{
  "category": "nba",
  "article": "The Boston Celtics ( pronounced  /ˈsɛltɪks/ ) are an American professional basketball team based in Boston , Massachusetts . They play in the Atlantic Division of the Eastern Conference in the National Basketball Association (NBA). Founded in 1946 and one of eight NBA teams (out of 23 total teams) to survive the league's first decade, the team is currently owned by Boston Basketball Partners LLC. The Celtics play their home games at the TD Garden , which they share with the National Hockey League 's Boston Bruins . The franchise's seventeen championships are the most for any NBA franchise, and account for 25.4% of all NBA championships since the league's founding in 1946.  This makes the Boston Celtics the most successful franchise to date in the major four traditional North American professional sports. [ note 1 ] , The Celtics have met the Lakers a record twelve times in the Finals, including their most recent appearances in 2008 and 2010, where the Celtics have won nine meetings (but only two since 1980). Four Celtics ( Bob Cousy , Bill Russell , Dave Cowens and Larry Bird ) have won the NBA Most Valuable Player Award for an NBA record total of ten MVP awards.  Their mascot 'Lucky the Leprechaun' is a nod to the team's Irish heritage and to Boston's historically large Irish population .  , The Celtics rose again after struggling through the 1990s to win a championship in 2008 with the help of Kevin Garnett , Paul Pierce , and Ray Allen .  Pierce and Garnett were later traded to the Brooklyn Nets , and Rajon Rondo was traded to the Dallas Mavericks in December 2014. , , , The Boston Celtics were formed in 1946 by Boston Garden-Arena Corporation President Walter A. Brown as a team in the Basketball Association of America , and became part of the National Basketball Association after the absorption of the National Basketball League by the BAA in the fall of 1949.  In 1943, the Celtics signed Chuck Cooper , becoming the first franchise to draft a black player.  , The Celtics struggled during their early years, until the hiring of coach Red Auerbach .  In the franchise's early days, Auerbach had no assistants, ran all the practices, did all the scouting—both of opposing teams and college draft prospects—and scheduled all the road trips. One of the first great players to join the Celtics was Bob Cousy , whom Auerbach initially refused to draft out of nearby Holy Cross because he was \"too flashy\".  Cousy eventually became the property of the Chicago Stags ,  but when that franchise went bankrupt, Cousy went to the Celtics in a dispersal draft. After the 1955–56 season, Auerbach made a stunning trade. He sent perennial All-Star Ed Macauley to the St. Louis Hawks along with the draft rights to Cliff Hagan in exchange for the second overall pick in the draft.  After negotiating with the Rochester Royals —a negotiation that included a promise that the Celtics owner would send the highly sought-after Ice Capades to Rochester if the Royals would let Russell slide to #2—Auerbach used the pick to select University of San Francisco center Bill Russell .  Auerbach also acquired Holy Cross standout, and 1957 NBA Rookie of the Year, Tommy Heinsohn .  Russell and Heinsohn worked extraordinarily well with Cousy, and they were the players around whom Auerbach would build the champion Celtics for more than a decade.  , With Bill Russell, the Celtics advanced to the NBA Finals and defeated the St. Louis Hawks in seven games, giving the Celtics the first of their record seventeen championships. Russell later won 11 championships, making him the most decorated player in NBA history.  In 1958, the Celtics again advanced to the NBA Finals , this time losing to the Hawks in 6 games.  However, with the acquisition of K.C. Jones that year, the Celtics began a dynasty that would last for more than a decade.  In 1959, the Celtics won the NBA Championship after sweeping the Minneapolis Lakers , the first of their record eight consecutive championships.  During that time, the Celtics met the Lakers in the Finals five times, starting an intense and often bitter rivalry that has spanned generations. In 1964, the Celtics became the first NBA team to have an all African American starting lineup. On December 26, 1964, Willie Naulls replaced an injured Tommy Heinsohn, joining Tom ‘Satch’ Sanders, K.C. Jones, Sam Jones and Bill Russell in the starting lineup. The Celtics defeated St. Louis 97-84. Boston won its next 11 games with Naulls starting in place of Heinsohn.  , The Boston Celtics of the late-1950s–60s are widely considered as one of the most dominant teams of all time.  , Auerbach retired as coach after the 1965–66 season and Russell took over as player-coach, which was Auerbach's ploy to keep Russell interested.  With his appointment, Russell also became the first African American coach in any U.S. pro sport.  Auerbach would remain the General Manager, a position he would hold well into the 1980s. However, that year the Celtics' string of NBA titles was broken as they lost to the Philadelphia 76ers in the Eastern Conference Finals. The aging team managed two more championships in 1968 and 1969, defeating the Lakers each time in the NBA Finals.  Russell retired after the 1969 season, effectively ending a dominant Celtics dynasty that had garnered 11 NBA titles in 13 seasons.  The streak of 8 consecutive championships is the longest streak of consecutive championships in U.S. professional sports history.  , The 1970 season was a rebuilding year, as the Celtics had their first losing record since the 1949–50 season. However, with the acquisition of Dave Cowens , Paul Silas , and Jo Jo White , the Celtics soon became dominant again.  After losing in the Eastern Conference Finals in 1972, the Celtics regrouped and came out determined in 1973 and posted an excellent 68–14 regular season record. But the season ended in disappointment, as they were upset in 7 games by the New York Knicks in the Conference Finals. John Havlicek injured his right shoulder in game six and was forced to play game 7 shooting left handed.  The Celtics returned to the playoffs the next year, defeating the Milwaukee Bucks in the NBA Finals in 1974 for their 12th NBA Championship .  The teams split the first four games, and after the Celtics won Game 5 in Milwaukee they headed back to Boston leading 3 games to 2, with a chance to claim the title on their home court. However, the Bucks won Game 6 when Kareem Abdul-Jabbar nestled in a hook shot with 3 seconds left in the game's second overtime, and the series returned to Milwaukee. But Cowens was the hero in Game 7, scoring 28 points, as the Celtics brought the title back to Boston for the first time in five years. In 1976, the team won yet another championship, defeating the Phoenix Suns in 6 games. The Finals featured one of the greatest games in the history of the NBA. With the series tied at two games apiece, the Suns trailed early in the Boston Garden, but came back to force overtime. In double overtime, a Gar Heard turn-around jumper at the top of the key sent the game to an unprecedented third overtime, at which point the Celtics prevailed.  Tommy Heinsohn coached the team for those two championships. After the 1976 championship and a playoff appearance in 1977 , Boston went into another phase of rebuilding. In the 1977 NBA Draft , the Celtics drafted a young forward from UNC Charlotte named Cedric Maxwell .  \"Cornbread\" Maxwell did not contribute much in his rookie season, but he showed promise. Auerbach's job became even tougher following the 1977–78 season in which they went 32–50 as John Havlicek , the Celtics' all-time leading scorer, retired after 16 seasons.  , The Celtics owned two of the top eight picks in the 1978 NBA Draft .  Since the Celtics had two draft choices, Auerbach took a risk and selected junior Larry Bird of Indiana State with the 6th pick, knowing that Bird would elect to remain in college for his senior year. The Celtics would retain his rights for one year—a rule that was later changed—and Auerbach believed that Bird's potential would make it worth the wait. Auerbach also felt that when the college season ended the Celtics would have a great chance to sign Bird. Auerbach was right and Bird signed soon after leading Indiana State to the NCAA Championship game, where they fell to a Michigan State University team. (The other pick was Freeman Williams , who was traded before the 1978–79 season began.) , In 1978, owner Irv Levin was looking to move to his native California. Since there was hardly any chance that the NBA would consider moving the Celtics out of Boston, Levin entered into an arrangement with John Y. Brown, Jr. , who at the time was the owner of the Buffalo Braves and who had also owned the Kentucky Colonels of the ABA . Brown traded ownership of the Braves for Levin's stake in the Celtics, thus allowing Brown to remain as a team owner and freeing up Levin to make the move he desired to make. Thus, Brown became the new owner of the Celtics while Levin moved the Braves to San Diego, California where they became known as the San Diego Clippers . , As part of the deal, trades were made between the Braves/Clippers franchise and the Celtics franchise which resulted in many former Braves joining the team. One of the moves that irked Auerbach was a trade that Brown made with the Braves that saw his franchise center Bob McAdoo join the Celtics for three first round draft picks that Auerbach had planned on using for the future rebuilding project he was trying to undertake.  The dispute nearly led to Auerbach resigning as General Manager for a position with the New York Knicks . With public support strongly behind Auerbach, Brown sold the team to Harry Mangurian rather than run the risk of having Auerbach leave the team.  The Celtics would struggle through the season, going 29–53 without Bird.  Newcomers Chris Ford , Rick Robey , Cedric Maxwell and Tiny Archibald failed to reverse the team's momentum.  , Bird debuted for the Celtics during the 1979–80 season, a year after being drafted.  With a new owner in place, Auerbach made a number of moves that would bring the team back to prominence. He almost immediately traded McAdoo,  a former NBA scoring champion, to the Detroit Pistons for guard M. L. Carr , a defensive specialist and legendary towel-waving Celtic cheerleader, and two first-round picks in the 1980 NBA Draft .  He also picked up point guard Gerald Henderson from the CBA . Carr, Archibald, Henderson and Ford formed a highly competent backcourt, with their unique skills blending in perfectly with the talented frontcourt of Cowens, Maxwell and Bird, who would go on to win NBA Rookie of the Year honors.  The Celtics improved by 32 games, which at the time was the best single-season turnaround in NBA history, going 61–21 and losing to the Philadelphia 76ers in the Eastern Conference Finals.  , After the season, Auerbach completed what may be the most lopsided trade in NBA history. Auerbach had always been a fan of stockpiling draft picks, so even after the success of the 1979–80 season, the Celtics had both the 1st and 13th picks in the 1980 NBA Draft left over from the M. L. Carr trade. Auerbach saw an opportunity to improve the team immediately, sending the two picks to the Golden State Warriors in exchange for center Robert Parish  and the Warriors' first round pick, the 3rd overall. With the draft pick, Auerbach picked University of Minnesota power forward Kevin McHale .  With these three future Hall of Famers on the team, henceforth known as the first \"Big 3\", the Celtics had a core in place to become a dominant team again in the NBA. , The Celtics went 62–20 under coach Bill Fitch in 1980–81 ,  despite losing center Dave Cowens to retirement late in training camp. Once again the Celtics matched up with the 76ers in the Eastern Conference Finals. Boston fell behind 3 games to 1 before coming back to win a classic 7th game, 91–90. The Celtics went on to capture the 1981 NBA Championship over the Houston Rockets ,  just two years after Bird had been drafted. Maxwell was named NBA Finals MVP .  The following year the Celtics once again tried to come back from a 3–1 deficit against the Sixers in the rematch but this time lost Game 7 at Boston Garden.  In 1983 the Celtics were swept in the playoffs for the first time by the Milwaukee Bucks ;  afterwards Fitch resigned and the team was sold to new owners led by Don Gaston .  , In 1983–84 the Celtics, under new coach K. C. Jones , would go 62–20 and finally get back to the NBA Finals after a three-year hiatus.  In the finals, the Celtics came back from a 2–1 deficit to defeat the Los Angeles Lakers , winning their 15th championship.  Bird renewed his college rivalry with Lakers star Magic Johnson during this series. After the series Auerbach officially retired as General Manager but maintained the position of team President.  Auerbach was succeeded by Jan Volk as General Manager.  Volk had been with the Celtics since graduating from Columbia Law School in 1971 and had been the team's General Counsel since 1976 and the team's Assistant G.M. since 1980. During the off-season, in Volk's first major transaction since assuming the GM role, the Celtics traded Henderson to the Seattle SuperSonics in exchange for their first round pick in the 1986 NBA Draft . , In 1985, the Lakers and Celtics met again, but this time the Lakers took the championship.  This was the first time the Lakers had defeated the Celtics for a championship, as well as the only time that the Celtics lost a championship at Boston Garden. During the following off-season the Celtics acquired Bill Walton from the Los Angeles Clippers in exchange for Cedric Maxwell .  Walton was a big star with the Portland Trail Blazers , but injuries had kept him from living up to expectations. He was willing to come off the bench, deferring to the three big men already with the team. Walton, considered the best passer of all NBA centers in history, stayed healthy and was a big part of the Celtics' success in 1986. , In 1985–86 the Celtics fielded one of the best teams in NBA history. The 1986 Celtics won 67 games, going 40–1 at the Boston Garden . Bird won his third consecutive MVP award and Walton won the Sixth Man of the Year Award . They won the franchise's 16th championship and last of the 20th century, defeating the Houston Rockets in the NBA Finals 4 games to 2. , Thanks to the 1984 trade of Gerald Henderson and the subsequent fall of the Seattle SuperSonics , at the end of the 1985–86 the Celtics owned not only the best team in the NBA but also the second pick in the 1986 NBA Draft . The Celtics drafted Len Bias with the pick and had high hopes for the young University of Maryland star.  Fans believed Bias had superstar potential, and that he would be the perfect complement to the aging, but still strong, Celtics. The hope was that his presence would ensure that the franchise would remain a powerhouse after Bird, McHale and Parish retired. Unfortunately, Bias died 48 hours after he was drafted, after using cocaine at a party and overdosing.  It would be the first in a long string of bad luck for the Celtics, one that would continue until the next manifestation of the 'Big Three' in Boston. , It was also during the 1986 season that the Celtics became known for the off-court antics of Susan “Busty Heart” Sykes , a well-endowed spectator whom television cameras scanned across during a 1986 game. Sykes's newfound fame, coupled with the team's success, made her a pop-culture icon in Boston for the next several years and launched her career in adult entertainment.  , Despite the loss of Bias, the Celtics remained competitive in 1986–87 , going 59–23 and again winning the Eastern Conference Championship.  However, injuries took its toll, and the Celtics ceded the NBA championship to the Lakers in six games. It would be 21 years before they would reach the NBA Finals again. The Celtics' reign as the Eastern Conference champions ended in 1988, losing to the Detroit Pistons in six games.  , After the 1987–88 season, head coach K.C. Jones retired. Jones was replaced as head coach by assistant Jimmy Rodgers . Rodgers faced immediate trouble in 1988–89 when, only 6 games into the season, Larry Bird decided to have surgery to remove bone spurs in both feet. The injury was to sideline Bird until well after the All-Star Break, although he hoped to return that year. However, despite his best attempts to return he was unable to make it back as the Celtics stumbled to a 42–40 record and a first round playoff defeat to the Detroit Pistons . , Bird returned in 1989–90 to play in 75 games and he led the Celtics to a 52–30 record. In the playoffs , after winning the first two games of a Best of 5 series against the New York Knicks , the Celtics collapsed, losing 3 straight, including the decisive 5th game at the Boston Garden . In the wake of the embarrassing defeat, Rodgers was fired and replaced by assistant coach (and former Celtic player) Chris Ford . , Under Ford's leadership the Celtics improved to 56–26 in 1990–91 , recapturing the Atlantic Division title even though Bird missed 22 games with a variety of injuries. The Celtics fell to the Detroit Pistons in the Eastern Conference Semifinals. In 1992, a late season rally allowed the Celtics to catch the New York Knicks and repeat as Atlantic Division champions. The team finished 51–31 and again matched up with the Indiana Pacers in the First round, this time sweeping the series 3 games to 0. In the Eastern Conference Semifinals the Celtics lost a grueling 7 game series to the Cleveland Cavaliers , 4 games to 3. Due to back problems, Larry Bird played in only 45 of the 82 regular season games, and only 4 of the 10 playoff games; during games he was frequently lying on the floor when out of the lineup, instead of sitting on the bench. , After thirteen seasons with the club and winning a gold medal in the Barcelona Olympics with the Dream Team , Bird retired in 1992, primarily due to his back injuries. , At the time of Bird's retirement, former Celtics guard Chris Ford was the coach of the Celtics.  26-year-old Reggie Lewis (out of Boston's Northeastern University ) was seen as Bird's successor as the franchise player for the Celtics. Lewis, a small forward , fainted during a 1993 first round playoff matchup with the Charlotte Hornets (the Celtics lost in four games).  It was later revealed that Lewis had heart problems,  yet he was able to get doctors to clear him for a comeback. He died of a heart attack while shooting baskets at Brandeis University during the offseason.  The Celtics honored his memory during the following season by retiring his number 35.  , The original Big Three era came to an end in 1994, after Robert Parish signed with the Hornets  The year before, Kevin McHale retired after the Celtics' playoff loss to the Hornets. The Celtics finished the year out of the playoffs with a 32–50 mark. , In 1994, the Celtics hired former player M. L. Carr to be the team's new V.P. of Basketball Operations, working alongside G.M. Jan Volk. In his first draft in charge of the Celtics, he drafted University of North Carolina star Eric Montross with his first round draft pick. Montross became the new heir apparent in the paint, but failed to develop and was eventually traded. 1994–95 was the Celtics' final season in the Boston Garden . The Celtics signed the aging Dominique Wilkins as a free agent, and he led the team in scoring with 17.8 PPG. Second-year player Dino Radja , a power forward from Croatia , added an interior presence to the team that had been lacking 1993–94 . The Celtics made the playoffs, losing to the heavily favored Orlando Magic in 4 games. , In 1995, the Celtics moved from the Boston Garden to the Fleet Center (later TD BankNorth, then TD Garden ). Carr fired Chris Ford and took the coaching reins himself. After drafting Providence College star Eric Williams , the Celtics struggled to a 33–49 record. Things got worse in 1996–97 as the Celtics lost a franchise record 67 games, setting an unwanted NBA record winning only once against other Atlantic Division teams and winning only fifteen times overall despite the emergence of 1st-round draft pick Antoine Walker . Carr's stint as coach is considered a failure. Carr stepped aside to another job in the organization when Celtics principal owner Paul Gaston convinced star college coach Rick Pitino to join the franchise as the team's president, director of basketball operations, and head coach .  Pitino's appointment as team president was controversial as Auerbach, who had filled that role for more than 25 years, first heard about this change from local media people. Unfortunately for the franchise, Pitino was not the savior everyone expected him to be. Auerbach bore the insult of being elbowed out with dignity, even as the team failed to improve. , The Celtics received the third and sixth draft picks in the 1997 NBA Draft ,  and used the picks to select a brand new backcourt. They drafted Chauncey Billups and Ron Mercer and dismantled much of the young team that lost 67 games the year before. David Wesley , Dino Radja and Rick Fox were let go, and Williams was traded to the Denver Nuggets for a pair of second round draft picks (Williams would return to the Celtics in 1999 and played for four years). Billups was subsequently traded to the Raptors during his rookie year and Ron Mercer .  was traded to the Nuggets during his third season. , The following year the Celtics drafted Paul Pierce in the 1998 NBA Draft ,  a college star who had been expected to be drafted much earlier than the Celtics' 10th overall pick. Pitino also acquired veteran Kenny Anderson , for future Finals MVP Billups and Dee Brown . Pitino failed to achieve meaningful success and resigned in 2001.  , Following the resignation of Rick Pitino, the Celtics saw modest improvement under coach Jim O'Brien . Paul Pierce matured into an NBA star and was ably complemented by Antoine Walker, along with the other players acquired over the years. The team finished the season 24–24 under O'Brien  (after going 12–22 before Pitino's resignation) and following the 2000–01 season O'Brien was given the job of head coach on a permanent basis. As a result of numerous trades, the Celtics had three picks in the 2001 NBA Draft , a luxury that seemed to set the franchise up well for the long term. General Manager Chris Wallace used the picks on Joe Johnson , Joe Forte (a favorite of Red Auerbach ) and Kedrick Brown . Only Johnson managed to succeed in the NBA, becoming a perennial All-Star after leaving the Celtics; Forte and Brown were busts. , The Celtics entered the 2001–02 season with low expectations. The team's success in the latter stages of 2000–01 was largely forgotten, and critics were surprised when the team, along with the New Jersey Nets , surged to the top of the Atlantic Division ahead of teams like the Philadelphia 76ers , who were fresh off a trip to the NBA Finals . The Celtics won a hard-fought 5-game series with the 76ers in the first round, 3 games to 2. Pierce scored 46 points in the series-clinching blowout at the Fleet Center . In the Conference Semifinals, the Celtics defeated the favored Detroit Pistons 4 games to 1 in a series best remembered for the Celtics low-scoring Game 3 victory, 66–64. In their first trip to the Eastern Conference Finals since 1988 , the Celtics jumped out to a 2–1 series lead over the New Jersey Nets, after rallying from 21 points down in the fourth quarter to win Game 3, but would lose the next three games to fall 4 games to 2.  , In 2003, the Celtics were sold by owner Paul Gaston to Boston Basketball Partners L.L.C.,  led by H. Irving Grousbeck , Wycliffe Grousbeck and Steve Pagliuca . The team made it back to the playoffs but were swept by the Nets in the second round, despite bringing Game 4 to double overtime.  , Before their elimination, the team hired former Celtic guard Danny Ainge as General Manager, moving Chris Wallace to another position in the organization. Ainge believed the team had reached its peak and promptly sent Antoine Walker to the Dallas Mavericks (along with Tony Delk ).  In return, the Celtics received the often-injured Raef LaFrentz , Chris Mills , Jiri Welsch ,  and a first-round pick in 2004 . The Celtics made the playoffs , only to be swept in the first round by the Indiana Pacers , losing all 4 games by blowout margins.  , The Celtics were a young team under new coach Doc Rivers during the 2004–05 season,  having drafted youngsters Al Jefferson , Delonte West and Tony Allen in the 2004 Draft. Yet they seemed to have a core of good young players, led by Pierce and rookie Al Jefferson , to go along with a group of able veterans. The Celtics went 45–37 and won their first Atlantic Division title since 1991–92 , receiving a boost from returning star Antoine Walker in mid-season. The Pacers defeated them in the first round yet again, with the series culminating in an embarrassing 27-point loss in Game 7 at the Fleet Center . After the season Walker was traded again, this time to the Miami Heat , where he went on to win a championship next season. Despite Pierce's career season, in which he averaged career-highs in points (26.8), the Celtics missed the playoffs with a 33–49 record, owing largely to a young roster and constant roster shuffling, which saw the likes of Marcus Banks , Ricky Davis and Mark Blount traded for underachieving Michael Olowokandi and former all-star Wally Szczerbiak . , The Boston Celtics continued to rebuild on the night of the 2006 NBA Draft . Danny Ainge traded the rights to seventh overall pick Randy Foye , Dan Dickau and Raef LaFrentz to the Portland Trail Blazers for NYC high school phenom Sebastian Telfair , Theo Ratliff and a future second-round pick.  The Celtics traded a first-round pick in the 2007 NBA Draft to the Phoenix Suns for the 21st selection, with which Ainge selected Kentucky point guard Rajon Rondo , who was to become a key piece in the Celtics' revival. In the second round the Celtics added Leon Powe to the team.  On July 6, 2006, Allan Ray was signed as a free agent.  , The 2006–07 season was a gloomy one for the franchise. The season began with the death of Red Auerbach at 89.  Auerbach was one of the few remaining people who had been a part of the NBA since its inception in 1946. The Celtics went 2–22 from late December 2006 through early February 2007 after losing Paul Pierce to injury, the result of a stress reaction in his left foot. At first, the Celtics received a much needed boost from guard Tony Allen but he tore his ACL and MCL on a needless dunk attempt after the whistle in a game vs. the Indiana Pacers on January 10, 2007.  The Celtics compiled a record of 24–58, second-worst in the NBA, including a franchise record 18-game losing streak that lasted from January 5 to February 14.  At the end of the season, the Celtics, with the second worst record in the NBA, were at least hopeful that they could secure a high draft pick and select either Greg Oden or Kevin Durant to help rebuild the franchise. During one of the most anticipated draft lotteries Boston has ever experienced, fans watched the Celtics end up falling as low as they could in the lottery to fifth. It seemed to many to be one misfortune in a long line of bad luck beginning with the death of Len Bias, but disappointment led to eventual redemption. , The Celtics completed the largest single-season turnaround in NBA history. The new Big Three of Pierce, Allen and Garnett went 66–16 in the regular season, an unprecedented 42-game improvement. However, the team struggled initially in the playoffs. The Atlanta Hawks took them the full seven games in the first round, as did the Cleveland Cavaliers in the conference semifinals. The Celtics defeated the Detroit Pistons in six games of the Eastern Conference Finals, winning two road games.  , In the 2008 NBA Finals, the Celtics faced MVP Kobe Bryant and the Los Angeles Lakers for the 11th time, the first time since 1987. The Celtics won Game 1 at home 98-88, fueled by strong play by Garnett and Pierce's dramatic comeback from a second half knee injury. They would also go on to win Game 2 108-102, despite nearly blowing a 24-point lead in the fourth quarter. As the series shifted to Los Angeles, the Lakers stifled Pierce and Garnett in Game 3 and won 87-81. However, the Celtics would overcome a 24-point deficit in Game 4 to win 97-91, the largest comeback in NBA Finals history. After once again blowing a large lead, the Lakers hung on to win Game 5 103-98, sending the series back to Boston. In Game 6, the Celtics overpowered the Lakers, winning 131-92, clinching their 17th NBA title, and first since 1986. It remains the most lopsided win ever in a championship-clinching game; Paul Pierce was named Finals MVP.  The win in Game 6 was a sense of relief, as it was a difficult path to this championship; in that game, these Celtics set a record for most games a team had ever played in a postseason, with 26, surpassing the 1994 New York Knicks , whom Coach Doc Rivers played for, and the 2005 Detroit Pistons , each of whom played 25, but lost their respective finals in seven games (Knicks in 1994 , Pistons in 2005 ).  , The 2008–09 Celtics started off the season at 27–2, the best starting record in NBA history.  They also had a pair of 10+ game winning streaks including a franchise record 19-game streak.  After the All Star Break, Kevin Garnett was injured in a loss against the Utah Jazz , missing the last 25 games of the season. Garnett was eventually shelved for the playoffs. The 2009 Celtics still finished with 62 victories, but their playoff run would end against the Magic in the second round, losing in seven games after leading 3–2, the first such occurrence in team history.  In the prior round they were pushed to a Game 7 against the Chicago Bulls, with four of those games went to overtime, yet the Celtics' experience was too much for the young Bulls.  , The following year, with the return of Kevin Garnett from injury and the additions of Rasheed Wallace and Marquis Daniels , the Celtics started the season 23–5 and at one point had the best record in the NBA. However Doc Rivers ultimately decided to lessen his aging stars' minutes to keep them fresh for the playoffs. As a result the Celtics sputtered to an even 27–27 record the rest of the way and finished the 2009–10 regular season with a 50–32 record, with a better road (26–15) than home (24–17) record.  Despite previous predictions that the Celtics would never go deeper into the playoffs, the Celtics still managed to make the NBA Finals despite their lowly fourth seeding. They defeated the Miami Heat in five games, upset the top-seeded Cavaliers in six games and toppled the defending Eastern Conference Champion Magic, avenging their loss from the previous season. Rajon Rondo finally emerged as a bonafide superstar during post-season play, continuing his rise to fame beginning with his first All-Star appearance.  , The Celtics and the Lakers met for the 12th time in the NBA Finals. After taking a 3–2 lead heading into Los Angeles for Game 6, the Celtics appear poised to pack in their 18th title. But Kendrick Perkins , the team's starting center, suffered a severe knee injury early in Game 6,  and the Celtics would lose Game 6, and go on to blow a 13-point lead in Game 7. After speculation that coach Doc Rivers would resign to spend more time with his family, he affirmed on June 30, 2010 that he would return to the team for the 2010–11 season. , During the 2010 off season, with Perkins expected to be out until February 2011, the Celtics signed two former All-Star centers, Shaquille O'Neal and Jermaine O'Neal , for insurance; they also signed Turkish center Semih Erden , their 2008 second round pick . The Celtics also welcomed back Delonte West to back up Rondo. During the 2010–11 season, Paul Pierce became the third Celtic to score 20,000 points, joining Larry Bird and John Havlicek . Ray Allen broke the NBA record for most three-pointers made in a career, while the Celtics won 3,000 games, the second team to do so. On February 17, however, Kendrick Perkins was traded to the Oklahoma City Thunder partially due to the expectation that Shaquille O'Neal would return from his injuries to fill Perkins' role. The Celtics were 33–10 in games Perkins had missed during the year due to injury,  and they were 19–3 in games that O'Neal played over 20 minutes.  The Celtics were 41–14 at the time of the trade and held the Eastern Conference leaderboard despite another rash of injuries. Following the trade, however, they proceeded to win only 15 of their final 27 games to finish with a 56–26 record, sliding to the third seed, due to the difficult adjustment of new Celtics such as Jeff Green , Nenad Krstić and Carlos Arroyo as well as player injuries. Shaquille O'Neal played only five minutes after February 1.   The Celtics swept the New York Knicks 4–0 in the opening round of the 2011 NBA Playoffs , but in the second round they were ousted by the Miami Heat in five games. Shaquille O'Neal missed the first round of the playoffs, and he was limited to 12 minutes in two games in the second round against the Heat (lost to Mavericks in NBA Finals).  Shaquille O'Neal retired at the end of the season. , At the 2011 NBA Draft , the Celtics selected Providence Friar swingman MarShon Brooks with the 25th overall pick then immediately traded his rights to the Brooklyn Nets for the rights to the 27th overall pick, power forward JaJuan Johnson . Then the Celtics selected E'Twaun Moore with the 55th overall pick in the 2nd round (reason being for his choice of #55), which reunited the Purdue teammates. During the short preseason following the 2011 NBA lockout , the Celtics signed free agents Marquis Daniels, Chris Wilcox , Keyon Dooling and Greg Stiemsma , while acquiring Brandon Bass from the Magic for Glen Davis and Von Wafer . They also re-signed Jeff Green , only to have it voided after a physical revealed that Green was diagnosed with an aortic aneurysm , forcing him to miss the season. The Celtics started the season 0–3 with Paul Pierce out with a heel injury. To fill the void, the Celtics signed French swingman Mickaël Piétrus , but did not make his season debut until January 6, 2012 against the Indiana Pacers. The Celtics, however, continued to struggle, at one point posting a five-game losing streak that was the longest in the 'Big Three' era. At the All Star break, the Celtics were below .500 with a 15–17 record. However, they were one of the hottest teams after the break, going 24–10 the rest of the year and winning their 5th division title in a row. The Celtics would end up making the playoffs as the fourth seed in the Eastern Conference in the 2012 NBA Playoffs. , In the playoffs, the Celtics faced the Atlanta Hawks in the first round, beating them in six games led by strong play from Pierce and Garnett. In the Conference Semifinals the Celtics faced the Philadelphia 76ers led by Doug Collins and a young group of promising players that would push the Celtics into a full-seven game series. Following a Game 7 85–75 win the Celtics faced the Miami Heat in the Eastern Conference Finals, who had defeated them in the playoffs the previous year. After losing Game 1 93–79, Boston fought back, pushing Miami into a Game 2 overtime, but ultimately fell short losing 115–111. Facing a 0–2 deficit heading back to Boston, the Celtics would come back with a strong 101–91 Game 3 win and then a hard fought 93–91 Game 4 overtime win, with Dwyane Wade missing a potential game-winning three-point shot at the buzzer. The C's then won Game 5 in Miami 94–90, giving them a chance to take the series back at the Garden. The Celtics couldn't close out the series however. Game 6 ended up in a blowout home loss of 98-79 taking the series back to Miami for Game 7, where the Celtics built an early lead but eventually lost 101-88; Miami would go on to defeat the Oklahoma City Thunder in the Finals. , 2012 became a pivotal off season for Danny Ainge's Celtics, as both Ray Allen and Kevin Garnett became free agents and only six players remained under contract ( Rajon Rondo , Paul Pierce , Avery Bradley , JaJuan Johnson , E'Twaun Moore & Sean Williams ). In the 2012 NBA Draft , the Celtics drafted three players, Jared Sullinger , Fab Melo and Kris Joseph with their 21st, 22nd and 51st picks respectively. The Celtics re-signed their free agents Kevin Garnett , Brandon Bass and Keyon Dooling along with Chris Wilcox and Jeff Green , who both were returning to play after sustaining season-ending heart ailments. The Celtics also signed former Dallas Mavericks shooting guard Jason Terry . On July 20, the Celtics acquired free agent Courtney Lee in a three-team sign and trade, sending JaJuan Johnson, E'Twaun Moore, Sean Williams and future second round pick to the Houston Rockets and Sasha Pavlovic to Portland Trail Blazers in exchange for Lee. Jason Collins was later signed to a one-year deal. However, Allen chose to sign with the Miami Heat , for less money, bringing the five-year \"Big Three\" era to a somewhat acrimonious end. , On September 20, Keyon Dooling was waived by the Celtics following his retirement from basketball, however, Dooling came back from retirement and signed with the Memphis Grizzlies later that year. In addition the Celtics signed center Darko Miličić and guard Leandro Barbosa . [ citation needed ] , Later in the season, it was announced that Miličić would return to Europe for a family matter. On December 24, the Celtics signed forward Jarvis Varnado of the NBA D-League team Sioux Falls to a deal. He was then waived on January 6 along with rookie forward Kris Joseph. , On January 27, 2013, it was revealed that Rajon Rondo had torn the ACL on his right knee and would miss the rest of the season along with part of the next season. On February 2, it was announced that Jared Sullinger would also miss the rest of the season due to back surgery. , Despite losing Rondo and Sullinger to injury, the Celtics compiled a seven-game winning streak, including victories over the Heat in double overtime and the Nuggets in triple overtime. The winning streak was snapped on February 12 when Leandro Barbosa suffered a torn ACL; he would miss the rest of the season as well. , Then on February 18, the Celtics signed swingman Terrence Williams to a deal. On February 21, the Celtics traded Leandro Barbosa and center Jason Collins for Washington Wizards guard Jordan Crawford. On February 28 and March 21, respectively, the Celtics signed forwards D. J. White and Shavlik Randolph .   , The Celtics finished the season with 41 wins, but played only 81 games after a home game against the Indiana Pacers on April 16 was cancelled following the Boston Marathon bombings ; the game was not made up with both teams already assured of their playoff positions.  The 41 wins were the lowest totals the Celtics achieved as a playoff-bound team since 2004. The Celtics trailed 3–0 to the New York Knicks in the first round of the 2013 NBA Playoffs , before losing the series in six games. In Game 6, the Celtics nearly completed a come back when they went on a 20-0 run to cut the lead to 4, but that was the closest they got as the New York Knicks would take over to win. , On June 3, 2013, head coach Doc Rivers was allowed out of his contract to coach Los Angeles Clippers and the Celtics were given a 2015 unprotected first round pick as compensation. , A few days later, on June 28, 2013, ESPN reported that Paul Pierce and Kevin Garnett (after waiving his no-trade clause), along with Jason Terry and D. J. White , were traded to the Brooklyn Nets for Keith Bogans , MarShon Brooks , Kris Humphries , Kris Joseph , Gerald Wallace , and three future first-round draft picks (2014, 2016, 2018), with the option of swapping 2018 pick with Brooklyn's 2017 pick.  The deal was later approved by the league on July 12, 2013, effectively ending the 'Big 3' era and marking the start of a youth movement for the team.  , On July 3, 2013, the Celtics announced that Brad Stevens , the head coach of Butler University , would replace Doc Rivers as Head Coach.  , On July 27, 2013, the Celtics traded their 16th overall pick with the Mavericks' 13th to select Kelly Olynyk out of Gonzaga.  Olynyk would go on to make the NBA All-Rookie 2nd team. , On January 15 the Celtics traded Jordan Crawford and MarShon Brooks to the Golden State Warriors in exchange for future first and second round picks as well as Miami Heat center Joel Anthony . , On January 17, 2014, Rajon Rondo made his return from an ACL tear. He was named the new Captain of the Boston Celtics, the 15th Team Captain in team history. , On June 26, 2014, the Celtics drafted Marcus Smart with the 6th overall pick and James Young with the 17th overall pick in the 2014 NBA Draft .  , On July 10, 2014, Tyler Zeller and Marcus Thornton were traded to the Celtics in a three-team trade involving the Cleveland Cavaliers and the Brooklyn Nets. , On July 21, 2014, Evan Turner agreed to sign with the Celtics using the Mid-level exception. , On December 18, 2014, Rondo and rookie Dwight Powell were traded to Dallas for center Brandan Wright , forward Jae Crowder and veteran point guard Jameer Nelson , plus future picks.  On January 9, 2015, the Celtics traded Jeff Green to the Memphis Grizzlies in exchange for Tayshaun Prince and sent newly acquired center Brandan Wright to the Phoenix Suns. A few days later, they also traded Jameer Nelson to the Denver Nuggets for Nate Robinson but waived him a few days later. This left Brandon Bass and Avery Bradley as the only players left from the 2012 NBA Playoffs Celtics roster. On February 19, 2015, Boston acquired Isaiah Thomas from the Phoenix Suns in exchange for Marcus Thornton and the Cleveland Cavaliers' 2016 first-round draft pick in a last-minute trade deadline deal.  On that same day, February 19, 2015, the Celtics also traded Tayshaun Prince in a deal that netted them Luigi Datome and Jonas Jerebko from the Detroit Pistons.  On February 23, 2015, soon after the All-Star break, it was announced that Jared Sullinger, the team's leading scorer and rebounder, who was averaging 14.4 points and 8.1 rebounds, would miss the remainder of the season with a left metatarsal stress fracture; Sullinger returned on April 3, 2015 on limited minutes.  The Celtics finished the season with a 40-42 record, but still managed to clinch the seventh seed in the Eastern Conference Playoffs .  The Celtics were swept by the second seeded Cleveland Cavaliers , led by LeBron James , in the first round of the 2015 NBA Playoffs  , The rivalry between the Boston Celtics and Los Angeles Lakers involves the two most storied franchises in NBA history. It has been called the NBA's best rivalry.  The two teams have met a record twelve times in the NBA Finals , starting with their first Finals meeting in 1959 . They would go on to dominate the league in the 1960s and the 1980s, facing each other six times in the 1960s, three times in the 1980s, in 2008, and in 2010. , The rivalry had been less intense since the retirements of Magic Johnson and Larry Bird in the early 1990s, but in 2008 it was renewed as the Celtics and Lakers met in the Finals for the first time since 1987, with the Celtics winning the series in six games. They faced off once again in the 2010 NBA Finals which the Lakers won in seven games. The two teams have won the two highest numbers of championships, the Celtics 17, the Lakers 16; together, the 33 championships account for almost half of the 67 championships in NBA history. , The Celtics and the 76ers are the two teams who have the most meetings in the NBA Playoffs , playing each other in nineteen series, of which the Celtics have won twelve.  Some [ who? ] consider this to be the 2nd greatest rivalry in the NBA next to the Celtics–Lakers rivalry . The rivalry reached its peak when players Bill Russell and Wilt Chamberlain of the 76ers played each other from 1965 to 1968. Their play would result in the Celtics not winning every NBA Finals series in the 1960s when the Sixers won in 1967. During the early 1980s, the teams constantly fought for conference championships with Larry Bird leading the Celtics and Julius Erving leading the 76ers. , The rivalry between the Celtics and the Detroit Pistons peaked in the 1980s, featuring players such as Larry Bird , Kevin McHale , Robert Parish , Isiah Thomas , Bill Laimbeer , Dennis Rodman , and Joe Dumars . These teams met in the NBA Playoffs five times in seven seasons from 1985 to 1991, with the Celtics winning in 1985 and 1987, and the Pistons coming out on top en route to back-to-back Finals appearances in 1988 and their championship seasons of 1989 and 1990 . Led by Paul Pierce , Kevin Garnett and Ray Allen in the 2008 Eastern Conference Finals the Celtics defeated the Pistons in 6 games to advance to the NBA Finals where they went on to beat the Lakers also in 6 games. , The rivalry between the Celtics and the New York Knicks rivalry stems from the location of the teams, both of which are in the NBA's Atlantic division. Also, the rivalry is heated due to the ongoing rivalry between the cities of Boston and New York. The teams have played with each other 512 total times during the regular season, with the Celtics leading their series 276 to 175. The two teams have also played each other 61 total times during the playoffs, with the Celtics leading this series 34 to 27. , The Boston Celtics were once rivals of the New Jersey Nets during the early 2000s due to their respective locations and their burgeoning stars. The Nets were led by Jason Kidd and Kenyon Martin, while the Celtics were experiencing newfound success behind Paul Pierce and Antoine Walker. The rivalry began to heat up in the 2002 Eastern Conference Finals, which was preceded by trash talking from the Celtics  who claimed Martin was a \"fake\" tough guy. Things progressed as the series started, and on-court tensions seemed to spill into the stands. Celtic fans berated Kidd and his family with chants of \"Wife Beater!\"  in response to Kidd's 2001 domestic abuse charge. When asked about the fan barbs being traded, Kenyon Martin stated, \"Our fans hate them, their fans hate us.\" Bill Walton said at the time that Nets-Celtics was the \"beginning of the next great NBA rivalry\" during the Eastern Conference Finals in 2002 with the Nets advancing to the NBA Finals, though New Jersey would go on to sweep Boston in the 2003 playoffs. In 2012, the year the Nets returned to New York in the borough of Brooklyn, there were indications that the rivalry might be rekindled when an altercation occurred on the court on November 28, resulting in the ejection of Rajon Rondo , Gerald Wallace, and Kris Humphries. Rondo was suspended for two games in the aftermath, while Wallace and Kevin Garnett were fined.  The story was revisited on December 25, when Wallace grabbed Garnett's shorts and the two had to be broken up by referees and players alike. However, the rivalry between the Nets and the Celtics appeared significantly cooled off by the June 2013 blockbuster trade that dealt Celtics stars Garnett and Paul Pierce to the Nets in exchange for Wallace, Humphries, and others. This move was billed as a merger of the two Atlantic Division teams.  Celtics announcer Sean Grande said \"It's almost as if you found a great home for these guys. You couldn't have found a better place. These guys will be in the New York market, they'll be on a competitive team, they'll stay on national TV. It's funny, because the enemy of my enemy is my friend. So with Celtics fans feeling the way they do about the Heat , feeling the way they do about the Knicks , the Nets are going to become almost the second [Boston] team now.\"  , , The Celtics hold the draft rights to the following unsigned draft picks who have been playing outside the NBA. A drafted player, either an international draftee or a college draftee who isn't signed by the team that drafted him, is allowed to sign with any non-NBA teams. In this case, the team retains the player's draft rights in the NBA until one year after the player's contract with the non-NBA team ends.  This list includes draft rights that were acquired from trades with other teams. , The Boston Celtics released a new logo for the 1996–97 season , although the depiction of a leprechaun spinning a basketball has been in use since the early 1950s. The leprechaun logo was originally designed by Zang Auerbach, the brother of Celtics head coach Red Auerbach . The logo has received numerous tweaks over the years; the latest version decorated the leprechaun in a gold vest to celebrate the club's 50th anniversary.  , The most familiar version, however, is the one-colored logo used during the Larry Bird era, with the leprechaun traced in black and only green and white clothes, which is still used on some TV networks whenever the current Celtics logo is unavailable or in classic Celtics references.  The logo made its debut midway through the 1975–76 season , albeit in green pants, at the center court of their trademark parquet floor . The official version with white pants debuted in the 1976–77 season . In the 1993–94 season , the pants on the center court were repainted white. Finally in the 1996–97 season , in coinciding with the team's (and the NBA's) 50th anniversary, the Celtics repainted the leprechaun logo to include gold on the vest, bow tie and hat, as well as brown on the ball and shillelagh , and black on its pants and shoes. Its face and hands were both painted tan. The one-colored leprechaun logo was revived for the 2011–12 season as an alternate logo, and is currently seen on the team website as well as banners during post-game interviews. , The Celtics also have various alternative logos, with the most popular being a white shamrock with the letters \"Celtics\" above it, wrapped in a green circle, which has been used since the 1998–99 season . The alternate logo is based on logos used by the Celtics before they used the Zang Auerbach leprechaun. For much of its history, the shamrock was trimmed in gold, as seen in the old team warmup jackets. A new secondary logo, unveiled in 2014, featured a variation of the leprechaun logo, albeit in silhouette form. , The Celtics jerseys have always been green on away games and white on home games since their inception in 1946. Except for some minor modifications, most notably the road 'Boston' script and the serifed version of the uniforms during the Bill Russell era, the jerseys remained unchanged through the years. , Beginning in 2005–06 , the Celtics began using alternate home/road jerseys which are green with black lettering and trim featuring the word \"Boston\" on the front side of the jersey. The alternate road jersey made few appearances in its first 2 seasons, but since 2007 it has been used much more often, in more than half of the road games. The uniforms traditionally make their debut on the last Friday of November home games, and are used on the road for games after that. In the 2011–12 season the uniforms were used sparingly, twice during the regular season, and during the first two games of the Eastern Conference Finals . , Also, in 2005–06 , the Celtics began a tradition of wearing green jerseys with gold trim as part of the St. Patrick's Day celebrations the NBA puts into place every third week of March. Except for the word \"Boston\" in front and the gold trim, the St. Patrick's Day jerseys resemble the regular road jerseys. For the first four years, the St. Patty's jerseys were used four times, a majority of which on the road; however in the 2009–10 NBA season , they were used just twice (both home games). They wore them six times in the 2011–12 season; wearing them at its earliest on March 9, their final home game before an eight-game road trip. The uniform was the only one in the current Celtics set that does not use the Adidas Revolution 30 design. , During the 2006–07 season , the Celtics wore a commemorative patch of a black shamrock with the nickname \"Red\" in green letters on the right top of the jersey in remembrance of Red Auerbach , who died shortly prior to the beginning of the season.  , During the NBA Europe Live Tour prior to the 2007–08 season , the Celtics used the alternate road jerseys in their game against the Toronto Raptors in Rome, except that the words \"Boston\" on the front side of the jersey and the shamrock on the shorts and on the reverse side of the jersey contained the green, white and red tricolors of the Italian flag . In the second game in London, the regular road jerseys featured a patch containing the Union Jack . , At the 2008–09 season opener against the Cleveland Cavaliers , the Celtics wore a modified version of their home uniforms, accented with gold, to commemorate last season's championship team. , In the 2012–13 season , the Celtics wore a special edition Christmas Day uniform known as 'Big Color'. The uniform is entirely green, with the exception of logos and lettering traced in white. , In the 2013–14 season , the Celtics replaced their former alternate St. Patrick's uniform with a new, sleeved version. Unlike the previous uniform, the front featured the team name in front, gold side panels and a white shamrock at the back, while the shorts closely resemble the green/black third uniform save for the gold accents. , A home grey alternate sleeved uniform was unveiled during the 2014–15 season . The uniform features a serifed vertical arch 'Celtics' wordmark in white with green trim, with names in green and numbers in white with green trim. In addition, it features a pattern of the Celtics' famed parquet floor on the sides, a silhouette version of their leprechaun logo on the waistband, and a green shamrock on the left leg of the shorts. It will be seen on six home dates during the season. , The team has honored deceased members of the Celtics family with a commemorative black band on the left shoulder strap of the jersey. It has been featured seven times in the history of the franchise: Walter Brown ( 1964–65 ), Bob Schmertz ( 1975–76 ), Joan Cohen ( 1989–90 ), Johnny Most ( 1993–94 ), Reggie Lewis ( 1993–94 ), Dorothy Auerbach ( 2000–01 ) and Dennis Johnson ( 2006–07 ).  , The team also had the tradition of wearing black sneakers through most of their history, except during the early 1980s when they wore green sneakers. According to legend, Celtics patriarch Red Auerbach had a problem with the white sneakers, claiming that the white sneakers can easily get dirty; hence starting a long tradition with the black sneakers. But prior to the 2003–04 season , current Celtics GM Danny Ainge and captain Paul Pierce suggested wearing white sneakers, in due part to a growing number of teams wearing black sneakers. Auerbach gladly accepted and the white sneakers have remained since on home games. They still wear the black sneakers on away games, but in the 2008–09 season , they wore white sneakers with green and gold accents while wearing their St. Patrick's Day jerseys on the road. Most recently, when the Celtics play on Christmas Day , they wore white or green sneakers with red and gold accents.  Since the 2009–10 season, the NBA relaxed its rules on specified sneaker colors, allowing several players such as Rajon Rondo to wear white sneakers on the road, or black at home, and sometimes solid green either home or away. , The Celtics were the only team to wear warmup jackets with the player names on the back. During the 1980s, this style was dominant in most NBA warmup jackets, but by the late 1990s, this style gradually declined. The Celtics, however, kept the design in keeping with tradition, before discontinuing the practice after the 2011–12 season. By that time Adidas issues a new warmup jacket design annually, and since the 2009–10 season, they provide players with a customized shooting shirt with the player's name and uniform number on the back. , Comcast SportsNet New England is currently the Boston Celtics' main television outlet, having aired its games since 1981. Most Celtics games began to air on the network full-time in 1998, and has held the distinction since. Before the 2007–08 Celtics season, the TV station was known as FSN New England and prior to 1997, it was known as SportsChannel New England. On October 1, 2007 the station transformed to the company Comcast, and is currently Comcast SportsNet. Comcast SportsNet broadcasts all Celtics games, except games that are nationally televised on TNT and ABC. Second and third rounds of the playoffs, and NBA Finals games are not broadcast on Comcast SportsNet. Mike Gorman, Tommy Heinsohn, and Abby Chin are the broadcasters for Comcast SportsNet during Celtics games with Mike Gorman going the play-by-play announcing, Tommy Heinsohn doing the color announcing and Abby Chin doing the sideline reporting. Various guest analysts, some with Celtic ties, serve during Celtics road games. , The Celtics can be heard on the WEEI Sports Radio Network during all Boston Celtics games, all season long from preseason to postseason. The play-by-play announcer is Sean Grande with commentary from Cedric Maxwell. , On September 26, 2013, the Celtics and 98.5 The Sports Hub announced a multi-year partnership in which the Boston Celtics games will be broadcast on the market's leading sports station. Beginning with the 2013–14 season, 98.5 The Sports Hub will feature select pre-season games, and all regular and post-season matchups, as well as produce extended pre- and postgame shows focused entirely on the Celtics.  "
}
