{
  "category": "nba",
  "article": "The Dallas Mavericks (often referred to as the Mavs ) are a professional basketball team based in Dallas , Texas . They are members of the Southwest Division of the Western Conference of the National Basketball Association (NBA). , According to a 2015 Forbes magazine report, they are the tenth most valuable basketball franchise in the United States, valued at approximately $1.150 billion.  , As of the 2013 season, the Mavericks have sold out 477 consecutive games since December 15, 2001, the longest currently running sellout streak in North American major league sports. , Since their inaugural 1980–81 season , the Mavericks have won three division titles ( 1987 , 2007 , 2010 ), two conference championships ( 2006 , 2011 ), and one NBA Championship ( 2011 ). , , , In 1978, Californian businessman Garn Eckardt met Dallas lawyer Doug Adkins, and mentioned he was trying to raise capital to move an NBA team to the city. Asking for a possible partner, Adkins recommended him one of his clients, Home Interiors and Gifts owner Don Carter . Negotiations with Eckardt fell through, but Carter remained interested in the enterprise as a gift to his wife Linda, who played basketball while at Duncanville High School . At the same time, Buffalo Braves president and general manager Norm Sonju grew an interest in bringing the NBA to Dallas as he studied possible new locations for the ailing franchise. While the Braves went to California as the San Diego Clippers , Sonju eventually returned to Texas, and was introduced to Carter by mayor Robert Folsom , one of the owners and team president of the last professional basketball team in the city, the Dallas Chaparrals of the American Basketball Association - which moved to San Antonio in 1973 to become the San Antonio Spurs . Sonju and Carter tried purchasing both the Milwaukee Bucks and the Kansas City Kings , but disagreement on relocation stalled the negotiations, leading them to instead aim for an expansion team . The league was initially reluctant to expand to Dallas, given Texas had both the Spurs and Houston Rockets , and the 1978-79 NBA season was proving unprofitable (18 out of the 22 teams lost money) and unpopular (television ratings fell 26 percent). Still, during the 1979 NBA All-Star Game weekend, NBA commissioner Larry O'Brien announced the league would add two new teams in the 1980-81 season , with teams in Dallas and Minneapolis . Once the Minnesota team backed out, only Dallas remained, and through negotiations with general counselor and future commissioner David Stern , the expansion fee was settled on the $12.5 million. Carter would provide half the amount, with   , At the 1980 NBA All-Star Game , league owners voted to admit the new team, with the team's name coming from the 1957–1962 TV western Maverick ; the name was chosen by the fans with 4600 postcards received, beating Wranglers and Express . James Garner , who played the namesake character, was a member of the ownership group. The University of Texas at Arlington , who also uses the Mavericks nickname , had objections about a shared name, but did not attempt any legal action.  They joined the Midwest Division of the Western Conference , where they would stay until the league went to six divisions for the 2004–05 season . Dick Motta , who had guided the Washington Bullets to the NBA Championship in 1977–78 , was hired as the team's first head coach . He had a well-earned reputation of being a stern disciplinarian, but was also a great teacher of the game. [ citation needed ] , Kiki Vandeweghe of UCLA was drafted by the Mavs with the 11th pick of the 1980 NBA draft , but Vandeweghe refused to play for the expansion Mavericks and staged a holdout that lasted a month into the team's inaugural season. Vandeweghe was traded to the Denver Nuggets , along with a first-round pick, in 1981, in exchange for two future first-round picks that eventually materialized into Rolando Blackman in 1981 and Sam Perkins in 1984 . , In the Mavericks' debut game, taking place in the brand-new Reunion Arena , the Mavericks defeated the Spurs, 103–92. But the Mavs started the season with a 6–40 record on their way to finishing 15–67. However, the Mavericks did make a player acquisition that, while it seemed minor at the time, turned out to play a very important role in the early years of their franchise. Journeyman 6 ft 3 in guard Brad Davis , who played for the Anchorage Northern Knights of the Continental Basketball Association , was tracked down and signed by the Mavs in December. At the time, there was absolutely no reason to expect that Davis would be any better than the expansion-level talent the Mavs had. [ citation needed ] But he started the Mavs' final 26 games, led the team in assists, and his career soared. He spent the next twelve years with the Mavericks, and eventually his number 15 jersey was retired. The Mavericks also marked the first NBA team to have a profitable debut season, with an average of 7,789 spectators.  , The 1981 NBA Draft brought three players who would become vital parts of the team. The Mavs selected 6'6\" forward Mark Aguirre with the first pick, 6'6\" guard Rolando Blackman 9th, and 6'7\" forward Jay Vincent 24th. By the end of his seven-year Mavs career, Aguirre would average 24.6 points per game. Blackman contributed 19.2 points over his 11-year career in Dallas. But it was Jay Vincent who made the biggest difference for the Mavs in their second season, leading the team in scoring with 21.4 points per game and earning NBA All-Rookie Team honors. The Mavericks improved to 28–54, getting out of the Midwest Division cellar as they finished above the Utah Jazz . , In 1982–83 , the Mavericks were serious contenders for the first time. At the All-Star break , they were 25–24 and had won 12 of their last 15 games. They could not sustain that momentum, and finished seven games behind the Denver Nuggets for the sixth and final playoff spot in the Western Conference. But the Mavs' 38–44 record was a 10-game improvement from the previous season. , Mark Aguirre led the 1982–83 Mavericks with 24.4 points per game, finishing sixth in the NBA. Jay Vincent and Rolando Blackman contributed 18.7 and 17.7 points per game, respectively. Brad Davis was 10th in the NBA in assists with 7.2 per game, and shot .845 from the free-throw line, 6th in the league. Derek Harper was drafted by the Mavs with the 11th pick of the 1983 NBA draft . The 6 ft 4 in guard would spend the next decade with the organization, averaging 15 points and 6.1 assists. The Mavericks' in 1983–84 posted a winning record for the first time in franchise history, finishing 43–39 and second in the Midwest Division. The Mavs also earned the first playoff berth in franchise history. Mark Aguirre was named the team's first NBA All-Star, as he finished with an average of 29.5 points per game—second in the league to Utah's Adrian Dantley . , Dallas finished with the fourth seed in the Western Conference playoffs, and in their first playoff trip they defeated the Seattle SuperSonics in five games. The fifth and deciding game of that series was played at Moody Coliseum , as Reunion Arena, then the home court for the Mavericks, was hosting a tennis tournament. The Magic Johnson -led Los Angeles Lakers were next for the Mavs, and the young club fell short, losing four games to one. But a trade the Mavericks made in their inaugural season of 1980 paid off for them in 1984, because they owned Cleveland 's first-round pick, which ended up being the fourth pick overall. The Mavs used it to select forward-center Sam Perkins , a former North Carolina Tar Heel with surprising range from the three-point line who would average 14.4 points and 8.0 rebounds in six seasons with Dallas. , About this time, the Dallas Cowboys , once one of the NFL 's elite teams, began a slow decline that eventually saw them fall to 1–15 in 1989 . The Mavs were hitting their stride at about the same time, and replaced the Cowboys as the Metroplex' team. The 1984–85 team finished a game better than the previous year at 44–38. Mark Aguirre led the team in scoring again with 25.7 ppg, Sam Perkins made the All-Rookie team, and Rolando Blackman represented the Mavericks in the 1985 NBA All-Star Game . The Mavs returned to the playoffs in 1985 , but were not as successful as they had been the previous year. They won Game 1 in double-overtime against the Portland Trail Blazers in their first-round playoff series, but lost the next three games in a row, ending their season. , Dallas had the eighth pick in the 1985 NBA draft —again due to a trade with the Cavaliers—and drafted German-born forward Detlef Schrempf out of Washington . He would show flashes of brilliance in his three-plus seasons with the team, but it was not until he was traded to the Indiana Pacers that he displayed his full potential. The Mavericks also traded center Kurt Nimphius to the Los Angeles Clippers for center James Donaldson , who would play for the Mavericks until halfway through the 1991–92 season . This allowed the Mavericks to have the steady hand at center that had been lacking throughout the franchise's first five years. In 1988, James Donaldson was the only All-Star center in Dallas Maverick history. , Rolando Blackman represented the Mavericks in the 1986 NBA All-Star Game , hosted by Dallas at Reunion Arena. The 1985–86 Mavericks were second in scoring at 115.3 points per game, gaining them their third-straight playoff appearance. They defeated Utah three games to one in the first round. In the conference semi-finals, they ran into the Lakers again, and L.A. defeated Dallas in six games. But four of those games were decided by four points or less, and Dallas won half of those, leaving Mavericks fans room to hope that they could finally top the Lakers in the following season. The Mavs drafted Michigan center Roy Tarpley with the seventh overall pick, who would go on to become a very talented—but troubled—member of the roster. , The 1986–87 Mavericks team had their most successful regular-season to date, going 55–27 and winning their first Midwest Division title. But despite the great expectations surrounding the team, they self-destructed in the playoffs. After hammering the Seattle SuperSonics by 22 points in Game 1, the bottom dropped out for the Mavs, as they lost Games 2 and 3 in close fashion before succumbing in Game 4 in Seattle . Following the unexpected early playoff exit, Motta, who had been with the team since its inception, shockingly resigned as head coach. John MacLeod , who had led the Phoenix Suns to nine playoff berths in 11 seasons including an NBA Finals run in 1976, was hired as his replacement. , The 1987–88 NBA season saw the Mavericks dip just a little bit in the regular season—finishing 53–29 and losing their Midwest Division title to the Denver Nuggets —but it was another successful year for the team. Mark Aguirre and James Donaldson both played in the 1988 NBA All-Star Game , the Mavericks rattled off a franchise-best 11-game winning streak, and Rolando Blackman scored his 10,000th career point. Aguirre led the team in scoring for the sixth consecutive year with 25.1 points per game, and Roy Tarpley won the NBA Sixth Man Award with averages of 13.5 points and 11.8 rebounds. The season saw the Mavs' deepest playoff run to date. They dispatched the Houston Rockets in four games and the Nuggets in six, leaving only the defending NBA Champion Lakers between them and their first-ever trip to the NBA Finals . The Mavericks gave the Lakers everything they could handle, but in the end the more experienced Lakers prevailed, defeating Dallas in seven games on the way to eventually winning their second consecutive NBA Championship. , Despite all the changes, the Mavs remained in contention. However, their season effectively ended when James Donaldson went down with a ruptured patella tendon on March 10, 1989 and missed the rest of the season as a result. The Mavericks were left undermanned, demoralized and disheartened as they finished with a 38–44 record. It was their first losing season since 1982–83—which was also the last time they missed the playoffs. , The Mavericks returned to the playoffs in 1989–90 with a 47–35 record, but it was another season of off-court chaos. On November 15, only six games into the Mavs' season, Tarpley was arrested for driving while intoxicated and resisting arrest. The team started 5–6 and MacLeod was fired, replaced by assistant coach Richie Adubato . The Mavs finished the season with four straight victories to surge into the playoffs, but went down rather meekly to the Portland Trail Blazers in three games. It would be the team's last winning season and last playoff appearance until 2001. , The team endured numerous changes in 1990, losing Sam Perkins to the Lakers via free agency and suffering injuries to practically their entire 1990–91 starting lineup. The players they managed to acquire— Rodney McCray , Fat Lever and Alex English —were all in the twilight of their careers. On November 9 it was announced that Fat Lever would have season-ending surgery on his right knee, and that very night, Tarpley suffered a knee injury of his own which ended his season. The Mavericks' season only got worse from there, and they finished with a record of 28–54, the worst in the NBA, falling behind even the second-year Minnesota Timberwolves and Orlando Magic . In March 1991, Tarpley was charged with suspicion of driving while intoxicated and was suspended again by the NBA. , It got even worse in 1991–92 . Before the season even began, Tarpley violated the league's substance abuse policy for the third time and was banned from the NBA for life. The former Sixth Man Award winner's fall from grace was complete. The few talented players the Mavericks had remaining to them were lost to injury. Brad Davis' back problems forced him to retire in mid-January, and Fat Lever had knee surgery again on January 29, missing the remainder of the season—hardly worth the cost of losing two first-round draft picks. The team finished with a 22–60 record. , In 1992–93 , the rebuilding began in earnest, with the Mavs trading Rolando Blackman —who by that point had surpassed Mark Aguirre as the team's all-time leading scorer—to the New York Knicks for a first-round draft pick. Blackman had made four All-Star Game appearances in his Mavericks career. Herb Williams joined the Knicks as a free agent. Fat Lever underwent more surgery and missed the entire 1992–93 season. Derek Harper was the team's sole bright spot, leading the team with 18.3 points per game. , The Mavericks selected Ohio State guard Jim Jackson with the fourth overall pick of the 1992 NBA draft , but he and owner Donald Carter could not come to terms on a contract for half of his rookie season. Jackson only played 28 games in 1992–93 , a season that was also ruined by trades, a coaching change and injuries. The Mavericks started 2–27 and fired Adubato on January 13, replacing him with Gar Heard . The Mavericks came dangerously close to setting the all-time worst record in NBA history (at the time, 9–73 by the 1972–73 Philadelphia 76ers ). But when Jackson was signed on March 3, the Mavs rallied, closing the season with a 7–14 mark, including two straight wins to end the season and finish 11–71, which was the second-worst record in NBA history. , Dallas selected Kentucky forward Jamal Mashburn with the fourth overall pick of the 1993 NBA draft and hired Quinn Buckner as coach. Part of the problem was that Buckner decided from the start to be a disciplinarian on the model of his college coach, Bobby Knight . [ citation needed ] The mostly young roster did not respond very well to Buckner's stern coaching style, and started 1–23. By the end of January they were 3–40, and it was once again possible that they could tie the 1973 Sixers for the all-time worst record in the league. But 5–9 records in February and April, coupled with Buckner loosening the reins a little bit, helped the Mavs finish 13–69. It was still by far the worst record in the league, but the Mavericks again avoided setting an all-time futility record. They did, however, tie the NBA's single-season record for consecutive losses at 20 games (since broken). , Buckner was fired after garnering the worst full-season record for a rookie head coach—a record that only lasted two years, until Bill Hanzlik broke it with the Denver Nuggets . The Mavericks brought back Dick Motta, who had led the franchise to some of its most successful seasons. The Mavericks also wound up with the number 2 pick in the 1994 NBA draft , and picked up Cal point guard Jason Kidd , giving them a solid tandem of Jackson, Mashburn and Kidd which would become known as \"The Three Js\". , The addition of Jason Kidd infused the Mavericks with new life in 1994–95 . Kidd averaged 11.7 points, 5.4 rebounds and 7.7 assists in his rookie season, and led the league in triple-doubles. Roy Tarpley was allowed to return to the league after three years and helped with 12.6 points and 8.2 rebounds per game. The tandem of Jim Jackson and Jamal Mashburn combined as the league's highest-scoring pair of teammates. On separate occasions, Mashburn and Jackson scored 50 points in a game that season. Mashburn contributed 24.1 points per game, fifth in the NBA; Jackson averaged 25.7 points, but suffered a severe ankle sprain in February which caused him to miss the remainder of the regular season. Second-year forward Popeye Jones had a great year as well, as he averaged 10.6 rebounds and led the NBA in offensive rebounds. , The Mavericks' improvement was dramatic. They jumped to 36–46, 10th in the Western Conference and only five games behind the Denver Nuggets for the eighth and final playoff spot. It was the biggest one-year improvement in the team's history, and the highest in the NBA that season. Many [ who? ] expected the Mavericks' improvement to continue with the franchise's first foray into the NBA Playoffs since 1990. But despite a 4–0 start, the 1995–96 season was a disappointment in about every conceivable way. [ according to whom? ] For the second time in his career, Roy Tarpley was given a lifelong ban from the NBA for repeated violations of the anti-drug policy—he never played in the NBA again. Jamal Mashburn had season-ending surgery to repair his sore right knee only 18 games into the Mavericks' schedule. , The team's two remaining stars, Jason Kidd and Jim Jackson, bickered throughout the season, though neither of them had any trouble establishing his individual stardom. Jackson led the team in scoring with 19.6 ppg, made 121 three-pointers and was the only Mav to start in all 82 games. Kidd became the first Maverick to be elected a starter in the NBA All-Star Game, and finished second in the league in assists and fourth in steals while averaging 16.6 ppg. George McCloud , who averaged 9.6 ppg in his previous year, blew away his career-high scoring average as the Mavs resorted to the outside shot time and again due to their lack of an inside scoring threat. McCloud averaged 18.9 ppg and made 257 three-pointers, equaling the second-highest individual season total in league history. , Overall, the Mavericks connected on 735 of their 2,039 three-point attempts, both new league records. The Mavs finished 26–56, fifth in the Midwest Division and 33 games out of first place. At season's end, Motta was relieved of his head coaching responsibilities and replaced by former Bulls assistant coach Jim Cleamons . And Don Carter, the only owner the Mavericks had ever had, sold the team to a group of investors led by H. Ross Perot, Jr. , The 1996–97 season was a year of transition for the Mavericks, as they basically re-designed their entire team; 27 different players saw action for that Dallas team, setting an all-time NBA record. By the time the season was over, only rookie forward Samaki Walker remained from the opening-day roster. The first big move came in December, as Jason Kidd, Loren Meyer and Tony Dumas were traded to the Phoenix Suns for guards Michael Finley and Sam Cassell and forward A. C. Green . By far the most important of these acquisitions [ citation needed ] was Finley who, after his first half-season in Dallas, went on to average over or near 20 ppg for at least the next seven years of his Mavericks career. He made two visits to the NBA All-Star Game, and played in each of the Mavs' games until the 2004–05 season. , Don Nelson was hired as Dallas' general manager on February 7. Within a week of his hiring, the Mavs had released Fred Roberts and Oliver Miller and traded Jamal Mashburn to the Miami Heat for forwards Kurt Thomas and Martin Müürsepp and guard Sasha Danilović . Thomas did not play in 1996–97, and only ended up playing in five games as a Maverick before signing as a free agent with the New York Knicks . Danilović played in 13 games for the Mavs before opting out of his contract and signing with Bucker Bologna of the Italian League, and Müürsepp played in 73 games for the Mavericks over the next two years before leaving the NBA. , Chris Gatling was the Mavericks' sole representative in the NBA All-Star Game, but he did not last much longer in Dallas. In one of the largest two-team trades in NBA history, the Mavericks traded Gatling, Jim Jackson, Sam Cassell, George McCloud and Eric Montross to the New Jersey Nets for 7 ft 6 in center Shawn Bradley , forward Ed O'Bannon and guards Khalid Reeves and Robert Pack . Nelson claimed the trades were necessary because the situation in the locker room was unacceptable. However, whereas Cassell went on to become a consistent floor leader and Jackson, Gatling and McCloud all continued to be solid contributors to their teams for several more years, only Bradley lasted any sort of time in Dallas and would spend part of the next eight years putting up modest contributions for the Mavs and giving them solid numbers in terms of blocked shots. , Undrafted rookie guard Erick Strickland averaged 10.6 ppg. He, along with Finley and Bradley, were expected to be the core of this new Mavericks team. The constant changes made it impossible to establish any sort of team chemistry in 1996–97, and the Mavericks finished 24–58. But they had acquired some of the pieces that would help them start to turn things around in years to come. In 1997–98, despite a poor record of 20–62, Dallas had a knack for giving some of the NBA's elite teams a hard time, as they beat the Seattle SuperSonics , New York Knicks , Indiana Pacers and Chicago Bulls . Against the Bulls, Dallas went on a 17–2 run to force overtime, where they won 104–97. Midway through that season, Nelson fired Cleamons and named himself head coach. , In the lockout-shortened 1998–99 season, the Mavericks finished with a lowly 19–31 record, but Michael Finley and Gary Trent put up solid numbers and led their team to their first winning home record (15–10) since 1989–90. Notable were the acquisitions of power forward Dirk Nowitzki and point guard Steve Nash , two seemingly unspectacular moves which would make a great impact in the future. In the following season the team finally \"clicked\" and started to win on a consistent basis. Led by Finley, the Mavericks earned their first 40-win season since 1989–90. He was greatly helped by Nowitzki, who finally \"arrived\" in the NBA and established himself as a potent offensive threat. , On January 14, 2000, Ross Perot's group sold the Dallas Mavericks to Internet entrepreneur and season ticket-holder Mark Cuban for $285 million. Cuban immediately set out to revitalize the Mavericks and increase the team's popularity in Dallas and nationwide. His controversial moves (he allowed Dennis Rodman to live in his house for a week before temporarily signing him) and outspoken personality quickly made him a fan favorite in Dallas and garnered the team lots of press in the national media. He has also been fined millions of dollars for violating NBA rules.  , In 2000–01 , the Mavericks improved further and finished with a 53–29 record, fueled by an offensive triangle of Nowitzki, Finley and Nash. The Mavs made a trade minutes before the trade deadline that sent Hubert Davis , Christian Laettner , Courtney Alexander , Loy Vaught , and Etan Thomas to the Washington Wizards for Juwan Howard , Calvin Booth and Obinna Ekezie . This move brought in fresh blood that secured the club's first playoff visit in 11 years. Also, Wang Zhizhi became the first Chinese player to play in the NBA, signing with the Mavs in January, along with the Eduardo Nájera, bringing Dallas an international cast that included Canada's Nash and Germany's Nowitzki. In the playoffs , the Mavericks won in the first round against the Utah Jazz , advancing to the second round for the first time since 1988. Even though they were eliminated by the San Antonio Spurs in five games, it marked a sense of optimism for Dallas in seriously contending for an NBA title. This was also the last season in the old Reunion Arena before making the move to the modern American Airlines Center . , These years also saw Nowitzki win the first two of his unprecedented five consecutive Euroscar Awards as the top player in Europe, in 2002 and 2003. (This award is presented at the end of a calendar year, as opposed to the end of the season as in the NBA awards.) , The 2001–02 season was a great season for the Mavericks, with a 57–25 record and many sellout crowds in the American Airlines Center . This season also saw a change in logo and colors, changing from the cowboy hat logo and green to a new horse logo. In addition, the team gained sleeker uniforms. Another blockbuster trade sent Juwan Howard , Tim Hardaway and Donnell Harvey to the Denver Nuggets in exchange for Raef LaFrentz , Nick Van Exel , Tariq Abdul-Wahad and Avery Johnson , the Mavericks also made several attempts to sign the Utah Jazz 's star Karl Malone . The Mavericks swept the Minnesota Timberwolves in the playoffs but lost again in the second round, this time to the Chris Webber -led Sacramento Kings . , But it was only in the next season that the Mavericks finally broke through. They started the 2002–03 season with a 14–0 record, which was one win shy of tying the NBA record set by the 1993–94 Houston Rockets (15–0). The Mavericks finished with a 60–22 record in the regular season, astonishing fans and critics with their sparkling offense. Since acquiring the \"Big Three\" of Nowitzki, Finley, and Nash, the Mavericks were a Western Conference power in waiting  and finally led the team to the Conference Finals against the San Antonio Spurs . However, with the series tied 1–1, Dirk Nowitzki, the team's leading scorer, suffered a knee injury in game three that kept him out the rest of the series. This further worsened the Mavs' front-court depth problems (both of their backup centers were injured for the entire series) and the Spurs took the series in 6 games. , In 2003–04 , two blockbuster trades were announced. The Mavericks acquired Antawn Jamison , Danny Fortson , Jiri Welsch and Chris Mills from Golden State in exchange for Nick Van Exel, Evan Eschmeyer , Popeye Jones, Avery Johnson and Antoine Rigaudeau . Another high-profile trade sent Raef LaFrentz, Chris Mills and Jiri Welsch to Boston for Antoine Walker and Tony Delk . Although the team struggled with chemistry, the Mavericks easily qualified for the playoffs. With the trio Nowitzki-Finley-Nash and NBA Sixth Man of the Year Jamison, the Mavericks continued their reputation as the best offensive team in the NBA. Notable were two rookies, Josh Howard and Marquis Daniels , who made an immediate impact. However, the Mavericks were eliminated quickly in the playoffs , losing in the first round to the Chris Webber -led Sacramento Kings , a team which clearly played better defense. The Mavericks management had to re-evaluate their strategy. , The 2004–05 season saw trades which (among others) brought in burly center Erick Dampier , combo guard Jason Terry , speedy rookie point guard Devin Harris , scoring machine Jerry Stackhouse , and defensive stalwart Alan Henderson . Although the loss of All-Star Steve Nash via free agency visibly hurt the Mavericks' offense, the new acquisitions strengthened the team defense. The run-and-gun style of former times changed into a more balanced style of play. At the All-Star break, the Mavericks acquired Keith Van Horn for Calvin Booth and Henderson, the latter resigning only days later. Nowitzki added his third consecutive Euroscar during this season as well. On March 19, longtime coach Don Nelson resigned and his assistant Avery Johnson succeeded him. Under Johnson's tutelage, the defense of the Mavericks became stronger and they easily qualified for the playoffs with an impressive 58–24 record. The Mavericks defeated the Houston Rockets in Round 1 of the playoffs in 7 games but then lost to the Phoenix Suns 4–2, led by former Maverick star Steve Nash . , Prior to the 2005 NBA Draft , the Mavericks had traded all their picks away and were left empty-handed. On August 15, 2005, veteran guard Michael Finley was waived under the new \"Allan Houston Rule\".  Under that rule, the Orlando Magic waived Doug Christie , who then signed with the Mavericks. On August 19, the Mavericks held a press conference announcing they had re-signed Darrell Armstrong , and introduced Christie, DeSagana Diop , Rawle Marshall , and Josh Powell as new Mavericks. Christie's playing time was very limited amid a surgically repaired ankle still hampering his play. He was waived on November 25, 2005. At the end of calendar 2005, Nowitzki achieved a rare double by winning both the Euroscar and Mr. Europa , a second prestigious award for the top European player. He additionally was named the inaugural FIBA Europe Player of the Year . , Up until the very end of the season, the Mavericks were toe-to-toe with the San Antonio Spurs for the crown of the Southwest Division as well as the #1 spot in the Western Conference. However, they fell short of the title and had to settle for a fourth seed. Nonetheless, they once again achieved a 60–22 record, with Avery Johnson winning NBA Coach of the Year honors. In the playoffs , they swept the Memphis Grizzlies , leading to a titanic series against their state rivals and the reigning NBA champions the San Antonio Spurs. Five out of the seven games were decided in the last minute, including a Game 7 that had to go into overtime, with the Mavs prevailing under the guidance of Dirk Nowitzki and an incredibly deep bench. The Mavericks were able to advance to the Conference Finals against former teammate Steve Nash and the Phoenix Suns . The Mavs' defense and depth enabled them to take the series, as they defeated the Phoenix Suns in game 6 of the Western Conference Finals on June 3, 2006 in the US Airways Center in Phoenix , and the Mavs advanced to their first NBA Finals in franchise history. , In the NBA Finals, the Mavericks faced the Miami Heat , held home-court advantage and scored two convincing wins. After game 2, Dallas city officials had already planned the victory parade. However, in Game 3, the Mavs blew a late double-digit lead, courtesy of Heat guard Dwyane Wade . He carried the Heat to the win, with Nowitzki missing a potentially game-tying free throw in the last seconds. After getting blown out in Game 4, the Mavericks suffered another loss in Game 5 when Wade scored the game-tying basket in the last possession of regular time, putting the Heat ahead with last-second free throws in overtime. The tragic figure was Josh Howard , who missed a pair of clutch free throws in overtime and mistakenly called an early timeout, so the Mavs had to bring in the ball at backcourt rather than half-court for the last possession. In Game 6, the Mavericks took an early double digit lead, but again, Wade poured in 36 points, helped by Alonzo Mourning 's five blocked shots, and the Mavericks lost their fourth game and the title after a string of botched three-pointers. Many Mavericks fans were stunned by the defeat. Mavericks owner Mark Cuban was fined a total of $250,000 for \"several acts of misconduct\" during the series, and Nowitzki was fined $5,000 for kicking a ball into the stands after Game 5. Nowitzki was also caught by TV cameras attacking a stationary bicycle in the hallway outside of the Mavericks locker room. Jerry Stackhouse was suspended for Game 5 after fouling Shaquille O'Neal on a breakaway dunk attempt. The latter marked the third time a Mavericks player was suspended in the 2006 playoffs. , The Mavericks became only the third team in NBA history (the first since 1977) to lose in the Finals after taking a 2–0 lead. In Game 3, the Mavs held a 13-point lead with under seven minutes remaining but were outscored 22–7 in the momentum-changing 98–96 defeat. The Heat's performance in the last seven minutes represented the team's greatest postseason comeback in team history.  , After an end to their playoff run in 2006, the Mavericks sought retribution in the new season. After an 0–4 start, the Mavericks went on a historic run and posted a 52–5 record over their next 57 games. They finished the regular season with a record of 67–15, good enough to be tied for 6th place all-time, first in the league and the number 1 seed in the Western Conference playoffs . Dirk Nowitzki had a dominant season, further cementing his place as one of the game's elite players; he won his fifth consecutive Euroscar during the season, and was named the NBA MVP at its end. Josh Howard was named to the all-star team. , However, the first-place Mavericks were defeated in six games by the 8th-seeded Golden State Warriors , which is regarded by some as one of the biggest upsets in NBA history, while others don't consider it an upset at all.  The Mavs were exposed defensively, and the Warriors systematically dismantled the Mavericks by exploiting match-ups and preying on Dirk Nowitzki's weaknesses. Former NBA champion and All-Star legend Bill Russell stated in his NBA.com blog that he didn't consider it to be an upset, since Golden State was 3–0 vs. the Mavericks in the regular season. On the year, the Mavericks went 67–12 against the rest of the league and 0–3 against Golden State, giving credibility to Russell's belief that the Warriors' win shouldn't have surprised NBA fans. The Warriors were coached by Don Nelson , the immediate past manager and coach of the Mavericks until he stepped down at the end of 2005–06, and he had been appointed head coach of the Warriors in the 2006–07 mid-season. , Nowitzki's winning of regular season MVP honors and his team's first-round exit created an awkward dilemma regarding the MVP trophy ceremony. Traditionally, the MVP award is given to the winner in a ceremony between the first and second rounds of the playoffs. But it has been believed  that the league opted to put some distance between the MVP presentation and the Mavericks' elimination against the Warriors. By the time Nowitzki collected his MVP award, nearly two weeks had elapsed since the Mavs were ousted in the playoffs. , The Mavericks dealt Devin Harris , two first-round picks and others to the New Jersey Nets for veteran all-star Jason Kidd and other role players, Cuban also tried to sign the free agent Kevin Garnett unsuccessfully. The Mavericks were 3–11 against winning teams since the trade and lost Nowitzki for a little over a week due to a high ankle sprain injury. He returned April 2 in a crucial game against the Golden State Warriors in a 111–86 Mavericks victory and helped defeat the Phoenix Suns in a 105–98 win on April 6. This win in Phoenix was especially significant because the Mavs had been nearly unable to defeat a contending team on the road the entire season. Continuing their playoff push, Dirk hit a crucial three-pointer with 0.9 seconds left, defeating the Utah Jazz 97–94 on April 10. This victory guaranteed them a playoff spot and their 8th consecutive 50-win season. The Mavericks ended the season with a record of 51–31. In the first round of the playoffs, the Mavericks were eliminated once again, by the New Orleans Hornets 4–1 on the road, 99–94. , Just one day after a disappointing season ended, Avery Johnson was dismissed as Head Coach of the Dallas Mavericks. On May 9, 2008, Rick Carlisle was hired as the head coach.      , After getting off to 2–7 start, the Mavericks eventually found themselves with the sixth spot in the Western Conference playoff bracket for 2009 after going 50–32 (ninth consecutive 50+-win season) and about three to four weeks earlier, weren't even sure if they were going to make the eighth and final spot. But a run of 5–1 in their last six regular season games got them to a game over the Hornets for sixth place. Dirk Nowitzki also entered the postseason with a streak of twenty-five consecutive games of scoring 20 or more points, which was ended in the first game of the quarterfinals series versus the arch-rival, San Antonio Spurs . , The Mavericks surprised many people by winning Game 1, 105–97 in San Antonio.  The Spurs quickly won game two in a rout. As the series shifted to Dallas, who had only lost one game there after the All-Star Break, won both Games 3 and 4. San Antonio was just trying to win Game 5 to extend the series, but they couldn't do it as the Mavericks closed out the series with a 13-point-victory, 106–93. With the Victory, the Mavericks advanced to the Conference semifinals for the first time since 2006. , In the semifinals, they faced the two-seeded Denver Nuggets , who were fresh off a 4–1 series win against the New Orleans Hornets , including a 58-point win in New Orleans. The Mavericks stayed close with the Nuggets in the first three quarters of Games 1 and 2, but it was the fourth quarter when Carmelo Anthony and the Nuggets woke up, as they took the first two games by double-digit figures. Game 3 in Dallas was close the whole way, and Dallas led by five points with less than a minute to go. But Carmelo Anthony hit a three-pointer to give the Nuggets a 106–105 victory. The play generated quite a bit of controversy because Maverick guard Antoine Wright clearly fouled Anthony, but since there was no replay used in the NBA in 2009 the Mavericks suffered a game 3 loss. It was later announced by the league that the referees made the wrong call,  but despite that, the Mavericks still faced a 3–0 deficit in the series. , Nowitzki's 44 points in Game 4 saved the Mavericks season, sending the series back to Denver for a Game 5, with the series in Denver's favor, 3–1. Game 5 would prove to be the final game for the Mavericks of the 2009 season, as they would be ousted by a score of 124–110. The elimination led to an off-season facing many questions about the future construction of the team. , After a disappointing loss to the Nuggets in the playoffs, the Mavericks entered the off-season with many questions about the future construction of the team. They began by re-signing Jason Kidd to a three-year contract extension, which took care of their pending point guard issue. The Mavericks also made a move to compound their age problem, by trading for former All-Star small forward Shawn Marion . In a three-team deal with the Grizzlies and Raptors, the Mavericks sent swing-man Antoine Wright along with defensive stalwart Devean George to Toronto, while aging guard Jerry Stackhouse landed in Memphis. Dallas also acquired burly center Nathan Jawai , and Kris Humphries . Many analysts viewed this as a beneficial trade for the Mavericks, being that it countered their age issues, while simultaneously providing them with more depth on the bench.  The Mavericks also added veteran forwards Tim Thomas , Drew Gooden , and Quinton Ross . , These moves proved successful, because after dropping the season opener to the Wizards , the Mavericks went on to beat many contenders such as the Los Angeles Lakers , San Antonio Spurs , Houston Rockets , and the Phoenix Suns which was something that the Mavericks had been unable to do the last two seasons. , A day before the trade deadline, the Mavericks instigated a deal. The trade sent Josh Howard , James Singleton , and Drew Gooden to the Washington Wizards in exchange for Caron Butler , Brendan Haywood , and Deshawn Stevenson . The Mavericks felt that this trade was necessary due to Howard's declining performance and apparent unhappiness with the Mavericks organization. Some NBA analysts felt that this was a good move, because not only did it remove a disgruntled Howard from the line-up, it simultaneously brought Dirk Nowitzki a quality supporting cast, with many believing that the Mavs could contend for a title after the trade went through.   The trade clearly worked, because the new-look Mavericks came out of the all-star break with a vengeance. On January 24, 2010, the Dallas Mavericks routed The New York Knicks 128–78. This was the third largest margin of victory in NBA history. The previous largest margin of victory for the Mavericks was 45 points. After dropping the second-half opener to the Oklahoma City Thunder, the Mavericks went on to win 13-straight games before losing to the New York Knicks. On April 10, the Mavericks clinched the Southwest division after defeating the Portland Trail Blazers 83–77. The Mavericks finished the season with a 55–27 record, good enough for the second seed in the Western Conference. The Mavericks then entered the post-season with quite a bit of optimism and an assurance that they could seriously contend for a title. , During the playoffs though, this optimism proved to be short lived, because after winning game one 100–94, behind Nowitzki's 36-point performance, the Mavericks dropped the next three games to their in-state rivals, the San Antonio Spurs, before winning game five. Dallas would eventually lose against San Antonio in six games 97–87, leading to yet another off-season full of speculation, mostly centering around franchise player Dirk Nowitzki's pending free agent status. , After yet another first round melt-down, the Mavericks began an unexpectedly early off-season. The first order of business for Mark Cuban and the Mavericks was to re-sign Dirk Nowitzki , and they did so on July 4, 2010, when the Mavericks and Nowitzki agreed to a four-year deal worth $80 million. On July 13, the Mavericks, after losing the opportunity to sign LeBron James , Dwyane Wade , or Amar'e Stoudemire , acquired centers Tyson Chandler and Alexis Ajinca from the Charlotte Bobcats for center Erick Dampier , forward Eduardo Najera and guard Matt Carroll . , The 2010–11 campaign saw the Mavericks fly out of the gate, winning 24 out of their first 29 games. However, on December 27, Dirk Nowitzki sustained a knee injury that derailed the Mavericks momentum, combined with the team's second-leading scorer Caron Butler suffering a season-ending knee injury himself only four nights later, raising questions of if the Mavericks could make it 11 straight 50-win seasons. The Mavericks then went on to drop their next seven games, causing serious concern as to who would lead the offense in Nowitzki's absence. This however would prove to only be a temporary setback because Nowitzki only missed nine games, and admittedly rushed back to assist the Mavericks' reeling offense, and consequently they quickly returned to their winning ways. The Mavericks re-invented their defensive reputation around the league during the 2010–11 campaign, mostly in part to off-season acquisition Tyson Chandler (who was later named to the All-Defensive Second Team).  The Mavericks battled the San Antonio Spurs all season long for the division title, but instead settled for the 3rd seed, with a 57–25 record. However, due to the Mavericks bad reputation on struggling during the playoffs, many predicted them to be ousted in the first round against the six-seeded Portland Trail Blazers .  Yahoo Sports analyst Adrian Wojnarowski even went so far as to predict a sweep for the Trail Blazers. , The Mavs won games 1 and 2 on their home floor in convincing fashion. However, upon their arrival to the Rose Garden in Portland, problems began to arise. After dropping game three to Portland, the Mavericks blew a 23-point fourth-quarter lead in game four to allow Portland to tie the series at two games apiece. The whispers then began to re-surface that the Mavericks were going to allow another impressive regular season to go down the drain.  The Mavericks then responded, posting back-to-back wins to oust the Blazers in six games. They then met the two-time defending champion Los Angeles Lakers in the Western Conference Semifinals. This series was the first time that Kobe Bryant had met Dirk Nowitzki in a playoff series and was expected to be extremely competitive; that however did not prove to be the case. The Mavericks shocked the NBA world by winning the first two games in Los Angeles, and took a two games to none lead heading back to Dallas. They then won a thrilling game three in Dallas, courtesy of 32 points from Nowitzki in a 98–92 victory. The Mavericks then provided the perfect \"exclamation point,\"  crushing the Lakers in game 4 by a score of 122–86. In that game, Jason Terry set an NBA playoff record with nine three-pointers with just one miss, ousting the Lakers in a four-game sweep. The Mavericks then met the upstart Oklahoma City Thunder in the Western Conference Finals. Dirk Nowitzki set the tone in the series in game one with a 48-point performance, with the Mavericks taking game 1 by a score of 121–112. The Thunder then responded with 106–100 victory in game 2. The Mavericks then won the next three games, including a 15-point comeback in game 4, to take the series in five games. The Mavericks claimed their second Western Conference Championship in franchise history, and met the team that defeated them in the 2006 NBA Finals, the Miami Heat . , The Mavs entered the 2010–2011 NBA Finals as underdogs, due to Miami's \"Big Three\" coming together during the course of the 2010–11 NBA Playoffs. After dropping game one in Miami by a score of 92–84, the Mavs needed more than just Nowitzki to score, with Nowitzki even calling out teammate Jason Terry earlier in the playoffs. In the fourth quarter of game 2 with the Mavericks trailing 88–73, Dallas was desperate to avoid a 0–2 heading back home. Dallas then staged a comeback, going on a 22–5 run to end the game, and stun the Heat with a game two victory, evening up the series at a game a piece. After the series shifted back to Dallas, the Mavericks lost in game 3, with Nowitzki narrowly missing the potential game-tying shot, by a score of 88–86. Dallas yet again showed their resiliency, winning a pivotal game 4 with Dirk hitting multiple big shots down the stretch to tie the series at two. Game 5 was a bit of an offensive showcase, with both teams breaking 100 points for the first time in the series. Jason Kidd and Jason Terry both hit huge shots down the stretch and the Mavericks defeated the Heat with a 112–103 victory, putting them one game from their first ever NBA title. Three nights later, the Mavericks captured their first ever NBA title with a 105–95 victory, completely reversing what had happened in the 2006 NBA Finals. Nowitzki scored 21, including 18 in the second half, and Terry provided 27 points off the Dallas bench. Nowitzki was so emotional after the game that he headed to the locker room before the game had concluded, and had to be coaxed back onto the floor for the NBA Championship trophy presentation. Nowitzki took home the NBA Finals MVP honors, after averaging 26 points a game during the series, shedding the Mavericks label as \"soft\", and putting an end to the Mavericks post-season futility. , The 2011–12 season was cut to 66 games due to a lockout , which meant the Mavericks had to wait until Christmas Day to raise their first championship banner. During the brief off-season, owner Mark Cuban decided to maintain financial flexibility by letting Tyson Chandler, DeShawn Stevenson, J. J. Barea and Caron Butler go. Chandler signed with the New York Knicks , Stevenson joined the New Jersey Nets , Barea went to the Minnesota Timberwolves , and Butler joined the Los Angeles Clippers . Meanwhile, they acquired incumbent NBA Sixth Man of the Year Lamar Odom via a trade with the Lakers, while signing veterans Vince Carter and Delonte West . , The Mavericks raised their championship banner prior to their Finals rematch with the Heat on Christmas Day, but in what would soon become a mirror image of the 2006–07 Heat 's eventual failed title defense, Miami blew them out in a 105–94 loss, marking Dallas's first regular-season loss to Miami in eight seasons. Things didn't get better for Dallas after starting the season 0–3, losing to the Thunder in a playoff rematch on December 29. As the calendar turned to 2012, the Mavericks started off on a high note, winning 13 of 18 games in January, but they limped to a 22–22 record the rest of the way, eventually finishing 7th with a 36–30 record, their lowest finish since the 2007–08 season. Nowitzki produced 21.6 points, 6 rebounds and 45.7% shooting, his lowest numbers since the 2000–01 season. Meanwhile, Odom proved to be a bad fit for the Mavericks, and they decided to sit him out for the final two months of the season. , In a rematch from the previous year, the Mavericks faced the Oklahoma City Thunder in the first round of the 2012 NBA Playoffs . Games 1 and 2 went down the wire, but the Mavericks fell short on both occasions as Kevin Durant bailed the Thunder out with a game-winning jumper in Game 1, and with late-game free throws in Game 2. Back in Dallas for Game 3, the Mavericks fell flat throughout the game and suffered a 95–79 defeat to fall behind 0–3. With their backs against the wall in Game 4, the Mavericks led for much of the second half, but James Harden 's 15-point fourth quarter rallied the Thunder to a 103–97 win and eliminated the Mavericks from contention. It marked the first time Dallas was swept in a seven-game series, and they became the third defending champion to be swept in the first round after the aforementioned 2006–07 Heat and the 1956–57 Philadelphia Warriors. , During the 2012 off-season, the Mavericks lost both Jason Kidd and Jason Terry to free agency. Kidd signed with the New York Knicks, while Terry joined the Boston Celtics . Brendan Haywood was later amnestied before moving to the Charlotte Bobcats . The Mavericks acquired Darren Collison from the Indiana Pacers and signed O. J. Mayo from the Memphis Grizzlies . Also joining the team were former All-Stars Chris Kaman and Elton Brand . , The 2012–13 season was a struggle for the Mavericks, as Nowitzki recovered from knee surgery and missed 29 games. In addition, Collison was inexperienced at the point, leading the Mavericks to sign veteran Derek Fisher for nine games,  before settling on Mike James . Mayo was the team's leading scorer for the first two months of the season before Nowitzki's return saw his averages dip. Kaman and Brand were also hounded by injuries. The Mavericks were 23–29 at the All-Star break, before making a late push for a playoff berth. Still, it did not save their season, and the Mavericks missed the playoffs for the first time since 2000. , During the 2013 off-season, the Mavericks chose not to re-sign role players Collison, Brand, and Kaman. Mayo then declined to exercise his player option, and later signed with the Milwaukee Bucks . The Mavericks signed José Calderón from the Detroit Pistons and Monta Ellis from the Bucks. They also signed veteran Samuel Dalembert . , On April 4, 2014, the Mavericks swept the season-series with the Los Angeles Lakers for the first time since the 1980–81 season with a 107–95 win.  , The Mavericks finished 49-33, one game ahead of Phoenix for the eighth and final playoff spot, which meant that they would once again have to face their in-state rivals, the San Antonio Spurs, who were the top seed in the Western Conference with a 62-20 record. In Game 1 in San Antonio, Dallas had an 81-71 lead in the fourth quarter, but the Spurs rallied back and took Game 1, 85-90. However, the Mavs forced 22 turnovers in Game 2 to rout the Spurs 113-92, splitting the first two games before the series went to Dallas. In Game 3, Manu Ginobili hit a shot that put the Spurs up 108-106 with 1.7 seconds left, but a buzzer-beater by Vince Carter gave the Mavs the victory, putting them up 2–1 in the series. The Spurs took Game 4 in Dallas 93–89 despite a late Dallas comeback after the Spurs at one point had a 20-point lead and later won Game 5 at home, 109-103, giving them a 3-2 series lead. The Mavs avoided elimination in Game 6 at home by rallying in the fourth quarter, winning 111–113. Game 7 was on the Spurs home court, and the Spurs beat the Mavericks 119-96, putting an end to the Mavericks' season. , In the 2014 off-season, the Mavericks made several moves, the first of which was trading for Tyson Chandler and Raymond Felton from the New York Knicks, sending Calderón, Dalembert, Shane Larkin, and Wayne Ellington as well as two second-round draft picks, on June 26, 2014, right before the draft. Nowitzki also took a generous discount, re-signing for three years and $25 million, which helped Dallas sign restricted free agent Chandler Parsons from the Houston Rockets to a three-year contract at $46 million. Devin Harris was re-signed, for four years and $16 million. Dallas brought in Richard Jefferson , Al-Farouq Aminu , Jameer Nelson , Greg Smith to build a deep bench. The Mavs' sixth man, Vince Carter, left in free agency to the Memphis Grizzlies. , On November 13, 2014, the Mavericks recorded their largest victory ever with a 123–70 win over the Philadelphia 76ers. The 53-point margin for Dallas surpassed its 50-point win over the New York Knicks in January 2010.  Two days later, they scored 131 points to record their biggest point tally since 2009 in the win over the Minnesota Timberwolves.  , On December 18, 2014, the Mavericks sent Jae Crowder , Jameer Nelson, Brandan Wright, a 2015 first-round pick and a 2016 second-round pick to the Boston Celtics for Rajon Rondo and Dwight Powell .  , On April 28th, 2015, the Mavericks were knocked out of the first round by their in state rivals, the Houston Rockets, in a 4-1 series loss. After going down 3-0 in a Game 3 overtime, the Mavericks managed to win one on their homecourt before losing in Houston in the clinching game, 103-94. The Mavericks were the seventh seed in the playoffs and finished the season 50-32. , During their expansion season of 1980–81 , the Mavericks road uniform colors were royal blue with green and white trim, but the green and blue were reversed a year later, and green was the dominant road uniform color through 1992. However, in the 1992–93 season, they went back to their original road uniform scheme from their expansion season, with minor alterations to the \"Dallas\" script, a design that the Mavericks used until 2001. From 1980–2001, the home white uniforms had \"Mavericks\" in blue, with green and white trim, with a few minor alterations to the \"Mavericks\" script during the 1990s.  The 1980s green road jerseys were revived in the 2004–05 season as part of the Mavericks' 25th anniversary. However, while the lettering from the 1980s uniform was present, the number scheme resembled the 1993–2001 uniforms. , In the 2001–02 NBA season , the Mavericks drastically updated their logos and uniforms, with a new Dallas Cowboys -inspired color scheme of midnight blue, royal blue and silver. The new uniforms consist of a \"Dallas\" script on both the home and road jerseys. On the home jersey, \"Dallas\" is in midnight blue across the chest and the numbers are in royal blue with silver trim, while on the road jersey, \"Dallas\" is in white, with the numbers in silver and white trim. , In the 2003–04 NBA season , the Mavericks debuted their shiny silver alternate uniforms, with \"Mavericks\" in white and royal blue trim, with blue numerals. However, it proved to be unpopular with fans (thus derisively nicknamed the 'Trash Bags'), and it was scrapped after just one game (at Lakers on October 28, 2003). , In the 2004–05 NBA season , the Mavericks introduced an alternate green uniform similar to their 1980s road uniforms. They were designed by rapper Sean \"P. Diddy\" Combs , and featured \"Mavs\" in white on the front side of the jersey with blue trim, and the numbers in silver with white trim above the script on the left chest. , On September 21, 2009, the Mavericks unveiled a new alternate royal blue uniform with the same \"Mavs\" script, replacing the green uniform. The said uniform will also be used for the NBA's Noche Latina promotion, with the wordmark \"Los Mavs.\".  , On August 19, 2010, the Mavericks unveiled yet another change to their uniform set, with a new royal blue road uniform that displays the \"Dallas\" script in navy blue with silver numbers, both with white trim. The alternate royal blue uniform was retired as a result and this new uniform has replaced the midnight blue one as the main road uniform.  However the 'Los Mavs' uniforms are still in use despite the change, but would be the last time the Mavericks participated in the 'Noche Latina' uniform events. , On December 13, 2011, during media day, the Mavericks unveiled an alternate uniform based on the last alternate uniform they wore in the 2009–10 season, except that the base color is navy blue and the number is positioned below the team nickname 'Mavs' rather than above, effectively reversing roles. , There have been nine  head coaches for the Mavericks franchise. The franchise's first head coach was Dick Motta , who served for two non-consecutive stints and coached for nine seasons with the Mavericks. Motta is the franchise's all-time leader for the most regular-season games coached (738); Don Nelson , Donnie Nelson's father, is the franchise's all-time leader for the most regular-season game wins (339); Avery Johnson is the franchise's all-time leader for the most playoff games coached (47), the most playoff-game wins (23), and the highest winning percentage in the regular season (.735). Nelson is also named one of the top 10 coaches in NBA history .  Johnson was the first coach to win the Western Conference championship, losing the 2006 NBA Finals to the Miami Heat .  Johnson is also the only Mavericks coach to have won the NBA Coach of the Year Award , having won it in the 2005–06 season .  Quinn Buckner and Jim Cleamons have spent their entire NBA coaching careers with the Mavericks. Only one of the Mavericks coaches, Don Nelson , has been elected into the Basketball Hall of Fame as a coach .  Rick Carlisle has been the head coach of the Mavericks since 2008.  Carlisle led the team to their first championship in franchise history in 2011, against their 2006 Finals opponent, the Miami Heat , in a rematch. , The Mavericks-Heat rivalry is a testament to when the two teams faced each other in the NBA finals on two separate occasions. First they came head to head in the 2006 NBA Finals , in which the two teams captured their first respective conference titles. The Mavericks came into the series 60–22 with a strong group of players while the Miami Heat came in with a respectable 52–30 record and sported an aging but still strong Shaquille O'Neal as well as an up-and-coming Dwyane Wade . Dallas was favored by many in the media to win the series. The Dallas Mavericks won the first two games but Miami went on to sweep the next four and win the NBA championship for the first time in team history. , Both teams would go on to have success over the next few seasons and would appear in the playoffs many times, and the two teams would go on to have a rematch in the 2011 NBA Finals . It was the first time for both teams since 2006 that they would enter the Finals. This time, however, Miami was favored to win after a highly publicized event when Miami signed LeBron James and Chris Bosh to their roster. Dallas came in 57–25 while the Heat came in 58–24. Miami won the first game 92–84, but Dallas went on to win four of the next five and upset the Heat to win the first title in the Mavericks's history. , The Mavericks-Spurs rivalry is relatively new but very fierce. It features two teams with Dallas roots—the Spurs began their life in the ABA as the Dallas Chaparrals and did not move to San Antonio until 1973. On October 11, 1980, the Mavs made their NBA debut by defeating the Spurs 103–92. In the playoffs the Spurs defeated the Mavericks in 2001, 2003, 2010, and 2014; while the Mavericks defeated the Spurs in 2006 and 2009. The Spurs have won five championships and six conference titles, while the Mavericks have won one championship and two conference titles. The Spurs have won 15 division titles, while the Mavericks have won 3. Both the Spurs and the Mavericks have 3 60-win seasons. , The two teams met in the playoffs during the 2000–2001 season with the Spurs winning in five games. Little was made during this series, as the Spurs won their first NBA championship only two years before. The Mavericks, run by a trio of Steve Nash , Michael Finley , and Dirk Nowitzki , had just defeated the Utah Jazz despite not having home court advantage and were only starting to meld into a title contender. , The two teams met again in 2003 in the Western Conference Finals. Both the Spurs and the Mavericks had 60-win seasons and reached the Western Conference Finals after defeating the Los Angeles Lakers and the Sacramento Kings , respectively. Despite having the best season of their history, the Mavericks fell in six games to the Spurs. , The rivalry took on a new meaning in 2005 when, near the end of the regular season, Don Nelson would resign as head coach of the Mavericks, apparently satisfied with the state of the team, and hand the coaching reins to former Spur Avery Johnson , the point guard of the 1999 NBA champion Spurs team who hit the game-winning shot against the New York Knicks . Since Johnson was coached under Spurs' Head Coach Gregg Popovich , he would be familiar with most, if not all, of Popovich's coaching style and philosophy. During the 2005 offseason, Michael Finley , waived by the Mavericks under the amnesty clause, joined the Spurs in search for the elusive title. , During the 2006 playoffs the two rivals met again. San Antonio won the first game at home 87–85. The Mavericks got revenge the next game winning 113–91 evening the series up at 1–1. The Mavericks won a dramatic Game 3 by one point 104–103. Though Manu Ginobili could have made the basket with five seconds remaining, he committed an error allowing the ball to bounce away from him with one second remaining. Dallas won a tightly-contested Game 4 123–118 in overtime. Game Five was won by one point with the Spurs taking the victory. In the final seconds of that game, Jason Terry was seen punching former teammate Michael Finley under the belt. This would lead to his suspension in Game 6. He was sorely missed in Game 6 as the Spurs took the series back home for a Game 7. In the crucial Game 7, with 2.6 ticks to go, Nowitzki converted a three-point play to force overtime. Manu Ginóbili , the one who fouled Dirk was the same person who gave San Antonio their first lead one possession earlier. Tim Duncan, who had played in all 48 minutes of regulation was too fatigued to carry his team in overtime. The Mavericks, meanwhile, were set to take control of the game and they did just that winning the game 119–111. The Mavericks went on to the Conference Finals where they defeated the Suns in six games, but succumbing to the champion Heat in the NBA Finals. , Despite much anticipation of a renewed meeting in the 2007 Western Conference finals, the Mavericks lost to the Golden State Warriors in one of the greatest upsets in NBA history.The Spurs won the NBA finals after beating the Cleveland Cavaliers 4–0.  The eighth seed Warriors, who made the playoffs on the last game of the NBA season, defeated the 67-win, first-seed Mavericks in six games.  Meanwhile, the Spurs would ultimately go on to win the 2007 NBA Championship, establishing themselves as a true NBA dynasty.     The season also gave longtime former Maverick Michael Finley his first championship. Many Spurs teammates claimed that the drive to win this season was partially to give Finley his first championship, especially since Finley had lost a bitter-fought series to his longtime team the year previous.  , Worth noting in a regular season meeting between the two rivals in April 2007, a game which the Spurs won 91–86, Tim Duncan suffered his first career ejection for supposedly laughing while sitting on the bench. Joey Crawford , the referee who ejected Duncan, allegedly asked Duncan to a fight which led to the longtime ref's season-ending suspension. As Duncan was heading into the locker room, American Airlines Center erupted into a huge cheer, applauding Duncan's ejection. The game was fierce, with Jerry Stackhouse and Manu Ginobili got into an altercation for a rebound, and foul calls going Dallas' way. , In the 2009 NBA Playoffs, the Mavericks and Spurs squared off again in the first round. The Spurs and Mavericks split the first 2 games in San Antonio, but Dallas defeated the Spurs in games 3 and 4, both in Dallas. The Mavericks then went on to close out the series and eliminated the Spurs at the AT&T Center in San Antonio. , In 2010, the Dallas Mavericks matched up against the San Antonio Spurs in the first round of the Western Conference Playoffs. Although the Mavericks managed to obtain the number two seed, they were defeated by the Spurs in six games. , During the 2011 playoffs, a role reversal of sorts occurred between the two rivals, when the top seeded Spurs were defeated by the eighth seeded Memphis Grizzlies , the first time an eight seed defeated a one seed since the infamous Mavs-Warriors series of 2007. In addition, the Mavericks defeated the LeBron James-led Miami Heat in the NBA Finals, similar again to how the 2007 Spurs defeated a LeBron James-led Cleveland Cavaliers team in the Finals. , The Mavericks were swept in the 2012–13 season by the Spurs for the first time since the 1998 season , Tim Duncan’s rookie season. In their last match up of the season, San Antonio escaped with a 92–91 victory over Dallas when a Vince Carter 3-point attempt bounced off the rim at the buzzer. With the win the Spurs clinched a playoff spot for the 16th straight season, currently the longest streak in the NBA. San Antonio also reached 50 wins for the 14th straight season, the longest streak in NBA history.  , In the 2013–14 season , the Spurs once again swept the Mavs in the regular season, giving them nine straight victories. In addition, an overtime loss to the Memphis Grizzlies on April 16, 2014 ensured that the Mavericks would face the Spurs once again in the 2014 NBA Playoffs , where the Mavs would be the eighth seed and San Antonio the first. In Game 1 in San Antonio, the game was relatively close. Dallas managed to reach an 81-71 lead in the fourth quarter, but the Spurs rallied back and took Game 1 at home, 85-90. However, the Mavs managed to force 22 turnovers in Game 2 to rout the Spurs 113-92, splitting the first two games before the series went to Dallas. In Game 3, Manu Ginobili managed to hit a shot that put the Spurs up 108-106 with 1.7 left, but a buzzer beater by Vince Carter gave the Mavs the victory, putting them up 2-1 in the series. The Spurs took Game 4 in Dallas 93-89 and later Game 5 at home 109-103, giving them a 3-2 lead. Luckily, the Mavs avoided elimination in Game 6 at home by rallying in the fourth quarter, winning 111-113. The Spurs won game 7 with 119 - 96, eliminating Dallas in the first round. , During the 2004 off-season, former Dallas Mavericks point guard Steve Nash signed a free-agent deal with the 29–53 Phoenix Suns to help out their offense. The addition of Nash helped as Phoenix rolled to a 62–20 record and the best record in the NBA. The teams met in the Western Conference Semifinals with Phoenix having the home-court advantage. , Phoenix won Game One 127–102 with a 40-point game by Amar'e Stoudemire . Steve Nash was also given his NBA MVP award during that game, a game in which he terrorized his former team. However, Mavericks star Dirk Nowitzki hit a game-winning turn-around jumper in Game 2 to beat Phoenix 108–106 to send the series back to Dallas tied 1–1. Phoenix and Dallas split the two games in Dallas which saw both winners of games score 119 points. The series went back Phoenix then took care of Dallas 114–108 in the America West Arena (now US Airways Center). Then, in Game Six, with Dallas facing elimination, Phoenix beat Dallas in a thriller which saw Steve Nash with a 39-point game, to go along with 12 assists. Phoenix then made it to the Western Conference Finals, where they eventually lost to the San Antonio Spurs who then went on to win the NBA Title that season. , The following year, a Suns team without Stoudemire (who was injured), Joe Johnson , and Quentin Richardson , but with a core of new players led by Raja Bell (who clotheslined Lakers star Kobe Bryant in a first-round series game), Boris Diaw and Tim Thomas to go along with Nash and fellow All-Star Shawn Marion . Phoenix had to play seven game series against the two Los Angeles teams, the Los Angeles Lakers (who had a 3–1 lead against Phoenix) and the resurgent Los Angeles Clippers . They faced a Mavericks team who won 60 games, but were forced to be the fourth seed since the division winners got the top three seeds. On their way to the Western Conference Finals, Dallas swept the Memphis Grizzlies , and beat in-state rival San Antonio Spurs in seven tense games. Phoenix won Game One 121–118 after Diaw hit a game-winning shot in the dying seconds of the fourth quarter. Bell, though injured himself in Game One, missing Games Two and Three. After that, Dallas took control of the series, winning Games Two and Three by the scores of 105–98 and 95–88. Bell came back for Game Four and led Phoenix to a 106–86 blowout win. Dallas however, beat Phoenix 117–101 in Game Five which included a 50-point performance from Dirk Nowitzki, and eliminated the Suns in Phoenix 102–93 in Game Six. Dallas would later on lose to the Miami Heat in six games, despite winning the first two games. , On March 14, 2007 in Dallas, Phoenix beat Dallas in a 129–127 double overtime thriller. With the Mavericks up by 7 with a minute left in regulation, Dirk Nowitzki (a 90% free throw shooter) missed two free throws. Steve Nash fed off his mistakes and scored 10 straight points including the game-tying three-pointer with 3 seconds left to go. Dirk Nowitzki's potential game-winning shot bounced off the rim and sent the game to overtime. Jason Terry sent the game into another overtime with a game-tying three-pointer of his own. Dirk Nowitzki's potential game-tying shot in double overtime went in and out of the rim as Amar'e Stoudemire's 41 points were too much for Dallas to handle. , On April 10, 2013, the Mavericks 12-season playoff streak, since 2001 , ended in a loss to the Suns 102–91.  , On April 12, 2014 the Mavs handed the Suns one of three straight losses to keep them out of the playoffs, 101-98. The other losses from rival San Antonio and the Memphis Grizzlies. , An NBA intrastate rivalry, both in Texas linked by I-45, as well as both Dallas and Houston fans traditionally having a disdain for each other's city, the rivalry started when the Mavericks were the last Texas team to join the NBA. In the Mavs' inaugural season in 1980-81, the Rockets won all six meetings including a 116-68 blowout win.  In the playoffs, the Mavericks defeated the Rockets in the 1988, and 2005 playoffs, the latter of which was plagued with allegations of game fixing.  and the Rockets swept several season series with the Mavericks during the 1990s during the Rockets' championship years. On April 11, 1995 the Mavericks were able to get one of their most superb victories against the Houston reigning champion for 156–147 scoring 23 points in the first overtime. Two years later, the Rockets and Mavericks have clashed in their first ever regular season's game played in Mexico City and won by the Rockets 108–106. In recent years the rivalry has once again flourished with Dallas owner Marc Cuban and Rockets General Manager Daryl Morey taking shots at each other on social media, as well as Houston fan favorite Chandler Parsons signing an offer sheet to leave the Rockets to sign with the rival Mavericks for $46M, while making negative statements about the city of Houston upon leaving,  causing massive backlash among Rockets fans. Finally longtime Mavericks player Jason Terry , who was a starter on the Mavs' 2011 championship team, joined the Rockets for the 2015 season , and both teams met in the first round of the 2015 NBA Playoffs , with the Rockets as the 2nd seed and Mavericks the 7th seed, and the Rockets got the best of them 4-1. , The Mavericks hold the draft rights to the following unsigned draft picks who have been playing outside the NBA. A drafted player, either an international draftee or a college draftee who isn't signed by the team that drafted him, is allowed to sign with any non-NBA teams. In this case, the team retains the player's draft rights in the NBA until one year after the player's contract with the non-NBA team ends.  This list includes draft rights that were acquired from trades with other teams. , NBA Most Valuable Player , NBA Finals Most Valuable Player Award , NBA Rookie of the Year , NBA Coach of the Year , NBA Sixth Man of the Year , NBA Sportsmanship Award , All-NBA First Team , All-NBA Second Team , All-NBA Third Team , NBA All-Defensive Second Team , NBA All-Rookie First Team , NBA All-Rookie Second , NBA All-Star Three-Point Shootout , Best NBA Player ESPY Award "
}
