{
  "category": "nba",
  "article": "The Denver Nuggets are a professional basketball team based in Denver , Colorado . The Nuggets are a member of the Northwest Division of the Western Conference in the National Basketball Association (NBA). The team was founded as the Denver Larks in 1967 as a charter franchise of the American Basketball Association (ABA) but changed its name to Rockets before the first season.  It changed its name again to the Nuggets in 1974, and played for the final ABA Championship title in 1976, losing to the New York Nets . , The team joined the NBA in 1976 after the ABA–NBA merger and has had some periods of success, qualifying for the playoffs in nine consecutive seasons in the 1980s and doing the same for the previous ten seasons. However, it has not made an appearance in a championship round since its last year in the ABA. The Nuggets play their home games at the Pepsi Center , which they share with the Colorado Avalanche of the National Hockey League (NHL). , , , In 1967, one of the ABA's charter franchises was awarded to a group in Kansas City, Missouri , headed by Southern Californian businessman James Trindle. However, Trindle was unable to find a suitable arena in the Kansas City area. League commissioner George Mikan suggested moving the team to Denver. After agreeing to name Denver native and former NBA player Vince Boryla as general manager, Trindle moved his team to Denver as the Denver Larks, named after Colorado's state bird.  The Trindle group was severely undercapitalized, leading Mikan to order the Larks to post a $100,000 performance bond or lose the franchise. Hours before the deadline, Trindle sold a two-thirds controlling interest to Denver trucking magnate Bill Ringsby for $350,000. Ringsby then renamed the team the Rockets, after his company's long-haul trucks.  , Playing at the Denver Auditorium Arena , the Rockets had early successes on the court, developing a solid fan base along the way.  However, the team had a history of early playoff exits and failed to play in an ABA championship series. , Early, they had a solid lineup led by Byron Beck and Larry Jones , then later by Beck and Ralph Simpson . Lonnie Wright of the American Football League 's Denver Broncos signed with the Rockets during that first season and became the first player to play professional football and basketball in the same season. Wright played four seasons with Denver.  Controversial rookie Spencer Haywood joined the team for the 1969–70 season. Haywood was one of the first players to turn pro before graduating from college, and the NBA initially refused to let him play in the league. Haywood averaged nearly 30 points and 19.5 rebounds per game in his only ABA season, being named ABA MVP, ABA rookie of the year, as well as the All-Star Game MVP. The team finished 51-33, winning their division, before exiting the playoffs in the 2nd round. , Just before the start of the 1970-71 season, Haywood signed with the Seattle SuperSonics , jumping to the NBA. The team tumbled to a 30-54 record and attendance suffered.  , Ringsby sold the team to San Diego businessmen Frank Goldberg and Bud Fischer in 1972.  In 1974, in anticipation of moving into the NBA , and the new McNichols Arena , the franchise held a contest to choose a new team nickname, as \"Rockets\" was already in use by the Houston Rockets . The winning choice was \"Nuggets,\" in honor of the original Nuggets team in Denver from 1948–50, the last year as a charter member of the NBA. Their new logo was a miner \"discovering\" an ABA ball. Goldberg and Fischer in turn sold the team to a local investment group in 1976. , With the drafting and signing of future hall of fame player David Thompson out of North Carolina State , Marvin Webster and the acquisitions of Dan Issel and Bobby Jones and with Larry Brown coaching, they had their best seasons in team history in their first two seasons as the Nuggets. Playing in the Denver Auditorium Arena for the last season the 1974-75 team went 65-16, including a 40-2 record at home. However, a quick playoff exit followed.  , In 1975-76, playing at their new arena, the Nuggets edged the reigning champion Kentucky Colonels four games to three to make the 1976 ABA finals for the first time. Eventually, they lost to the New York Nets and Julius Erving .  They did not get a second chance to win an ABA league championship, as the ABA-NBA merger took place after the 1975–76 season. The Nuggets, Nets, Indiana Pacers and San Antonio Spurs were merged into the NBA. The Spirits of St. Louis and Kentucky Colonels were disbanded.  , The Nuggets and Nets had actually applied to join the NBA in 1975, but were forced to stay in the ABA by a court order. The Nuggets continued their strong play early on in the NBA, as they won division titles in their first two seasons in the league, and missed a third by a single game. However, neither of these teams were ultimately successful in the postseason. Similarly to the other new NBA teams, the Nuggets were given many financial issues including a 2 million dollar entry fee. Red McCombs bought the team in 1978. , In 1979, Brown left the team, helping usher in a brief decline in their team's performance. It ended in 1981, when they hired Doug Moe as a head coach. Moe brought with him a \"motion offense\" philosophy, a style of play focusing on attempting to move the ball until someone got open. Moe was also known for not paying as much attention to defense as his colleagues. The offense helped the team become highly competitive. During the 1980s, the Nuggets often [ quantify ] scored in excess of 115 points a game, and during the 1981–82 season, they scored at least 100 points in every game—136 consecutive games (NBA record).  During the 1981–82 season, the Nuggets set the league scoring record for the highest points per game average at 126.5 points. , Anchored by scoring machines Alex English and Kiki Vandeweghe at the two forward spots, and Dan Issel at center, Denver led the league in scoring, with English and Vandeweghe both averaging above 25 points per game. It was a novel strategy, allowing the Nuggets to top the Midwest Division and qualify for the playoffs during that span. (On December 13, 1983, the Nuggets and the visiting Detroit Pistons combined for an NBA record 370 points, with Detroit winning in triple overtime , 186–184.) At the end of the season, English won the NBA scoring title, becoming the only Nugget to win the award despite the heavily favored offensive play of Doug Moe. In 1984–85 , they made it to the Western Conference finals after being perennial playoff contenders, and they lost in 5 games to the Los Angeles Lakers . , Vandeweghe was traded before the 1984–85 season to the Portland Trail Blazers for 6–3 rebounding guard Fat Lever , undersized power forward Calvin Natt and center Wayne Cooper . Spearheaded by Alex English and supported by the three new acquisitions and defensive specialists Bill Hanzlik and TR Dunn , the team replicated its success in the Western Conference despite the loss of Vandeweghe. They even managed to win 54 games in the 1987–88 season , the most they had ever won as an NBA team. However, the Mavericks eliminated the Nuggets in the second round of the 1988 NBA Playoffs. McCombs sold the team to Sidney Shlenker in 1985. Shlenker, in turn, sold the team to COMSAT in 1989. , Moe left the team in 1990, and was replaced by Paul Westhead . Westhead also believed in a \" run and gun \" style of play, and gave the green light for players like Michael Adams and Chris Jackson to light up the scoreboards within seconds of possession. , However, Westhead cared even less about defense than Moe. As a result, the Nuggets gave up points so quickly that even their prolific offense couldn't keep up. They finished with the worst record in the league during the 1990–91 season, despite setting many scoring records. As an insult, many sportswriters nicknamed the team at the time as the \"Enver Nuggets\" (as in no \"D\", or no defense). , Denver took a positive step in rebuilding by drafting 7–2 Georgetown University center Dikembe Mutombo in 1991. Mutombo finished runner-up to Larry Johnson for the NBA rookie of the year that season. Denver finished 24–58 that year. , Denver fired Westhead prior to the 1992–93 season and hired former star player Dan Issel as his successor. The Nuggets had two lottery picks that year and drafted University of Notre Dame forward LaPhonso Ellis and University of Virginia guard Bryant Stith . Denver improved to 36–46, just missing the playoffs that year. , Denver ditched their rainbow colors for a dark navy, metallic gold and wine color scheme starting in the 1993–94 season. Led by Mutombo, Mahmoud Abdul-Rauf (who changed his name from Chris Jackson prior to the season), and Ellis, Denver finished with its first winning season since the Doug Moe era at 42–40. Denver clinched the 8th seed in the Western Conference playoffs, playing the first place Seattle SuperSonics . Denver was a heavy underdog, having only a couple of players on their roster with actual NBA playoff experience. After dropping the first two games of the five-game set in Seattle , the series returned to Denver. Denver won both games and tied the series at 2. The Nuggets made NBA history in Game 5, upsetting Seattle in overtime 98–94. They became the first 8th-seeded team to defeat a 1st-seeded team in NBA playoff history. Denver almost repeated the feat before falling to the Utah Jazz in Game 7 of the second round. , Denver acquired Sonics sharp-shooter Dale Ellis in the off-season and drafted University of Michigan guard Jalen Rose . Denver struggled, causing Issel to resign as coach partway into the season. Assistant Coach Gene Littles assumed control for a brief period before relinquishing control to general manager Bernie Bickerstaff . Denver rebounded and earned the 8th seed again in the playoffs, finishing 41–41. The Nuggets were swept by the San Antonio Spurs in the first round of the playoffs that season. , Following that season, Denver acquired Antonio McDyess in a draft day trade with the Los Angeles Clippers . McDyess was the face of the franchise for the next few years, as Mutombo left after the 1995–96 season for the Atlanta Hawks , Ellis missed the majority of the next few seasons due to recurring knee and leg injuries, Rose was traded to the Indiana Pacers for Mark Jackson , and Abdul-Rauf was traded to the Sacramento Kings prior to the 1996–97 season. , After finishing the 1996-97 season with the fourth worst record in the league (21-61), the Nuggets sent Antonio McDyess to the Phoenix Suns , and Dale Ellis returned to Seattle. Denver flirted with history in the 1997–98 , by nearly setting the mark for fewest wins in an 82-game season (11). They tied the then-NBA's all-time worst single-season losing streak at 23 —only one game shy of the overall worst mark of 24 by the Cleveland Cavaliers of the early 1980s. The losing streak was later broken by the Cavaliers in 2011 and the Philadelphia 76ers in 2014 with 26 consecutive losses. Several years later, the Nuggets tied for the worst record in the NBA in 2002–03 , also with the Cavaliers. , The team's struggles in the late 1990s were due in part to ownership instability. COMSAT bought the NHL 's Quebec Nordiques in 1995 and moved them to Denver as the Colorado Avalanche . However, its diversification into sports ownership was proving a drain on the company. In particular, cost overruns associated with the construction of Pepsi Center had shareholders up in arms. Finally, in 1997, COMSAT agreed in principle to sell Ascent Entertainment Group, the umbrella corporation for its sporting assets, to Liberty Media .  However, Liberty was not interested in sports ownership at the time (though it has since bought the Atlanta Braves ), and made the deal contingent upon Ascent selling the Avalanche and Nuggets.  , After almost two years, Ascent sold the Avalanche and Nuggets to Walmart heirs Bill and Nancy Laurie for $400 million. However, a group of Ascent shareholders sued, claiming that the sale price was several million dollars too low. Ascent then agreed to sell the Avalanche and Nuggets to Denver banking tycoon Donald Sturm for $461 million.  , However, a new wrinkle appeared when the city of Denver refused to transfer the parcel of land on which Pepsi Center stood unless Sturm promised to keep the Avalanche and Nuggets in Denver for at least 25 years. Sturm had bought the teams in his own name, and the city wanted to protect itself in case Sturm either died or sold the teams before the 25 years ran out. While Sturm was willing to make a long-term commitment to the city, he wasn't willing to be held responsible if he died or sold the teams. After negotiations fell apart, Liberty bought all of Ascent, but kept the Nuggets and Avalanche on the market.  In the meantime, Issel had returned as head coach in 1999, but the protracted ownership negotiations made it difficult for him to rebuild the team. Just before the start of the 1999–2000 season, he told reporters there were several personnel moves he simply couldn't make due to the unstable ownership situation (since all basketball decisions required the approval of both Ascent/Liberty and Sturm).  , Finally, in July 2000, the Avalanche, Nuggets and Pepsi Center were bought by real estate entrepreneur Stan Kroenke in a $450 million deal.  Kroenke is the brother-in-law of the Lauries; his wife Ann is Nancy Laurie's sister. Liberty retained only a 6.5% stake of the sports franchises. As part of the deal, Kroenke placed the teams into a trust that would ensure the teams will stay in Denver until at least 2025.  After the deal, Kroenke organized his sports assets under Kroenke Sports Enterprises. , In 2003 , the Nuggets drafted future All-Star Carmelo Anthony with the third overall pick in the 2003 NBA Draft .  That same year, the team also updated their logos and uniforms, with a new color scheme of powder blue, gold and royal blue; the latter color was changed to navy blue in 2009.  In just two months of the season, the Nuggets recorded more wins than they had in 5½ months of play in 2002–03. Much of the reason for this incredible turnaround were the front-office moves of General Manager Kiki Vandeweghe , a former Nuggets player who assumed General Manager duties on August 9, 2001.  In April, the turnaround was complete as they became the first franchise in NBA history to qualify for the postseason following a sub-20-win campaign the previous year since the NBA went to an 82-game schedule.  They were eliminated in the first round 4 games to 1 by the Minnesota Timberwolves .  , On December 28, 2004, head coach Jeff Bzdelik was fired from the organization and replaced by interim coach, former Los Angeles Laker player and Los Angeles Sparks head coach Michael Cooper .  The Nuggets later hired George Karl as a permanent replacement.  Karl led the team to a record of 32–8 in the second half of the regular season, which vaulted the team into the playoffs for the second consecutive year.  , In the playoffs , however, the Nuggets could not survive the San Antonio Spurs . After winning game one in San Antonio , the Nuggets proceeded to lose the next four games and lost the series 4–1.  The Nuggets picked 20th in the 2005 NBA Draft ; it was acquired from the Washington Wizards via the Orlando Magic .  Denver selected Julius Hodge with the pick. The Nuggets also had the 22nd overall selection in the draft, in which they selected Jarrett Jack , but sent him to the Portland Trail Blazers for rights to Portland's 27th overall pick, Linas Kleiza .  , In 2005–06 , for the first time in 18 years, the club won the Northwest division title.  This placed the team in the third seed of the Western Conference playoffs . Denver played the Los Angeles Clippers who, despite their 6th seeding, had a better regular-season record. As a result, the Clippers received home court advantage. They defeated the Nuggets in 5 games. Shortly after, the Nuggets announced that General Manager Kiki Vandeweghe's contract would not be renewed. He was replaced by Mark Warkentien .  , On December 18, 2006, team co-captain Carmelo Anthony , shooting guard J.R. Smith and power forward Nenê were suspended by the NBA (15, 10 and one games respectively) for a fight that occurred in the last two minutes of a game against the New York Knicks two days earlier.   The fight was sparked by Knicks rookie Mardy Collins , when he tackled J.R. Smith on a breakaway layup. According to Anthony, Knicks coach Isiah Thomas warned him to not go in the paint shortly before the hard foul.  , On December 19, 2006, the Nuggets traded Joe Smith , Andre Miller and two first-round draft picks of the 2007 NBA Draft to the Philadelphia 76ers for Ivan McFarlin and superstar Allen Iverson (McFarlin was waived immediately following the trade's approval). The moves gave the Nuggets the top two scorers in the league at the time in Anthony and Iverson, who were both scoring over 30 points per game at the time of the trade. On January 11, 2007, Earl Boykins , Julius Hodge and cash considerations were traded to the Milwaukee Bucks , in exchange for point guard Steve Blake . With Iverson, many considered the Nuggets as one of the elite in the West. However, chemistry was an issue, as the Nuggets finished the season with the 6 seed, giving them a first round matchup against the San Antonio Spurs . In the playoffs , the Nuggets took Game 1 and home court advantage away from the Spurs. However, in an eerie repeat of the 2005 playoffs, the Spurs bounced back to sweep the next four, as the Nuggets were eliminated in the first round in five games for the fourth straight year. , On March 16, 2008 , the Nuggets scored 168 points in a 168–116 home win over Seattle SuperSonics .  It was the third-most points scored for a regulation game in NBA history (The Nuggets and the Pistons hold the spot for most combined points scored in a game which was over 360 points total.)  , They finished the 2007–08 NBA season with exactly 50 wins as well as finishing the first half of that season 25–16 (50–32 overall record, tied for the third-best all-time Nuggets record since the team officially joined the NBA in 1976), following a 120–111 home victory over the Memphis Grizzlies in the last game of the season.  It was the first time since the 1987–88 NBA season that the Nuggets finished with at least 50 wins in a season.  Denver ended up as the 8th seed in the Western Conference of the 2008 NBA Playoffs , and their 50 wins marked the highest win total for an 8th seed in NBA history.  It also meant that for the first time in NBA history, all eight playoff seeds in a Conference had at least 50 wins. The Nuggets faced the top-seeded Los Angeles Lakers (57–25) in the first round. The seven games separating the Nuggets and the Lakers overall records is the closest margin between an eighth seed and a top seed since the NBA went to a 16-team playoff format in 1983–84 .  However, the Lakers swept them in four games, marking the second time in NBA history that a 50-win team was swept in a best-of-seven playoff series in the first round. It was Denver's fifth straight first-round loss.   , On July 16, 2008, at the end of the 2007–08 NBA season , the Nuggets traded former NBA Defensive Player of the Year Marcus Camby to the Los Angeles Clippers for a second-round draft pick (that was then traded to the New York Knicks for Renaldo Balkman ). This trade was to reduce the Nuggets' payroll costs. [ citation needed ] , On November 3, 2008, guard Allen Iverson was traded to the Detroit Pistons for Chauncey Billups , Antonio McDyess , and Cheikh Samb (part of the trade exception from the Marcus Camby trade was used to allow the deal to go through). McDyess was waived though on November 10, 2008, and he returned to Detroit shortly afterwards. , With Carmelo Anthony averaging 22.8 ppg and Billups averaging 6.4 assists in the 2008–09 NBA season the Nuggets accomplished a great number of franchise milestones. Their 54–28 record matched the most wins the franchise had gotten since their induction in the NBA; their 27–14 start was also a record for wins in the first half of a season. This also marked the first time in the franchise's history the team had back-to-back 50-win seasons. They led the Northwest division for much of the season, eventually winning the division and placing #2 in the Western Conference, matching the highest the team has ever been seeded for the playoffs. General Manager Mark Warkentien won the NBA Executive of the Year Award for the Nuggets' improvement. They won Game 1 of the playoffs in a blowout victory against the New Orleans Hornets , the first time they had home-court advantage since 1988 and also, the 29-point victory was the largest victory for any team for Game 1 of the first round of the 2009 NBA Playoffs . Chauncey Billups set a Nuggets franchise record with the most three-pointers in a playoff game with 8, and his 19 three-pointers in total is also a Nuggets record for threes made in a playoff series.   They went on to beat the Hornets in 5, including a 58-point victory in Game 4 which matched the most lopsided win in NBA playoff history . They then went on to beat the 6th seed Dallas Mavericks 4 games to 1 in the Conference Semifinals to make their first trip to the Western Conference Finals since 1985 . That was also the first time the Nuggets had ever led 3–0 in a best-of-seven series. Up to that point, they held an NBA Playoffs-high in three-pointers made and a 16-point average margin of victory, the largest average margin of victory in the first 10 playoff games in NBA Playoff history. They lost the first game of the Western Conference Finals against the Los Angeles Lakers but won the second game to tie the series. Anthony became the first Denver player to score at least 30 points in five consecutive playoff games since the Nuggets joined the NBA in 1976. They lost the series 4–2, ending Denver's longest playoff run in team history.  , In the 2009 NBA Draft , the Nuggets traded a first-round draft pick acquired from the Charlotte Bobcats to the Minnesota Timberwolves for the rights to rookie Ty Lawson , who was drafted 18th overall. On July 13, 2009, the Nuggets traded a second-round draft pick to the Detroit Pistons for Arron Afflalo (part of the trade exception from the Iverson trade was used to allow the deal to go through) and Walter Sharpe . Afflalo replaced starting guard Dahntay Jones , who signed with the Indiana Pacers .  However, on August 10, the Nuggets lost forward Linas Kleiza , who signed with Olympiacos Piraeus of the Greek League .  , The 2009–10 season saw Anthony average 28.2 ppg and Billups average a career-high 19.6 ppg. In the opening two games of the season, Anthony totaled 71 points, scoring 30 points in the home opener and 41 the next night, in wins against division rivals Utah Jazz and Portland Trail Blazers , respectively. Anthony became one of two players in the Nuggets' history to open with more than 70 points through two games (Alex English also accomplished the feat). It was also only the second time since 1987 that the Nuggets started the season 2–0.  They later went 3–0, 4–0, and 5–0 for the first time since 1985 after defeating the Memphis Grizzlies , Indiana Pacers , and New Jersey Nets respectively. Despite injuries which caused all three captains – Carmelo Anthony, Chauncey Billups, and Kenyon Martin  – to miss a total of 46 games, and then later on in the second half of the season the absence of head coach George Karl , who underwent treatment for neck and throat cancer , the Nuggets were still able to win 53 games (third consecutive 50-win season, a Nuggets first) for the season which gave them a second consecutive Northwest division title and finished as the fourth seed in the West Conference. However, they were eliminated by the Utah Jazz 4-2, their sixth first-round elimination in 7 seasons. Anthony averaged a career-high 30.7 ppg in the playoffs. , On July 14, 2010, the Nuggets bolstered their frontcourt depth by signing Al Harrington .  During the 2010 off-season, Masai Ujiri replaced Mark Warkentien as the General Manager, while Josh Kroenke was named team president. , Stan Kroenke bought full ownership in the St. Louis Rams of the NFL in 2010. Since the NFL does not allow its owners to hold majority control of major-league teams in other NFL cities, Kroenke turned over day-to-day control of the Nuggets and Avalanche to Josh Kroenke toward the end of 2010, and must sell his controlling interest in both teams by 2014.  , On February 22, 2011, after months of speculation that he wanted to leave the Nuggets, Carmelo Anthony was traded along with Chauncey Billups , Anthony Carter , Shelden Williams and Renaldo Balkman to the New York Knicks in a multi-player deal also involving the Minnesota Timberwolves in which the Nuggets received Wilson Chandler , Raymond Felton , Danilo Gallinari , Timofey Mozgov and Kosta Koufos . On the day when the trade was done, the Nuggets were left with 9 players to play against the Memphis Grizzlies . The Nuggets won 120–107, where they led by as many as 27 points. In the closing minutes of the game, the arena resounded with chants of \"Who needs Melo?\" George Karl said after the game, \"Our guys, when their backs are confronted with a difficult situation, they usually play at a high level. We always react to tough situations in a very positive way.\" Some people [ who? ] said after the trade the Nuggets would become the \" Cleveland Cavaliers \" of the West, that is, falter in the standings and lose their playoff hopes due to the loss of their franchise player, Carmelo. However, the trade only seemed to make them better. Post-trade, the Nuggets averaged 24.1 assists, showing their newfound teamwork. The defense of the Nuggets also improved, from allowing 105.2 ppg before the trade to of 97.1 ppg for the remainder of the season.  Despite the franchise changing trade which saw eighteen different starting lineups through the whole season, Denver finished with 50 wins (fourth consecutive 50 win seasons for the first time in Nuggets history), clinching the 5th seed of the Western Conference. They met the Oklahoma City Thunder in the first round of the playoffs and lost four games to one. , The first full season of the post-Melo Nuggets saw the steady rise of Danilo Gallinari, who averaged 17 points, 5.2 rebounds and 2.6 assists through the first 25 games of the season, which resulted to the Nuggets' best start through the first 20 games. But Gallinari was robbed off his best season by injuries to his ankle, thumb, and wrist. On March 15, 2012, the Nuggets decided to make their team younger by trading Nenê , who had played the previous 9 seasons for Denver, to the Washington Wizards for JaVale McGee .  Prior to playing with the Nuggets, McGee has had the reputation as a dumb NBA player, known for making awful mistakes that have molded his losing years playing for the Washington Wizards. McGee had a rebirth in Denver though, as he changed from a knucklehead to a key player for the Nuggets. [ neutrality is disputed ] In his first game as a Nugget, he made a putback dunk off an Arron Afflalo miss which proved to be the game-winning basket in Denver's 116-115 victory over the Detroit Pistons. In two of the Nuggets final games of their season, McGee finally earned national attention when he had a 16-point,15-rebound effort, and a 21-point, 14-rebound effort in Denver's playoff series against the Los Angeles Lakers . These performances helped the Nuggets come back from a 2-0 and a 3-1 series deficit, but the Nuggets eventually lost in Game 7, 87-96. , On August 10, 2012, Denver was involved in a four-team trade where they received All-Star Andre Iguodala and sent Arron Afflalo and Al Harrington to the Orlando Magic . This same trade also sent Dwight Howard to the Los Angeles Lakers . After the trade, Iguodala tweeted \"I'm excited to be joining the Denver Nuggets and I know my best basketball is ahead of me!\"  Despite losing their first three games, the 2012-2013 Nuggets finished with a franchise best 57-25 record, and a 38-3 record in Pepsi Center (the Washington Wizards, Miami Heat , and Minnesota Timberwolves were the only 3 visitors to defeat Denver on their home during the regular season).Denver also clinched the 3rd seed in the Western Conference, with a first round matchup with the Golden State Warriors . The Nuggets won Game 1 97-95 on their home court on a last second Andre Miller game winner, but the Warriors won the next three games, putting the Nuggets on the brink of elimination. Denver won Game 5 at home to keep their season alive, but the Warriors eliminated the Nuggets in Game 6, winning 88-92 in Oakland. It was Denver's ninth first round loss in the previous 10 seasons, and the eighth of Karl's tenure. Although Karl won that year's NBA Coach of the Year Award and had led Denver to the playoffs in every year of his nine-year tenure, it wasn't enough to keep him from being fired after the season. , Along with Karl being fired, Denver saw a major shake-up in the front office with Executive of the Year Masai Ujiri accepting the general manager position with the Toronto Raptors  and vice-president Pete D'Alessandro , who was expected to replace Ujiri, being named General Manager of the Sacramento Kings . On June 21, 2013, Tim Connelly was announced as the new general manager.  and to replace Karl, the Nuggets hired the Indiana Pacers' associate head coach, former NBA player, Brian Shaw . Guard-forward Andre Iguodala was sent to the Golden State Warriors in a sign-and-trade in which they acquired guard Randy Foye from the Utah Jazz. They also signed center-forward J. J. Hickson , who was previously with the Portland Trail Blazers and 5' 9\" guard Nate Robinson , who played for the Bulls during the 2012–2013 season. They also acquired Darrell Arthur from the Memphis Grizzlies and 55th pick Joffrey Lauvergne in return for Kosta Koufos.  In a tough 2013-14 season which saw numerous injuries to key players missing a significant amount of the season, the Nuggets finished with 36 wins, their worst in 11 years, and missed the playoffs. , During the 2014 offseason, the Nuggets brought back Arron Afflalo who they traded Evan Fournier for. Denver also traded their first lottery pick (#12) since 2003 to Chicago to acquire two later first round draft picks, which were used to draft Jusuf Nurkić and Gary Harris . On March 3, 2015 general manager Tim Connelly announced the Nuggets fired head coach Brian Shaw and named Melvin Hunt interim head coach.  , On June 15, 2015, Michael Malone was named as the new head coach of the Denver Nuggets.  , The Nuggets have worn numerous uniforms throughout their franchise history, including their days in the American Basketball Association as the \"Denver Rockets.\" From the early to mid-1970s, the Nuggets wore gold and purple (Columbine blue) uniforms. , When the Nuggets joined the NBA in the 1976–77 season, they retained the pick-axe logo on their jerseys from the ABA days. The home uniforms feature 'Nuggets' in red with a red pick-axe inside a blue oval, and gold numbers with blue trim in front, blue numbers and letters at the back. The road uniforms were blue, with 'Denver' in blue with a blue pick-axe in a red oval, and gold numbers in front, white numbers and letters at the back. , The Nuggets simplified their uniforms following their inaugural season in the NBA. From 1977–82, their home uniforms were white, with a \"Nuggets\" script written across the chest in a darker royal blue, with gold trim around the script and jersey numbers. The royal blue away jersey had \"Denver\" written across the chest in white, with gold trim. , From the early-1980s until the 1992–93 season, the Nuggets wore the Denver \"rainbow city\" skyline across the chest and back on both the home and away uniforms. Some fans also call the iconic 1980s logo the \" Tetris \" logo, due to the buildings that shadow the mountains on the logo which are in the shape of squares. The initial home uniforms were white with navy and green trim, with \"Nuggets\" and the uniform number in gold with blue trim. The player names were written in block lettering and in a straight position. In 1985, they changed the shade of blue to royal and eliminated green, and in 1986, changed the back numbers to royal blue. In 1991, coinciding with the debut of Dikembe Mutombo , the word \"Nuggets\" became white with royal blue and gold trim. The road uniforms were initially navy blue with green trim, with \"Denver\" and the uniform number in white with gold trim, before likewise changing it to royal blue, with gold serifed block letters for player names in an arch (royal blue in home uniforms). , For the 1993–94 season, the Nuggets drastically changed their look, with a navy blue, gold and wine color scheme on their uniforms. The home jerseys had a \"Nuggets\" script in a modified version of the typeface Aachen across the chest in navy blue, with dark red and gold trim around the script and numbers, while the navy blue away jerseys had the same script in gold, with dark red and white trim. The Nuggets wore these uniforms for a decade, until the 2002–03 season. , For the 2003–04 season, the Nuggets made another uniform change, coinciding with Carmelo Anthony 's debut with a new color scheme of powder blue, royal blue and gold. Like the 1990s uniforms, the new Nuggets jerseys also have the Aachen typeface across the chest — it's \"Nuggets\" in powder blue, with royal blue and gold trim on the home white jersey, while the new powder blue road jersey has \"Denver\" in white, with gold and royal blue trim. These jerseys were tweaked prior to the 2008–09 season, with the royal blue trim replaced by navy blue, as well as a circle patch of the Nuggets alternate pick axe logo placed above the nameplate on the backs of the jerseys. , In the 2005–06 season, the Nuggets also introduced an alternate navy blue uniform, with an alternate Nuggets script in gold, with navy blue interior trim and powder blue outlining. This uniform was used until the end of the 2011–12 season. , For the 2012–13 season, the Nuggets unveiled a new gold alternate jersey, replacing the aforementioned navy blue jerseys that had been used during the previous seven seasons. The new alternate uniform features a return to the Denver \"rainbow skyline\" logo, but uses the team's current color scheme and wordmark.  , For the 2015–16 season, the Nuggets will modify the script and numbering fonts on their home and away jerseys, with a gold \"Nuggets\" script on the home white jersey and a gold \"Denver\" script on the powder blue away jersey. Navy blue numerals trimmed in gold, as well as navy blue nameplates, will be featured on both the home and away jerseys. There is no word yet if there will be any changes to the alternate gold \"skyline\" jerseys as well as the team logos.  , The Nuggets hold the draft rights to the following unsigned draft picks who have been playing outside the NBA. A drafted player, either an international draftee or a college draftee who isn't signed by the team that drafted him, is allowed to sign with any non-NBA teams. In this case, the team retains the player's draft rights in the NBA until one year after the player's contract with the non-NBA team ends.  This list includes draft rights that were acquired from trades with other teams. , 1 Number represents his total number of regular season victories. , Bold denotes still active with team. \"Name*\" includes points scored for the team while in the ABA. Italics denotes still active but not with team. , Points scored (regular season) (as of the end of the 2014–15 season)  , Other Statistics (regular season) (as of the end of the 2014-15 season)  , Minutes Played , Rebounds , Assists , Steals , Blocks , NBA All-Star Game , NBA Defensive Player of the Year , NBA Most Improved Player of the Year , NBA Coach of the Year , NBA Sportsmanship Award , J. Walter Kennedy Citizenship Award , NBA Executive of the Year , All-NBA First Team , All-NBA Second Team , All-NBA Third Team , NBA All-Defensive First Team , NBA All-Defensive Second Team , NBA Rookie First Team , NBA Rookie Second Team "
}
