{
  "category": "nba",
  "article": "The Oklahoma City Thunder is [ A ] an American professional basketball team based in Oklahoma City , Oklahoma . The team plays in the Northwest Division of the Western Conference in the National Basketball Association (NBA).   Its home court is at Chesapeake Energy Arena .  The Thunder's NBA Development League affiliate is the Oklahoma City Blue , which is owned by the Thunder.  The Thunder is the only team in the major professional North American sports leagues based in the state of Oklahoma. , The team was established as the Seattle SuperSonics in 1967. They relocated in 2008 after a settlement was reached between the ownership group led by Clay Bennett and lawmakers in Seattle , Washington following a lawsuit. As the SuperSonics, the franchise qualified for the NBA Playoffs 22 times, won their division six times, and won the 1979 NBA Championship . In Oklahoma City, the Thunder qualified for their first playoff berth during the 2009–10 season. They followed that success by winning their first division title as the Thunder in the 2010–11 season and their first Western Conference championship as the Thunder in the 2011–12 season, appearing in the NBA Finals for the fourth time in franchise history and first since 1996 , when the club was based in Seattle. , , , The Thunder's previous incarnation, the Seattle SuperSonics, were formed in 1967. In their 41 years in Seattle, the SuperSonics compiled a 1,745–1,585 (.524) win–loss record in the regular season and 107–110 (.493) in the playoffs. The franchise's titles include three Western Conference championships and one NBA title in 1979 . , In 2006, Howard Schultz sold the SuperSonics for $350 million to a group of Oklahoma City investors led by Clay Bennett, a move approved by NBA owners the following October.  In 2007, Bennett announced that the franchise would move to Oklahoma City as soon as the lease with KeyArena expired.  , In June 2008, a lawsuit brought by the City of Seattle against Bennett due to his attempts to break the final two years of the Sonics' lease at KeyArena went to federal court. Nearly a month later, the two sides reached a settlement agreement. The terms awarded the city $45 million to get out of the remaining lease at KeyArena, and could provide an additional $30 million payment to Seattle in 2013 if certain conditions are met. The owners agreed to leave the SuperSonics name, logo and colors in Seattle for a possible future NBA franchise;  however, the items would remain the property of the Oklahoma City team along with other \"assets,\" including championship banners and trophies.  On September 3, 2008, the team name, logo, and colors for the Oklahoma City franchise were revealed to the public. The name \"Thunder\" was chosen due to Oklahoma being a frequent victim of powerful storms due to its location in Tornado Alley , and Oklahoma City housing the 45th Infantry Division , the Thunderbirds.   , The Thunder participated in the Orlando Pro Summer League featuring their second-year players, potential free agents and rookies. The players wore generic black and white jerseys reading \"OKC-NBA\" against an outline of a basketball. The Thunder's temporary practice facility was the Sawyer Center at Southern Nazarene University , which had been used by the New Orleans Hornets when they relocated to Oklahoma City after Hurricane Katrina .  , The Thunder played several preseason games before the 2008–2009 regular season, but only one of those games was in Oklahoma City. The Thunder made their first appearance in Billings, Montana on October 8, 2008 in an 88–82 preseason loss against the Minnesota Timberwolves .  The Thunder played their first Ford Center game on October 14 against the Los Angeles Clippers .  , In their regular-season home opener, the Thunder faced (and lost to) the Milwaukee Bucks. Earl Watson scored the first points of the season with a layup. Three nights later on November 2, the Thunder won their first game as a franchise by defeating the Timberwolves, improving their record to 1–3. The team then went on a 10-game losing streak before deciding on November 22 to fire head coach P. J. Carlesimo and assistant Paul Westhead . Assistant coach Scott Brooks then took over on an interim basis.  Oklahoma City lost its next four games to tie the dubious franchise losing streak of 14 set in Seattle the previous season. But the team managed to prevent history by winning their next game on the road against the Memphis Grizzlies .  , As the season continued, the Thunder began to improve. After starting 3–29, the Thunder finished the regular season 20–30 for the remaining fifty games. Not only were they winning more often, they played much more competitively than in the first part of the season. The team brought their record to 23–59 and improved upon their record of 20–62 from the team's final season in Seattle. The late-season successes of the Thunder contributed to the signing of Scott Brooks as the team's official head coach. , After moving to Oklahoma City from Seattle, the team's operating situation improved markedly. In December 2008, Forbes magazine estimated the team's franchise value at $300 million – a 12 percent increase from the previous year's $268 million when the club was located in Seattle.  Forbes also noted an increase in percentage of available tickets sold, from 78 percent in the team's last season in Seattle to 100 percent in 2008–09.  , After an inaugural season filled with many adjustments, the Thunder hoped to improve during their second season in Oklahoma City. Oklahoma City did not make any major moves in the offseason, other than drafting James Harden from Arizona State University with the third overall pick in the NBA Draft . The Thunder selected Rodrigue Beaubois with the 25th pick in the 2009 draft before immediately trading him to the Dallas Mavericks for the 24th pick, center Byron Mullens from Ohio State University . The team then added veteran center Etan Thomas and guard Kevin Ollie . The last major change to their roster occurred on December 22, 2009, when the team traded for Eric Maynor from the Utah Jazz . Maynor immediately supplanted Ollie as the backup point guard. , From the outset the young team looked determined and cohesive. The increasing leadership of Kevin Durant , along with the growing experience of the Thunder's younger players (including future All-Stars Russell Westbrook , James Harden and Serge Ibaka ), were signs of the Thunder's improvement. The 2009–10 season included several victories over the NBA's elite teams, including a 28-point blowout over the Eastern Conference champion Orlando Magic and a 16-point blowout of the reigning NBA champion Los Angeles Lakers. Road victories over the San Antonio Spurs , Utah Jazz , Miami Heat , Boston Celtics and Dallas Mavericks further enhanced their reputation. Though they hovered around .500 for the first half of the season, they went on a 9-game winning streak that sent them into serious playoff contention. Kevin Durant became the youngest player in league history to win the scoring title, averaging 30.1 points per game while playing in all 82 games. , The Thunder finished 50–32, more than doubling their win total from the previous season. The 50–32 tied with the 2008 Denver Nuggets as the best 8th seed in the modern Playoffs era, at least in terms of record. The Oklahoma City Thunder also had the same record as the Boston Celtics in this season.  They finished fourth in the Northwest Division and eighth in the Western Conference playoff standings, and earned a spot in the 2010 NBA Playoffs . On April 22, the team secured their first playoff win in Oklahoma City when they defeated the defending-champion Los Angeles Lakers 101–96. This was also the Thunder's first playoff win at the Ford Center. However, the Thunder tied the series at 2 games each, but the Lakers won the last 2 games in the series to win it 4-2. , Oklahoma City ranked twelfth in overall attendance in the NBA, and seventh in percentage of available seats occupied (98 percent, including 28 sellouts in 41 home games).  The team's operating situation also continued to improve in 2009–10. Forbes magazine estimated the team's franchise value at $310 million (an increase of $10 million over the prior year) with an estimated operating profit of $12.7 million (the first operating profit in years for the franchise).  , Financially, the Thunder organization continued to build on the positive returns experienced from relocating from Seattle to Oklahoma City. In January 2011, Forbes magazine estimated the franchise's worth at $329 million, up six percent from 2009–10 and ranking No. 18 in the NBA.  The magazine also estimated the franchise's revenue at $118 million and operating profit at $22.6 million – up 6.3 percent and 78 percent, respectively, from the previous year.   The Thunder finished the 2010–2011 season with a 55–27 record, a five-win increase from their breakout season the previous year. The team also captured their first division title since moving to Oklahoma City, and seventh in franchise history.  , In the wake of a fourth-seed versus fifth-seed match-up against the Denver Nuggets , Kevin Durant scored 41 points in Game 1 to set a new career playoff high. In the final game of the series, he again scored 41 and forward Serge Ibaka nearly tied the record for most blocks in a playoff game (10, set by Mark Eaton , Hakeem Olajuwon and Andrew Bynum ) with 9 blocks.  The Thunder won the series 4 games to 1 and were set to face off against the Memphis Grizzlies who achieved an eight-seed upset over the San Antonio Spurs just days before. The Thunder advanced to the Western Conference Finals with a seven-game series triumph over the Grizzlies. Durant was again the star, scoring 39 points in the clinching Game 7, while Russell Westbrook also had a triple-double. Despite hard-fought battles with the eventual NBA champs, the Thunder fell to the Dallas Mavericks 4–1 in the Western Conference Finals. The Thunder had a chance to tie the series in Game 4, but they were unable to hold a 15-point lead with five minutes remaining in the fourth quarter. They ended up losing in overtime by the score of 112–105. , During the extended lockout, Thunder players played in exhibition games and even local pickup games to stay in shape.     When the abbreviated training camp began, Oklahoma City started with an intact roster and all players, except for Russell Westbrook . In addition, Kendrick Perkins lost more than 30 pounds during the lockout. The Thunder made their two pre-season appearances, after the lockout, against the Dallas Mavericks , winning both games. They won their first regular-season game against Orlando at home and went on a five-game winning streak. Kevin Durant became the sixth player to score 30 or more points in four consecutive games at the start of a season. In addition, the Thunder was the first to sweep their back-to-back-to-back games, winning a home-and-home series with the Houston Rockets , then routing the San Antonio Spurs . Thunder players Durant, Westbrook, Harden, Perkins, and Ibaka made it onto the 2012 All-Star ballots. After the Thunder's win over the Utah Jazz on February 11, 2012, Scott Brooks was named the Head Coach of the Western Conference All-Star squad for the 2012 NBA All-Star Game in Orlando, Florida. , In the 2012 NBA Playoffs , the Thunder swept the defending champion Dallas Mavericks in the first round to advance and face off against their first-round foes from 2010, the Los Angeles Lakers . They defeated the Lakers in five games and advanced to play the San Antonio Spurs in the Western Conference Finals. The Thunder lost the first two games against the Spurs but won the next three including a Game 5 road win, to take a commanding 3–2 game lead in the series. In Game 6, the Thunder defeated the Spurs 107–99 and advanced to the 2012 NBA Finals . Durant led the way with 34 points, playing all of regulation time in the game. In the 2012 NBA Finals against the Miami Heat , the Thunder won the first game at home but then lost four in a row and lost the series in five games. , In the 2012 NBA draft , the Thunder selected Baylor University forward Perry Jones III with the 28th overall pick. The Thunder also signed free agents Hasheem Thabeet and Daniel Orton , and signed guards Andy Rautins and DeAndre Liggins . They re-signed forward Serge Ibaka to a four-year, $48 million extension. After failing to sign James Harden to an extension that was reportedly worth four years and $52 million, the team decided to trade Harden rather than having to pay the luxury tax penalty. On October 27, 2012, the Thunder traded Harden along with center Cole Aldrich and forwards Daequan Cook and Lazar Hayward to the Houston Rockets for Kevin Martin , Jeremy Lamb , first-round draft picks from Toronto and Dallas , and one second-round draft pick. Martin took over Harden's sixth-man role for the season. The Thunder finished with a 60–22 regular season, taking both the Northwest division title and top seed of the Western Conference. In the first round of the playoffs, they faced the 8th-seeded Houston Rockets, featuring former team member James Harden. In game 2 of the series, Russell Westbrook was struck by Rockets point guard Patrick Beverley, and fell down with an injury and missed the rest of the playoffs after having knee surgery. Without the team's second-leading scorer, the Thunder, who had a 3–0 lead, lost the next two games to bring the series to 3–2. In game 6, the Thunder defeated the Rockets to advance to the second round, facing a rematch of the 2011 second round, with the Memphis Grizzlies. The Thunder lost the series 4–1, losing four straight games after winning Game 1 at home. , In the 2013 NBA draft , the Thunder selected 12th pick Steven Adams , traded for the 26th pick Andre Roberson, and 47th pick Grant Jerrett. Kevin Martin's contract expired, soon signing with the Timberwolves. In addition to Oklahoma City's offseason movements, they signed free agent Ryan Gomes and re-signed Derek Fisher. The team finished 2nd in the conference to San Antonio with a 59-23 record. They met with the Memphis Grizzlies for the 3rd time in the playoffs, hoping for a revenge after last year's finish. The series set a record for most consecutive overtimes in a series with 4. OKC would prevail in 7 games to play the Los Angeles Clippers for the first time, whom they finished in 6. Their final opponent in the Western Conference Finals were the San Antonio Spurs, with the San Antonio Spurs winning 4-2. , With the 21st and 29th pick in the NBA draft, the Thunder selected Mitch McGary from Michigan and Josh Huestis from Stanford. \"He brings energy, passion, and great basketball IQ and toughness what we value\" said Presti on drafting McGary. Oklahoma City also signed Semaj Christon in the draft. On July 3, the Thunder signed Sebastian Telfair . But they lost a major piece in shooting guard Thabo Sefolosha as his contract expired, after agreeing to a 3-year, 12 million dollar contract with the Atlanta Hawks . Several weeks before the season even started, the Thunder suffered a major setback. Durant was diagnosed with a Jones fracture in his right foot and missed the first 17 games of the season. During the opening game against the Portland Trailblazers , Westbrook scored 38 points, but found himself sidelined due to a small fracture on his right hand. He missed 14 games, during which Oklahoma City went 4-12. During the middle of the season Westbrook and Durant would both come back, and similarly suffer more injuries. Durant was ruled out of the rest of the season in March, deciding to have foot surgery. Westbrook also had to undergo surgery in early March, to repair a fracture in the zygomatic arch bone of his right cheek. Several days later he returned and put on perhaps the best stretch of his career for the rest of the season. Westbrook would recorded several triple doubles on his way to Western Conference Player of the Month honors from February-April. He would also gain the 2014-2015 NBA scoring title. However despite the effort, the Thunder would miss out on the playoffs, and Westbrook would fall short of the MVP award, finishing fourth in voting. They would finish with a 45-37 record. On April 22, 2015, Scott Brooks was fired from being the Thunder head coach. Billy Donovan was hired on April 30, 2015. This will be Donovan's first major NBA coaching job, after he initially accepted and then left the Orlando Magic job in 2007.   , For details on Seattle SuperSonics history, please visit Seattle SuperSonics Records . , Points : 54 (2 times) , by Kevin Durant vs. Golden State Warriors , January 17, 2014 and Russell Westbrook vs. Indiana Pacers , April 12, 2015 , Rebounds : 22 , Serge Ibaka vs. Dallas Mavericks , February 19, 2015 , Assists : 17 , by Russell Westbrook vs. Denver Nuggets , February 22, 2015 , Steals : 7 (2 times) , by Russell Westbrook vs. Golden State Warriors , January 27, 2012 and Thabo Sefolosha vs. Milwaukee Bucks , April 9, 2012 , Blocks : 11 , by Serge Ibaka vs. Denver Nuggets , February 19, 2012 , Points in a playoff game : 43 , by Russell Westbrook vs. Miami Heat , June 19, 2012 , Note: All arenas used before 2008 were used by the defunct Seattle SuperSonics franchise. , Seattle arenas had hosted two NBA All-Star Games ; the 1974 game in Seattle Center Coliseum and the 1987 game in the Kingdome , where SuperSonics forward Tom Chambers grabbed MVP honors. , Opened in 2002, Chesapeake Energy Arena was built without luxury accommodations, but designed to accommodate luxury \"buildouts\" should a professional sports franchise locate to the city. , A plan for such build-out improvements began in 2007. It came in the wake of the acquisition of the Seattle Supersonics by an Oklahoma City-based ownership group the previous October. A city ballot initiative approved by a 62 percent margin on March 4, 2008, extended a prior one-cent city sales tax for a period of fifteen months in order to fund $101 million in budgeted improvements to the arena and a separate $20 million practice facility for a relocated franchise.  , Renovation work on the arena was delayed by a sales tax-receipts shortfall during the 2008-10 economic crisis.  Revised plans limited the size of a new glass entryway and eliminated a practice court to accommodate the shortfall.  Major construction work on the arena expansion was also delayed from the summer of 2010 to the summer of 2011. Seating capacity of the stadium is 18,203 for professional NBA basketball games. , Similar revisions were made to the plans for the Thunder's separate practice facility, for a total cost savings of approximately $14 million.  The Thunder's practice facility completion date was pushed back to approximately March 2011.  , Note: All mascots used before 2008 were used by the defunct Seattle SuperSonics franchise. , On February 17, 2009, Rumble the Bison was introduced as the new Oklahoma City Thunder mascot during halftime of a game against the New Orleans Hornets . Rumble was the winner of the 2008–2009 NBA Mascot of the Year.  , During the 2012 NBA Finals, sportswriter Bill Simmons published a piece on the team's fan base in his ESPN -sponsored Web outlet, Grantland.com , in which he noted the unusual enthusiasm of the city for its team: , Simmons speculated that the Oklahoma City bombing played a major part in the team's culture, noting that Thunder general manager Sam Presti has every new Thunder player visit the Oklahoma City National Memorial , and encourages players to look into the stands and consider that many of the team's fans were personally affected by the event. He also noted, however, that the fact that the Thunder is the only team from Oklahoma City (or indeed the state) in one of the nation's four major leagues contributes mightily to the city's devotion.  , Thunder fans are also reportedly much more likely to attend major home games than most other NBA fanbases. According to a source in the ticket industry, only 5 percent of tickets to the 2012 NBA conference finals listed for sale on secondary market sites such as StubHub were for Thunder home games, and for every ticket listed for a Thunder home game in the 2012 NBA Finals, 10 tickets for Heat home games were listed.  , The Thunder hold the draft rights to the following unsigned draft picks who have been playing outside the NBA. A drafted player, either an international draftee or a college draftee who isn't signed by the team that drafted him, is allowed to sign with any non-NBA teams. In this case, the team retains the player's draft rights in the NBA until one year after the player's contract with the non-NBA team ends.  This list includes draft rights that were acquired from trades with other teams. , For details on Seattle SuperSonics history, see Seattle SuperSonics records . , NBA Most Valuable Player , NBA All-Star head coach , NBA Coach of the Year , NBA Sixth Man of the Year , NBA scoring champion , All-NBA First Team , All-NBA Second Team , NBA All-Defensive First Team , NBA All-Defensive Second Team , NBA Rookie of the Year , NBA Rookie First Team , NBA Rookie Second Team , NBA All-Star Team , NBA All Star Game Most Valuable Player , As the Oklahoma City Thunder's original iteration, the Seattle SuperSonics retired six numbers. In addition, the Supersonics awarded an honorary microphone to longtime broadcaster Bob Blackburn , who had called the majority of the team's games from 1967 through 1992.  , The Oklahoma City Thunder unveiled their first logo on September 3, 2008. According to majority owner Clay Bennett , the team's logo takes several of its elements from other Oklahoma sports teams such as the collegiate Sooners and Cowboys .  The uniform design was unveiled on September 29, 2008.   , An alternate uniform was unveiled on November 8, 2012, featuring only navy blue and white colors. Unlike their regular uniforms, the wordmarks on the alternate are written vertically.   , A second alternate uniform was unveiled on March 1, 2015. A white uniform with sleeves, it features the Thunder partial logo in the center of the chest, and the shorts showcase bolts in light blue and sunset colors.  , All Thunder games are broadcast on the Thunder Radio Network, fronted by flagship stations WWLS-FM 98.1 and KWPN AM 640 in Oklahoma City. Matt Pinto is the radio voice of the Thunder.  , For their first two seasons, the Thunder's TV broadcasts were split between Fox Sports Oklahoma (a regional fork of Fox Sports Southwest ), which broadcast most of the games, and independent station KSBI (channel 52), with around 65 Thunder games airing during the season and more than half of the games available in HD on Fox Sports Oklahoma, along with other team-related programming such as pre-game shows. Around 15 to 20 regular-season games were broadcast over the air on KSBI, which had a network of re-broadcasters spanning the entire state. All televised games are called by Brian Davis on play-by-play and Michael Cage as color commentator.   During the 2009–10 season , KSBI telecast all Thunder games it aired in high definition (KSBI had previously aired in HD the first regular-season game played at the Ford Center – against the Milwaukee Bucks on October 29, 2008 – while all other games during the 2008–09 season were telecast on KSBI in standard definition). On August 3, 2010, the Thunder signed a new exclusive multi-year agreement with Fox Sports Oklahoma, beginning with the 2010–11 season , ending the team's broadcasts on KSBI.  On October 22, 2012, the Thunder announced that Lesley McCaslin would be the new Thunder sideline reporter.  On July 21, 2014, the Thunder announced that Long would not return to be its TV color commentator on Fox Sports Oklahoma.  On September 17, 2014, the Oklahoma City Thunder announced that 15-year NBA veteran Michael Cage would be the new color analyst, joining Brian Davis on television and Matt Pinto on the radio when the game is not on Fox Sports Oklahoma.  "
}
