{
  "category": "nba",
  "article": "The Philadelphia 76ers (also commonly known as the Sixers ) are an American professional basketball team based in Philadelphia , Pennsylvania . They play in the Atlantic Division of the Eastern Conference of the National Basketball Association (NBA). Founded in 1946 and originally known as the Syracuse Nationals , they are one of the oldest franchises in the NBA, and one of only eight (out of 23) to survive the league's first decade. , The 76ers have had a rich history, with many of the greatest players in NBA history having played for the organization, including Wilt Chamberlain , Julius Erving , Moses Malone , Charles Barkley , Allen Iverson , and Dikembe Mutombo . They have won three NBA championships, with their first coming as the Syracuse Nationals in 1955. The second title came in the 1966–67 season , a team which was led by Chamberlain. The third title came in the 1982–83 season , won by a team led by Erving and Malone. They have only been back to the Finals once since then, during the 2001 campaign , led by Iverson and Mutombo, only to fall to the Los Angeles Lakers , 4–1. They won game 1 in overtime, but lost the next 4. The Sixers set a franchise record and tied an NBA record for futility during the 2013–14 season , losing 26 consecutive games. , , , In 1946, Italian immigrant Daniel Biasone sent a $5,000 check to the National Basketball League offices in Chicago , and the Syracuse Nationals became the largely Midwest-based league's easternmost team, based in the Upstate New York city of Syracuse .  The Syracuse Nationals began play in the NBL in the same year professional basketball was finally gaining some legitimacy with the rival Basketball Association of America that was based in large cities like New York and Philadelphia. While in the NBL with teams largely consisting of small Midwestern towns, the Nationals put together a 21–23 record, finishing in 4th place. In the playoffs, the Nats would be beaten by the fellow upstate neighbor Rochester Royals in 4 games. , In their second season, 1947–48, the Nationals would struggle, finishing in 5th place with a 24-36 record. Despite their struggles, the Nats would make the playoffs, getting swept by the Anderson Duffey Packers in 3 straight games. , Several teams began to leave the NBL for the BAA as the foundation for an absorption was laid. Staying in the NBL, the Nationals signed Al Cervi to be player coach as Dolph Schayes made his professional debut, leading the Nats to a winning record for the first time with a record of 41–22. In the playoffs the Nationals would make quick work of the Hammond Calumet Buccaneers, winning the series in 2 straight games. However, in the semifinals the Nats would fall to the Anderson Duffey Packers for the second straight season in 4 games. In 1949, the Nationals were one of seven NBL teams that were absorbed by the Basketball Association of America to form the NBA. , The Nationals were an instant success in the NBA winning the Eastern Division in the 1949-1950 season, with a league best record of 51–13 . In the playoffs the Nationals would continue to play solid basketball beating the Philadelphia Warriors in 2 straight. Moving on to the Eastern Finals the Nationals would battle the New York Knickerbockers beating their big city rivals in a 3-game series. Moving on to the NBA Finals the Nationals would face fellow NBL alum Minneapolis Lakers . In Game 1 of the Finals the Nats would lose just their 2nd home game of the season 68–66. The Nats would not recover as they fell behind 3 games to 1 before falling in 6 games. , Despite several teams leaving the NBA for the National Professional Basketball League , before the 1950-1951 season, the Nationals decided to stay put. In their second NBA season the Nationals played mediocre basketball all season finishing in 4th place with a record of 32–34. However, in the playoffs the Nats played their best basketball of the season as they stunned the 1st place Philadelphia Warriors in 2 straight taking Game 1 on the road in overtime 91–89. However, in the Eastern Finals the Nationals would be beaten by the New York Knickerbockers in a hard fought 5-game series losing the finale by just 2 points. , Al Cervi, playing less and coaching more, emphasized a patient offense and a scrappy defense, which led the league by yielding a stingy 79.5 points per game, as the Nationals won the Eastern Division in the 1951-1952 season, with a solid 40–26 record. In the playoffs the Nats would knock the Philadelphia Warriors off again in a 3-game series. However, in the Eastern Finals the Nats would fall to the New York Knickerbockers again dropping the series in 4 games. , The Nationals would finish in 2nd place in a hard fought 3-way battle for first place in the Eastern Division for the 1952-1953 season, with a record of 47–24. In the playoffs the Nationals would face the Boston Celtics dropping Game 1 at home 87–81. Needing a win in Boston to keep their hopes alive, the Nationals would take the Celtics deep in to overtime before losing in quadruple OT 111–105, in what remains the longest playoff game in NBA history.  , The Nationals acquired Alex Groza , and Ralph Beard as the Indianapolis Olympians folded leaving the NBA with just 9 teams for the 1953-1954 season. Once again the Nationals would battle for the Division title falling 2 games short with a 42–30 record. In the playoffs the Nats would win all 4 games of a round robin tournament involving the 3 playoff teams from the East. In the Eastern Finals the Nats would stay hot beating the Boston Celtics in 2 straight games. However, in the NBA Finals the Nationals would lose to the Minneapolis Lakers in a hard fought 7-game series where the 2 teams alternated wins throughout. , With the NBA struggling financially and down to just 8 teams Nationals owner during the 1954-1955 season Danny Biasone suggested the league limit the amount of time taken for a shot thus speeding up a game that often ended with long periods of teams just holding the ball and playing keep away. Biasone calculated a 24-second shot clock would allow at least 30 shots per quarter speeding up the game and increasing scoring. The Shot Clock was an instant success as scoring was up 14 points per game league wide. In the first season of the shot clock the Nats would take first place in the East with a 43–29 record. After a first round bye the Nats would beat the Boston Celtics in 4 games to reach the NBA Finals for the 2nd straight season. In the finals the Nats would get off to a fast start, lead by (led by forward Dolph Schayes ), and took the first 2 games at home against the Fort Wayne Pistons .  However, as the series moved to Fort Wayne the Pistons would spark back to life taking all 3 games to take a 3–2 series lead. Back in Syracuse for Game 6 on the Nats kept Championship hopes alive by beating the Pistons 109-104 to force a 7th game at home. Game 7 would be as tight as the series as George King sank a free throw to give the Nats a 92–91 lead in the final seconds. King would then steal inbound pass to clinch the NBA Championship for the Nationals. , Coming off their NBA Championship the Nationals struggled during the 1955-1956 season, needing a tiebreaker over the New York Knickerbockers to avoid finishing in last place and make the playoffs with a 35–37 record. However, in the playoffs the Nats would stun the Boston Celtics winning the first round series in 3 games by taking the final 2 games. In the Eastern Finals the Nationals played solid basketball again as they pushed the Philadelphia Warriors to a decisive 5th game. However, the Nationals' reign as champions would end with a 109–104 loss in Philadelphia . , The Nationals would get off to a slow start as coach Al Cervi was fired and replaced by Paul Seymour . Under Seymour the Nats would rebound and finish the 1956-1957 season in 2nd place with a record of 38–34. In the playoffs the Nats would have trouble knocking off the defending champion Philadelphia Warriors advancing to the Eastern Finals with 2 straight wins. However, the Nats would be swept in 3 straight games by the eventual champions, the Boston Celtics . , Fort Wayne and Rochester had moved on to Detroit and Cincinnati for the 1957-1958 season, leaving the Syracuse Nationals as the last small town team in the big city NBA. That would not matter on the court as the Nats held their own finishing in 2nd place with a 41–31 record. However, in the playoffs the Nationals would fall in the first round as they lost a 3-game series to the Philadelphia Warriors. , Despite a mediocre 35–37 record for the 1958-1959 season the Nationals would make the playoffs again by finishing in 3rd place. In the playoffs the Nationals would once again rise to the occasion sweeping the New York Knickerbockers in 2 straight to reach the Eastern Finals, where they gave the eventual champion Boston Celtics all they could handle, alternating wins before falling by 5 points in Game 7. , Playing in a league now dominated by superstars like Bill Russell of the Boston Celtics , Wilt Chamberlain of the Philadelphia Warriors and Bob Pettit of the St. Louis Hawks , the Nationals held their own posting a solid 45–30 record, while finishing in 3rd place after the 1959-1960 regular season. However, in the playoffs the Nats would lose a 3-game series to Chamberlain and the Warriors. , With the Lakers relocating from Minneapolis to Los Angeles before the 1960-1961 season, the Syracuse Nationals became the last old NBL team to still be playing in their original city in the NBA. The Nationals would go on to make the playoffs again by finishing in 3rd place with a 38–41 record. The Nationals would prove to be dangerous in the playoffs as they stunned the Philadelphia Warriors in 3 straight games. However, in the Eastern Finals the Nats would be knocked off once again by the eventual champion Boston Celtics in 5 games. , Dolph Schayes missed 24 games during the 1961-1962 season and fails to lead the team in scoring for the first time in 14 years, as Hal Greer leads the way with 22.8 ppg. The Nats would go on to finish in 3rd place again with a 41–39 record. In the playoffs the Nats would drop their first 2 games to the Philadelphia Warriors on the road. Facing elimination the Nats would win the next 2 games to force a 7th game in Philadelphia. However, in Game 5 the Warriors would prove to be too strong as they ended the Nats season with a 121–104 victory. , With an aging team the Nationals were expected to fade, however with the scrappy play of Johnny Kerr the Nationals remained a strong contender finishing in 2nd place for the 1962-1963 season, with a record of 48–32. In the playoffs the Nationals would face the Cincinnati Royals , getting off to a 2–1 series lead. However, needing a win to advance to the Eastern Finals again the Nationals would lose 2 straight dropping the decisive 5th game at home in overtime 131–127. , The playoff overtime loss on March 26, 1963 would prove to be the last game for the Syracuse Nationals, as investors Irv Kosloff and Ike Richman purchased the team from Danny Biasone moving the team to Philadelphia, filling the void left by the Warriors. Syracuse was the last of the medium-sized cities housing an NBA team, but by then it was apparent that central New York was no longer large enough to support it. The NBA thus returned to Philadelphia one year after the Warriors had left for San Francisco . A contest was held to decide on a new name for the team. The winning name, chosen by Walter Stalberg, was the \"76ers\".   Newspaper writers liked the name because it was easily shortened to \"Sixers\" in headlines. The shorter name was quickly accepted by the team for marketing purposes, and for most of the last half-century \"76ers\" and \"Sixers\" have been officially interchangeable. , For their first four years in Philadelphia, the 76ers played mostly at the Philadelphia Arena and Civic Center-Convention Hall , with an occasional game at The Palestra at the University of Pennsylvania . Schayes was named head coach, a post he held for four years (the first as player-coach). , In June 2014 the it was announced that the team would move their practice facility and home offices to the Camden Waterfront , across the Delaware River from Philadelphia in Camden, New Jersey .   , In the 1964–65 season, the 76ers acquired the legendary Wilt Chamberlain from the Warriors; Chamberlain had been a high school legend at Overbrook High School in Philadelphia and began his career with the Warriors while they still played in Philadelphia. The 76ers would push the Celtics to seven games in the semifinals, with the 76ers trailing 110–109 in Game 7. After Hal Greer 's pass was stolen by John Havlicek —an infamous blow to 76ers fans, rubbed in by fabled Celtics announcer Johnny Most when he yelled into the microphone \"Havlicek stole the ball!\"—the Celtics went on to beat the Los Angeles Lakers and win the NBA Championship. On December 3, 1965, in the midst of a game at the Boston Garden, co-owner Ike Richman suffered a heart attack and died courtside.  , Led by head coach Alex Hannum , the 76ers had a dream season as they started 46–4,  en route to a record of 68–13, the best record in league history at the time.  Chamberlain, Billy Cunningham , and Hal Greer , along with all-stars Chet Walker , Lucious Jackson and Wali Jones led the team to the semifinals. This time the 76ers beat the Celtics in five games. In Game Five of that series, as the 76ers went to victory and the NBA Finals, Philadelphia fans chanted \"Boston is dead!\"—a symbol that the Celts' eight-year reign as NBA champion had ended. The Finals were almost anticlimactic, with the Sixers ousting the Warriors in six games to give them their second NBA Championship. The 1966–67 Sixers were voted the best team in league history during the NBA's 35th anniversary celebration. Since then, the record for regular season wins has been broken twice, by the 1971-72 Los Angeles Lakers (69) and 1995-96 Chicago Bulls (72), both of whom also won championships in their respective seasons. Other than those two teams, the only other team in league history to post a better regular season record than the 1966-67 Philadelphia 76ers were the 1996-97 Chicago Bulls (69). , In the 1967–68 season, with a new home court in the form of The Spectrum to defend their championship, once again the 76ers made it back to the NBA Playoffs and in the rematch of the previous year's semifinals, the 76ers held a 3–1 series lead over the Celtics, before the Celtics staged a dramatic comeback to beat the Sixers in seven games. , At the end of the season, the 76ers dealt Chamberlain to the Los Angeles Lakers for Archie Clark, Darrall Imhoff and Jerry Chambers. At the time, the trade appeared to make some sense from the Sixers' perspective. Chamberlain was making noises about jumping to the American Basketball Association , and GM Jack Ramsay didn't want to risk letting Chamberlain walk away for nothing. Nonetheless, the Sixers didn't get nearly enough in return. The man who was in position to take over as the center, Lucious Jackson, suffered a severe injury in 1969 and was never the same player after that. The Chamberlain trade sent the Sixers into a freefall, which Ramsay accelerated by subsequent divestiture of All Star forward Chet Walker to the Chicago Bulls . , While the rapidly declining 76ers continued to contend for the next three seasons, they never got past the second round. In 1971–72—only five years after winning the title—the 76ers finished 30–52 and missed postseason play for the first time in franchise history. , The bottom fell out in the 1972–73 season. For all intents and purposes, the season ended when Cunningham bolted to the ABA, leaving the Sixers with a roster of Greer and little else. The 76ers lost their first 15 games of the season, and a few months later set a then-record 20-game losing streak in a single season. Their record following the 20-game losing streak was 4–58, and the team at that point had just lost 34 of 35 games. The 76ers finished the season with a 9–73 record, leading the skeptical Philadelphia press to call them the \"Nine and 73-ers\". Under Coach Roy Rubin the 76ers went 4-47. It was his first and, as it turned out, his last NBA coaching job. He was succeeded by player-coach Kevin Loughery, who went 5-26 the rest of the way. The 76ers finished an NBA-record 59 games behind the Atlantic Division champion Boston Celtics. The nine wins by the 1972–73 squad is the fourth fewest in NBA history, and remains the fewest for a full 82 game season. The 73 losses, although threatened several times, remains the all-time low-water mark for any NBA franchise. The 76ers' 0.110 winning percentage was a record worst at the time, and is still the second lowest in NBA history. This record was broken by the 2011-2012 Charlotte Bobcats which was shortened due to a lockout. (That Bobcats team finished 7-59, for a .106 winning percentage.) Only six seasons earlier, the 76ers had set the NBA record for most wins in a season. The 76ers of 1972-73 is considered to be the worst team that ever played in NBA history. , The next year, the 76ers would hire Gene Shue as their head coach and they slowly came back. In the 1975–76 season, the 76ers acquired George McGinnis from the Indiana Pacers of the ABA (after the Knicks tried to sign him, not knowing that the 76ers owned his rights). With him, the 76ers were back in the playoffs after a five-year absence, and even though they lost to the Buffalo Braves in three games, a \"Doctor\" would come along and get the team healthy enough to stay in perennial contention. During this period, however, one last personnel misjudgment had effects when the team used the fifth pick overall in the 1975 draft to select Darryl Dawkins directly from high school. The immensely talented and physically imposing Dawkins seldom, if ever, lived up to his great potential in part because of a perpetual adolescence. , The Sixers finally came all the way back in 1976-77, in large part due to a byproduct of the ABA-NBA merger . The ABA's last champions, the New York Nets , were facing having to pay almost $5 million to the Knicks for \"invading\" the New York area on top of the $3.2 million expansion fee for joining the NBA. When the Sixers offered to buy the contract of the Nets' franchise player, Julius Erving , for $3 million—roughly the cost of NBA membership—the Nets had little choice but to accept. A few months before that trade, Kosloff had sold the Sixers to local philanthropist Fitz Eugene Dixon, Jr. , grandson of George Dunton Widener and heir to the Widener fortune. , Led by Erving, the 76ers began an exciting ride for the fans of Philadelphia, beating their long-time rival from Boston in a seven-game playoff to advance to the Eastern Conference Finals. There, they defeated the Houston Rockets , led by future 76er Moses Malone , in six games to advance to the NBA Finals. In the Finals, they sprinted to a 2-0 series lead over the Bill Walton -led Portland Trail Blazers —who were coached by former Sixers coach/general manager Jack Ramsay—only to drop the next four games in a row to give the Blazers the title. , That led to the 1977–78 motto of \"We owe you one\", which would ultimately backfire when they lost in the conference finals that season to the Washington Bullets , who went on to win the NBA championship. In the next four seasons, the 76ers would fall short of the NBA Championship, even after Shue handed the coaching reins to former great Billy Cunningham. In the 1980 NBA Finals against the Los Angeles Lakers , they lost, four games to two. In Game Six, rookie Magic Johnson played center for the Lakers in place of Kareem Abdul-Jabbar (who was out because of a sprained ankle sustained in Game Five) and scored 42 points. In the 1981 Eastern Conference Finals, the 76ers opened a 3–1 series lead over the Celtics only to see Boston come back and win the series in seven games. The following season, the 76ers again faced the Celtics in the Eastern Conference Finals, and again jumped to a 3–1 series lead only to see Boston forge a 3–3 series tie. The 76ers were given little chance of winning as they faced the Celtics in Game Seven at Boston Garden . This time, they played angry but inspired basketball, pulling away to a 120–106 victory. In the game's closing moments, the Boston Garden fans began chanting \"Beat L.A., Beat L.A.\" , an incredible moment in basketball history, wherein, for seemingly the first time ever the opposing team's fans (Boston), realizing their team would lose the playoff series to a hated opponent (Philadelphia), nonetheless during the very game their team (Boston) was losing to the opponent (Philadelphia), openly wished that opponent (Philadelphia) good luck in the next round against a more hated opponent (Los Angeles).  Although they lost in the NBA Finals, the 76ers began the 1982–83 season with great momentum. All they needed now was Moses to lead them to the promised land of the NBA championship. , Harold Katz bought the 76ers from Dixon in 1981. On his watch, the final piece of the championship puzzle was completed before the 1982–83 season when they acquired center Moses Malone from the Houston Rockets . Led by Hall of Famer Julius Erving and All-Stars Maurice Cheeks , Andrew Toney , and Bobby Jones they dominated the regular season, winning 65 games in what is still the second most winning year in franchise history. Malone was named League MVP, and when reporters asked how the playoffs would run, he answered, \"four, four, four\"—in other words, saying that the 76ers needed to win four games in each of the 3 rounds. The media misinterpreted this and assumed Moses was predicting that the 76ers would sweep all three rounds to win the title, with the minimum 12 games. Malone's accent made his boast sound like \"fo', fo', fo'.\" , However, the 76ers backed up Malone's boast. They made a mockery of the Eastern Conference playoffs, first sweeping the New York Knicks and then beating the Milwaukee Bucks in five games. The 76ers went on to win their third NBA championship (and second in Philadelphia) with a four-game sweep of the Los Angeles Lakers, who had defeated them the season before. Malone was named the playoffs' MVP. The 76ers didn't quite fulfill Malone's prediction, as their run was actually \"fo', fi', fo\" (\"four, five, four\")--a loss to the Bucks in game four of the Eastern finals being the only blemish on their playoff run. Nonetheless, their 12–1 playoff record is tied for the least number of losses in league history with the 2000–2001 Lakers, who went 15–1 en route to the NBA Title, coincidentally beating the 76ers in the Finals (after suffering their only defeat that postseason in Game 1). The Philadelphia-based group Pieces Of A Dream had a minor hit in 1983 with the R&B song \"Fo-Fi-Fo\", which title was prompted by Malone's quip. This also marked the last championship in Philadelphia until the Phillies won the 2008 World Series .  , After a disappointing 1983–84 season , which ended with a five-game loss to the upstart New Jersey Nets in the first round of the playoffs , Charles Barkley arrived in Philadelphia for the 1984–85 season . For the next eight seasons, Barkley brought delight to the Philadelphia fans thanks to his humorous and sometimes controversial ways.  The Sixers returned to the Eastern Conference Finals in Barkley's rookie season, but lost to the Boston Celtics in five games. As it turned out, they would never again advance as far during Barkley's tenure in Philadelphia. Following the '84-85 season, Matt Guokas replaced Billy Cunningham as head coach. Guokas led the 76ers to a 54-28 record and the second round of the playoffs in 1985–86 , where they were defeated by the Milwaukee Bucks in seven games. , On June 16, 1986, Katz made two of the most controversial and highly criticized personnel moves in franchise history, trading Moses Malone to Washington and the first overall pick in the 1986 NBA Draft (which had been obtained from the San Diego Clippers in a 1979 trade for Joe Bryant ) to the Cleveland Cavaliers . In return, the 76ers received Roy Hinson , Jeff Ruland , and Cliff Robinson , none of whom played more than three seasons with the team. Cleveland, meanwhile, turned their acquired pick into future All-Star Brad Daugherty . , On the night of the 1986–87 season opener, Julius Erving announced he would retire after the season, which was subsequently filled with tributes in each arena the Sixers visited. On the court, the team suffered through an injury-plagued campaign, but still managed to make the playoffs with a 45-37 record. Their season would end at the hands of the Bucks again, this time in a best-of-five first round series that went the distance. , In 1987–88 , with the team's record at 20–23, Guokas was fired and replaced by assistant Jim Lynam . Lynam finished the season 16–23, to bring Philadelphia's overall mark to 36-46. For the first time since the 1974-75 season, the Sixers failed to reach the playoffs. Philadelphia selected Charles Smith with its first pick (third overall) in the 1988 NBA Draft , then traded his rights to the Los Angeles Clippers for their first pick (sixth overall), Hersey Hawkins . In five seasons with the 76ers, Hawkins would average 19 points per game, and was the team's all-time leader in three-point field goals attempted and made when he was traded to the Charlotte Hornets for Dana Barros , Sidney Green and draft picks in 1993. , In 1988–89, Philadelphia returned to the playoffs after a one-year absence, but were swept in the first round by the New York Knicks . In 1989–90, Barkley finished second in the league's MVP voting, as the Sixers won the Atlantic Division title with a 53-29 record. After defeating Cleveland in the first round of the playoffs, Philadelphia faced Michael Jordan and the Chicago Bulls in the second round. The 76ers fell to the Chicago Bulls in five games, and would do the same in 1991 after sweeping the Bucks in the first round. In 1991–92 , the 76ers went 35-47 and missed the playoffs for the just the second time during Barkley's eight seasons in Philadelphia. On June 17, 1992, Barkley was traded to the Phoenix Suns for Jeff Hornacek , Tim Perry , and Andrew Lang , a deal that was met with harsh criticism.  , Lynam relinquished his head coaching position to become general manager following the 1991–92 season, and hired Doug Moe to fill the vacancy. Moe's tenure lasted just 56 games, with the Sixers posting a 19–37 record. Popular former player and longtime assistant coach Fred Carter succeeded Moe as head coach in March 1993, but could only manage a 32–76 record at the helm. Following the 1993–94 season, the 76ers hired John Lucas in the dual role of head coach and general manager. The enthusiastic Lucas had been successful as a head coach for the San Antonio Spurs , and Philadelphia hoped he could breathe new life into the 76ers. It proved disastrous, as the team went 42–122 in its two seasons under Lucas. The acquisition of unproductive free agents such as Scott Williams and Charles Shackleford , players at the end of their careers such as LaSalle Thompson , Orlando Woolridge , and Scott Skiles along with stunningly unwise high draft picks such as Shawn Bradley and Sharone Wright were also factors in the team's decline. In fact, Wright would only play four seasons in the NBA while Temple product Eddie Jones —drafted 4 slots below Wright in 1994 by the L.A. Lakers—had 16 productive seasons as an NBA player. , Starting with the 1990–91 season, and ending with the 1995–96 season, the 76ers had the dubious distinction of seeing their win total decrease each year. The nadir was the 1995–96 season, when they finished with an 18–64 record, the second-worst in franchise history. It was also the second-worst record in the league that year, ahead of only the expansion Vancouver Grizzlies but behind the Toronto Raptors , who were also in their inaugural season. That season would turn out to be their last in The Spectrum . Katz, unpopular among fans since the 1986 trades, sold the team to Comcast Spectacor , a consortium of Philadelphia Flyers owner Ed Snider and Comcast Corporation , at the end of the 1995–96 season. Snider had been the Sixers' landlord since gaining control of the Spectrum in 1971. Pat Croce , a former trainer for the Flyers and Sixers, took over as president. , Many 76ers fans call these years \"The Dark Ages\". However, after many years of misfortune, there was a bright spot. The team won the lottery for the top pick in the 1996 NBA Draft . Questions remained, but with the first pick, the Sixers found their \"Answer\": Allen Iverson . , With new ownership, Iverson in place, and the 76ers moving into the CoreStates Center , things seemed to finally be heading in a positive direction. Croce fired Lucas as both coach and general manager. Johnny Davis was named head coach, while Brad Greenberg took over as general manager. Iverson was named Rookie of the Year, but Philadelphia's overall improvement was minimal, as they finished with a 22–60 record. Changes had to be made, and after the 1996–97 season, Davis and Greenberg were both fired and the unveiling of a new 76ers team logo and jerseys marked a new era. To replace Davis, Larry Brown was hired as head coach. Known for a defense-first approach and transforming unsuccessful teams into winners by \"playing the right way\", Brown faced perhaps his toughest coaching challenge. He often clashed with Iverson, but the 76ers improved to 31 wins in 1997–98. Early in the 1997–98 season, the Sixers traded Jerry Stackhouse , who had been the third overall pick in the 1995 NBA Draft , to the Detroit Pistons . In exchange, Philadelphia received Aaron McKie and Theo Ratliff , defensive standouts who would have an impact in the team's resurgence. Another key figure in the team's rise, Eric Snow , was added in a trade with the Seattle SuperSonics in January 1998. , Prior to the 1998–99 season, the 76ers signed George Lynch and Matt Geiger , but a lengthy lockout delayed the start of the season, which was shortened to 50 games. During the season, Philadelphia acquired Tyrone Hill in a trade with Milwaukee. The team began its resurgence during this strike-shortened season, finishing with a 28–22 record and the sixth seed in the Eastern Conference playoffs, marking the first time since 1991 the team reached the postseason. In the first round, Philadelphia upset the Orlando Magic , three games to one, before being swept by the Indiana Pacers . The following season, the Sixers improved to 49–33, fifth in the East. Again, the Sixers won their first round series in four games, this time defeating the Charlotte Hornets . For the second straight year, they were defeated by Indiana in the second round, this time in six games. Though the team was moving in a positive direction, Iverson and Brown continued to clash, and their relationship deteriorated to the point where it seemed certain Iverson would be traded. A rumored trade to the Los Angeles Clippers fell through, but a complicated four-team deal that would've seen Iverson sent to Detroit was agreed upon, only to see it dissolve due to salary cap problems. When it became clear Iverson was staying in Philadelphia, he and Brown worked to patch things up, and the team would reap the benefits in 2000–01. , During the 2000–01 season, the 76ers got off to a hot start by winning their first ten games and were never seriously challenged in the Atlantic Division. Larry Brown coached the Eastern Conference All-Stars, and Allen Iverson was named MVP of the All-Star Game. Shortly before the All-Star break, Theo Ratliff was lost for the season with a wrist injury, one that would later prove to be devastating to his future career. Despite holding a 41-14 record and a comfortable lead atop both the Atlantic Division and Eastern Conference standings at the time of the February 22 trade deadline, management felt the team needed an established center to advance deep into the playoffs. On that day, Philadelphia acquired Dikembe Mutombo from the Atlanta Hawks in a deal that sent the injured Ratliff along with Nazr Mohammed , Toni Kukoč , and Pepe Sanchez to Atlanta (Sanchez was reacquired later in the season after the Hawks waived him). The 76ers went on to finish 56-26, good enough for their first Atlantic Division title since 1989–90 and top seed in the Eastern Conference Playoffs. , In the first round of the playoffs, Philadelphia faced Indiana yet again. In Game One, the 76ers wasted an 18-point lead and lost, 79–78, when Reggie Miller hit a three-pointer in the closing seconds. Philadelphia fought back, however, and took the next three games to win the series. In the Eastern Conference Semifinals, the Sixers squared off against the Toronto Raptors and their superstar, Vince Carter . The teams alternated wins in the first four games, with Iverson scoring 54 points in Philadelphia's Game Two victory. A Game Five win (with Iverson scoring 52 in a 121-88 rout) and Game Six loss set up a decisive Game Seven, which the 76ers survived as Carter missed a long jump shot at the buzzer for an 88-87 victory that sent the Sixers to the Eastern Conference Finals against the Milwaukee Bucks. After the teams split the first two games of the series in Philadelphia, it was learned Iverson would miss Game Three due to various nagging injuries that had plagued him late in the season. Though most predicted a Milwaukee cakewalk, the 76ers kept the game close before falling, 80–74. Philadelphia seemed to gain momentum despite the loss, and they would win Games Four and Five. Milwaukee put any Sixer celebration plans on hold by building up a 33-point lead in the third quarter of Game Six, but the 76ers would make a furious fourth-quarter rally before falling 110–100. Struggling in the series up to that point, Iverson scored 26 points in the final quarter to finish with 46 on the night and appeared to have gotten a second wind. In Game Seven, the Bucks jumped out to a 34–25 second quarter advantage before seldom-used reserve Raja Bell scored 10 points to spark a 23–4 run that gave Philadelphia the lead for good. Iverson scored 44 points and the 76ers pulled away in the second half, winning by a 108–91 score to put them in the NBA Finals for the first time since 1983. As had been the case in their three previous Finals appearances, their opponent would be the Los Angeles Lakers, who had run up an 11–0 record in the first three rounds of the playoffs and were expected by many to make quick work of a worn-down 76ers squad. Because of a seemingly meaningless loss to the lowly Chicago Bulls in the regular season finale (both the Sixers and the Lakers finished with identical 56–26 records, but Los Angeles was awarded a higher seed based on tiebreakers), the NBA Finals marked the first time in the 2001 playoffs in which the 76ers had to start a series on the road. , In Game One, the Lakers jumped out to an 18–5 lead, but the 76ers stormed back to take a 15-point lead in the second half. Los Angeles rallied to force a 94–94 tie at the end of regulation before scoring the first five points of the overtime period, but the 76ers closed the game on a 13-2 run for a 107-101 triumph. Iverson hit a go-ahead three-pointer with 1:19 to go in the extra period, and followed that with a jump shot after which he infamously stepped over Tyronn Lue after making the basket. Eric Snow hit a running jump shot in the waning seconds with the shot clock expiring to clinch the stunning victory. The series would come back to Philadelphia even as Los Angeles took Game Two, 98–89. In Game Three, Shaquille O'Neal fouled out late in the fourth quarter, and the Sixers pulled to within a point with less than a minute to play after trailing by 12 earlier in the second half. Robert Horry , however, hit a clutch three-pointer in that final minute, and the Lakers prevailed, 96-91. Los Angeles wrapped up the second of what would be three consecutive NBA titles with a 100–86 win in Game Four and a 108–96 victory in Game Five. , In addition to their Atlantic Division and Eastern Conference titles, the 2000–01 76ers featured the NBA's MVP (Iverson), Coach of the Year (Brown), Defensive Player of the Year (Mutombo), and Sixth Man of the Year ( Aaron McKie ). , The 76ers went into the 2001–02 season with high expectations, but were able to produce only a 43–39 record, sixth in the Eastern Conference. In the first round of the playoffs, Philadelphia was defeated by the Boston Celtics, three games to two. In 2002–03, the 76ers sprinted to a 15–4 start, but a 10–20 swoon left them 25–24 at the All-Star break. After the break, the 76ers caught fire, winning nine in a row at one point, and 23 of their last 33 to finish at 48–34, earning the fourth seed in the Eastern Conference playoffs. Iverson scored 55 points in the playoff opener against the New Orleans Hornets and the Sixers went on to win the series in six games. In the second round, the Detroit Pistons ended Philadelphia's playoff run in a frustrating six-game series that saw the 76ers lose twice in overtime, and once on a last-second shot in regulation. It would be nine years before the Sixers won another playoff series. , On Memorial Day, 2003, Brown abruptly resigned as head coach, taking over the reins in Detroit a few days later. Brown's Pistons would win the 2004 NBA Championship over the Los Angeles Lakers , in some ways avenging his loss to them in 2001. After being turned down by Jeff Van Gundy and Eddie Jordan , the 76ers hired Randy Ayers , an assistant under Brown, as their new head coach. Ayers lasted only 52 games and was fired with the team's record at 21–31. Chris Ford took over, but the 76ers finished the 2003–2004 season at 33–49, missing the playoffs for the first time in six years. Iverson, who was at odds with Ford throughout the interim coach's tenure, played only 48 games in a stormy, injury-plagued season. , For the 2004–2005 season, Philadelphia native Jim O'Brien was named head coach. Iverson was moved back to point guard and flourished, having arguably his finest season. He also impressed many with his willingness to get other players involved in the offense. During this season, Philadelphia acquired Chris Webber in a trade with the Sacramento Kings , with the hopes that the team had at long last found a consistent second scoring option to compliment Iverson. Andre Iguodala , Philadelphia's first-round pick in the 2004 NBA Draft , was named to the All-Rookie First Team, and the 76ers returned to the postseason with a 43–39 record. In the first round, they were defeated in five games by the defending NBA Champion Pistons, coached by Larry Brown. , Though the 2004–05 76ers exceeded many on-court expectations, there was a great deal of behind-the-scenes tension between O'Brien, his players, and the front office. Shortly after the season ended, O'Brien was fired and replaced by the popular Maurice Cheeks , who played for the team from 1978 to 1989, and was the starting point guard for the 1983 NBA Champions. However, the coaching change did not help team's fortunes for the 2005–06 season. A 2–10 stretch in March doomed them to missing the playoffs for the second time in three years with a 38–44 record. , With the opening of the 2006–07 season, the 76ers started out hot, going 3–0 for the first time since making it to the Finals five years previously. However, they stumbled through the first half of the season and couldn't quite recover, finishing 35–47, good for 3rd in the Atlantic Division, and 9th in the Eastern Conference (tied with Indiana). , On December 5, 2006, disappointed with the direction the team was headed, Allen Iverson gave the 76ers management an ultimatum: find players who will help support me or trade me. This was confirmed via an in-game interview with team owner, Ed Snider .  , On December 19, 2006, Allen Iverson , along with Ivan McFarlin , were sent to the Denver Nuggets in exchange for guard Andre Miller , forward Joe Smith , and two first-round draft picks. Then, on January 11, Sixers GM Billy King announced that the Sixers and aging forward Chris Webber had agreed to a buyout of the remainder of his contract. The Sixers would pay Webber $36 million over the next 1½ seasons, which is $7 million less than he would have been paid to play. After the buyout, the Sixers waived Webber, making him a free agent. Webber signed with the Detroit Pistons shortly thereafter. , The moves allowed the 76ers to make Iguodala the unquestioned leader of the team, and evaluate whether they saw him as a franchise player. The Sixers had started the year 3-0, then went 5-10 before Iverson left the team. They would stumble out to an eight-game losing streak with Iverson deactivated; however, they were able to finish the season on a high note, going 30-29 for the remainder of the season. They finished the year 35-47. , The Sixers drafted Georgia Tech SF Thaddeus Young with the 12th pick, traded with the Miami Heat for 21st pick Colorado State PF Jason Smith , traded with the Portland Trail Blazers for 42nd pick Vanderbilt SG/SF Derrick Byars , and then finally traded with the Utah Jazz for Providence PF Herbert Hill . , On December 4, 2007, the Sixers fired Billy King and replaced him with Nets GM Ed Stefanski .  , With Iguodala, the Sixers clinched a playoff berth with a win over the Atlanta Hawks on April 4, 2008. It was their first postseason appearance since 2005, as well as the first in the post-Iverson era. However, they were eliminated by the Pistons in six games, with Detroit winning the series 4–2. Even with this elimination, many fans considered this to be a successful season, considering that the Sixers were 12 games under .500 in early February and went on to have a run that led them to the playoffs and a 40–42 record. , On July 9, 2008, the 76ers signed power forward Elton Brand to a five-year, $79.795 million contract,  after trading Rodney Carney  and renouncing their rights to all their unrestricted free agents.  Brand had originally opted out of his contract with the Los Angeles Clippers , looking to re-sign with them.  But the 76ers offered him more money (he regarded their offer as the \"Philly-Max\") and a better chance at winning an NBA championship by playing in the Eastern Conference . This move has been the subject of controversy since there were rumors that he and Baron Davis had made a friendly agreement to play together for the Clippers.  The team later signed free agent point guard Royal Ivey of the Milwaukee Bucks ,  Kareem Rush from the Indiana Pacers ,  and then signed former Sixer Theo Ratliff after Jason Smith 's injury. Donyell Marshall was signed on September 2, 2008, after he stated to his agent that he wanted to go back home and end his career in Philadelphia.  Rush, Ivey, Ratliff and Marshall were all paid the veteran's minimum salary, but they were to be contributors to a team on the rise. During the off-season, they also re-signed restricted free agents Louis Williams and Andre Iguodala for five years/$25 million  and six years/$80 million, respectively.  , However, the Sixers couldn't find the form that pushed them to the playoffs last year. The Sixers started the year with a 9–14 record before firing head coach Maurice Cheeks on December 13. Assistant GM Tony DiLeo took over and the Sixers gradually improved. They finished the season with a 41–41 record, with a 32–27 record under DiLeo. Brand's first season with the Sixers ended early with a right shoulder injury that required surgery. Despite the loss of Brand, the Sixers earned a playoff berth with a 95–90 win against the Detroit Pistons on April 4, 2009, at home. , In the first round, they faced the Orlando Magic . Three of the first four games of the series provided late-game heroics. Iguodala and Thaddeus Young made game-winning shots in Games 1 and 3, respectively, while Orlando's Hedo Türkoğlu provided the game-winner in Game 4. Just like in the previous year's playoffs, the Sixers led 2–1 after three games, but the Magic won three straight to eliminate the Sixers from the playoffs. , It was also during the season that the Sixers played one home game at their old home, the Wachovia Spectrum . The Sixers won 104–101 over the Chicago Bulls on March 13, 2009. The game was played to provide the final curtain call on the Spectrum, which was scheduled to be imploded on New Year's Eve 2009. , Following the playoff loss, Tony DiLeo returned to his front office job, creating a head coaching vacancy. Former Washington Wizards coach Eddie Jordan was introduced as the 76ers' new coach on June 1, 2009.  In the 2009 off-season, the Sixers drafted UCLA point guard Jrue Holiday with the 17th pick. The Sixers also traded power forward Reggie Evans to the Toronto Raptors for a three-point specialist, small forward Jason Kapono , who had won back-to-back three-point shootouts in 2007 and 2008.  The off-season also marked the return of the 1977–97 76ers logo, along with a redesigned court and new uniforms updating the 1980s ones.  , On December 2, 2009, the Philadelphia 76ers announced that they had signed Allen Iverson to a one-year prorated $1.3 million non-guaranteed contract.  The 76ers were 5–13 at the time and had lost Louis Williams for at least 30 games to injury.  Iverson made his \"re-debut\" for the 76ers against the team he was traded to, the Denver Nuggets, to a thunderous ovation from the sell-out crowd, scoring 11 points, with six assists and five rebounds.  , However, the euphoria that greeted Iverson's return to the 76ers faded quickly. On February 22, Iverson announced he was leaving the 76ers indefinitely to attend to his daughter's illness, and a few weeks later the 76ers announced that Iverson would not be returning for the rest of the season. , The 76ers finished the season with a record of 27–55, their first 50-loss season since 1998. Most cited the reason behind this as the players' inability to play within Eddie Jordan's Princeton offense , with several players unhappy with his system. Hours after the 76ers' last game at Orlando on April 14, the team fired Jordan after one season. He was the fourth coach to be fired after one season or less since Larry Brown left the team in 2003.  , On May 20, 2010, TNT analyst Doug Collins was named head coach of the 76ers.  Collins played for the Sixers for his entire NBA career after being the first overall pick in the 1973 draft , and had previously coached the Chicago Bulls, Detroit Pistons, and the Washington Wizards. The 76ers had the sixth-best odds at receiving the top pick in the 2010 draft , and they managed to land the second overall pick, beating out the Warriors, Kings, Timberwolves, and Nets, who all had better odds. They used that draft pick to select Ohio State University's Evan Turner . , The Sixers started the season with an uninspiring 3–13 mark, but started turning things around, to finish with a 41-41 record. They clinched a playoff berth on April 1, 2011, their third in the last four years. The 76ers faced the heavily favored Miami Heat in the first round, and ultimately fell to them in five games. Although they lost the series, Collins was praised for turning around a lottery team in his first season, as well as winning a playoff game when many pundits predicted that the Sixers would be swept. Collins also finished second in Coach of the Year voting. , On July 13, 2011, Comcast-Spectacor reached an agreement to sell the 76ers to an investment group led by Apollo Global Management co-founder Joshua Harris . Harris' group paid $280 million for the franchise. The sale did not include any ownership stake in the Flyers or in Comcast Sportsnet. The Sixers will continue to play their home games at the Wells Fargo Center for the foreseeable future. Rapper Will Smith (a Philadelphia native) and his wife Jada Pinkett Smith are notable minority owners. The new ownership group decided to retain Head Coach Doug Collins and President of Basketball Operations Rod Thorn. Ed Stefanski, who served as the team's General Manager since 2007, was relieved of his duties. , The 2011–12 NBA season was delayed into December and the Sixers did not hold their home opener until January 6, 2012. The home opener marked the debut of an improved in-game presentation at the Wells Fargo Center. [ citation needed ] , The Sixers had their best start since the 2000-01 season with a 20–9 record, battling for the Eastern Conference's best record and taking a firm division lead. The Sixers, however, finished the rest of the season 15–22, giving them a 35–31 record. Attributed to their lack of a true go-to scorer, [ citation needed ] the 76ers lost hold of the top-three seed and division championship that they held for most of the season, by going on the losing steak. Nevertheless, they clinched their fourth playoff berth in the last five years on the penultimate play date of the season. , Philadelphia earned the eighth seed in the 2012 NBA playoffs , facing the 1st-seeded Chicago Bulls . Philadelphia improved from their struggles in the second half of the regular season, beating Chicago 4–2 to win their first series since 2003. This was the fifth time in NBA history that an eight seed has beaten a one seed. They then faced their rival, the Boston Celtics , in the second round, and were eliminated 4–3. The Sixers once again faced criticism for their lack of a true scorer, as they were not able to keep pace with the Celtics' scoring. They were, however, given credit for winning the regular-season series against Boston and forcing the playoff series to seven games against the Celtics, who had won the last four division championships. [ citation needed ] , In an effort to re-tool for the upcoming season, The 76ers selected Maurice 'Mo' Harkless , and Arnett Moultrie (via trade with Miami) in the 2012 NBA draft . The Sixers then used their amnesty clause on Elton Brand , traded for Dorell Wright , signed Nick Young , Kwame Brown , and Royal Ivey , and re-signed Spencer Hawes while Lavoy Allen . Lou Williams , and Jodie Meeks left through free agency. , On August 9, 2012, the 76ers agreed to a four-team trade with the Los Angeles Lakers , Orlando Magic and Denver Nuggets . In the trade that sent six-time All-Star Dwight Howard to the Lakers, Philadelphia agreed to send 2011 first-round pick Nikola Vučević , 2012 first-round draft pick Maurice Harkless , and a future first-round draft pick to Orlando, as well as All-Star swingman Andre Iguodala to Denver. In exchange, they received Jason Richardson from the Magic and All-Star center Andrew Bynum from the Los Angeles Lakers.  , The Sixers started the 2012–13 NBA season with high expectations with the help of Andrew Bynum and the growth of the young Sixers. However, Bynum's debut with the 76ers took a hit when he was sidelined for precautionary reasons, in relation to the Orthokine knee procedure he received during the off-season. At first it looked like Bynum would be out only shortly, but little success in healing and setbacks pushed Bynum's return date further and further. As a result of many setbacks, on March 19, the Sixers announced that Bynum would have season-ending surgery on both knees.  Bynum wasn't the only Sixer to suffer through injuries. On February 8, Jason Richardson also went through a season-ending knee surgery.  Jrue Holiday , Thaddeus Young , Nick Young , and Royal Ivey also had injuries that sidelined them for weeks. By the end of the season, Evan Turner and Spencer Hawes were the only Sixers to play in every game during the season. The Sixers started the season 12–9 but stumbled through a tough stretch and couldn't recover. The Sixers finished the season 34–48, missing the playoffs for the first time since Doug Collins had taken over as head coach. , On April 18, Collins resigned as 76ers coach, citing his declining health and need to spend time with his grandchildren. He stayed with the team as an adviser.  Soon after, general manager Tony DiLeo had \"cut ties\" with the team. [ citation needed ] On May 11, it was announced that Sam Hinkie , who had previously worked for the Houston Rockets , would replace DiLeo as general manager.  On July 8, it was announced that Adam Aron had stepped down as CEO, and was being replaced by Scott O'Neil. Aron maintained his position as co-owner of the team. [ citation needed ] , Following the 2012–13 season, the Sixers, led by Hinkie, chose to shift in the direction of rebuilding the franchise. The first move of this new plan was executed during the 2013 draft , when the Sixers agreed in principle to trade Jrue Holiday and the 42nd pick in the draft, Pierre Jackson , to the New Orleans Pelicans for Nerlens Noel and the Pelicans' 2014 first-round pick. The trade was later made official on July 12.  The trade was seen by some [ who? ] as somewhat surprising, as Holiday had been the team's marquee player and was coming off a season that saw him make his first NBA All-Star Game . Additionally, Noel was recovering from an anterior cruciate ligament injury suffered while in college, strongly indicating that he would not be able to make an immediate impact for the Sixers as he would be inactive to start the season. The Sixers used the 11th pick in the draft to select Michael Carter-Williams as Holiday's replacement as the starting point guard. The Sixers chose Arsalan Kazemi with the 54th overall pick, making Kazemi the first Iranian chosen in the NBA draft.  , Following the Holiday trade, many of the team's returning players were either waived or left the team in free agency, most notably Andrew Bynum ; of the 15 players on the team's roster during their final game of the 2012–13 season, only six remained with the team by January 1, 2014. In their place were a number of young prospects, many coming from the NBA Development League or signing with the Sixers after playing limited roles on other teams. Further moves at the trade deadline on February 20, 2014, saw the exits of veterans Spencer Hawes , Evan Turner , and Lavoy Allen , all of whom were key rotational players. , The 76ers, predicted by many [ who? ] to finish with the worst record in the league, had a 3–0 start that included wins over the two-time defending champion Miami Heat and a Chicago Bulls team with high expectations. However, the Sixers struggled mightily after that, at one point posting a 26-game losing streak which set a franchise record  and tied the all-time NBA record for most consecutive losses in a single-season.  The Sixers finished the season with a 19–63 record, the third-worst in franchise history. Despite that, the Sixers did not have the worst win/loss record in the overall NBA standings: the Bucks fared worse with a 15–67 record. , Carter-Williams led all rookies in points, rebounds, assists, and steals, joining Magic Johnson and Oscar Robertson as the only rookies to do such a feat.  He also won the player of the week award in his first week, being the second rookie after Shaquille O'Neal to accomplish that.  He went on to win the Rookie of the Year award, becoming the first rookie drafted 10th or later to win the award since Mark Jackson in 1987 for the Knicks .  , In the 2014 NBA draft , the Sixers selected Joel Embiid with the third overall pick, and traded with Orlando for Croatian prospect Dario Šarić , the twelfth pick of the draft. Neither prospect was expected to make an immediate impact for the Sixers, as Embiid was recovering from a stress fracture in the navicular bone , while Šarić will likely spend one or more years playing in the Turkish League .  In the second round, the Sixers selected K. J. McDaniels , Jerami Grant , Jordan McRae , and Serbian prospect Vasilije Micić . The Sixers also traded a second-round pick to re-acquire Pierre Jackson from the New Orleans Pelicans .  , In the 2014 off-season, the Sixers traded Thaddeus Young to Minnesota in the Kevin Love to Cleveland trade, and received the Heat's 2015 first-round draft pick, Luc Mbah a Moute and Alexey Shved , leaving only two players with three years of experience on the Sixers remaining. , On November 29, 2014, the 76ers lost to the Dallas Mavericks 103–110 and set a franchise record for losses to start the season, as they fell to a record of 0–16.  After losing their next game against the San Antonio Spurs to make it 0–17, the 76ers were on the verge of tying the NBA record of 18 straight losses to start a season if they lost to the Minnesota Timberwolves on December 3, but they broke their losing streak and won their first game of the 2014–15 season with an 85–77 victory at Minnesota.  , In three deals at the 2015 NBA trade deadline, the 76ers traded Carter-Williams and McDaniels for JaVale McGee , Isaiah Canaan , and three draft picks, including a protected 2015 first round pick originally owned by the Los Angeles Lakers . , On May 19, the 76ers were awarded the third overall pick in the NBA Draft , which is scheduled to take place June 25 at the Barclays Center in Brooklyn, New York . , During the 2014-15 playoffs, the 76ers started referring to their stadium as \"The Center,\" because Wells Fargo left sponsorship with the 76ers, but still has naming rights to their arena. It makes a lot of sense, since they've drafted a center with their first pick for the third consecutive season. , 1963–1997 logo , While team colors have changed somewhat over the years, with emphasis alternating between blue, white, red, and even black and gold, the 76ers have always been closely identified with the logo featuring the number 76 with 13 stars arranged in a circle above the number 7 to represent the original 13 American colonies. The logo portrays the patriotic nature of the United States , prominently featuring the colors red, blue and white, and Philadelphia 's reputation as the birthplace of American independence . The logo was used from 1963 to 1977, after which it was slightly modified to feature the full team nickname and a basketball adorning the logo. This iteration was used from 1977 to 1997. The 76ers also had an alternate logo with the '76' wordmark inside the silhouette of the Liberty Bell with 'Philadelphia' on top. , Uniforms during this era varied between blue and red. During much of the 1960s, the abbreviated city name 'PHILA' adorned the uniforms, ranging from fancy and contemporary two-tone script to classic block lettering, the latter of which was used during their 1967 title run. Blue was the primary road color for most of the 1960s (except the 1965–66 season ), but for the 1968–69 season, red became the primary away color, with the away uniform featuring 'PHILA' and the block numbers in white with blue trim (later switching color designations in the 1970–71 season). Player names were also added as part of the NBA mandate. A uniquely-designed home uniform was used in the second half of the 1971 season, featuring a script 'Seventy Sixers' wordmark in red with blue trim, the only time the full team name was used on the uniform. , From 1971 to 1978 they returned to blue as the primary road color, with the more popular moniker 'SIXERS' written in Art Deco lettering. With various adjustments from block lettering to Bookman Old Style font, this version with stars in side stripes stayed until 1978. The uniforms from 1978 to 1991 were a classic nod to their 1967 uniforms, except that the road color is red and the home lettering is blue with red trim. The name 'SIXERS' was featured in block lettering. This uniform was used in their 1983 title run. From 1991 to 1994, the Sixers followed other teams in designing more graphic-laden uniforms by featuring a streaking blue splash with tricolored stars heading up to the word 'SIXERS' in Helvetica and in either red (home) or white (away). In addition, the word 'PHILADELPHIA' was added atop the team name. From 1994 to 1997, the Sixers return to a more basic uniform design, featuring a more ornate lettering. The team name is in red (home) and white (away), with numbers in blue. , In the 1997–98 NBA season , the Sixers drastically changed their logo and colors in an effort to appeal to a more youthful, hip-hop oriented culture. The iconic 76 logo was dropped, and a new logo was introduced, featuring a bigger 76ers script, with a single star behind the number 7 and a streaking basketball below. More controversially, gold and black were introduced to the color scheme,along with red, white and blue. Uniforms were primarily white (home), and black (away), with slight adjustments in the home logo lettering (gold 1997–2000, black 2000–09), trim and piping. Until the 2006–07 season, player names featured a red trim, before dropping it altogether and shrunk the font size in the 2007–08 season; the alternates adopted this design that season, with the regular uniforms following suit that same season. A blue alternate uniform was worn 1999–2006, while a red alternate uniform, featuring a return to the 'PHILA' script in then-current lettering, was worn 2006–09. This logo and color scheme were used until the 2008–09 NBA season . , During the 2008–09 season, while the previous logo was still in use, the original 'Stars and Stripes' 76 logo was revived to coincide with the team's 60th anniversary (counting the Syracuse years). The previous 1977–97 logo was reintroduced, with the addition of a red square and 'Philadelphia' inside a blue rectangle below it, although the partial logo without the square, city name and rectangles was also used. Uniform colors for this anniversary edition were white only, using the 1978–91 design. The anniversary uniforms proved so popular that they inspired the team to return to the old logo and color scheme full-time for the 2009–10 season, with red away uniforms completing the ensemble. This variation featured different striping patterns, team name in blue and numbers in red on the home uniforms, and monotone script. This combination continues to represent the 76ers to the present. A blue alternate uniform, which mirrors that of the red away uniform, was unveiled before the 2012–13 season. For the 2013–14 season, the blue uniforms will be the primary while the red uniforms will be the alternate, marking the first season since 1977–78 that the 76ers wore blue as a primary away uniform. The red uniform was retired prior to the 2014–15 season.  , A new version of the classic 76ers logo was unveiled for the 2015–16 season, featuring a slight tilt to the white basketball and a roundel featuring the city name and six stars. A secondary \" Dribbling Ben Franklin \" logo was also introduced. The home white, away blue and red alternate uniforms featured a mix of classic styles used in previous uniforms. The home white and away blue uniforms featured the 'PHILA' wordmark as homage to the late 1960s uniforms, while the red alternates featured the 'SIXERS' wordmark in tribute to the 1980s uniforms. Side stripes featuring seven stars on one side and six on the other pay homage to the 1970s uniforms, while the shoulder piping was a callback to the 1980s uniforms. The inscription 'PHILA TOUGH' is sewed on the bottom of all uniforms.  , The rivalry between the 76ers and Boston Celtics is the earliest dated rivalry in the NBA. The two teams have the most meetings in the NBA Playoffs , playing each other in nineteen series, of which the Celtics have won twelve.  It is considered to be the 2nd greatest rivalry in the NBA next to the Celtics–Lakers rivalry .  The rivalry first peaked when Wilt Chamberlain and Bill Russell of the Celtics played each other from 1965 to 1968. The 1966-67 Sixers, voted the best team in league history during the NBA's 35th anniversary, set a then-record by winning 68 games in the 82 game season (a record since broken by the Lakers then Bulls) and ending Boston's eight-year title reign which led to the infamous \"Boston's Dead!\" chants. , The 76ers went through a rebuilding period through the early 1970s, however came back to relevance during the 1976 season in which they defeated the Celtics en route to a Finals appearance. Both teams would peak in the 80's, with every single Eastern Conference Championship between 1980 and 1987 belonging to either the 76ers or Celtics. The Larry Bird-led Celtics won five of them, while the Julius Erving-led 76ers won the other three. The Charles Barkley-led Sixers of the later 80's took the fight to the Celtics, however neither team experienced much playoff success in the late 80's and both took steep nosedives in the Eastern Conference rankings throughout the 90's. , The rivalry was reborn in the new millennium. The first time, the Allen Iverson-led defending-Eastern Conference champions 76ers were defeated in the first round of the 2002 playoffs by the Paul Pierce-led Celtics 3-2. The second time, exactly ten years later, the Big Three Celtics (Kevin Garnett, Paul Pierce and Ray Allen) defeated the valiant eight seed 76ers team 4-3. In the ten years in between, the Sixers would experience limited success whereas the Celtics won a championship and contended for most of that span. In a memorable 2006 regular season meeting between the two, the 76ers defeated the Celtics 125-124 in triple overtime, with Iverson leading the way with 33 points and 10 assists. , The rivalry started due to the proximity of two cities, 2 hours by car, and the rivalries between two cities with sports teams was the stemming of the Mets–Phillies rivalry of the Major League Baseball , the Eagles–Giants rivalry of the National Football League , and the Flyers–Rangers rivalry of the National Hockey League . This rivalry, however, isn't as fierce as the others. , The Los Angeles Lakers are the Sixers' biggest rival from the Western Conference . The rivalry has been most intense during the late 1970s and early 80s, when both teams were big title contenders with well-known NBA players such as Magic Johnson , Kareem Abdul-Jabbar , Julius Erving , and Moses Malone . During this period, the teams have met each other in the NBA Finals 3 times; in 1980 , 1982 , and 1983 . The Lakers took the series in 1980 and 1982, but the Sixers won the series in 1983. , The rivalry was dormant during the rest of the 1980s and the entire 1990s with the 76ers going through tough rebuilding times. However, the rivalry made a comeback in the 2001 NBA Finals , when the Allen Iverson and Dikembe Mutombo led Sixers met the Kobe Bryant and Shaquille O'Neal led Lakers. The Sixers shocked the world by beating the seemingly unbeatable Lakers in Game 1 at Los Angeles. The Lakers, however, would take the next four games to win the series. The rivalry has cooled since then with both the Sixers and Lakers going through rebuilding periods. , Sixer fans also have their own rivalry with the Lakers' Kobe Bryant. This rivalry started in the 2001 NBA Finals when Kobe proclaimed he was \"coming to Philly to cut their hearts out.\" (Coincidentally, Bryant himself was born in Philadelphia.) This began an unforgiving attitude from Sixers fanatics that continues to this day.  , , The following players have rights owned by the Philadelphia 76ers. , Bold denotes still active with team. Italics denotes still active but not with team. , Points scored (regular season) (as of the end of the 2014–15 season)  , Other Statistics (regular season) (as of the end of the 2014-15 season)  , Minutes Played , Rebounds , Assists , Steals , Blocks , All-time Leading Scorer , NBA MVP of the Year , NBA Finals MVP , NBA Defensive Player of the Year , NBA Rookie of the Year , NBA Sixth Man of the Year , NBA Most Improved Player of the Year , NBA Coach of the Year , NBA scoring champion , NBA All-Star Game head coaches , All-NBA First Team , All-NBA Second Team , All-NBA Third Team , NBA All-Defensive First Team , NBA All-Defensive Second Team , NBA All-Rookie First Team , NBA All-Rookie Second Team "
}
