{
  "category": "uefa",
  "article": "The UEFA Champions League , known simply as the Champions League , is an annual continental club football competition organised by the Union of European Football Associations (UEFA) and contested by top-division European clubs . It is one of the most prestigious tournaments in the world and the most prestigious club competition in European football, played by the national league champion (and, for some nations, one or more runners-up) of each UEFA national association. The final of the 2012–13 tournament was the most watched UEFA Champions League final to date, as well as the most watched annual sporting event worldwide in 2013, drawing 360 million television viewers.  , Introduced in 1992, the competition replaced the European Champion Clubs' Cup , or simply European Cup , which had run since 1955, adding a group stage to the competition and allowing multiple entrants from certain countries.  The pre-1992 competition was initially a straight knockout tournament open only to the champion club of each country. During the 1990s, the format was expanded, incorporating a round-robin group stage to include clubs that finished runner-up of some nation's top level league.  While most of Europe's national leagues can still only enter their national league champion, Europe's strongest national leagues now provide up to four teams for the competition,  and will provide up to five teams from the 2015–16 season onwards.  Clubs that finish next-in-line in each nation's top level league, having not qualified for the UEFA Champions League competition, may be eligible for the next level UEFA Europa League competition. , In its present format, the UEFA Champions League begins in mid-July with three knockout qualifying rounds and a play-off round. The 10 surviving teams enter the group stage, joining 22 other teams qualified in advance. The 32 teams are drawn into eight groups of four teams and play each other in a double round-robin system . The eight group winners and eight runners-up proceed to the knockout phase that culminates with the final match in May.  The winner of the UEFA Champions League qualifies for the UEFA Super Cup and the FIFA Club World Cup .   , Real Madrid is the most successful club in the competition's history, having won the tournament ten times, including its first five seasons. Spanish clubs have accumulated the highest number of victories (15 wins), followed by England and Italy (12 wins apiece). The competition has been won by 22 different clubs, 12 of which have won it more than once.  Since the tournament changed name and structure in 1992, no club has managed consecutive wins; Milan were the last holders to successfully defend their title, in the 1989–90 season.  The reigning champions are Barcelona , who secured their fifth title in the competition after defeating Juventus 3–1 in the 2015 Final .  , , , The first pan-European tournament was the Challenge Cup, a competition between clubs in the Austro-Hungarian Empire .  The Mitropa Cup , a competition modelled after the Challenge Cup, was created in 1927 by Zeid Edilbi and played between Central European clubs.  In 1930, the Coupe des Nations ( French : Nations Cup ), the first attempt to create a cup for national champion clubs of Europe, was played and organised by Swiss club Servette .  Held in Geneva , it brought together ten champions from across the continent. The tournament was won by Újpest of Hungary.  Latin European nations came together to form the Latin Cup in 1949.  After receiving reports from his journalists over the highly successful Campeonato Sudamericano de Campeones of 1948, Gabriel Hanot , editor of L'Équipe , began proposing the creation of a continent-wide tournament.  After Stan Cullis declared Wolverhampton Wanderers \"Champions of the World\" following a successful run of friendlies in the 1950s, in particular a 3–2 friendly victory against Budapest Honvéd , Hanot finally managed to convince UEFA to put into practice such a tournament.  It was conceived in Paris in 1955 as the European Champion Clubs' Cup .  , The first edition of the European Cup took place during the 1955–56 season.   Sixteen teams participated: Milan (Italy), AGF Aarhus (Denmark), Anderlecht (Belgium), Djurgården (Sweden), Gwardia Warszawa (Poland), Hibernian (Scotland), Partizan ( Yugoslavia ), PSV Eindhoven (Netherlands), Rapid Wien (Austria), Real Madrid (Spain), Rot-Weiss Essen ( West Germany ), Saarbrücken ( Saar ), Servette (Switzerland), Sporting CP (Portugal), Stade de Reims (France), and Vörös Lobogó (Hungary).   The first European Cup match took place on 4 September 1955, and ended in a 3–3 draw between Sporting CP and Partizan.   The first goal in European Cup history was scored by João Baptista Martins of Sporting CP.   The inaugural final took place at the Parc des Princes between Stade de Reims and Real Madrid.    The Spanish squad came back from behind to win 4–3 thanks to goals from Alfredo Di Stéfano and Marquitos , as well as two goals from Héctor Rial .    , Real Madrid successfully defended the trophy next season in their home stadium, the Santiago Bernabéu , against Fiorentina .   After a scoreless first half, Real Madrid scored twice in six minutes to defeat the Italians.    In 1958 , Milan failed to capitalize after going ahead on the scoreline twice, only for Real Madrid to equalize.   The final held in Heysel Stadium went to extra time when Francisco Gento scored the game-winning goal to allow Real Madrid to retain the title for the third consecutive season.    In a rematch of the first final, Real Madrid faced Stade Reims at the Neckarstadion for the 1958–59 season final , easily winning 2–0.    West German side Eintracht Frankfurt became the first non-Latin team to reach the European Cup final.   The 1959–60 season finale still holds the record for the most goals scored, but the record is overshadowed by the 7–3 thrashing Eintracht Frankfurt received in Hampden Park , courtesy of four goals by Ferenc Puskás and a hat-trick by Alfredo Di Stéfano.    This was Real Madrid's fifth consecutive title, a record that still stands today.  , Los Merengues reign ended in the 1960–61 season when bitter rivals Barcelona dethroned them in the quarter-finals.   Barcelona themselves, however, would be defeated in the final by Portuguese outfit Benfica 3–2 at Wankdorf Stadium .    Reinforced by Eusébio , Benfica defeated Real Madrid 5–3 at the Olympic Stadium in Amsterdam and kept the title for a second, consecutive season .    Benfica wanted to repeat Real Madrid's successful run of the 1950s after reaching the showpiece event of the 1962–63 European Cup , but a brace from Brazilian-Italian José Altafini at the Wembley Stadium gave the spoils to Milan, making the trophy leave the Iberian Peninsula for the first time ever.    Internazionale beat an ageing-Real Madrid 3–1 in the Ernst-Happel-Stadion to win the 1963–64 season and replicate their local-rival's success.    The title stayed in the city of Milan for the third year in a row after Inter beat Benfica 1–0 at their home ground, the San Siro .    , The UEFA Champions League anthem, officially titled simply as \"Champions League\", was written by Tony Britten , and is an adaptation of George Frideric Handel's Zadok the Priest (one of his Coronation Anthems ).   UEFA commissioned Britten in 1992 to arrange an anthem, and the piece was performed by London's Royal Philharmonic Orchestra and sung by the Academy of St. Martin in the Fields .  The chorus contains the three official languages used by UEFA: English, German, and French. The anthem's chorus is played before each UEFA Champions League game, as well as at the beginning and end of television broadcasts of the matches. The complete anthem is about three minutes long, and has two short verses and the chorus. For the 2009 UEFA Champions League Final in Rome, tenor Andrea Bocelli sang backing lyrics to the Champions League anthem, whilst similarly Juan Diego Flórez provided the tenor for the 2010 UEFA Champions League Final . Girl band All Angels performed at the 2011 UEFA Champions League Final . Jonas Kaufmann provided the tenor for 2012 UEFA Champions League Final , whilst David Garrett performed with his violin. The anthem has never been released commercially in its original version. , As of 2009 , the UEFA Champions League begins with a double round-robin group stage of 32 teams, which is preceded by two qualification 'streams' for teams that do not receive direct entry to the tournament proper. The two streams are divided between teams qualified by virtue of being league champions, and those qualified by virtue of finishing 2nd–4th in their national championship. , The number of teams that each association enters into the UEFA Champions League is based upon the UEFA coefficients of the member associations. These coefficients are generated by the results of clubs representing each association during the previous five Champions League and UEFA Europa League/UEFA Cup seasons. The higher an association's coefficient, the more teams represent the association in the Champions League, and the fewer qualification rounds the association's teams must compete in. , Five of the remaining ten qualifying places are granted to the winners of a four round qualifying tournament between the remaining 40 or 39 national champions, within which those champions from associations with higher coefficients receive byes to later rounds. The other five are granted to the winners of a two round qualifying tournament between the 15 clubs from the associations ranked 1 through 15, which have qualified based upon finishing second, third, or fourth in their respective national league. , In addition to sporting criteria, any club must be licensed by its national association to participate in the Champions league. To obtain a license, the club must meet certain stadium, infrastructure, and finance requirements. , In 2005–06 , Liverpool and Artmedia Bratislava became the first teams to reach the Champions League group stage after playing in all three qualifying rounds. In 2008–09 , both BATE Borisov and Anorthosis Famagusta achieved the same feat. Real Madrid holds the record for the most consecutive appearances in the group stage, having qualified 19 times in a row (1997-2016). They are followed by Manchester United on 18 (1996-2014)  and Arsenal on 18 (1998-2016).  , Between 2003 and 2008, no differentiation was made between champions and non-champions in qualification. The 16 top ranked teams spread across the biggest domestic leagues qualified directly for the tournament group stage. Prior to this, three preliminary knockout qualifying rounds whittled down the remaining teams, with different teams starting in different rounds. , An exception to the usual European qualification system happened in 2005, after Liverpool won the Champions League the year before, but did not finish in a Champions League qualification place in the Premier League that season. UEFA gave special dispensation for Liverpool to enter the Champions League, giving England five qualifiers.  UEFA subsequently ruled that the defending champions qualify for the competition the following year regardless of their domestic league placing. However, for those leagues with four entrants in the Champions League, this meant that, if the Champions League winner fell outside of its domestic league's top four, it would qualify at the expense of the fourth-placed team in the league. Until 2015-16, no association could have more than four entrants in the Champions League.  In May 2012, Tottenham Hotspur finished fourth in the Premier League , two places ahead of Chelsea, but failed to qualify for the 2012–13 Champions League , after Chelsea won the 2012 Champions League Final .  Tottenham were demoted to the Europa League for the 2012–13 season.  , The top three leagues in Europe are currently allowed to enter four teams into the Champions League. Michel Platini , the UEFA president, had proposed taking one place from the top three leagues and allocating it to that nation's cup winners. This proposal was rejected in a vote at a UEFA Strategy Council meeting.  In the same meeting, however, it was agreed that the third-placed team in the top three leagues would receive automatic qualification for the group stage, rather than entry into the third qualifying round, while the fourth-placed team would enter the play-off round for non-champions, guaranteeing an opponent from one of the top 15 leagues in Europe. This was part of Platini's plan to increase the number of teams qualifying directly into the group stage, while simultaneously increasing the number of teams from lower-ranked nations in the group stage.  , The tournament proper begins with a group stage of 32 teams, divided into eight groups. Seeding is used whilst making the draw for this stage, whilst teams from the same country may not be drawn into groups together. Each team meets the others in its group home and away in a round-robin format. The winning team and the runners-up from each group then progress to the next round. The third-placed team enters the UEFA Europa League . , For this stage, the winning team from one group plays against the runners-up from another group, and teams from the same association may not be drawn against each other. From the quarter-finals onwards, the draw is entirely random, without association protection. The tournament uses the away goals rule : if the aggregate score of the two games is tied, then the team who scored more goals at their opponent's stadium advances.  , The group stage is played from September to December, whilst the knock-out stage starts in February. The knock-out ties are played in a two-legged format, with the exception of the final. This is typically held in the final two weeks of May. , Starting with the 2015–16 edition, the winners of the UEFA Europa League will be entered into the Champions League, initially at the level of the playoff round, ensuring group stage participation in either competition. The maximum number of teams that an association can field in the tournament has also been increased from four to five.  , The UEFA Refereeing Unit is broken down into five experience-based categories. A referee is initially placed into Category 4 with the exception of referees from France, Germany, England, Italy, or Spain. Referees from these five countries are typically comfortable with top professional matches and are therefore directly placed into Category 3. Each referee's performance is observed and evaluated after every match; his category may be revised twice per season, but a referee cannot be promoted directly from Category 3 to the Elite Category.  , In co-operation with the UEFA Refereeing Unit, the UEFA Referee Committee is responsible for appointing referees to matches. Referees are appointed based on previous matches, marks, performances, and fitness levels. To discourage bias, the Champions League takes nationality into account. No referee may be of the same origins as any club in his or her respecting groups. Referee appointments, suggested by the UEFA Refereeing Unit, are sent to the UEFA Referee Committee to be discussed and/or revised. After a consensus is made, the name of the appointed referee remains confidential up to two days before the match for the purpose of minimising public influence.  , Since 1990, a UEFA international referee cannot exceed the age of 45 years. After turning 45, a referee must step down at the end of his season. The age limit was established to ensure an elite level of fitness. Today, UEFA Champions League referees are required to pass a fitness test to even be considered at the international level.  , Each year, the winning team is presented with the European Champion Clubs' Cup, the current version of which has been awarded since 1967. Any team that wins the Champions League three years in a row or five times overall wins the right to retain a full-sized replica of the trophy (UEFA retains the original at all times). Six clubs have earned this honour: Real Madrid, Ajax, Bayern Munich, Milan, Liverpool, and Barcelona. , The current trophy is 74 cm (29 in) tall and made of silver, weighing 11 kg (24 lb). It was designed by Jörg Stadelmann, a jeweller from Bern , Switzerland , after the original was given to Real Madrid in 1966 in recognition of their six titles to date, and cost 10,000 Swiss francs . , As of the 2012–13 season, 40 gold medals are presented to the Champions League winners, and 40 silver medals to the runners-up.  , As of 2015–16, UEFA awards €2 million to the play-offs winners and €3 million to the eliminated clubs in the play-off round. For reaching the group stage, UEFA awards a base fee of €12 million. A win in the groups is awarded with €1.5 million and a draw is worth €500,000. In addition, UEFA pays teams reaching the first knockout round €5.5 million, each quarter-finalist €6 million, €7 million for each semi-finalist, €10.5 million for the runners-up and €15 million for the winners.  , A large part of the distributed revenue from the UEFA Champions League is linked to the \"market pool\", the distribution of which is determined by the value of the television market in each country. For the 2012–13 season, Juventus , who were eliminated in the quarter-finals, earned nearly €65.3 million in total, of which €20.5 million was prize money, compared with the €55.0 million earned by Bayern Munich, who won the tournament and were awarded €35.9 million in prize money.  , Like the FIFA World Cup , the UEFA Champions League is sponsored by a group of multinational corporations, in contrast to the single main sponsor typically found in national top-flight leagues. When the Champions League was created in 1992, it was decided that a maximum of eight companies should be allowed to sponsor the event, with each corporation being allocated four advertising boards around the perimeter of the pitch, as well as logo placement at pre- and post-match interviews and a certain number of tickets to each match. This, combined with a deal to ensure tournament sponsors were given priority on television advertisements during matches, ensured that each of the tournament's main sponsors was given maximum exposure.  , From the 2012–13 knockout phase , UEFA have utilised the LED advertising hoardings installed in knock-out participant stadiums, including the final stage. It is planned to use such hoardings to play-off matches onwards.  , The tournament's current main sponsors are: , Adidas is a secondary sponsor and supplies the official match ball, the Adidas Finale , and referee uniform, as they do for all UEFA competitions.  Konami 's Pro Evolution Soccer is also a secondary sponsor as the official Champions League video game. , Individual clubs may wear jerseys with advertising. However, only one sponsorship is permitted per jersey in addition to that of the kit manufacturer (exceptions are made for non-profit organisations, which can feature on the front of the shirt, incorporated with the main sponsor or in place of it; or on the back, either below the squad number or on the collar area.  , If clubs play a match in a country where the relevant sponsorship category is restricted (such as France's alcohol advertising restriction), then they must remove that logo from their jerseys. For example, when Rangers played French sides Auxerre and Strasbourg in the 1996–97 Champions League and the UEFA Cup , respectively, Rangers players wore the logo of Center Parcs instead of McEwan's Lager .  , The competition attracts an extensive television audience, not just in Europe, but throughout the world. The final of the tournament has been, in recent years, the most-watched annual sporting event in the world.  The 2013 final was the most watched final to date, drawing 360 million television viewers.  , excluding qualifying games , As of 6 June, 2015.    , excluding qualifying games , As of 6 June 2015.  , Players in Bold are still active in Europe. "
}
