{
  "category": "nhl",
  "article": "                    , The Arizona Coyotes are a professional ice hockey team based in the Phoenix suburb of Glendale, Arizona . They compete in the National Hockey League 's (NHL) Pacific Division of the Western Conference . , Since December 2003, the Coyotes have played their home games at Gila River Arena after having spent 7½ seasons at America West Arena (now Talking Stick Resort Arena ) in downtown Phoenix. On June 10, 2015, the Glendale City Council voted to end their lease agreement with the Coyotes at Gila River Arena. The Coyotes have not announced where they will play the 2015–16 season.  , The Coyotes were founded on December 27, 1971, as the Winnipeg Jets of the World Hockey Association (WHA). After the WHA had ceased operations, they were one of four franchises absorbed into the National Hockey League and then granted membership on June 22, 1979. The Jets moved to Phoenix on July 1, 1996, and were renamed the Phoenix Coyotes . , The NHL took over ownership of the Phoenix Coyotes franchise in 2009 after owner Jerry Moyes (who had incurred massive financial losses since his purchase of the team in 2005) turned it over to the league after declaring bankruptcy . Moyes had attempted to privately sell the team to Canadian billionaire Jim Balsillie , who wanted to relocate the team to Hamilton, Ontario ,  but the NHL protested that the attempted sale was a violation of league policy and a court agreed.  During the next four years, the league vehemently resisted selling the team to interests that would have moved the team out of the Phoenix area, and on July 3, 2013, reached an agreement that will keep the team in Glendale for the near future. The sale to IceArizona Acquisition Co., LLC. was completed on August 5, 2013.  , On June 27, 2014, the team changed its franchise name to the \"Arizona Coyotes\" and modified its secondary logo.  , , , The team began play as the Winnipeg Jets , one of the founding franchises in the World Hockey Association (WHA). The Jets were the most successful team in the short-lived WHA, winning the Avco World Trophy , the league's championship trophy, three times and making the finals five out of the WHA's seven seasons. It then became one of the four teams admitted to the NHL as part of a merger when the financially struggling WHA folded in 1979. , However, the club was never able to translate its WHA success into the NHL after the merger. The merger's terms allowed the established NHL teams to reclaim most of the players that had jumped to the upstart league, and the Jets lost most of their best players in the ensuing reclamation draft. As a result, they finished last in the NHL during their first two seasons, including a nine-win season in 1980–81 that is still the worst in franchise history. They recovered fairly quickly, however, making the playoffs 11 times in the next 15 seasons. However, the Jets only won two playoff series, largely due to being in the same division as the powerful Edmonton Oilers and Calgary Flames . Because of the way the playoffs were structured for much of their Winnipeg run, the team was all but assured of having to defeat either the Oilers or the Flames (or both) to reach the Conference Finals. In 1984–85 , for instance, they finished with the fifth-best record in the league, only to be bounced by the Oilers in the division finals. Two years later , they dispatched the Flames in the first round, only to be eliminated again by the Oilers in the division finals. The franchise would not win another playoff series for 25 years. , The Jets ran into financial trouble when player salaries began spiraling up in the 1990s; this hit the Canadian teams particularly hard. Winnipeg was the second-smallest market in the NHL for most of the Jets' existence, and after the Quebec Nordiques moved to Denver in 1995 to become the Colorado Avalanche , it became the smallest market. In addition, the club's home arena, Winnipeg Arena , was one of the smallest in the league. Despite strong fan support, several attempts to keep the team in Winnipeg fell through. In December 1995, Jerry Colangelo , owner of the National Basketball Association 's Phoenix Suns , Phoenix businessmen Steven Gluckstern and Richard Burke, and a local investor group, bought the team with plans to move it to Phoenix for the 1996–97 season . After the franchise considered \"Mustangs,\" \"Outlaws,\" \"Wranglers\" and \"Freeze,\" a name-the-team contest yielded the nickname \" Coyotes .\" [ citation needed ] , In the summer that the move took place, Jets star Alexei Zhamnov left the team, while the team added established superstar Jeremy Roenick from the Chicago Blackhawks . Roenick teamed up with power wingers Keith Tkachuk and Rick Tocchet to form a dynamic 1–2–3 offensive punch that led the Coyotes through their first years in Arizona. Also impressive were young players like Shane Doan (as of the 2014–15 season the last remaining Coyote dating to the team's days in Winnipeg), Oleg Tverdovsky and goaltender Nikolai Khabibulin , whom the fans nicknamed the \"Bulin Wall.\" , Another key addition to the squad was veteran forward Mike Gartner , who had come over from the Toronto Maple Leafs . Despite his experience and scoring his 700th career goal on December 15, 1997, Gartner battled injuries in the latter half of the 1997–98 season. The Coyotes did not renew his contract, and he retired at the end of the season. , After arriving in Phoenix, the team posted six consecutive .500 or better seasons, making the playoffs in every year but one. The one time they didn't make the playoffs, in 2000–01 , they became the first team to earn 90 points and miss the playoffs. , The Coyotes' original home, America West Arena, was completely inadequate for hockey. Although considered a state-of-the-art arena when built for the Phoenix Suns, unlike most modern arenas, it was not designed with a hockey rink in mind. The floor was just barely large enough to fit a standard NHL rink, forcing the Coyotes to hastily re-engineer it to accommodate the 200 foot rink. The configuration left a portion of one end of the upper deck hanging over the boards and ice, obscuring almost a third of the rink and one goal from several sections. As a result, listed capacity had to be cut down from over 18,000 seats to just over 16,000 — the second-smallest in the league at the time — after the first season. , Burke bought out Gluckstern in 1998, but was unable to attract more investors to alleviate the team's financial woes (see below). In 2001, Burke sold the team to Phoenix-area developer Steve Ellman, with Wayne Gretzky as a part-owner and head of hockey operations. , The closest that they came to advancing past the first round during their first decade in Arizona was during the 1999 playoffs . After building a 3–1 series lead, The Coyotes would fall in overtime of Game 7 on a goal by Pierre Turgeon of the St. Louis Blues . In 2002 , the Coyotes posted 95 points, one point behind their best total as an NHL team while in Winnipeg, but went down rather meekly to the San Jose Sharks in five games. , From then until the 2007–08 season, the Coyotes were barely competitive and managed to break the 80-point barrier only once during that time. Attendance levels dropped considerably, worrying many league executives. In addition, an unfavorable arena lease at city-owned America West Arena had the team suffering massive losses  (as much as $40 million a year at one point  ); the Coyotes have yet to really recover from the resulting financial problems. , The team moved into Glendale Arena (now known as Gila River Arena ) about 2½ months into the 2003–04 NHL season . Ellman put forward numerous proposals to improve the hockey sight lines in America West Arena in hopes of boosting capacity back over the 17,000 mark. However, neither of these got beyond the planning stages, leading Ellman to commit to building a new arena. Simultaneously, the team changed its logo and uniforms, moving from the multi-colored kit to a more streamlined look. , In 2005, Ellman sold the Coyotes, the National Lacrosse League 's Arizona Sting and the lease to Gila River Arena to trucking magnate Jerry Moyes , who is also a part-owner of Major League Baseball 's Arizona Diamondbacks . , On August 6, 2005, Brett Hull , son of former Jet Bobby Hull , was signed and promptly assigned the elder Hull's retired #9. Two days later, Gretzky named himself head coach, replacing Rick Bowness , despite the fact that he had never coached at any level of hockey. The Coyotes \"Ring of Honor\" was unveiled on October 8, inducting Gretzky (who had never played for the organization) and Bobby Hull. Only a week later, Brett Hull announced his retirement. On January 21, 2006, Jets great Thomas Steen was the third inductee to the \"Ring of Honor.\" , Another moment in a series of bad luck: the Coyotes were planning to host the 2006 NHL All-Star Game , but the event was canceled because of the 2006 Winter Olympics . , The team returned to Winnipeg on September 17, 2006, to play a pre-season game against the Edmonton Oilers , but were shut-out 5–0 before a sellout crowd of 15,015. , On April 11, 2007, CEO Jeff Shumway announced that general manager Michael Barnett (Gretzky's agent for over 20 years), senior executive vice president of hockey operations Cliff Fletcher and San Antonio Rampage 's general manager and Coyotes' assistant general manager Laurence Gilman \"have been relieved of their duties.\" The Coyotes finished the 2006–2007 season 31–46–5, its worst record since relocating to Phoenix.  , On May 29, 2007, Jeff Shumway announced that Don Maloney had agreed to a multi-year contract to become General Manager of the Coyotes. As per club policy, terms of the contract were not disclosed.  However, as has been the case with all general managers since 2001, Maloney serves in an advisory role to Gretzky. , The 2007–08 season was something of a resurgence for the Coyotes. After their disastrous 2006–07 campaign, the Coyotes looked to rebuild the team by relying on their drafted talent such as Peter Mueller and Martin Hanzal to make the team successful as opposed to using free agency. The Coyotes also acquired Radim Vrbata from the Chicago Blackhawks for Kevyn Adams in an effort to provide the team with more offense. The team signed both Alex Auld and David Aebischer to compete for the starting goaltender position with Mikael Tellqvist acting as the backup goaltender. Neither Auld or Aebischer were able to hold on to the starting position, leaving the Coyotes to turn to the waiver wire for assistance. On November 17, 2007, the Coyotes were able to claim Ilya Bryzgalov off waivers from the Anaheim Ducks . Bryzgalov responded by not only starting in goal the day he was acquired, but posting a shutout in his Coyotes debut against the Los Angeles Kings . Bryzgalov was soon given a three-year contract extension because of his high level of play. Despite predictions of another disastrous season, the Coyotes played competitive hockey for most of the season. However, they finished eight points short of the last playoff spot, with 83 points. , In December 2008, the media became aware that the Coyotes were suffering massive losses, and the NHL was paying the team's bills. The media reports were minimized by NHL commissioner Gary Bettman and vice-president Bill Daly. However, Moyes had secretly given operational control of the team to the league. In May 2009, Moyes put the team into bankruptcy hours before Bettman was to present him an offer to sell the team to Chicago Bulls and Chicago White Sox owner Jerry Reinsdorf . Moyes intended to sell the team to Canadian billionaire Jim Balsillie who intended to purchase the team out of bankruptcy and move it to Hamilton, Ontario . The NHL responded by stripping Moyes of his remaining ownership authority. , From May until September 2009, hearings were held in Phoenix bankruptcy court to determine the fate of the Coyotes and the holding company. Two potential bidders for the team surfaced, Reinsdorf and Ice Edge Holdings. but they did not submit a bid for the team at the bankruptcy hearing. Instead, the NHL put in the only rival bid to Balsillie for the team, while it contended the Moyes-Balsillie deal violated NHL rules. The bankruptcy court voided the planned sale to Balsillie, accepting the league's argument that bankruptcy could not be used to circumvent league rules. The NHL's bid was also declared insufficient, but the judge left the window open to an improved bid. Moyes and the NHL settled, with the NHL buying the team and assuming all debts. The NHL negotiated a temporary lease with the city of Glendale, which owns Gila River Arena. , The NHL then negotiated with the Reinsdorf and Ice Edge to work out a deal with Glendale. Ice Edge signed a letter of intent to buy the team from the NHL, while Reinsdorf had won the approval of the City of Glendale. On Friday, May 7, 2010, ESPN.com reported that Reinsdorf bid had fallen apart, and the City of Glendale was working with Ice Edge to buy the team in a last-ditch effort to keep them in Arizona. The National Post criticized both bids, as they were conditional on municipal taxpayers covering any losses that the Coyotes might incur, and suggested that keeping the team in Phoenix was never economically viable.  , In July 2010, the Ice Edge bid collapsed, as it did not satisfy Glendale's financial conditions. Ice Edge decided to concentrate on an effort to buy a minor league team. The City of Glendale had to step in and guarantee the team's losses for 2010–11 as a precondition of the NHL not transferring the franchise. A consortium of investors led by Chicago investor Matt Hulsizer then reached a deal to purchase the Coyotes from the NHL along with a lease agreement with Glendale. However, the Hulsizer deal collapsed in late June 2011 at least in part due to a threatened suit by the Goldwater Institute over the legality of payments Glendale would make to Hulsizer prior to the consortium buying the team. The threat of the suit may have prevented the sale of bonds to finance the payments. The team only stayed in the Phoenix area for the 2011–12 season after another $25 million payment by the city of Glendale. , The 2012–13 NHL lockout provided another opportunity for the Coyotes to find a potential owner and avoid relocation while the league suspended team operations during the labor dispute. A deal to former San Jose Sharks owner Greg Jamison had been drafted just as the lockout ended, but failed to be finalized and fulfilled by January 31, 2013. The deal would have kept the Coyotes in Phoenix for the next 20 years relying on a tax payer subsidy, according to the agreement. It would also have had \"Phoenix\" dropped from the name and instead use the more inclusive term \"Arizona.\"  , California investment executive Darin Pastor also submitted a bid to buy the Coyotes. His bid proposed to keep the team in the Glendale area while engaging young hockey players in the region through school partnerships and scholarship efforts.  The NHL rejected Pastor's bid on May 13, 2013, citing the bid was \"inconsistent with what we had previously indicated were the minimum prerequisites\" of a bid.  , On September 24, 2009, Dave Tippett took over coaching duties of the Phoenix Coyotes after Wayne Gretzky stepped down hours before. In just 61 games, Tippett led the Coyotes to more wins in their 2009–10 regular season (37) than their previous season (36), en route to the first 50-win season in the franchise's NHL history. , On March 27, 2010, the Coyotes clinched a playoff spot, their first playoff spot since the 2001–02 season, and in the process, reached the 100-point mark for the first time ever as an NHL team, and the first time overall since the 1977–78 (WHA) Jets scored 102 points.  They finished with 107 points, the highest point total in the franchise's 38-year history. This was good enough for fourth overall in the league, tying the 1984–85 Jets for the franchise's highest finish as an NHL team. They also qualified for the fourth seed in the Western Conference, giving them home-ice advantage in the first round for the first time since 1985. , Their first round opponent in the 2010 Stanley Cup playoffs was the Detroit Red Wings . Game 1 of the series was the first NHL playoff game to be played in Gila River Arena. However, an injury to Shane Doan sidelined him for most of the series, and the veteran Red Wings defeated the Coyotes in seven games. , In the following year, the Coyotes played the Detroit Red Wings for the second straight postseason, in the first round of the 2011 Stanley Cup playoffs . The Coyotes were swept in four games. , On April 7, 2012, the Coyotes defeated the Minnesota Wild with a score of 4–1 to win the Pacific Division title—their first division title as an NHL team (in Winnipeg or Phoenix).  This gave them the third seed in the West, and with it home ice advantage in a playoff series for only the third time in franchise history. In the first round, they defeated the Chicago Blackhawks in six games, he franchise's first playoff series win since 1987. The first five games went to overtime, tying a record when the Montreal Canadiens and Toronto Maple Leafs did it in the 1951 Stanley Cup Final . They faced the Nashville Predators in the second round, winning the first two games and the series 4–1. However, the Coyotes fell to the Los Angeles Kings in game five of a 4–1 series. , Due to the team's bankruptcy status since 2009 and the annual revenue lost each year, the NHL planned to move the Coyotes should a deal with the city for a new lease and new ownership not be decided by July 2, 2013. The plan was to move the franchise to a new city, likely Seattle.  On July 2, 2013, by a vote of 4–3, the Glendale City Council approved a 15-year lease agreement with Renaissance Sports and Entertainment (RSE), who would purchase the team from the NHL for US$225 million by August 5, 2013.  The members of the Canadian group are Executive Chairman & Governor George Gosbee, President, CEO & Alternate Governor Anthony LeBlanc, Alternate Governor Craig Stewart, and Directors Gary J. Drummond, W. David Duckett, William \"Bill\" Dutton, Robert Gwin, Scott Saxberg and Richard Walter. RSE partnered with Global Spectrum (owners of the Philadelphia Flyers ) for help in managing Gila River Arena. The agreement has the city of Glendale giving RSE US$15 million per year for management fees. There is an agreement that RSE can move the team after five years, if it accrues $50 million US in losses.  , On January 29, 2014, the new ownership group announced that the team would change its name to the \"Arizona Coyotes\" for the 2014–15 season. According to Coyotes President Anthony LeBlanc, the change is being made to reflect that the team is no longer located within Phoenix city limits and to include all hockey fans in the state of Arizona. Aside from a new shoulder patch, the team's uniform design will not change.  , The Coyotes played their final game under the Phoenix moniker with a 2–1 victory over the Dallas Stars on April 13, 2014. In front of 15,146 fans, David Moss scored the final goal in Phoenix Coyotes history with 2:31 left in the regulation time.  , Following the conclusion of the 2013–14 season, it was reported that due to lackluster revenue from parking and non-hockey events, the City of Glendale would recoup just $4.4 million, which was significantly less than the $6.8 million the city expected to receive back from source including parking receipts, ticket sales and naming rights for the arena.  , On June 4, 2014, it was reported that a Scottsdale, Arizona , public-relations firm had sued IceArizona, the owner of the Phoenix Coyotes, alleging that the NHL club had reneged on a sponsorship deal worth nearly $250,000. A Coyotes' spokesman responded to this issue by calling it a \"quarter-million-dollar scheme.\"  By October, IceArizona entered a deal to sell 51% of the Coyotes to Philadelphia -based entrepreneur Andrew Barroway who had recently failed in his attempt to purchase the New York Islanders .  The deal was approved by the NHL Board of Governors on December 31, 2014.  During the 2014-15 season, the team finished last in the Pacific Division with the third-worst record in the NHL. On June 10, 2015 the Glendale, Arizona city council voted to terminate the arena lease agreement, which leaves an uncertain future for the team in Arizona.  , Upon their arrival in Phoenix in 1996, the team adopted a look with a strong Southwestern flavor. The primary logo was a stylized hockey stick-wielding coyote in a kachina -inspired style. The jerseys featured pointed green shoulders with brick red trim over a white (home) or black (road) body, and non-traditional striping patterns. These uniforms remained in place until 2003. A third jersey, primarily green with a nighttime desert landscape wrapped around the bottom and the cuffs of the sleeves, was introduced in 1998, and retired in 2003 when the team redesigned the uniforms. , As the NHL switched home and road jerseys beginning in the 2003–04 season, and coinciding with the team's move from America West Arena to the newly completed Glendale Arena, the Coyotes redesigned their look completely, adopting the current howling coyote head logo, while dropping several colors from the team's palette. Sedona red and white became the primary colors, with desert sand and black remaining as logo trim colors. A variation of these colors was later used for the Major League Baseball team Arizona Diamondbacks . The uniform's simplified two-color scheme with three stripes on each sleeve and the tail bears some resemblance to later versions of the Montreal Maroons jerseys. The team also changed its shoulder patch, taking the form of the outline of the state of Arizona, with an homage to the state flag and the abbreviation \"PHX\". This logo was worn only on the right shoulder leaving the left shoulder bare. , The Coyotes updated their jerseys for the 2007–08 season, along with all NHL teams, as part of the switchover to Rbk Edge jerseys. The changes made were adding an NHL crest just below the neck opening, removing the stripes that were previously just above the lower hem, and moving the \"PHX\" patch from the right to the left shoulder. The white jersey also gained red shoulder coloring and laces at the collar. The three-stripe pattern is applied to the side of the pants. , The Coyotes also added a third jersey for the 2008–09 season. It is primarily black and features a new alternate coyote logo on the front, with the primary logo (coyote head) patch on the right shoulder, and the \"Official Seal\" on the left.  Since white does not appear on the alternate, solid red pant shells are worn with this jersey. , Before the 2014-15 season, it was announced that the Coyotes third jersey would no longer be used. The patch on the home and away jerseys that used to read \"PHX\" would also be changed to read \"AZ\" to comply with the team's rebranded name.  , Howler is the coyote-suited mascot of the Arizona Coyotes. He was introduced on October 15, 2005. The Coyotes' official kids club is called Howler's Kids Club.  Howler wears number 96 on his jersey, representing the year the Winnipeg Jets moved to Arizona, and wears a \"M\" Designation for Mascot. He is known to beat on a bucket to encourage the fans to cheer, and has many different outfits in games. , This is a partial list of the last five seasons completed by the Coyotes. For the full season-by-season history, see List of Arizona Coyotes seasons . , Note: GP = Games played, W = Wins, L = Losses, OTL = Overtime Losses, Pts = Points, GF = Goals for, GA = Goals against , Records as of April 14, 2014. , Updated March 3, 2015.  , , Note: This list does not include selections of the Winnipeg Jets . , *The 1996 NHL Draft took place on June 22, and the Jets did not become the Coyotes until July 1, making Focht and Briere the two final first round selections of the Winnipeg Jets . , Note: This list includes scoring of the original Winnipeg Jets , including WHA seasons. , Note: Pos = Position; GP = Games Played; G = Goals; A = Assists; Pts = Points; P/G = Points per game; * = current Coyotes player , Jack Adams Award , King Clancy Memorial Trophy , Mark Messier Leadership Award , Note: This list does not include seasons of the 1972–1996 Winnipeg Jets . , In the NHL, each team may select a captain . Along with the two alternate captains, they have the \"privilege of discussing with the referee any questions relating to interpretation of rules which may arise during the progress of a game\".   Captains are required to wear the letter \"C\" on their uniform for identification, which is 3 inches (7.6 cm) high.  , Note: This list does not include captains from the Winnipeg Jets ( NHL & WHA ). , Only includes staff part of the Hockey Operations side. This list does not include staff on the business side. ,  , Media related to Arizona Coyotes at Wikimedia Commons "
}
