{
  "category": "nhl",
  "article": "               , The Edmonton Oilers are a professional ice hockey team based in Edmonton , Alberta . They are members of the Pacific Division of the Western Conference of the National Hockey League (NHL). , The Oilers were founded on November 1, 1971, with the team playing its first season in 1972 , as one of twelve founding franchises of the major professional World Hockey Association (WHA). They were originally intended to be one of two WHA teams in Alberta (the other one being the Calgary Broncos ). However, when the Broncos relocated to Cleveland, Ohio , before the WHA's first season began, the Oilers were renamed the Alberta Oilers. They returned to using the Edmonton Oilers name for the following year , and have been called that ever since. The Oilers subsequently joined the NHL in 1979 as one of four franchises introduced through the NHL merger with the WHA. , After joining the NHL, the Oilers went on to win the Stanley Cup on five occasions: 1983–84 , 1984–85 , 1986–87 , 1987–88 and 1989–90 . For their success in the 1980s, the Oilers team of this era has been honoured with dynasty status by the Hockey Hall of Fame .  , On November 1, 1971, the Edmonton Oilers became one of the 12 founding WHA franchises. The original team owner was Bill Hunter . Hunter owned the Edmonton Oil Kings , a junior hockey franchise.  He also founded the Canadian Major Junior Hockey League (now known as the Western Hockey League (WHL)).  Hunter's efforts to bring major professional hockey to Edmonton via an expansion NHL franchise had been rebuffed by the NHL. So, he looked to the upstart WHA instead. It was Hunter who chose the \"Oilers\" name for the new WHA franchise. This was a name that had previously been used as a nickname for the Edmonton Oil Kings in the 1950s and 1960s.  , After the newly founded Calgary Broncos folded prior to commencement of the inaugural WHA season, the Oilers were renamed the Alberta Oilers as it was planned to split their home games between Edmonton and Calgary . Possibly for financial reasons or to allow for a less complicated return of the WHA to Calgary, though, the team ultimately played all of its home games in the Edmonton Gardens and subsequently changed its name back to the Edmonton Oilers the following year.  They won the first game in WHA history 7–4 over the Ottawa Nationals .  , The Oilers drew fans with players such as defenceman and team captain Al Hamilton , goaltender Dave Dryden and forwards Blair MacDonald and Bill Flett . However, a relatively little-noticed move in 1976 would have an important impact on the history of the franchise. That year, journeyman forward Glen Sather was acquired by the Oilers.  It turned out to be his final season as a player. However, he was named player-coach late in the season, moving to the bench full-time after the season. Sather would be the coach or general manager of the Oilers for the next 23 years.  , The team's performance would improve in 1978 , when new owner Peter Pocklington acquired Wayne Gretzky as an under-age player (consequently, his first year of WHA experience prevented him from being an official 1979–80 NHL rookie ), as well as goaltender Eddie Mio and forward Peter Driscoll , from the recently folded Indianapolis Racers for cash.  Gretzky's first and only WHA season, 1978–79, saw the Oilers finish first in the WHA standings, posting a league-best 48–30–2 record.  However, Edmonton failed to win the championship, as they fell to the Winnipeg Jets in the Avco World Trophy Final. Dave Semenko of the Oilers scored the last goal in WHA history in the third period of the final game, which the Oilers lost 7–3.  , The Oilers joined the NHL for 1979–80 , along with fellow WHA teams Hartford Whalers , Quebec Nordiques and the Jets following a merger agreement between the two leagues. Of these four teams, only Edmonton has avoided relocation and renaming; the Nordiques became the Colorado Avalanche in 1995, the Jets became the Phoenix Coyotes in 1996 and the Whalers became the Carolina Hurricanes in 1997.  , The Oilers lost most of the players from 1978–79 when the NHL held a reclamation draft of players who had bolted to the upstart league as they were allowed to protect two goaltenders and two skill players.  Originally, Gretzky was not eligible to be protected; under the rules of the time, he normally would have been placed in the Entry Draft pool. However, Pocklington had signed him to a twenty-one year personal services contract in 1979 and Pocklington used the contract to force the NHL to admit the Oilers and allow the Oilers to keep Gretzky.  , The Oilers were mediocre during the regular season in their first two seasons, finishing sixteenth and fourteenth respectively. However, due to the fact that 16 of the 21 NHL teams made the playoffs at the time, the Oilers were still able to get their young players experience in the playoffs (they would make the playoffs for their first thirteen years in the NHL).  They won only one playoff series over this time span though, upsetting the Montreal Canadiens in 1980–81 . Gretzky set new NHL records in 1980–81 for assists (109)  and points (with 164).  Also, they still had great draft positions. This allowed the Oilers to put together a young, talented, experienced team quickly. Within three years, Sather and chief scout Barry Fraser had drafted several players who would have an important role in the team's success, including Mark Messier , Glenn Anderson , Jari Kurri , Paul Coffey , Kevin Lowe , Grant Fuhr and Andy Moog .  , The Oilers improved in 1981–82 , finishing second overall. Grant Fuhr emerged as the Oilers' starting goaltender, and he set a rookie record by going undefeated in twenty-three straight games.  However, Gretzky stole the show by setting the single season record for goals with ninety-two  and becoming the first player in NHL history to score 200 points (with 212).  Gretzky's accomplishments helped the Oilers become the first team to score four hundred goals in a season, a feat they would accomplish for five straight years.  However, the Oilers were upset by the Los Angeles Kings in five games (game three of this series, now known as the Miracle on Manchester , saw the Oilers take a 5–0 lead, only to lose 6–5 to the Kings in overtime).   , In 1982–83 , the Oilers finished third overall in the NHL. They advanced all the way to the Stanley Cup Finals (losing only once in the process) before getting swept by defending Stanley Cup Champions the New York Islanders .  During this season, Gretzky, Messier, Anderson, and Kurri all topped the 100 point plateau, with Coffey not far behind at 96.  After the season, Lee Fogolin resigned as captain of the Oilers, picking Gretzky as his successor.  , In 1983–84 , the Oilers finished first overall in the NHL, winning a franchise record fifty-seven games and earning 119 points (fifteen points ahead of the second place Islanders). They were the first team to feature three players with fifty goals (Gretzky, Kurri and Anderson).  Gretzky started off strong by scoring at least a point in the first fifty-one games of the season.  Paul Coffey became the second defenceman ever to score forty goals in a season (with forty exactly).  The Oilers scored a grand total of 446 goals as a team, an NHL record.  The Oilers were so determined to win the Stanley Cup that they hired Roger Neilson as a video analyst.  They started the playoffs strongly by sweeping the Winnipeg Jets in the Smythe Division semifinals. They faced a tougher test in the Calgary Flames , but they defeated them in seven games in the division finals. They then swept the Minnesota North Stars in the conference finals to earn a rematch with the Islanders in the Stanley Cup Finals . The Oilers split the first two games in Long Island, but then won three in a row in Edmonton to become the first former WHA team to win the Stanley Cup. After the series, Mark Messier was awarded the Conn Smythe Trophy as playoff MVP.  , Next year , the Oilers finished second overall in the NHL with 49 wins and 109 points. Wayne Gretzky led the NHL in goals with 73,  and Jari Kurri was close behind with a career high 71.  Gretzky also became the youngest player in NHL history to score one thousand points.  In the playoffs, the Oilers swept the Kings in the opening round and Jets in round two. They won the first two games of the Campbell Conference Finals against the Chicago Blackhawks , but lost the next two before winning the final two and returning to the Stanley Cup Finals. Edmonton lost the first game to Philadelphia, but won the next four to win the Stanley Cup for the second year in a row. Paul Coffey had a playoff performance to remember, setting records for most goals (twelve), assists (twenty-five), and points (thirty-seven) ever by a defenceman in a playoff year.  In addition, Jari Kurri tied Reggie Leach's record for most goals in a playoff year, with 19.  However, Gretzky won the Conn Smythe Trophy after setting the record for most points in a playoff year (forty-seven).  , Despite some off-season legal issues,  the Oilers were again the top team in the NHL during the 1985–86 regular season, with 56 wins and 119 points. They won the inaugural Presidents' Trophy , the trophy given to the team with the best regular-season record. Gretzky, Kurri, and Anderson each scored fifty goals again.  Kurri led the NHL in goals with 68, finishing with 131 points. Paul Coffey set a new record for most goals in a season by a defenceman (forty-eight), and he just missed setting a new record for points by a defenceman with 138 ( Bobby Orr scored 139 in 1970–71 ).   Gretzky also set records for assists (163) and points (215).  However, the Oilers failed to win their third straight Stanley Cup, as the Calgary Flames defeated them in seven games in the second round of the playoffs. In the third period of a 2–2 tie during game seven, Steve Smith , a rookie for the Oilers, accidentally sent the puck into his own net on his birthday. This goal stood as the game-and-series-winning goal.  , 1986–87 saw the Oilers capture their second straight President's Trophy with 50 wins and 106 points. Gretzky and Kurri were first and second in the NHL point scoring race, and Messier was fourth.  Edmonton returned to the Stanley Cup Final and faced the same opponent as they had in 1985, the Philadelphia Flyers. The Oilers took a 3 games to 1 lead in the series. However, strong goaltending by Flyers' rookie Ron Hextall forced a game seven. The Oilers still prevailed by a score of 3–1. In the post-game celebration, Gretzky immediately passed the Stanley Cup to Steve Smith, now vindicated after his costly miscue the previous season.  However, Hextall won the Conn Smythe Trophy.  , The Oilers began losing star players in 1987–88 . Paul Coffey sat out the first twenty-one games of the season before getting traded to the Pittsburgh Penguins .  Andy Moog also failed to report; he was tired of being Grant Fuhr's backup goalie. Moog played for the Canadian Olympic team in the 1988 Winter Olympics before getting traded to the Boston Bruins for Bill Ranford .  Despite the changes, the Oilers placed third overall in the NHL. Grant Fuhr started a league-record 75 games (this record has now been broken)  and posted a team-record 40 wins.  In the first round of the playoffs, the Oilers dispatched the third place Winnipeg Jets in five games. The Oilers then defeated first-overall Calgary in a sweep. In the Campbell Conference Final against the Detroit Red Wings , the Oilers prevailed in five games. The Oilers then swept the Boston Bruins in five games in a best-of-seven series. This occurred because of trouble during game four. With the score tied 3–3 with 3:23 to play in the second period, a power outage hit the Boston Garden , forcing cancellation of the entire game. The Oilers would win the next game (originally scheduled as game five) back in Edmonton 6–3 to complete the series sweep. However, all player statistics for the aborted game four in Boston are counted in the NHL record books. Gretzky won the Conn Smythe Trophy after leading the playoffs in scoring with forty-three points. After the Cup-clinching game, Gretzky implored his teammates, coaches, trainers, and others from the Oilers organization to join at centre ice for an impromptu team photo with the Stanley Cup. This started a tradition since continued by every subsequent Stanley Cup champion.  After the season, Fuhr was awarded the Vezina Trophy as the NHL's top goaltender.  , In a surprising and shocking trade, Gretzky, along with enforcer Marty McSorley and centre Mike Krushelnyski , were traded to the Los Angeles Kings on August 9, 1988. In exchange, the Oilers received US$15 million, young star Jimmy Carson , 1988 first round draft choice Martin Gelinas and the Kings' first round draft picks in 1989, 1991 and 1993. The trade occurred because Pocklington didn't want to risk Gretzky leaving Edmonton without getting anything in return. Gretzky had converted his personal services contract with Pocklington into a standard five-year player's contract with the Oilers in the summer of 1987 with an option to declare himself an unrestricted free agent after the 1988–89 season. During the 1987–88 season, Pocklington had approached Gretzky about renegotiating the contract, but Gretzky, unwilling to give up his chance at free agency, refused, which ultimately led to the trade. None of this was public knowledge at the time.  , However, the Oilers and their fans were still upset. Nelson Riis , the New Democratic Party leader in Canada's House of Commons , went so far as to ask the government to block the trade.  Several of the Oilers considered launching a team-wide strike, and even considered demanding that Pocklington sell the team.  , The loss of Gretzky had an immediate impact in 1988–89 , as the Oilers were only able to finish in third place in their division. Mark Messier was chosen to succeed Gretzky as captain.  Coincidentally, the Oilers' first round playoff opponent was Gretzky's Los Angeles Kings. Edmonton took a commanding 3–1 series lead, but Gretzky and the Kings fought back to win game seven 6–3 in Los Angeles. It was the first time since 1982 that the Oilers had been eliminated from the playoffs after only one round. , The Oilers underwent more changes during 1989–90 season. John Muckler replaced Glen Sather as head coach of the Oilers; Sather remained general manager and became the Oilers' president.  During training camp, Grant Fuhr came down with a severe case of appendicitis. He missed the first ten games of the season, and when he returned he suffered a shoulder injury that eventually sidelined him for the remainder of the season.  This marked the emergence of Bill Ranford as a starter. Four games into the season, Jimmy Carson decided the pressure of playing in Edmonton was too intense, and he was traded to Detroit with Kevin McClelland in exchange for Petr Klima , Adam Graves , Joe Murphy and Jeff Sharples .  The Oilers improved on their previous season, finishing with 38 wins and 90 points, good for fifth place overall in the NHL. Messier had 45 goals and 84 assists for 129 points, good for second in the NHL scoring race (behind only Gretzky).  , In the first round, the Oilers faced the Winnipeg Jets. Trailing the series 3–1 and trailing Game 5 by the identical score, the Oilers rallied to win the next three and take the series. In the division final, the Oilers met Los Angeles for the second-straight season. Edmonton swept the series 4–0, outscoring the Kings 22–10. The Oilers then met the Chicago Blackhawks in the Campbell Conference Final and fell behind 2–1 in the series. However, the Oilers won the next three games to earn a rematch of the 1988 Stanley Cup Finals with Boston. The Final will be remembered for Game 1, which still stands as the longest Stanley Cup Final game played in the modern NHL. Despite being soundly outshot by the Bruins, the Oilers won the game 3–2 when Petr Klima — benched for much of the game, and thus the only player on either team who not exhausted — scored at 15:13 of the third overtime period.  The Oilers would go on to defeat the Bruins in five games, and win their first Cup without Gretzky. For his superlative goaltending, Bill Ranford was awarded the Conn Smythe Trophy.  , The Oilers lost another important player before the 1990–91 season, as Jari Kurri chose to play the entire season with the HC Milano Devils . Grant Fuhr was also suspended for 60 games for drug abuse.  The season itself was not a great one for the Oilers: they finished with 37 wins and 80 points, good for third place in the Smythe Division. In the playoffs, the Oilers met the Flames in the opening round. In a thrilling series, the Oilers won the series in seven games, led by seven goals by Esa Tikkanen . Despite injuries suffered in the series with Calgary, they defeated the Los Angeles Kings in six games. Their success was unable to continue into the Conference Final, however, as they lost in five games to the Minnesota North Stars, who were making their Cinderella run . , The final star players from the Oilers left before the 1991–92 season. Grant Fuhr and Glenn Anderson were traded to Toronto,  Steve Smith was traded to Chicago,  and Jari Kurri was traded to Philadelphia.  Charlie Huddy was claimed by Minnesota in the expansion draft,  and Mark Messier was traded to the New York Rangers a day after the season began.  The Oilers even lost their head coach, as John Muckler left to become head coach and general manager of the Buffalo Sabres .  Ted Green replaced Muckler as head coach,  and Kevin Lowe succeeded Messier as captain.  , Despite the staggering amount of changes, the Oilers produced a comparable season to 1990–91, finishing third in the Smythe Division with 36 wins and 82 points. In the first round of the playoffs, the Oilers again met the Los Angeles Kings. Again, for the third time since the Gretzky trade, the Oilers defeated the Kings. In the next round, the Oilers defeated the Vancouver Canucks in six games to return to the Campbell Conference Final for the third straight season, this time facing the Chicago Blackhawks. However, the Oilers unexpected run in the playoffs came to a crashing halt, as the Blackhawks dominated every game and swept the series 4–0. , The departures of the stars from the 1980s exposed serious deficiencies in the Oilers' development system. The Oilers had done a poor job of drafting during the dynasty years,  and the younger players hadn't had nearly enough time to develop before the core of the 1980s dynasty left town. This didn't become apparent for a few years; as mentioned above, the Oilers still had enough heft to make the conference finals two years in a row. However, it was obvious that they were nowhere near being the powerhouse that had dominated the league in the previous half-decade. In 1992–93 , the Oilers missed the playoffs for the first time as an NHL team. They would not return to the post-season for four years, despite the emergence of young centremen Doug Weight and Jason Arnott . , In 1996–97 , the Oilers made the playoffs for the first time in five years, thanks to stellar goaltending by Curtis Joseph . In the first round, they upset the Dallas Stars , who had compiled the league's second best record, in a seven-game series. The Oilers won game seven on a goal by Todd Marchant in overtime . However, the Oilers surprise playoff run failed to continue, as the Colorado Avalanche defeated them in the next round. , In 1997–98 , Joseph led the Oilers to another first-round upset. After Colorado took a 3–1 series lead, the Oilers held them scoreless for eight straight periods en route to winning the series in seven games. Dallas and Edmonton met again in the second round, but this time, the Stars were the victors. The Oilers would make the playoffs in four of the next six years, but they were defeated after the first round every single time. , Despite their success over the past two seasons, the Oilers were in trouble off the ice. Owner Peter Pocklington had explored moving the Oilers to Minnesota during the 1990s. In 1998, Pocklington almost made a deal to sell the team to Leslie Alexander , the owner of the Houston Rockets of the National Basketball Association (NBA) who would have moved the team to Houston, Texas . On March 14, 1998, hours before the deadline to keep the team in Edmonton, the Edmonton Investors Group agreed to pay $70 million to buy the club.  The EIG were spearheaded by Cal Nichols , who had a commitment to retain NHL hockey in Edmonton. The deal was finalized, on May 5.  and thus prevented them from being the third Canadian team to move in the 1990s (the Winnipeg Jets and Quebec Nordiques had moved earlier in the decade). The Oilers received support from the NHL for this very reason.   , On November 22, 2003, the Oilers hosted the 2003 Heritage Classic , the first regular season outdoor hockey game in the NHL's history and part of the celebrations of the Oilers' 25th season in the NHL. The Oilers were defeated by the Montreal Canadiens 4–3 in front of more than 55,000 fans, an NHL attendance record, at Commonwealth Stadium in Edmonton. Unfortunately, the Oilers would fail to make the playoffs in the 2003–04 season. , The Oilers struggled with their small-market status for several years, but after the wiped-out 2004–05 season, they were aided by a Collective Bargaining Agreement (CBA) between the NHL owners and players. This included a league-wide salary cap that forced all teams to essentially conform to a budget, as the Oilers had been doing for years.  A more reasonable conversion rate of Canadian dollar revenues to U.S. dollar payroll in the new millennium also helped the Oilers to return to profitability.  Because of this, Edmonton was able to acquire Chris Pronger (former winner of the Hart and Norris Trophies)  and Michael Peca (two-time Frank J. Selke Trophy winner)  before the 2005–06 season .   , The team suffered from inconsistency during the first few months of the regular season, especially in goal and on offence. Goaltenders Ty Conklin and Jussi Markkanen were unreliable in net, and Peca also struggled with offence.    However, in-season acquisitions, such as defenceman Jaroslav Spacek ,  defenceman Dick Tarnstrom ,  goaltender Dwayne Roloson and left winger Sergei Samsonov ,  helped Edmonton finish the regular season with 95 points and clinch the final playoff spot in the Western Conference over Vancouver.  , In the first round of the playoffs, the Oilers played the Detroit Red Wings (winners of the Presidents' Trophy ).  Despite Detroit's much better regular season record, the Oilers pulled off a six-game upset for their first playoff series win since 1998.  Edmonton then met the San Jose Sharks in the Conference Semifinals. After trailing the series two games to none, the Oilers won the next four and became the first eighth-seeded team to reach a Conference Final since the NHL changed the playoff format in 1994 .  There, the Oilers would beat the sixth-seeded Mighty Ducks of Anaheim in five games, claiming the Clarence S. Campbell Bowl for a seventh time. , In the Stanley Cup Final , Edmonton met the Carolina Hurricanes . During Game 1, the Oilers blew a 3–0 lead, lost Dwayne Roloson for the series, after he suffered a knee injury and ultimately lost 5–4 when Carolina's captain Rod Brind'Amour scored after backup Ty Conklin misplayed the puck. From that game forward, the Oilers used Jussi Markkanen in net.  However, after trailing the series 2–0 and 3–1, the Oilers forced a seventh game with a 2–1 win in Game 3, a Fernando Pisani short-handed overtime winner in Game 5 and a 4–0 shutout for Markkanen in Game 6. The Oilers, however, could not complete the comeback as the Hurricanes won Game 7 by a score of 3–1 to capture their first-ever Stanley Cup.  , During the 2006 off-season, many Oilers left the team. Four days after their loss to the Hurricanes, Chris Pronger surprisingly issued a trade request for personal reasons. Pronger was subsequently traded to the Anaheim Ducks in exchange for Joffrey Lupul , Ladislav Smid and three draft picks.  Several Oilers left via free agency and during the season, long-time Oiler Ryan Smyth was traded to the New York Islanders for Ryan O'Marra , Robert Nilsson and a first round pick in the 2007 NHL Entry Draft ( Alex Plante ).  Not everyone left the team, however; the Oilers were able to re-sign Dwayne Roloson and Fernando Pisani. Having lost so many players, the Oilers posted a 32–43–7 record in 2006–07 , their worst record since the 1995–96 season, and eventually finished in 11th place in the Western Conference. Throughout the season, the Oilers lost various players to injury and illness; at one point, they had 11 players out of the line-up and had to rely on emergency call-ups to fill their roster.  , In 2007–08 , the Oilers had a 16–21–4 record after the first half of the season. However, they improved the second half of the year and went 25–14–2 in 41 games for a final record of 41–35–6. Nonetheless, this run not enough to qualify for the playoffs, as the Oilers finished three points out in ninth place. During the season, Daryl Katz , owner of the Rexall pharmaceutical company , purchased the Oilers from the Edmonton Investors Group.  The Oilers announced a restructuring of their hockey operations on July 30, 2008, which saw the promotion of Kevin Lowe to the role of president of hockey operations and the hiring of Steve Tambellini as their new general manager.  , The 2008–09 season saw the Oilers finish with a record of 38–35–9. However, that was only good enough for 11th in the West. One bright spot during the season, however, was Oilers goaltender Dwayne Roloson, as he became the oldest goalie to play 60 NHL games in one season.  After the season, the Oilers fired Head Coach Craig MacTavish and hired Pat Quinn as his replacement.  , Roloson left via free agency at the end of the season,  and the Oilers replaced him in goal with Nikolai Khabibulin .  The Oilers also worked out a trade with the Ottawa Senators for star right wing Dany Heatley , which would have seen Dustin Penner , Ladislav Smid and Andrew Cogliano go the other way, but Heatley refused a trade to Edmonton and was later acquired by San Jose.   Off-season moves failed to help the Oilers as they finished with the poorest record in the NHL in 2009–10 . It was also easily their worst season as an NHL team. , Following the season, Tom Renney replaced Quinn as the Oilers head coach.  The one advantage to such a bad season was that the Oilers were able to make the first pick in the 2010 NHL Entry Draft . The Oilers selected two-time Stafford Smythe Memorial Trophy winner Taylor Hall , from the Windsor Spitfires with their pick.  They used the off-season to begin the rebuild of the club around their young talent.  Patrick O'Sullivan was traded to Phoenix, in exchange for Jim Vandermeer , Robert Nilsson was bought out of his contract and Oilers captain Ethan Moreau was placed on waivers and claimed by the Columbus Blue Jackets . Along with these players, several others were allowed to enter free agency including Mike Comrie , Marc-Antoine Pouliot and Ryan Potulny . Also during the off-season, radio announcer Rod Phillips announced his retirement. Phillips had been the Oilers' play-by-play announcer since 1973–74 . Phillips would call ten specific games in 2010–11 before calling it quits.  The 2010–11 Oilers season would be documented in the series Oil Change . , The 2010–11 season would bring a new look to the Edmonton Oilers line-up, when Shawn Horcoff was selected to succeed Ethan Moreau as team captain. Horcoff had become the Oilers longest-serving player by this point.   Taylor Hall, Jordan Eberle and Magnus Paajarvi would all make their NHL debuts for the team. Despite the influx of their young talent, Edmonton would still find themselves at the bottom of the standings. In an attempt to gain valuable prospects and draft picks, Dustin Penner was traded from the Oilers to Los Angeles on February 28, 2011, in exchange for Colten Teubert , a first round draft pick in 2011 ( Oscar Klefbom ) and a conditional third-round pick in 2012 .  At the end of the season, the Oilers were at the bottom of the standings and received the right to choose first overall in the upcoming 2011 NHL Entry Draft . The Oilers selected Ryan Nugent-Hopkins with the first overall selection in the Draft, along with several other \"blue chip\" prospects. During the 2011 off-season, the team again made several moves to bolster the offence and defence, re-acquiring fan favourite Ryan Smyth from Los Angeles in exchange for Colin Fraser and a seventh-round draft pick.  The team also traded with the Anaheim Ducks to acquire Andy Sutton for Kurtis Foster . Sheldon Souray , who had played the entire 2010–11 season in the American Hockey League (AHL) with the Hershey Bears , was bought out of the last year of his contract.  These moves, coupled with the signings of Eric Belanger , Cam Barker , Ben Eager and Darcy Hordichuk , changed the complexion of the team, to add \"grit and toughness.\" However, the Oilers were again unable to qualify for the playoffs for the sixth-straight season, as they finished 14th in the Western Conference. , On May 17, 2012, a month after the ending of the 2011–12 season , the Oilers would announce they would not be renewing the contract of Head Coach Tom Renney.  The following month, Edmonton selected Nail Yakupov as the first overall pick at the 2012 NHL Entry Draft .  A week later, Ralph Krueger was named as the Oilers' new head coach on June 27, being promoted from his role as associate coach the season previous.  Three days later, Edmonton announced they had agreed to terms with sought-after free agent defenceman Justin Schultz .   , The 2012–13 season start, however, was delayed from its original October 11, 2012, date due to a labour lockout imposed by the NHL franchise owners after the expiration of the League's CBA. After a new labour agreement was reached between the owners and the National Hockey League Players' Association (NHLPA), training camps opened on January 13, 2013, and a 48-game season (reduced from 82 games) commenced on January 19. The Oilers would play their first game of the shortened season a day later, on January 20. , On January 23, to ensure of the health of the Edmonton Oilers in Edmonton and for the planned revitalization of downtown Edmonton, the City of Edmonton council voted 10–3 to the approval of a deal which will see a new $480 million arena built in Edmonton's downtown core for the start of the 2016–17 season. Rogers Communications announced it would have the naming rights to the new arena on December 3, 2013; the new 18,641-seat arena is to be called Rogers Place .   , After 41 games into the shortened season, and with the Oilers mathematically eliminated from the playoffs for a seventh successive time, Edmonton dismissed General Manager Steve Tambellini, whereupon he was replaced with former Head Coach Craig MacTavish.  Following the end of the season, on June 8, MacTavish fired Ralph Krueger after just one season as head coach.   Two days later, it was announced that Krueger was to be replaced by former Toronto Marlies head coach Dallas Eakins .    Some of MacTavish's first player moves as Oilers GM came at the 2013 NHL Entry Draft , as Edmonton would use their seventh overall selection to draft defenceman Darnell Nurse .  More moves came on July 5, during free agency, which saw MacTavish trade away captain Shawn Horcoff to the Dallas Stars in exchange for Philip Larsen . MacTavish also signed Andrew Ference , Boyd Gordon , Jason LaBarbera , Will Acton , Ryan Hamilton and Jesse Joensuu .  Ference was later announced as the 14th captain in Oilers NHL franchise history, on September 29.  Ales Hemsky and Ryan Smyth, who after the Horcoff trade became the last remaining members of the Oilers' 2006 Stanley Cup finalists still with the team, departed the Oilers franchise, as Hemsky was traded to the Ottawa Senators , on March 5, 2014.  Smyth (who had previously left the Oilers in 2007, but had returned in 2011) announced his retirement on April 11,  playing his final NHL game on April 13, where he was ceremoniously named team captain.  , On December 15, 2014, after 31 games into the 2014–15 season , MacTavish announced that Dallas Eakins was relieved of head coaching duties. MacTavish assumed the role of interim coach while Todd Nelson transitioned into the role for the remainder of the season. Nelson was previously serving as the head coach of the Oklahoma City Barons , the Oilers' then-AHL affiliation team.   Three days later, the Oilers released a statement, which would see their affiliation with the Barons cease operations at the end of the season.   , Following Edmonton's decision not to renew affiliation with the Barons, it was announced that the Oilers would be relocating their AHL franchise from Oklahoma City , Oklahoma , to Bakersfield , California . This move was announced on January 29, 2015, as part of the AHL's new Pacific Division, which would include the Oilers affiliation in Bakersfield.  The following month, on February 25, the team was given its new identity, the Bakersfield Condors .  On April 2, the Condors released their new logo.  , The Oilers won the 2015 Draft Lottery that took place on April 18, thus moving them from the third overall pick to first overall, marking their fourth lottery win in six seasons.  The Oilers used the pick to select Connor McDavid first overall in the 2015 NHL Entry Draft held in Sunrise, Florida on June 26. , On April 24, Craig MacTavish was removed from his position as general manager and was replaced by former Boston Bruins GM Peter Chiarelli ; Chiarelli was also appointed president of hockey operations as part of other related changes.  , On May 19, Todd McLellan was named the new head coach of the Oilers.  He and his former team, the San Jose Sharks, mutually agreed to part ways on April 20, after failing to qualify for the 2015 playoffs .  More coaching changes came on June 4, when it was announced that Keith Acton and Craig Ramsay had been relieved of their duties and would not be returning for the 2015–16 season.  In addition to these coaching changes, the Oilers also some changes to their scouting staff on June 22, which saw both head amateur and pro scouts, Stu MacGregor and Morey Gare relieved of their duties. Amateur scouts Brad Davis and Kent Hawley, pro scout Dave Semenko , and Billy Moores , who served as Director of Coaching and Special Projects, were also relieved of their duties.   , This is a partial list of the last five seasons completed by the Oilers. For the full season-by-season history, see List of Edmonton Oilers seasons , Note: GP = Games played, W = Wins, L = Losses, T = Ties, OTL = Overtime Losses/Shootout Losses, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes , The original 1972 design featured the now-traditional colours of blue and orange, but reversed from their more familiar appearance in later seasons, orange being the dominant colour and blue used for the trimming. For the first few games of the 1972 season, player names were not displayed on the uniform; rather the word \"ALBERTA\" was written in that space. About halfway through the season, though, the player names made their appearance, since the Oilers had played exclusively in Edmonton.  These jerseys also featured the player numbers high on the shoulders, rather than on the upper sleeve. , In the 1975–76 season , the jersey was changed to a blue base with orange trim. The logo that appeared on programs and promotional material remained the same. However, the logo that appeared on the home jersey had a white oil drop, on a dark orange field, with the team name written in deep blue. The away jersey featured an orange-printed logo. , When the team joined the NHL in 1979, the alternate logos were discarded, giving the jersey its most famous form. However, the logo appeared slightly differently on a few vintages of the jersey. Minor changes were also made to the numbering, lettering and collar in their first few NHL campaigns. From 1982 to 1989, Nike provided the Oilers' sweaters. , The essential design remained untouched until 1996, when the team colours were changed to midnight blue and copper with red trim. Other changes made to the jersey at that point were the removal of the shoulder bar and cuffs from the away jersey, and the addition of the \"Rigger\" alternate logo to the jersey's shoulders. A year later, the shoulder bars were removed from the home jersey as well, and the Oilers' sweater design then remained stable until 2007. , In 2001, the Oilers introduced their first alternate third jersey . Designed by then-minority owner Todd McFarlane and his production studio, the new uniforms were a radical departure from previous Oilers designs. The original Oilers logo was completely absent, along with copper and red; midnight blue was complemented with two shades of silver/grey, and the primary logo was a flying set of gears with an oil drop on top. Elements of the logo paid tribute to the five Stanley Cup titles and ten team captains to that point. A silver shield bearing \"OILERS\" above a variation of the oil-drop gear adorned the shoulders.   The jersey's sleeve numbers are located inside the white sleeve stripe. , In 2007, with the NHL's switch to Reebok Edge jerseys, the Oilers kept their team colours but changed the style of their jerseys. Most notable about the Edge jerseys were the removal of the waistline stripes in favour of vertical piping, and the sleeve stripes only appearing on the inside of the elbow panels. The \"Rigger\" was retired, along with the McFarlane third jersey and its associated logos. , In 2008, the Oilers introduced a new alternate jersey that closely resembled the blue-and-orange away jersey of the dynasty era. For the 2009–10 season , this jersey became the Oilers' main home jersey as blue and orange became the primary team colours once again. The old midnight blue-and-copper jersey became their alternate. On June 24, 2011, the Oilers presented their new white road jerseys at the 2011 NHL Entry Draft, when they selected Ryan Nugent-Hopkins first overall.  The midnight blue jersey remained as the third jersey before being dropped altogether in 2012. , The Oilers do not have a mascot, making them one of three NHL teams without one (the others being the New York Rangers and Philadelphia Flyers ).  , During the 2010–11 season , the Oilers introduced the Oilers Octane , the first cheerleading squad for a Canadian NHL team. The Oilers Octane consists of 19 women aged 18 to 29, most of whom are from the greater Edmonton area (within neighbouring suburbs), or the province of Alberta.  , The cheer team was, initially, not greeted with enthusiasm by all fans. Just over 1,500 people signed an online petition against it, suggesting the women do not improve the game experience and may in fact hinder it. Many felt the cheer team was a cheap public relations stunt and considered it disrespectful to women and completely unrelated to hockey.  , In addition to performing cheers at Oilers home games, helping with promotions and interacting with fans, the Octane members participate in charity fund raising and special events.  , Updated June 26, 2015.  , Note: This list includes Oiler captains from both the NHL and WHA . , * Ryan Smyth was named captain for his final NHL game , Note: This list includes coaches from the WHA. , These are the top-ten point, goal, and assist scorers in franchise history. Figures are updated after each completed NHL regular season. , Note: Pos = Position; GP = Games Played; G = Goals; A = Assists; Pts = Points; P/G = Points per game; G/G = Goals per game; A/G = Assists per game; * = current Oilers player , Note: This list includes WHA statistics. , Items marked in bold are NHL records. , Stanley Cup , NHL League Championship* , * prior to creation of the Presidents' Trophy in 1985–86 , Presidents' Trophy , Clarence S. Campbell Bowl , Art Ross Trophy , Conn Smythe Trophy , Hart Memorial Trophy , Jack Adams Award , James Norris Memorial Trophy , King Clancy Memorial Trophy , Lady Byng Memorial Trophy , Lester B. Pearson Award , NHL Plus/Minus Award , Vezina Trophy , , In addition to the national coverage of the Oilers on NHL on Sportsnet and Hockey Night in Canada , the regional coverage of the games are aired on television live on Sportsnet West and Sportsnet Oilers with its on air staff Kevin Quinn , Drew Remenda , Gene Principe . Like the Calgary Flames , those games are available in Alberta , Saskatchewan , Northwest Territories and Nunavut . , On radio, the games are aired on CHED called by Jack Michaels and Bob Stauffer and Reid Wilkins as reporter. Tom Gazzola is the reporter for the Oilers online. "
}
