{
  "category": "nhl",
  "article": "               , The Philadelphia Flyers are a professional ice hockey team based in Philadelphia , Pennsylvania . They are members of the Metropolitan Division of the Eastern Conference of the National Hockey League (NHL). Part of the 1967 NHL Expansion , the Flyers were the first expansion team in the post- Original Six era to win the Stanley Cup , victorious in 1973–74 and again in 1974–75 . , The Flyers' all-time points percentage of 57.7% (as of the 2014–15 NHL season [update] ) is the second best in the NHL, behind only the Montreal Canadiens ' 59.0%.  Additionally, the Flyers have the most appearances in the league semi-finals (known as the conference finals since the 1981–82 season) out of all 24 expansion teams (16 appearances, winning 8), and they are second behind the St. Louis Blues for the most playoff appearances out of all expansion teams (37 out of 47 seasons).  , The Flyers have played their home games on Broad Street since their inception, first at the Spectrum from 1967 until 1996, and then at the Wells Fargo Center from 1996 to the present. , The Flyers have had rivalries with several teams over the years. Historically, their biggest adversaries have been the New York Rangers , with an intense rivalry stretching back to the 1970s. They have also waged lengthy campaigns against the New York Islanders in the 70s and 80s, as well as the New Jersey Devils , with whom they traded the Atlantic Division title every season between 1994–95 and 2006–07 , and finally they enjoy a spirited rivalry with their cross-state brethren, the Pittsburgh Penguins . , Prior to 1967 Philadelphia had only iced a team in the NHL for one season when the financially struggling Pittsburgh Pirates re-located there in 1930 and played as the Quakers at The Arena at 46th and Market Streets. The club (which like the Flyers was garbed in orange and black) was coached by J. Cooper Smeaton , who 30 years later would be elected to the Hockey Hall of Fame in his far more accustomed role as an NHL referee. Among the young Quakers' skaters in 1930–31 was another future Hall of Famer in 19-year old rookie center Syd Howe . The Quakers' only \"claim to fame\" was to establish a single season NHL record for futility which has stood ever since by compiling a dismal record of 4–36–4, still the fewest games ever won in a season by an NHL club. The Quakers quietly suspended operations after that single dreadful campaign to again leave the Can-Am League's Philadelphia Arrows as Philadelphia's lone hockey team. The Quakers' dormant NHL franchise was finally canceled by the League in 1936.)   , In 1946, a group led by Montreal and Philadelphia sportsman Len Peto announced plans to put another NHL team in Philadelphia, to build a $2.5 million rink to seat 20,000 where stood the old Baker Bowl and to acquire the franchise of the old Montreal Maroons . The latter was held by the Canadian Arena Company, owner of the Montreal Canadiens . Peto's group, however, was unable to raise funding for the new arena project by the League-imposed deadline, and the NHL would cancelled the Maroons franchise.    , While attending a basketball game on November 29, 1964, at the Boston Garden , Ed Snider , the then-vice-president of the Philadelphia Eagles , observed a crowd of Boston Bruins fans lining up to purchase tickets to see a last-place ice hockey team.  He began making plans for a new arena upon hearing the NHL was looking to expand due to fears of a competing league taking hold on the West Coast and the desire for a new television contract in the United States. Snider made his proposal to the League, which chose the Philadelphia group — including Snider, Bill Putnam, Jerome Schiff and Philadelphia Eagles owner Jerry Wolman — over the Baltimore group. , On April 4, 1966, Putnam announced there would be a name-the-team contest.  Details of the contest were released on July 12.  The team name was announced on August 3.  , The new teams were hampered by restrictive rules that kept all major talent with the \" Original Six \" teams. In the NHL Expansion Draft , most of the players available were either aging veterans or career minor-leaguers before expansion occurred. Among the Flyers' 20 selections were Bernie Parent , Doug Favell , Bill Sutherland , Ed Van Impe , Joe Watson , Lou Angotti , Leon Rochefort and Gary Dornhoefer . Having purchased the minor-league Quebec Aces , the team had a distinctly francophone flavor in its early years, with Parent, Rochefort, Andre Lacroix , Serge Bernier , Jean-Guy Gendron , Simon Nolet and Rosaire Paiement among others. Beginning play in 1967–68 , the Philadelphia Flyers made their debut on October 11, 1967, losing 5–1 on the road to the California Seals .  They won their first game a week later, defeating the St. Louis Blues on the road, 2–1.  The Flyers made their home debut in front of a crowd of 7,812, shutting out their intrastate rivals, the Pittsburgh Penguins , 1–0 on October 19.  Lou Angotti was named the first captain in Flyers history, while Rochefort was the Flyers' top goal scorer after netting a total of 21 goals. With all six expansion teams grouped into the same division, the Flyers were able to win the division with a sub-.500 record despite being forced to play their last seven home games on the road due to a storm blowing parts of the Spectrum 's roof off.  Playoff success, however, did not come so quickly, as the Flyers were upset by St. Louis in a first round, seven-game series. , Angotti left the team in the off-season and was replaced by Van Impe as team captain. Led by Van Impe and the team-leading 24 goals of Andre Lacroix, the Flyers struggled during their sophomore season by finishing 15 games under .500. Despite their poor regular season showing in 1968–69 , they made the playoffs. They again lost to St. Louis, however, this time being dispatched in a four-game sweep. Not wanting his team to be physically outmatched again, owner Ed Snider instructed General Manager Bud Poile to acquire bigger, tougher players.  While Head Coach Keith Allen soon after replaced Poile as GM, this mandate eventually led to one of the most feared teams to ever take the ice in the NHL. The keystone of those teams was acquired when the Flyers took a chance on a 19-year-old diabetic from Flin Flon , Manitoba , Bobby Clarke , with their second draft pick, 17th overall, in the 1969 NHL Amateur Draft . Keeping to Snider's mandate, the team also drafted future enforcer Dave Schultz 52nd overall. , By the time training camp came around, it was clear that Clarke was the team's best player, and he quickly became a fan favorite. His 15 goals and 31 assists in his rookie season earned him a trip to the NHL All-Star Game . Despite his arrival, the team struggled in 1969–70 , recording only 17 wins — the fewest in franchise history (as of completion of the 2012–13 season — and set the NHL team record for most ties (24). They lost the tiebreaker for the final playoff spot to Oakland, missing the playoffs for the first time. , On December 11, 1969, the Flyers introduced what would become one of the team's best-known traditions: playing a recording of Kate Smith singing \" God Bless America \" instead of the \" The Star-Spangled Banner \" before important games. The perception was that the team was more successful on these occasions, so the tradition grew. The move was initially done by Flyers Promotion Director Lou Scheinfeld as a way to defray national tensions at the time of the Vietnam War : Scheinfeld noticed that people would regularly leave their seats and walk around during the anthem, but showed more respect and often sang along to \"God Bless America.\" To this day, the team plays the song before major playoff games, currently with Lauren Hart (daughter of Hall of Fame Flyers broadcast announcer Gene Hart ) performing the first part of the song, a recording of Smith singing the second part, and Lauren Hart joining the recording for the finale. As of the close of the 2013–14 season, the Flyers have a record of 96–28–4 when \"God Bless America\" is sung prior to Flyers home games.  , In 1970–71, the Flyers returned to the playoffs, but were swept by the Chicago Black Hawks in the first round. Even though the team had improved their record in his second season behind the bench, Head Coach Vic Stasiuk was replaced by Fred Shero in the off-season. Clarke continued to progress as he led the team in scoring in 1971–72 and became the first Flyer to win an NHL award, the Bill Masterton Memorial Trophy for perseverance, sportsmanship and dedication to hockey. However, in the season's final game, the Flyers needed a win or a tie against the second-year Buffalo Sabres to beat out Pittsburgh for the final playoff spot. The score was tied late in the game, but with just four seconds on the clock, former Flyer Gerry Meehan took a shot from just inside the blue line that eluded Flyers goaltender Doug Favell .  The Flyers lost the tiebreaker to Pittsburgh and missed the playoffs. As it turned out, it was the last time the Flyers missed the playoffs for 18 years. , It was during the 1972–73 season that the Flyers shed the mediocre expansion team label and became the intimidating Broad Street Bullies , a nickname coined by Jack Chevalier and Pete Cafone of the Philadelphia Bulletin on January 3, 1973  after a 3–1 brawling victory over the Atlanta Flames that led Chevalier to write in his game account, \"The image of the fightin' Flyers spreading gradually around the NHL, and people are dreaming up wild nicknames. They're the Mean Machine, the Bullies of Broad Street and Freddy's Philistines.\" Cafone wrote the accompanying headline, \"Broad Street Bullies Muscle Atlanta.\"  That same month, Clarke was the youngest player (at that time) in NHL history to be named team captain, replacing Ed Van Impe. Rick MacLeish became the first Flyer to score 50 goals in a season and the Flyers recorded their first winning season. An overtime goal by Gary Dornhoefer in Game 5 turned the tide of their first round series with the Minnesota North Stars in the Flyers' favor, as the Flyers got their first playoff series win in six games. They were outmatched in the semifinals by the Montreal Canadiens, however, losing in five games. After the season, Clarke was awarded the Hart Memorial Trophy as the NHL's Most Valuable Player . , Goaltender Bernie Parent returned to the franchise in the off-season, and the Flyers proved that the expansion teams could challenge the Original Six in 1973–74 . The Bullies continued their rough-and-tumble ways, led by Dave Schultz's 348 penalty minutes, and reached the top of the West Division with a record of 50–16–12. The return of Parent proved to be of great benefit, as he established himself as one of if not the best goaltender in the League after winning 47 games, a record which stood for 33 years.  Since the Flyers, along with Chicago, allowed the fewest goals in the League, Parent also shared the Vezina Trophy with Chicago's Tony Esposito . , Come playoff time, the Flyers swept the Atlanta Flames in four games in the first round. In the Semifinals, the Flyers faced the New York Rangers . The series, which saw the home team win every game, went seven games. Fortunately for the Flyers, they had home-ice advantage as they advanced to the Stanley Cup Finals by winning Game 7 and in the process made history by becoming the first expansion team to win a playoff series over an Original Six team. Their opponent, Bobby Orr and the Boston Bruins , took Game 1 in Boston , but Bobby Clarke scored an overtime goal in Game 2 to even the series. The Flyers then won Games 3 and 4 at home to take a 3–1 series lead, though Boston won Game 5 to stave off elimination. That set the stage for Game 6 at the Spectrum. The Flyers picked up the lead early when Rick MacLeish scored a first period goal. Late in the game, Orr hauled down Clarke on a breakaway, a penalty which assured the Flyers of victory. Time expired as the Flyers brought the Stanley Cup to Philadelphia for the first time. Parent, having shutout Boston in Game 6, won the Conn Smythe Trophy as the Playoff MVP. , Throughout the 1973–74 season, the Flyers often used a recording of Kate Smith singing \"God Bless America\" instead of the national anthem. Smith herself appeared before Game 6 to lead the crowd in the song, even miming a \"knockout punch\" after her performance. , In 1974–75 , Dave Schultz topped his mark from the previous season by setting an NHL record for penalty minutes with 472. Clarke's efforts earned him his second Hart Trophy and Parent was the lone recipient of the Vezina Trophy. The Flyers as a team improved their record slightly with a mark of 51–18–11, the best record in the NHL. After a first-round bye, the Flyers easily swept the Toronto Maple Leafs and were presented with another New York-area team in the Semifinals. The Flyers looked to be headed toward another sweep against the New York Islanders after winning the first three games. The Islanders, however, fought back by winning the next three games, setting up a deciding seventh game. The Flyers were finally able to shut the door on the Islanders, winning Game 7, 4–1. , Facing Buffalo in the Stanley Cup Finals , the Flyers won the first two games at home. Game 3, played in Buffalo, would go down in hockey lore as The Fog Game due to an unusual May heat wave in Buffalo that forced parts of the game to be played in heavy fog, as Buffalo's arena lacked air conditioning. The Flyers lost Games 3 and 4, but won Game 5 at home in dominating fashion, 5–1. On the road for Game 6, Bob Kelly scored the decisive goal and Parent pitched another shutout (a playoff record fifth shutout) as the Flyers repeated as Stanley Cup champions. Parent also repeated as the playoff MVP, winning a second consecutive Conn Smythe Trophy. , The highlight of the 1975–76 season had no bearing on the season standings. On January 11 at the Spectrum, the Flyers, as part of the Super Series '76 , played a memorable exhibition game against the Soviet Union 's dominant Central Red Army team. As the Bullies had put intimidation to good use the past three years, the Flyers' rugged style of play led the Soviets to leave the ice midway through the first period, protesting a hit on Valeri Kharlamov , whom Clarke had slashed on the ankle in the famous Summit Series '72 , by Ed Van Impe. After some delay, the Soviets returned after they were warned that they would lose their salary for the entire series. The Flyers went on to win the game rather easily, 4–1, and were the only team to defeat the Red Army outright in the series. After this win, the Spectrum was known as the \"most intimidating building to play in and has the most intimidating fans.\" Head Coach Fred Shero proclaimed, \"Yes we are world champions. If they had won, they would have been world champions. We beat the hell out of a machine.\"  , The Flyers recorded the best record in team history (points-wise) with a record of 51–13–16. The LCB line, featuring Reggie Leach at right-wing, Clarke at center and Bill Barber at left-wing, set an NHL record for goals by a single line with 141 (Leach 61, Clarke 30, Barber 50). Clarke, on his way to a third Hart Trophy, set a club record for points in one season with 119. Heading into the playoffs, the Flyers squeaked past Toronto in seven games and defeated Boston in five games, with Game 5 featuring a five-goal outburst by Leach, the \" Riverton Rifle ,\" to head to a third-straight appearance in the Stanley Cup Finals. However, the Flyers did not come close to a third straight championship without an injured Bernie Parent, as they ran into an up-and-coming dynasty in Montreal, and were swept in four-straight games. Despite the loss, Leach was awarded the Conn Smythe Trophy for scoring a record 19 goals in 16 playoff games. , Dethroned, the heyday of the Broad Street Bullies began to come to an end, as prior to the 1976–77 season , tough-guy Dave Schultz was traded to the Los Angeles Kings . Despite a slight drop-off in performance, the Flyers dominated the Patrick Division with what proved to be their fourth-straight division title. After disposing of Toronto in six games, the Flyers found themselves in the Semifinals for the fifth consecutive season. Pitted against Boston, the Flyers lost Games 1 and 2 at home in overtime and did not return home as they were swept in four-straight games. The Flyers lost their hold on the Patrick Division in 1977–78 and settled for second place. After sweeping the Colorado Rockies in two games in the preliminary round, the Flyers moved on to beat Buffalo in five games. They then faced Boston in the Semifinals for the second consecutive season, and lost again, this time in five games. Following the season, the Flyers were stunned when Head Coach Shero left to become general manager and head coach of the Rangers. As compensation for Shero, the Flyers received the Rangers' first-round draft pick in 1978. , Bob McCammon , who had just coached the Flyers' first year AHL Maine Mariners farm club to a Calder Cup title, replaced Fred Shero behind the bench. After a slow start in 1978–79 , the Flyers switched McCammon with Pat Quinn , Shero's previous assistant coach, who had replaced McCammon with the Mariners. Adding to the problems, Bernie Parent suffered a career-ending eye injury. The Flyers rallied under Quinn and finished in second place. Matched-up against the Vancouver Canucks in the preliminary round, the Flyers won the series in three games. The Flyers' season came to an end against Fred Shero's Rangers in a five-game Quarterfinal loss. , The Flyers began the 1979–80 season with a somewhat controversial move by naming Clarke a playing assistant coach and giving the captaincy to Mel Bridgman . While Clarke was against this initially, he accepted his new role. The Flyers went undefeated for a North American professional sports record 35-straight games (25–0–10), before losing 7–1 to the Minnesota North Stars, a record that still stands to this day.  The streak started after the team was 1–1 on October 14, and ended on January 7, 1980.  In doing so, the Flyers wrapped up the Patrick Division title with 14 games to spare and the first overall seed in the playoffs. Their regular-season success continued into the playoffs, as the Flyers swept a young Wayne Gretzky and his Edmonton Oilers in the first round, then went on to get revenge against Fred \"The Fog\" Shero and his Rangers by beating them in five before disposing of Minnesota in five to lock up a berth in the Stanley Cup Finals. Facing the Islanders for the Cup, the Flyers ultimately lost in six games on Bob Nystrom 's overtime Cup-winning goal. The end result of the series was marred by controversy, as the Islanders were offside on the play that resulted in their second goal, but the call was not made. Linesman Leon Stickle admitted after the game that he had blown the call.  , After the loss to the Islanders, the last of the Broad Street Bullies guard moved on. Gone were the likes of Leach, MacLeish, Dupont, Kelly, Jimmy Watson and finally Barber and Clarke in 1984, and taking their spots over the next few seasons were young talent such as Brian Propp , Tim Kerr , Dave Poulin , Pelle Lindbergh and Mark Howe , who upon arrival instantly became the Flyers' top defenseman for the next decade. , The Flyers made early playoff exits the next four years, including three first round exits in a row. After a tough, five-game preliminary round series win against the Quebec Nordiques , the team's 1980–81 season came to an end as they lost in the Quarterfinals to the Calgary Flames in seven games. They then lost to the Rangers two years in a row in 1981–82 and 1982–83 and then were swept by the Washington Capitals in 1983–84 . It was after the latter of these playoff losses that Bobby Clarke retired and was named vice-president and general manager of the team. , Mike Keenan , a relative unknown at the time, was hired in 1984 to coach the team, and named second-year player Dave Poulin team captain. Behind the goaltending of Pelle Lindbergh (who led the NHL with 40 wins and was the first European to win the Vezina Trophy),  the Flyers won a franchise-record 53 games — best in the League — during the 1984–85 season . The Flyers rolled through the playoffs by sweeping the Rangers in three games, defeating the Islanders in five and beating Quebec in six to return to the Stanley Cup Finals. Though they defeated the defending Stanley Cup champion Oilers in Game 1 by a score of 4–1 at home, Edmonton won the next four games and the series. A month into the 1985–86 season , Pelle Lindbergh was killed in a car accident. The team rallied and showed perseverance by garnering the best record in the Wales Conference and matching their win total (53) from the previous year. Tim Kerr scored 58 goals and the defense pairing of Howe and Brad McCrimmon led the League in plus-minus, a +85 and a +83, respectively. Bob Froese filled in admirably in net for Lindbergh, being named a second Team All-Star and sharing the William M. Jennings Trophy with teammate Darren Jensen . Despite their regular season success, an emotionally-exhausted Flyers team lost in the first round of the playoffs to the Rangers in five games. , In 1986 , the Flyers were rejuvenated by the ascension of 22-year-old goaltender Ron Hextall .  In his rookie season, he became the third Flyers goaltender to win the Vezina Trophy, joining Parent and Lindbergh. With Hextall providing the critical stops at crucial times, the Flyers captured a third-straight Patrick Division title, and were able to gain revenge on the Rangers by beating them in six games, as well as surviving a tough seven-game test from a gritty Islanders club. The Flyers then defeated the defending Stanley Cup champion Canadiens in a fiery six game series (notable for a famous bench-clearing brawl during the Game 6 warmup) to win the Wales Conference and return to the Stanley Cup Finals. As was the case two seasons prior, the Flyers became decimated by injuries, the most significant of which was losing Kerr for the remainder of the playoffs. After falling behind three games to one in the Stanley Cup Finals, the Flyers rallied from a two-goal deficit on the road in Game 5 to extend the series, then won Game 6 at home with another late-game comeback. However, they could not overcome the odds a third time and eventually succumbed to the Oilers, 3–1, in Game 7. Hextall was voted playoff MVP, the second time a Flyer won the Conn Smythe Trophy despite being on the losing team (the other being another Manitoban, Reggie Leach, in 1976).  , The Flyers stumbled in 1987–88 , finishing third in the Patrick Division (after a first-place finish the previous three years). Hextall became the first NHL goaltender to score a goal by firing the puck into an empty net in a December 8 game against Boston. In their first round playoff series with Washington, the Flyers blew a 3–1 series lead as Washington forced a Game 7. They then blew a 3–0 lead in Game 7 as Washington won in overtime 5–4. It was because of this playoff collapse that \"Iron Mike\" was fired. Paul Holmgren was named Keenan's replacement, the first time a former Flyer was named the club's head coach. Despite finishing at the .500 mark in 1988–89 , the Flyers made the playoffs for the 17th consecutive season. Facing first-place Washington in the first round, the Flyers pulled off the upset in six games. Ron Hextall managed to score another empty-net goal in the waning moments of Game 5, becoming the first NHL goalie to score a goal in the playoffs. The Flyers then defeated Pittsburgh in seven games to make the Wales Conference Finals before bowing out to Montreal in six games. , The 1989–90 season got off to a bad start for the Flyers, and continued to get worse. Hextall missed all but eight games due to suspension, contract holdout issues and injury, the suspension given for attacking Chris Chelios at the end of the Montreal playoff series the previous spring. Holmgren replaced Dave Poulin as captain in December with Ron Sutter , which led to Poulin's (and later that season, Brian Propp's) trade to Boston. As a result, the Flyers missed the Stanley Cup playoffs for the first time since 1972. Bob Clarke, having been with the Flyers organization since he was drafted in 1969, was fired and replaced as GM by Russ Farwell ; Clarke resurfaced with the Minnesota North Stars. Hextall continued to be hampered by injuries during the 1990–91 season . He only played in 36 games and as a result the Flyers missed the playoffs for the second consecutive year, finishing fifth in the Division and three points short of a playoff spot after a late-season collapse. , Prior to the 1991–92 season , the Flyers acquired Rod Brind'Amour from St. Louis. Brind'Amour led the Flyers in goals (33), assists (44) and points (77) in his first season with the club. With Ron Sutter gone to St. Louis in the Brind'Amour trade, Rick Tocchet was named team captain. As the Flyers continued to flounder, Paul Holmgren was fired midway through the season and replaced by Bill Dineen , father of Flyer Kevin Dineen . On February 19, the Flyers and Pittsburgh made a major five-player deal which featured Tocchet — who never grew comfortably into the role of captain — heading to Pittsburgh and Mark Recchi coming to Philadelphia. Recchi recorded 27 points in his first 22 games as a Flyer, but the team missed the playoffs for the third consecutive year, due in large part to an awful road record (10–26–4). With Tocchet traded, the Flyers would remain without a captain until Kevin Dineen was named to the post in 1993–94 , and instead went with three alternate captains. , In June 1992, the Flyers persuaded Clarke to return to the team as senior vice president after Jay Snider won the hard fought arbitration battle for 1991 first overall pick Eric Lindros against the Rangers. It was determined that Quebec had made a deal with the Flyers before making a deal with the Rangers. In order to acquire Lindros' rights, the Flyers parted with six players, trading Steve Duchesne , Peter Forsberg , Ron Hextall , Kerry Huffman , Mike Ricci , Chris Simon , a 1993 first-round draft pick ( Jocelyn Thibault ), a 1994 first-round draft pick ( Nolan Baumgartner ) and $15 million to Quebec. While Lindros became a preeminent star in Philadelphia, the trade proved heavily lopsided in favor of the Nordiques — soon to become the Colorado Avalanche — providing the core of their two Stanley Cup teams and an unprecedented eight-straight division championships, with Forsberg becoming a franchise player. , The trio of Lindros, Recchi and Brent Fedyk formed the Crazy Eights line in Lindros' first two years in the NHL, the eights being the player's jersey numbers (88, 8 and 18 respectively). In 1992–93 , Recchi set the franchise record for points in a season with 123 (53 goals and 70 assists) and Lindros scored 41 goals in 61 games. After struggling early, the Flyers made a run at the playoffs, but came four points short of the last spot. Head Coach Bill Dineen was fired at the season's end, while Clarke left town again to become general manager of the expansion Florida Panthers . , For 1993–94 , Terry Simpson was hired as the new head coach in hopes that the Flyers would finally return to playoff contention after four consecutive off-years. Recchi recorded 107 points (40 goals and 67 assists) and Lindros 97 (44 goals and 53 assists), while Mikael Renberg set a Flyers rookie record with 82 points. Offense was generated yet the Flyers still failed to clinch a playoff berth, again falling four points short of the final playoff spot. Jay Snider stepped down as president, forcing his father Ed Snider to take over day-to-day operations. The elder Snider had decided he had seen enough of Farwell as GM, and began courting Bob Clarke to leave his GM post with Florida to return to Philadelphia. Farwell's last move as GM was firing Simpson after a lackluster performance. , Bob Clarke returned to the general manager position prior to the 1994–95 season and immediately began putting his stamp on the team. New Head Coach Terry Murray replaced Kevin Dineen as team captain with Lindros prior to the start of training camp. In order to shore up the defense, Ron Hextall was re-acquired from the Islanders and high-scoring winger Recchi was traded to Montreal for Eric Desjardins , Gilbert Dionne and John LeClair early in the abbreviated season. The Flyers initially struggled out of the gate, going only 3–7–1 through their first 11 games while being outscored 34–22. Lindros and LeClair then teamed with Renberg to form the Legion of Doom line, a mix of scoring talent and physical intimidation. In their 37 games (including the 3–1 victory on February 11, 1995, against the New Jersey Devils), the Flyers went 25–9–3 and outscored their opponents 128–98 en route. Lindros tied Jaromir Jagr for the regular season scoring lead (though Jagr won the Art Ross Trophy with more goals), and captured the Hart Memorial Trophy as the league's MVP. The playoff drought came to an end as the Flyers won their first division title in eight years and clinched the second seed in the Eastern Conference. After dispatching Buffalo in five and sweeping the defending Stanley Cup champion Rangers, the Flyers were upset in the Eastern Conference Finals to the eventual Stanley Cup champion New Jersey Devils in six games. , Lindros eclipsed the 100-point mark for the first time in 1995–96 , gathering 115 points, and LeClair scored 51 goals, as the Flyers repeated as Atlantic Division champs and clinched the top seed in the East. Facing the eighth-seeded Tampa Bay Lightning , the Flyers dropped two of the first three games. They rallied by winning three straight games to win the series. After taking two of the first three games against their second-round opponent, Florida, the Flyers were defeated in overtime in Game 4 and double-overtime in Game 5. An upstart Florida club with stellar goaltending from John Vanbiesbrouck ended the Flyers' season in Game 6. The Flyers said goodbye to the Spectrum and prepared to open a new arena — the CoreStates Center — for the next season. , The 1996–97 season started off slowly, as Lindros missed 30 games, but LeClair still managed to score 50 goals for the second consecutive year. The mid-season acquisition of then-defenseman scoring leader Paul Coffey gave the Flyers a veteran presence.  Despite finishing just one point shy of a third straight Atlantic Division title, the Flyers blitzed their way through the first three rounds of the playoffs, dominating Pittsburgh, Buffalo and the Rangers all in five games apiece to win the Eastern Conference championship, and clinch a berth in the Stanley Cup Finals for the first time since 1986–87 . Despite having home ice advantage, the Flyers were swept in four-straight games by the Detroit Red Wings . The goaltending tandem of Hextall and Garth Snow fared poorly in the Finals, as both conceded soft goals, and Murray's strategy of alternating starters in goal was criticized. After Game 3 which was a 6–1 loss, Murray blasted his team in a closed-door meeting and then described to the media that the Flyers were in a \"choking situation,\" a remark which angered his players and likely cost Murray his job, as his contract was not renewed. , The man picked to replace Murray as coach, Wayne Cashman , was deemed ill-suited for the job as the Flyers played inconsistently throughout the 1997–98 season . With 21 games to go in the season, Roger Neilson took over as coach while Cashman was retained as an assistant. John LeClair was able to score at least 50 goals for the third consecutive year (netting 51), the first time for an American-born player, and goaltender Sean Burke was acquired at the trade deadline. Burke proved ineffective in net, as the Flyers were eliminated in the first round by Buffalo in five games. , In the off-season, the Flyers went looking for a new goaltender. Burke was let go and Hextall was about to enter his final season as a backup. They chose to sign former Panther John Vanbiesbrouck over former Oiler Curtis Joseph , who ended up signing with Toronto. The 1998–99 season was marred by a life-threatening injury sustained by Eric Lindros on April Fools' Day during a game against the Nashville Predators , a season-ending injury later diagnosed as a collapsed lung. Up until that point, Lindros was having an MVP-type season with 40 goals and 53 assists in 71 games. Without Lindros, the Flyers had trouble scoring in the playoffs even after having re-acquired Mark Recchi at the trade deadline. Although Vanbiesbrouck allowed nine goals to Joseph's eleven allowed, the Flyers lost their first round series with Toronto in six games. , 1999–2000 was one of the most tumultuous seasons in franchise history and the tumult actually started three months prior to the start of the regular season. In the span of a few days in July, longtime broadcaster Gene Hart died due to illness and defenseman Dmitri Tertyshny , coming off his rookie season, was fatally injured in a freak boating accident.  Head Coach Roger Neilson was diagnosed with bone cancer, forcing him to step aside in February 2000 to undergo treatment, so Assistant Coach Craig Ramsay took over as interim coach for the rest of the season; Neilson later recovered but was informed that he would not be returning. In January, longtime Flyer and fan favorite Rod Brind'Amour was shipped to the Carolina Hurricanes for Keith Primeau , with the intention of acquiring a big center to complement Lindros. Meanwhile, the strife between Flyers management (particularly Clarke) and Lindros, continued to worsen. Less than a month after Ramsay took over, Lindros suffered his second concussion of the season. He played several games after the initial hit and afterwards criticized the team's training staff for failing to initially diagnose the concussion after it happened. It was after this that the Flyers' organization decided to strip Lindros of the captaincy on March 27 and name defenseman Eric Desjardins the team's captain. , With Lindros out indefinitely, the Flyers rallied to overcome the distractions and a 15-point deficit in the standings to win the Atlantic Division and the top seed in the East on the last day of the regular season. They easily defeated their first round opponent, Buffalo, in five games. Primeau's goal in the fifth overtime of Game 4 against the team's second-round opponent, Pittsburgh, turned that series in the Flyers' favor as they won in six games, coming back from a 2–0 series deficit. After dropping Game 1 to New Jersey in the Eastern Conference Finals, the Flyers peeled off three-straight wins to take a 3–1 series lead. But New Jersey refused to give up. After New Jersey won Game 5, Lindros returned to the lineup for the first time since March for Game 6 in another losing effort. Early in Game 7, Lindros was on the receiving end of a controversial hit by Scott Stevens , giving him another concussion and leaving the Philadelphia crowd deflated. Without Lindros, the Flyers lost the decisive game by a score of 2–1. It was the second time in franchise history the team lost a series after being up three games to one. New Jersey went on to win the Stanley Cup. , Lindros would never wear a Flyers uniform again, as he sat out the season awaiting a trade. Also, Craig Ramsay retained the head coaching position as Neilson was not asked to return, which became a matter of some controversy. Ramsay only lasted until December when he was replaced by former Flyer great Bill Barber. Brian Boucher , who as a rookie backstopped the Flyers' playoff run the previous season, could not duplicate his performance in 2000–01 and therefore lost the starting goaltending job to Roman Cechmanek , a former star in the Czech Republic . The performance of Cechmanek, worthy of a Vezina nomination, helped the Flyers stay afloat, but they lost in the first round to Buffalo in six games. , In the off-season, the Flyers re-vamped their lineup by signing Jeremy Roenick and finally trading Lindros to the Rangers for Kim Johnsson , Jan Hlavac , Pavel Brendl and a 2003 third-round draft pick ( Stefan Ruzicka ). Desjardins stepped down as team captain eight games into the season and was replaced by Primeau. The Flyers began 2001–02 with high expectations and with Roenick leading the team in scoring, the Flyers finished with an Atlantic Division title. The power play was one of the NHL's worst however, so Adam Oates , the third leading point-producer in the League at the time, was acquired from Washington at the NHL trade deadline . It was of no benefit, however, as the Flyers could not muster much offense, scoring only two goals in their five-game, first-round playoff loss to the Ottawa Senators . It turned out there was much discontent in the locker room as Bill Barber was fired. The Flyers hired a proven winner when they turned to former Dallas Stars and Stanley Cup-winning Head Coach Ken Hitchcock . , In 2002–03 , Roman Cechmanek had a 1.83 goals against average (GAA) and the Flyers acquired Sami Kapanen and Tony Amonte prior to the trade deadline; however, they fell one point short of a second straight Atlantic Division title. As a result, the Flyers endured a long, brutal seven-game first round match-up with Toronto that featured three multiple overtime games, all in Toronto. After winning Game 7, 6–1, the Flyers fought Ottawa in the second round with equal vigor as they split the first four games of the series, Cechmanek earning shutouts in both wins. Cechmanek's inconsistency showed through, however, as he allowed ten goals in the final two games and Ottawa advanced in six games. Cechmanek was later traded to Los Angeles for a 2004 second round draft pick during the off-season despite having the second-best GAA in the League over his three years in Philadelphia. , Free-agent goaltender Jeff Hackett was signed from Boston to replace Cechmanek and challenge backup Robert Esche for the starter's spot in 2003–04 , but Hackett was forced to retire in February due to vertigo . During the course of the season, serious injuries suffered by both Roenick (broken jaw) and Primeau (concussion) in February forced the Flyers to trade for Chicago's Alexei Zhamnov , who filled in well and kept the Flyers afloat. On March 5, 2004, the Flyers set an NHL record in a game against Ottawa where they set a combined record of 419 penalty minutes in a single game . Esche entrenched himself as starter and remained in that position even after the Flyers re-acquired Sean Burke from the Phoenix Coyotes as the Flyers clinched the Atlantic Division title over New Jersey on the last day of the season. Though solid in net, Esche's performance was trumped by the play of captain Keith Primeau in the playoffs. Primeau led the Flyers past the defending Stanley Cup champion Devils in five, and Toronto in six on their way to the Eastern Conference Finals and a match-up with Tampa Bay. Despite winning Game 6 on the late-game heroics of Primeau and winger Simon Gagne , the Flyers came up short once again losing Game 7 in Tampa, 2–1. , With the NHL preparing for looming labor unrest, the Flyers let their leading scorer, Mark Recchi, leave for Pittsburgh during the off-season. Unsure about what the future would bring, the Flyers were unsure about Recchi's worth. The NHL lockout forced the cancellation of the 2004–05 NHL season. The Flyers were one of the more active teams once the NHL lockout came to an end. Replacing the high-profile names of Amonte, LeClair and Roenick were superstar Peter Forsberg , along with defensemen Derian Hatcher and Mike Rathje , as well as several players from the Calder Cup-winning Philadelphia Phantoms . When all was said and done, the team had experienced a turnover of nearly two-thirds of the roster. , The Flyers began the season with lofty expectations. Despite being hampered by injuries prior to and during 2005–06 , the Flyers lived up to those expectations in the first half of the season, reaching the top of the league standings in January while simultaneously holding a ten-point lead in the Atlantic Division. The Deuces Wild line of Forsberg, Gagne and Mike Knuble recorded 75, 79 and 65 points respectively while Gagne, with Forsberg feeding him, scored a career high of 47 goals. However, the injuries began to accumulate and take their toll, the most crippling of which was Keith Primeau season-ending concussion. The Flyers had been first in the league prior to the Olympic break, where an injury to Forsberg occurred. All told, the Flyers were third in the NHL with 388 man-games lost to injury, tops amongst playoff teams.  The second half of the regular season was defined by a record hovering around .500, sending the Flyers on a steady slide in the standings. The Flyers fell short of an Atlantic Division title, finishing second by tie-breaker to New Jersey, drawing the fifth seed in the Eastern Conference and a first round match-up with fourth-seeded Buffalo. The Flyers lost the series in six games. , The Flyers' 40th year anniversary season turned out to be the worst in franchise history. The Flyers traded Michal Handzus to Chicago, lost Kim Johnsson to free agency and Eric Desjardins and team captain Keith Primeau retired in the off-season. Peter Forsberg replaced Primeau as team captain, but a chronic foot injury developing in last season's Olympics had him in and out of the lineup throughout the season and limited his effectiveness. Eight games into the regular season and with a record of 1–6–1, General Manager Bobby Clarke resigned and Head Coach Ken Hitchcock was fired. Assistant Coach John Stevens replaced Hitchcock and Assistant General Manager Paul Holmgren took on Clarke's responsibilities on an interim basis. , The changes did little to improve the Flyers fortunes in 2006–07 as setting franchise records for futility became the norm. They had several multiple-game losing streaks including a franchise worst ten-game losing streak and a 13-game home losing streak that stretched from November 29 to February 10. Ultimately, the Flyers finished with a 22–48–12 record — the most losses and the worst winning percentage in franchise history, and the worst record in the League. They also set the NHL record for the biggest points drop off in the standings in a one-year span (101 points in 2005–06 to 56 points in 2006–07, a difference of 45 points). The Flyers were left further dejected as they lost the NHL draft lottery and were demoted to the second overall selection. , With the team clearly on the verge of missing the playoffs for the first time in 13 years, Paul Holmgren set his sights on rebuilding the team and preparing for the future. Forsberg, unwilling to commit to playing next season, was traded to Nashville for Scottie Upshall , Ryan Parent and 2007- first and third-round draft picks at the deadline. Veteran defenseman Alexei Zhitnik was traded to the Atlanta Thrashers for prospect defenseman Braydon Coburn , while disappointing off-season acquisition Kyle Calder was sent to Detroit via Chicago in exchange for defenseman Lasse Kukkonen . The Flyers also acquired goaltender Martin Biron from Buffalo for a 2007 second-round pick. Given wide praise for his efforts, the Flyers gave Holmgren a two-year contract and removed the interim label from his title. Throughout the season, the fans remained faithful, with the average attendance dropping to 19,283, a mere 253 less than 2009–10, when the Flyers would win the Eastern Conference.  , The Flyers began the 2007–08 season with the intention of putting the disaster of the previous season behind them. In June, the Flyers made a trade that sent the first round draft pick they had acquired in the Forsberg trade (23rd overall) back to Nashville in exchange for the rights to negotiate with impending unrestricted free agents Kimmo Timonen and Scott Hartnell . Both were subsequently signed to six-year contracts. After much speculation as to whether the Flyers would trade the second overall pick in the 2007 NHL Entry Draft , the Flyers opted to keep the pick, using it to select New Jersey native James van Riemsdyk . , The Flyers wasted no time in addressing their free agent needs. On July 1, the Flyers signed Buffalo co-captain Daniel Briere to an eight-year, $52 million contract. Continuing to revamp their defensive core, Joni Pitkanen and Geoff Sanderson were traded to Edmonton in exchange for Oilers captain Jason Smith and Joffrey Lupul . Smith was later named Flyers captain on October 1. , The season began in the image of the Broad Street Bullies era, with multiple-game suspensions handed out to five separate players, the most serious being 25-game suspensions to both Steve Downie and Jesse Boulerice for two separate incidents. A 7–3 start in October and a 9–3–1 January run had the Flyers near the top of both the Division and Conference standings. However, a disastrous ten-game losing streak in February, reminiscent of such a streak the previous season, nearly derailed the Flyers' year. An 8–3–4 run in Marchm coupled with two huge wins over New Jersey and Pittsburgh over the final weekend of the regular season, put the Flyers back in the 2008 playoffs as the sixth seed, setting-up a first round matchup with Washington. After taking a three games to one lead over the Capitals, Washington then won Games 5 and 6 to force a deciding Game 7 in Washington. After an evenly-fought game, the Flyers ultimately won the series in overtime via a Joffrey Lupul powerplay goal. The Flyers then drew a matchup with heavily-favored Montreal in the second round. Despite being outshot a majority of the series, the Flyers upset the Canadiens in five games, advancing to the Eastern Conference Finals for the first time since 2003–04 to face Pittsburgh. Before the start of the series, the Flyers suffered a fatal blow when it was learned that Kimmo Timonen was out with a blood clot in his ankle. Coupled with a gruesome facial injury to Braydon Coburn in Game 2, Pittsburgh ran roughshod over the Flyers' depleted defense and jumped out to a 3–0 series lead. The Flyers won Game 4 at home to stave off elimination, and although Timonen returned for Game 5, Pittsburgh finished off the Flyers in five games. , The Flyers began the 2008–09 season by naming Mike Richards the 17th captain in team history on September 17, with Jason Smith having departed to Ottawa as a free agent. The Flyers were looking to build on the success of the previous season, but instead got off to an 0–3–3 start. However, despite a solid December and January and finishing with four points more than the year before, for the most part the 2008–09 Flyers played inconsistently and looked like different teams, playing at the top of their ability one night and a subpar performance the next. Derian Hatcher missed the entire regular season and playoffs with a knee injury, and Steve Downie was traded to Tampa Bay with Steve Eminger , who they had previously acquired in a trade with Washington prior to the season for defenseman Matt Carle . Two pleasant surprises were the emergence of rookie center Claude Giroux and defenseman Luca Sbisa , who was drafted by the Flyers in June with the 19th overall pick acquired from the Columbus Blue Jackets in exchange for R. J. Umberger , a victim of team salary cap constraints. Scottie Upshall also found himself the victim of such a crunch; he was traded to Phoenix in exchange for Daniel Carcillo at the NHL trade deadline . , Despite holding on to the fourth seed in the East for much of the season, thanks to a 4–5–1 finish to the season, highlighted by a home loss to the Rangers on the last day of the regular season, the Flyers slipped to the fifth seed and lost home-ice advantage in their first round series with Pittsburgh. Pittsburgh dominated the Flyers in Game 1, and despite a better effort by the Flyers in Game 2, Pittsburgh came to Philadelphia with a 2–0 series lead. The Flyers were the better team in Games 3 and 4, but Pittsburgh gained a split in Philadelphia and took a 3–1 series lead. After a decisive 3–0 win in Game 5, the Flyers jumped out to a 3–0 lead in Game 6, but promptly fell victim to the inconsistencies that plagued the team all season and gave up five unanswered goals in a season-ending 5–3 loss. Claud Giroux led the team in scoring in the playoffs. Jeff Carter ended the regular season with 46 goals, second in the NHL after Washington's Alexander Ovechkin . Captain Mike Richards just missed out on the Frank J. Selke Trophy in the closest vote in the history of the award. , The Flyers began the 2009–10 season with some major changes, allowing goaltenders Martin Biron and Antero Niittymaki to depart via free agency, replacing them with former Ottawa netminder Ray Emery and former Flyer Brian Boucher, and significantly upgrading the defense with the addition of Chris Pronger from Anaheim. Pronger came at a price, however, costing the Flyers Joffrey Lupul, Luca Sbisa and the Flyers' first-round draft picks in both 2009 and 2010 . The season began in earnest, though it soon unravelled with mediocre play that cost Head Coach John Stevens his job in December. Peter Laviolette was hired as his replacement in order to reinstitute accountability and restore success to the Flyers, though the results were not immediate; the Flyers suffered a 2–7–1 stretch immediately following his arrival. Injuries took a major toll on the Flyers, with Blair Betts , Daniel Briere, Jeff Carter, Simon Gagne and Kimmo Timonen all missing significant amounts of games, though no position was nearly affected as much with injuries as goaltending. Emery suffered a hip injury in December, played sporadically afterwards and ultimately underwent season-ending surgery. Boucher suffered a hand injury shortly thereafter, which allowed journeyman goaltender Michael Leighton to step in and make an immediate impact. Leighton went 8–0–1 in his first ten starts, including a tough 2–1 overtime loss in the 2010 Winter Classic to Boston at Fenway Park on New Year's Day. Leighton, however, was forced out of the line-up in March with a high ankle sprain, necessitating Boucher's return as starter. All told, seven different goaltenders suited up for the Flyers at various points throughout the year. Mediocre play down the stretch forced the Flyers into a do-or-die shootout with the Rangers in what could have been their final game of the year, with the contest being hosted at the Wachovia Center. Boucher stopped final shooter Olli Jokinen to clinch the seventh seed in the East and a first round matchup with New Jersey. , Boucher and the Flyers consistently outplayed Martin Brodeur and New Jersey and pulled off the upset in five games. However, the victory was costly, as Carter suffered a broken foot and Gagne a broken toe in Game 4, while Ian Laperriere suffered a grievous facial injury by blocking a shot in Game 5. The Flyers then faced sixth-seeded Boston in the second round, and despite playing at an even level with the Bruins, the Flyers found themselves in a 3–0 series deficit. Gagne returned in Game 4 and scored in overtime to force a Game 5, which the Flyers won convincingly, 4–0. Boucher suffered MCL sprains during the game in both knees which forced Leighton back into net in his first time suiting up since March. Boucher and Leighton became the first goalies since 1955 to share a playoff shutout. A 2–1 Flyers win in Game 6 forced a Game 7 in Boston. Falling behind 3–0 in Game 7, the Flyers pulled off the biggest comeback in both franchise and League history, winning 4–3 on a late goal by Gagne to join Maple Leafs in 1942 , Islanders in 1975 and the Boston Red Sox in 2004 as the only sports teams to win a playoff series after trailing 3–0. , In the Eastern Conference Finals, the Flyers had home-ice advantage as they faced eighth-seeded Montreal. Leighton became the first Flyers netminder to record three shutouts in a series, and Carter and Laperriere returned to the lineup as the Flyers won the Eastern Conference Championship in five games, advancing to the Stanley Cup Finals for the first time since 1997 to face the Chicago Blackhawks. Dropping two close games in Chicago , the Flyers returned home to win Game 3 in overtime and Game 4 to even the series. A convincing 7–4 win by Chicago in Game 5, however, put the Flyers one game away from elimination. A late Scott Hartnell goal in Game 6 forced overtime, but Patrick Kane scored just over four minutes into overtime to eliminate the Flyers and give Chicago their first Stanley Cup since 1961 . Ville Leino , acquired in a mid-season trade from Detroit, set the Flyers rookie playoff scoring record and tied the NHL record with 21 points. Daniel Briere led the NHL playoff scoring race with 30 points, one point ahead of Conn Smythe Trophy winner, Jonathan Toews . , Coming off the close loss to Chicago in the Finals, the Flyers traded Gagne to Tampa Bay to clear up cap space, acquired Andrej Meszaros from Tampa Bay in a separate trade and signed free agent Sean O'Donnell to shore up the defensive corps. The Flyers started the 2010–11 season with rookie goaltender Sergei Bobrovsky from the Kontinental Hockey League (KHL) in Russia , who recorded an opening-night win in his NHL debut against Pittsburgh and had steady numbers throughout the season. Boucher remained as the team's backup goaltender, while Leighton played one game in December after recovering from a back injury before being demoted to Adirondack in the American Hockey League (AHL). The Flyers led both the Atlantic Division and Eastern Conference for the majority of the season, and challenged Vancouver for the overall NHL lead. Kris Versteeg was brought in from Toronto to add additional offense for the stretch drive and playoffs. However, lackluster play throughout March and April, coupled with a broken hand suffered by Chris Pronger in late February that ended his regular season, cost the Flyers the top seed in the East during the last week of the regular season, although the Flyers hung on to win their first Atlantic Division title since 2003–04 and clinched the second seed in the East. , The Flyers drew Buffalo in the first round. Bobrovsky played well in a 1–0 Game 1 loss, but was replaced in Game 2 by Boucher, who held on for a 5–4 Flyers win. Boucher played well in a Game 3 win and a Game 4 loss, but was replaced himself in a favor of Leighton during a bad first period in Game 5, which Buffalo won in overtime. Pronger returned to the lineup and Leighton started Game 6 but was replaced by Boucher after a poor first period, though nonetheless the Flyers went on to win in overtime and forced a Game 7, which Boucher started. The Flyers dominated Buffalo, 5–2, and became the first team to win a playoff series starting three different goaltenders since 1988 . The Flyers then drew a rematch with the Boston Bruins in the second round. Boston dominated the Flyers in Game 1, where Boucher was again replaced, this time by Bobrovsky. Pronger again left the lineup with an undisclosed injury, while Boston won Game 2 in overtime and again dominated the Flyers in Game 3 to take a 3–0 series lead. Bobrovsky started Game 4, but there would be no such comeback like their previous meeting as Boston completed the sweep of the Flyers. The Flyers tied an NHL record with seven playoff in-game goalie changes, and were the only NHL team not to record a shutout in either the regular season or playoffs. , Following his penchant for making big moves, Flyers General Manager Paul Holmgren pulled off perhaps the most stunning move of his tenure, trading Mike Richards to the Los Angeles Kings for Brayden Schenn , Wayne Simmonds and a 2012 second-round draft pick; and Jeff Carter to Columbus for their 2011 first-round pick (with which the Flyers selected Sean Couturier ), 2011 third-round pick (with which the Flyers selected Nick Cousins ) and Jakub Voracek , all within the span of one hour on June 23. Later that same day, Holmgren addressed the Flyers' long-standing goaltending issues by signing the Phoenix Coyotes ' Ilya Bryzgalov to a nine-year, $51 million contract. On July 1, the Flyers signed Jaromir Jagr to a one-year contract, Maxime Talbot to a five-year contract and Andreas Lilja to a two-year contract. Additionally, Chris Pronger was named Flyers captain; however, 13 games into the 2011–12 season , he was lost for the remainder of the regular season and playoffs with severe post-concussion syndrome. Bryzgalov's play ranged from spectacular to subpar, including being benched in favor of Sergei Bobrovsky for the Flyers' 3–2 loss to the New York Rangers in the 2012 Winter Classic , but also being named NHL First Star for the month of March. Twelve rookies suited up for the Flyers during the season, with the play of Couturier, Schenn and Matt Read standing out impressively. , The Flyers drew Pittsburgh in the first round of the 2012 playoffs , a series in which the two teams combined for an NHL-record 45 goals in the first four games and a total of 309 penalty minutes in an intense, fight-filled series. The Flyers pulled off the upset in six games against a Pittsburgh team that was heavily favored to win the Stanley Cup. In the second round against New Jersey, the Flyers were heavily favored to win the series, but the Flyers' run-and-gun style of play was stymied by the Devils' forechecking and defense, and, although they won the first game at home in overtime, the Flyers lost four games in a row and were eliminated in five. Daniel Briere and Claude Giroux ended the playoffs tied with five other players for the League lead in playoff goals with eight, despite their team being eliminated in the second round. , In the following off-season, in an attempt to gain a bona-fide, first-line defenseman to replace the injured Pronger and the aging Kimmo Timonen, the Flyers signed Nashville Predators defenseman Shea Weber to an offer sheet contract worth $110 million over 14 years; the contract, however, was eventually matched by the Predators. , The team would start off the lockout -shortened 2012–13 season at 0–3–0, their worst in 17 years.  The franchise finished at a record of 23–22–3, fourth in the Atlantic and tenth in the East. The team failed to qualify for the playoffs for the first time since the 2006–07 season and only the ninth time in team history. , On January 15, 2013, the club announced that Claude Giroux had been named the 19th captain in franchise history. On October 7, 2013, Head Coach Peter Laviolette and Assistant Coach Kevin McCarthy were fired just three games into the 2013–14 season after the team again started out 0–3–0. Assistant Coach Craig Berube , who previously played for the Flyers and served two stints as head coach of the Flyers' AHL affiliate Philadelphia Phantoms , was named the new head coach, while John Paddock and former player Ian Laperriere were announced as Berube's assistants.  The team went 42–27–10 with Berube behind the bench, clinching a playoff berth and ultimately falling in seven games to the New York Rangers in the first round. , On May 7, 2014, the club announced that then-General Manager Paul Holmgren had been promoted to president, with Assistant General Manager Ron Hextall moving in to fill the vacancy. , The Flyers did not qualify for the playoffs for the second time in three seasons in 2014–15 , and Berube was subsequently fired after the season.  The Flyers finished with 33 wins and 31 losses for 84 points.  On May 18, 2015, the Flyers hired former head coach of University of North Dakota. Hakstol had been North Dakota's coach for the past 11 seasons, during which he had a 289-143-43 record and led the school to the NCAA tournament in each season. Last season, the school was 29-10-3 and advanced to the Frozen Four for the seventh time during Hakstol's tenure.  , On April 4, 1966, Bill Putnam — a member of the Philadelphia group that was selected by the NHL for one of the six new franchises — announced there would be a name-the-team contest and that orange , black and white would be the team colors.  Wanting what he referred to as \"hot\" colors, Putnam's choice was influenced by the orange and white of his alma mater — the University of Texas at Austin — and the orange and black of Philadelphia's previous NHL team, the Quakers .  Also announced on April 4 was the hiring of a Chicago firm to design the team's arena. , Details of the name-the-team contest were released on July 12, 1966.  Ballots were available at local Acme Markets grocery stores — sponsor of the contest.  The top prize was an RCA 21\" color television, with two season tickets for both the second- and third-prize winners, and a pair of single-game tickets for the next 100 winners.  Among the names considered behind the scenes were Quakers, Ramblers and Liberty Bells. The first two were the names of previous Philadelphia hockey teams and — given the connotations of losing (Quakers) and the minor leagues (Ramblers) — were passed over. Liberty Bells, although seriously considered, was also the name of a local race track. Bashers, Blizzards, Bruisers, Huskies, Keystones, Knights, Lancers, Raiders and Sabres were among the other names considered.  , It was Ed Snider's sister Phyllis who ended up naming the team when she suggested \"Flyers\" on a return trip from a Broadway play.  Ed knew immediately it would be the winning name, since it captured the speed of the game and went well phonetically with Philadelphia.  On August 3, 1966, the team name was announced.  Of the 11,000 ballots received, more than 100 selected Flyers as the team name and were entered into a drawing to select a winner.  Alec Stockard, a 9-year-old boy from Narberth, Pennsylvania , who had spelled it \"Fliers\" on his entry, won the drawing and was declared the winner.  , With the name and colors already known, Philadelphia advertising firm Mel Richmann Inc. was hired to design a logo and jersey .  With Tom Paul as head of the project, artist Sam Ciccone designed both the logo and jerseys to represent speed.  Ciccone's winged \"P\" design — four stylized wings attached to a slanted \"P\" with an orange dot to represent a puck — was considered the \"obvious choice\" over his other designs, which included a winged skate.  Ciccone's jersey design, a stripe down each shoulder and down the arms, represented wings.  The flying \"P\" has remained the same since the beginning and was ranked the sixth best NHL logo in a 2008 Hockey News poll.  The Flyers unveiled a 3D version of this logo with metallic accents during the 2002–03 season which was used on orange third jerseys until the end of the 2006–07 season. , As with his logo design, Ciccone's jersey design was meant to represent speed.  The home jersey was orange with a white stripe down each shoulder and down the arms (meant to represent wings)  with a white number on the back and black sleeve numbers. The away jersey was white with orange striping, an orange number on the back and white sleeve numbers. Other than a few minor alterations to the numbers and the switch the NHL made to wear white at home and dark on the road for 1970–71 , this general design was used until the end of the 1981–82 season. , The Flyers unveiled second-generation jerseys for the 1982–83 season. The main difference was the increased width of the shoulder and arm stripes with black trim added to the border of the stripes. Also, a pinstripe (black for the white jersey, orange for the dark) was added to the bottom of each sleeve. With the exception of a similarly designed black jersey replacing the orange and the NHL switching back to wearing darks at home and whites on the road prior to 2003–04 , this design was used until the end of the 2006–07 season. , Many NHL teams started using third jerseys during the mid-1990s and the Flyers unveiled a black third jersey that was similar in design to their second generation jerseys during the 1997–98 season. During the 2000 Stanley Cup playoffs , the black jersey became the primary dark jersey with the orange jersey being retired after the 2000–01 season (although it was worn for one final game early in the following season on Halloween night). In 2002–03 , a new orange third jersey was introduced which was a radical departure from any jersey the Flyers had used before. Unique striping and fonts were used along with the aforementioned metallic 3D logo and the first use of a color other than orange, black or white on a Flyers jersey, silver/gray. These jerseys were used until the end of the 2006–07 season. , The Flyers, along with the rest of the NHL, unveiled new Rbk Edge jerseys prior to the 2007–08 season. The black jersey featured white shoulders with orange and black sections at the elbow and black cuffs. The white road jersey featured orange shoulders with black and white sections at the elbow, and black cuffs.  The Flyers unveiled a new orange third jersey based on their 1973–74 jerseys during the 2008–09 season.  and had replaced the black jerseys as the primary home jersey during the 2009 Stanley Cup Playoffs . The team wore the 1973–74 white jersey - reverse of their current home uniform but with a black nameplate with white lettering - at the 2010 NHL Winter Classic versus the Boston Bruins at Fenway Park . For the 2010–11 season, the Winter Classic jersey was adopted as the team's primary road jersey and the team's alternate black jersey was retired. , For their second Winter Classic appearance, this time against their arch-rivals the New York Rangers at Citizens Bank Park , the Flyers wore a traditional sweater design in orange with cream and black trim, featuring a cream nameplate with black lettering, as well as black numbers. It also contains a neck tie string which no other Flyers jersey has had before it. This design was later adopted as a third jersey for the 2014–15 season . , The Flyers debuted a short-lived skating mascot named \"Slapshot\" in 1976 but dropped the character by the next season. It remains the only mascot in Flyers' team history, although the team occasionally employed the services of \"Phlex\", the former mascot of the team's minor league affiliate and former next door neighbors who were in Glens Falls, NY , the Adirondack Phantoms from 2009-2014, and are now re-branded the Lehigh Valley Phantoms playing in the PPL Center in Allentown, Pennsylvania . , The Flyers were the first and one of only two NHL teams (the Hartford Whalers being the other) to wear Cooperalls , hockey pants that extend from the waist to the ankles, in 1981–82. They wore them the following season as well, but were compelled to return to the traditional hockey pants in 1983–84. , Updated June 21, 2015  , The Flyers currently have fifteen personnel in the Hockey Hall of Fame ; ten have been inducted into the players category and five in the builders category. Inducted as players and who spent a significant part of their career with the Flyers were goaltender Bernie Parent in 1984, forward Bobby Clarke in 1987, forward Bill Barber in 1990, and defenseman Mark Howe in 2011. Of the other Flyers also inducted as players – Paul Coffey , Peter Forsberg , Dale Hawerchuk , Adam Oates , Darryl Sittler and Allan Stanley – only Sittler played a third season with the Flyers. Inducted as builders were Keith Allen , who was head coach (1967–69), general manager (1969–83) and executive vice-president (1980–2014), Roger Neilson , head coach (1997–2000), mainly for his overall NHL coaching career, Bud Poile , general manager (1967–69), Fred Shero , head coach (1971–78), and Ed Snider , the Flyers majority owner (1967–96) and chairman (since 1996). Gene Hart (1967–95), was honored as a broadcaster ( Foster Hewitt Memorial Award ) in 1997.  , The Flyers have retired five of their jersey numbers and taken another number out of circulation. Barry Ashbee 's number 4 was retired a few months after his death from leukemia.  Bernie Parent 's number 1 — Parent wore number 30 during his first stint with the Flyers  — and Bobby Clarke 's number 16 were retired less than a year after retiring while Bill Barber 's number 7 and Mark Howe 's number 2 were retired shortly after their inductions into the Hockey Hall of Fame . The number 31, last worn by goaltender Pelle Lindbergh , was removed from circulation after Lindbergh's death on November 11, 1985, but it is not officially retired.  , Established in 1988, the Flyers Hall of Fame was designed to \"permanently honor those individuals who have contributed to the franchise's success.\"  Candidates for the hall are nominated and voted upon by a panel of media members and team officials.  To date, twenty-three former players and executives have been inducted.  , Statistics and records are current after the 2014–15 season , except where noted. , This is a partial list of the last five seasons completed by the Flyers. For the full season-by-season history, see List of Philadelphia Flyers seasons , Note: GP = Games played, W = Wins, L = Losses, T = Ties, OTL = Overtime Losses, Pts = Points, GF = Goals for, GA = Goals against , Records as of the 2014–15 season. , These are the top-ten regular season point-scorers in franchise history.  , These are the top-ten goaltenders in franchise history by regular season wins.  "
}
