{
  "category": "nhl",
  "article": "               , The Tampa Bay Lightning are a professional ice hockey team based in Tampa, Florida . Established in 1992, they are members of the Atlantic Division of the Eastern Conference of the National Hockey League (NHL). Tampa Bay has one Stanley Cup championship in their history, in 2003–04 .  They are often referred to as the Bolts , and the nickname is used on their current third jersey . They play their home games in the Amalie Arena in Tampa. , The owner of the Lightning is Jeffrey Vinik while Steve Yzerman serves as general manager. The team is currently coached by Jon Cooper , who has led the team since 2013. , , , In the late 1980s, the NHL announced that it would expand. Two rival groups from the Tampa/ St. Petersburg area decided to bid for a franchise: a St. Petersburg-based group fronted by future Hartford Whalers / Carolina Hurricanes owners Peter Karmanos and Jim Rutherford , and a Tampa-based group fronted by two Hall of Famers — Phil Esposito and his brother Tony . , On paper, it looked like the Karmanos/Rutherford group was the frontrunner. Not only was the Karmanos/Rutherford group better financed, but one of Esposito's key backers, the Pritzker family , had backed out a few months before the bid. Esposito eventually recruited a consortium of Japanese businesses headed by Kokusai Green, a golf course and resort operator. The prospect of Japanese backing tipped the scales in the Esposito group's favor, and they were awarded an expansion franchise for the 1992–93 season , as was a group in Ottawa (which became the Senators ). One of the team's limited partners was New York Yankees owner George Steinbrenner , who lived in Tampa during the year.  , According to former NHL President Gil Stein , another factor was that the Karmanos/Rutherford group wanted to pay only $29 million before starting play, while the Esposito group was one of the few willing to pay the entire $50 million expansion fee up front.  , After being awarded the franchise, the team's management brought in star power before they had any players. Phil Esposito installed himself as president and general manager, while Tony became chief scout. Terry Crisp , who played for the Philadelphia Flyers when they won two Stanley Cups in the mid-1970s, and coached the Calgary Flames to a Cup in 1989 , was tapped as the first head coach. The team was named the Lightning, after Tampa's status as the \"Lightning Capital of North America.\"  , Phil Esposito initially attempted to recreate the mystique from the powerhouse Boston Bruins of the 1970s; he hired former linemate Wayne Cashman as an assistant coach, former Bruin trainer John \"Frosty\" Forristal as the team's trainer and the inaugural team photo has him flanked by Cashman and player Ken Hodge, Jr. , son of his other Bruins' linemate. The team turned heads in the preseason when Manon Rheaume became the first woman to play in an NHL game, making her first of two NHL appearances in an exhibition game against the St. Louis Blues . , The Lightning first took the ice on October 7, 1992, playing in Tampa's tiny 11,000-seat Expo Hall at the Florida State Fairgrounds. They shocked the visiting Chicago Blackhawks 7–3 with four goals by little-known Chris Kontos . The Lightning shot to the top of the Campbell Conference 's Norris Division within a month, behind Kontos' initial torrid scoring pace and a breakout season by forward Brian Bradley . However, they buckled under the strain of some of the longest road trips in the league—their nearest division rival, the Blues, were over 1,000 miles away—and finished in last place with a record of 23–54–7 for 53 points. Their 53 points in 1992–93, however, was one of the best-ever showings by an NHL expansion team. Bradley's 42 goals gave Tampa Bay fans optimism for the next season; it would be a team record until the 2006–07 season when Vincent Lecavalier passed it with a career-high 52 goals. , As part of the Norris Division, Tampa Bay had rivalries with teams in Chicago , Detroit , and Minnesota , similar to how the National Football League 's Tampa Bay Buccaneers were in the same division as the Chicago Bears , Detroit Lions and Minnesota Vikings . , The following season saw the Lightning shift to the Eastern Conference 's Atlantic Division , as well as move into the Florida Suncoast Dome (a building originally designed for baseball) in St. Petersburg, which was reconfigured for hockey and renamed \"the Thunderdome,\" and where the team would play many home games in front of then-unprecedented crowds of 25,000 or more. The team picked up goaltender Daren Puppa , left-wing goal scorer Petr Klima and aging sniper Denis Savard . While Puppa's play resulted in a significant improvement in goals allowed (from 332 to 251), Savard was long past his prime and Klima's scoring was offset by his defensive lapses. The Lightning finished last in the Atlantic Division in 1993–94 with a record of 30–43–11 for 71 points. Another disappointing season followed in the lockout-shortened 1995 season with a record of 17–28–3 for 37 points. Still, the Lightning appeared to be far ahead of their expansion brethren, the Ottawa Senators. In marked contrast to the Lightning, the Senators showed almost no sign of respectability in their first four seasons. , In their fourth season, 1995–96 , with Bradley still leading the team in scoring, second-year forward Alexander Selivanov scoring a total of 31 goals, and Roman Hamrlik (the team's first-ever draft choice except for the players drafted in the expansion draft two days earlier ( Wendell Young being the first ever Lightning) in 1992 ) having an All-Star year on defense, the Lightning finally qualified for the playoffs, nosing out the defending Stanley Cup champion New Jersey Devils with a record of 38–33–12 with 88 points for the eighth spot in the Eastern Conference by a single win. Due to his stellar play in net, Puppa was named a finalist for the Vezina Trophy (losing out to Jim Carey of the Washington Capitals ). Although they lost their first round series in six games to the Philadelphia Flyers , it still remains a magical season for Lightning fans. The Thunderdome crowd of 28,183 for the April 23 playoff game against the Flyers was the largest crowd for an NHL game, a record that stood until the 2003 Heritage Classic in Edmonton. , The Lightning picked up sniper Dino Ciccarelli from the Detroit Red Wings during the 1996 off-season, and he did not disappoint, scoring 35 goals in the 1996–97 season , with Chris Gratton notching another 30 goals. The team moved into a glittering new arena, the Ice Palace (now the Amalie Arena ), and appeared destined for another playoff spot. However, the Lightning suffered a devastating rash of injuries. Puppa developed back trouble that kept him out of all but four games during the season; he would only play a total of 50 games from 1996 until his retirement in 2000 . Bradley also lost time to a series of injuries that would limit him to a total of 49 games from 1996 until his retirement in December 1999. Center John Cullen developed non-Hodgkin lymphoma , and missed the last 12 games of the 1996–97 season; he would eventually be forced to retire in 1999. Decimated by these ailments, the Lightning narrowly missed the playoffs. It would be seven years before the Lightning would even come close to the playoffs again. , Most of the Lightning's early stars were gone by 1998 due to free agency and trades by Phil Esposito that backfired. Crisp was fired 11 games into the 1997–98 season and replaced by Jacques Demers . Though Demers had presided over the resurgence of the Detroit Red Wings in the 1980s and helmed a Stanley Cup run with the Montreal Canadiens in 1993, he was unable to change the team's fortunes and the Lightning ended up losing 55 games. , By all accounts, the Lightning's plunge to the bottom of the NHL was due to the way Kokusai Green ran the team. Rumors abounded as early as the team's second season that the Lightning were on the brink of bankruptcy and that the team was part of a money laundering scheme for the yakuza (Japanese crime families).  Its scouting operation consisted of Tony Esposito and several satellite dishes. The Internal Revenue Service investigated the team in 1994 and 1995, and nearly slapped a lien on the team for $750,000 in back taxes. The situation led longtime NHL broadcaster and writer Stan Fischler to call the Lightning a \"skating vaudeville show.\"  , Even in their first playoff season, the team was awash in red ink and Kokusai Green was looking to sell at any price. However, the sale was hampered by the team's murky ownership structure; even some team officials (including Crisp) did not know who really owned the team.  Another problem was that Kokusai Green initially demanded $230 million for the team, including the lease with the Ice Palace.  The Maloof family had shown interest in the franchise, but conflicts between Esposito and the Maloofs' representative during the 1997 NHL Entry Draft stalled the plans.  , It later emerged that Kokusai Green's owner, Takashi Okubo, had never met with Esposito or with NHL officials in person prior to being awarded the Lightning franchise. During his seven years as owner, Okubo never watched his team play and never even visited the city of Tampa. Esposito never met him personally in his hunt for investors, for instance. Nearly all of Kokusai Green's investment in the team and the Ice Palace came in the form of loans, leaving the team constantly short of cash.  At least one prospective buyer pulled out after expressing doubts that Okubo even existed.  In fact, the first time anyone connected with the Lightning or the NHL even saw Okubo was in the spring of 1998. Many of Esposito's trades came simply to keep the team above water. The team's financial situation was a considerable concern to NHL officials; rumors surfaced that the league was seriously considering taking control of the team if Okubo failed to find a buyer by the summer of 1998.  , Forbes wrote an article in late 1997 calling the Lightning a financial nightmare, with a debt equal to a staggering 236% of its value—the highest of any major North American sports franchise. Even though the Ice Palace was built for hockey and the Lightning were the only major tenant, Forbes called the team's deal with the arena a lemon since it would not result in much revenue for 30 years. It was also behind on paying state sales taxes and federal payroll taxes.  , Finally, in 1998, Kokusai Green found a buyer. Although Detroit Pistons owner William Davidson was thought to be the frontrunner, the buyer turned out to be insurance tycoon and motivational speaker Art Williams , who previously owned the Birmingham Barracudas of the Canadian Football League (CFL). Williams walked into a difficult financial situation; the team was $102 million in debt at the time the sale closed.  Like the Japanese, Williams knew very little about hockey. However, he was very visible and outspoken, and immediately pumped an additional $6 million into the team's payroll to turn it around. He also cleared most of the massive debt left over from the Kokusai Green era. After taking control, Williams publicly assured the Espositos that their jobs were safe, only to fire them two games into the 1998–99 season. He then gave Demers complete control of hockey operations as both coach and general manager. Despite the clouds still hovering over the franchise, the Lightning drafted Vincent Lecavalier in 1998, a player who would be a cornerstone of the team for years to come. , Williams was widely seen as being in over his head and was an easy target for his NHL colleagues, who called him \" Jed Clampett \" behind his back due to his thick Southern accent and fundamentalist Christian views (unlike most of his fellow owners, Williams did not smoke, drink or curse). Early in the 1998–99 season, the Lightning lost 10 games in a row, all but ending any chance of making the playoffs. They ended up losing 54 games that year—more than the expansion Nashville Predators . Although some blame Williams for the slide, it can be argued that the damage from the Kokusai Green era was too much for Williams to overcome. , By the spring of 1999, Williams had seen enough. He had not attended a game in some time because \"this team broke my heart.\" He lost $20 million in the 1998–99 season alone—as much money in one year as he'd estimated he could have reasonably lost in five years.  , Williams sold the team for $115 million—$2 million less than he had paid for the team a year earlier—to Detroit Pistons owner William Davidson, who had almost bought the team a year earlier.ref name=blunder/> Along with the sale, the Lightning picked up a new top minor league affiliate; Davidson also owned the Detroit Vipers of the now-defunct International Hockey League . , Davidson remained in Detroit, but appointed Tom Wilson as team president to handle day-to-day management of the team. Wilson immediately fired Jacques Demers, who despite his best efforts (and fatherly attitude toward Vincent Lecavalier) was unable to overcome the damage from the Kokusai Green ownership. Wilson persuaded Ottawa Senators General Manager Rick Dudley to take over as the Lightning's new general manager; Dudley, in turn, brought Vipers coach Steve Ludzik in as the team's new head coach. Wilson, Dudley and Ludzik had helped make the Vipers one of the premier minor league hockey franchises, having won a Turner Cup in only their third season in Detroit (the team had originally been based in Salt Lake City ). , However, as had been the case with Demers, the damage from the last few seasons under Kokusai Green was too much for Ludzik to overcome. Even with a wholesale transfer of talent from Detroit to Tampa (a move that eventually doomed the Vipers, which folded along with the IHL in 2001), the Lightning lost 54 games in 1999–2000 and 52 in 2000–01 , becoming the first team in NHL history to post four straight 50-loss seasons. The lone bright spots in those years were the blossoming of Vincent Lecavalier and Brad Richards into NHL stars. Ludzik was replaced in early 2001 by career NHL assistant John Tortorella . The March 5 trade deadline offered another glimmer of hope when the team acquired hold-out goaltender Nikolai Khabibulin from the Phoenix Coyotes for three players and a draft pick. , The 2001–02 season , Tortorella's first full year behind the bench, saw some improvement. Martin St. Louis was having a breakout season when he broke his leg in game number 47 and was lost for the remainder of the season.  Khabibulin recorded a shut out at the NHL All-Star Game but was not named its MVP , by all accounts due to the game's voting protocol.  By mid-February, the Lightning were well out of playoff contention and were sinking under a rash of injuries. Dudley, who had guaranteed a playoff berth before the season, was fired and replaced by his assistant, Jay Feaster . Still the Lightning showed some signs of life, earning more than 60 points for the first time since 1997. Tortorella stripped Lecavalier of the captaincy due to contract negotiations that had made the young center miss the start of the season. , With a young core of players led by Vincent Lecavalier , Brad Richards , Martin St. Louis and Fredrik Modin , the Lightning were thought to be very close to respectability. However, they arrived somewhat earlier than expected in 2002–03 . The young team was led by the goaltending of Nikolai Khabibulin and the scoring efforts of Lecavalier, St. Louis, Modin, Richards and Ruslan Fedotenko , and also boasted a new captain, former prolific scorer Dave Andreychuk . Throughout the season, the Lightning battled the Washington Capitals for first place in the Southeast Division. They finished with a record of 36–25–16 for 93 points, breaking the 90-point barrier for the first time in team history. They won the division by just one point, giving them home-ice advantage in their first round match-up with the Capitals. At season's end, Coach Tortorella was recognized for his efforts by being named a finalist for the Jack Adams Award , losing out to Jacques Lemaire of the Minnesota Wild . , In the playoffs , the Lightning quickly fell two games behind in the series but followed the two losses with four consecutive wins which advanced them to the Conference Semifinals for the first time in team history. In the semifinals, the Lightning won only one game, losing the series to the New Jersey Devils . The Devils went on to win the Stanley Cup, but the Lightning's return to the post-season pleased the long-suffering hockey fans of the Tampa Bay area. , The Lightning played through the 2003–04 regular season , finishing with a record of 46–22–8–6 for 106 points, second-best in the league after the Western Conference's Detroit Red Wings —the first 100-point season in franchise history. The Lightning went through the season with only 20 man-games lost to injury. In the first round of the playoffs, the Lightning ousted the Alexei Yashin -led New York Islanders in five games, with solid play from goaltender Nikolai Khabibulin, who posted three shutouts in games 1, 3, and 4. , In the second round, the Lightning faced the Montreal Canadiens , captained by Saku Koivu ; Lecavalier, Richards, and Khabibulin led the team to a four-game sweep of Montreal. They next faced Keith Primeau and his Philadelphia Flyers in the Conference Finals. After a tightly-fought seven-game series in which neither team was able to win consecutive games, Fredrik Modin notched the winning goal of the seventh and deciding game, earning the Eastern Conference championship for the Lightning and their first-ever berth in the Stanley Cup Finals. , Their opponent in the final round was the Calgary Flames , captained by Jarome Iginla . The final round also went the full seven games, with the deciding game played in the St. Pete Times Forum on June 7, 2004. This time, Ruslan Fedotenko was the Game 7 hero, scoring both Lightning goals in a 2–1 victory. Brad Richards, who had 26 points in the post-season, won the Conn Smythe Trophy as the most valuable player of the playoffs; the Lightning had won all 31 contests in which he had scored a goal since the opening of the season. Tortorella won the Jack Adams Award as the NHL's Coach of the Year. Only three years after losing 50 games, the Lightning became the southernmost team ever to win the Stanley Cup, in only their 12th year of existence. Martin St. Louis led the team and the NHL with 94 points (his 38 goals were fourth-most after the 41 of tied trio Jarome Iginla, Rick Nash and Ilya Kovalchuk ), and won the Hart Memorial Trophy as the league's most valuable player. St. Louis also won the Lester B. Pearson Award for the league's most outstanding player as voted by the NHL Players' Association , and tied the Vancouver Canucks ' Marek Malik for the NHL Plus/Minus Award . A season of superlatives was capped with one final accolade, as The Sporting News named GM Jay Feaster as the league's executive of the year for 2003–04. , The Lightning had to wait a year to defend their title due to the 2004–05 NHL lockout , but in 2005–06 , they barely made the playoffs with a record of 43–33–6 for 93 points in a conference where six teams notched 100 or more points. They lost to the Ottawa Senators in five games in the first round. , During the off-season, the Lightning traded Fredrik Modin and Fredrik Norrena to the Columbus Blue Jackets for goaltender Marc Denis in an effort to replace the departing John Grahame , who had signed with the Carolina Hurricanes . Free agent Johan Holmqvist , however, would eventually receive the majority of playing time and most of the club's wins. The first half of 2006–07 was inconsistent for the Lightning, maintaining an 18–19–2 record throughout the first few months. January and February were far better months for the team, going 9–4–0 in January and 9–2–2 in February, driving them back into the playoff race. Fourteen games in March were split even, and on March 16, 2007, Vincent Lecavalier broke the franchise record for most points in a season, with 95 (finishing with 108). The record was previously held by Martin St. Louis, who had set the record in the 2003–04 Stanley Cup-winning year. Lecavalier also broke the franchise's goal scoring record, finishing with a league-leading 52 goals. , The Lightning were busy during the final weeks before the NHL's trade deadline, acquiring wingers Kyle Wanvig , Stephen Baby and defenseman Shane O'Brien . Former first round pick Nikita Alexeev was traded on deadline day to the Chicago Blackhawks . Other mid-season additions to the team included Filip Kuba , Luke Richardson and Doug Janik . Veteran Andre Roy , who had won the Stanley Cup with the Lightning in 2004, was claimed off waivers from the Pittsburgh Penguins . , Throughout March, the Lightning had been competing with the Atlanta Thrashers for first place in the Southeast Division. With a chance to overtake the Thrashers one final time and once again become division champions for the third time in team history, on April 6, 2007, in the final week of the regular season, the Lighting suffered a loss to the Florida Panthers , the night before the season finale in Atlanta. That same night, the Thrashers defeated the Carolina Hurricanes and subsequently clinched the division. For the Lightning, this meant having to settle for the seventh seed in the Eastern Conference , with a final record of 44–33–5 (93 points). , The Lightning were eliminated from playoff competition on April 22, however, after a 3–2 home loss to the New Jersey Devils in Game 6 of the Eastern Conference Quarterfinals. , Following their playoff exit, on August 7, 2007, Absolute Hockey Enterprises, a group led by Doug MacLean , announced it had signed a purchase agreement for the team and the leasehold on the St. Pete Times Forum . MacLean is the former president and general manager of the Columbus Blue Jackets and former head coach for both the Blue Jackets and the Florida Panthers . The group announced that it planned to keep the team in Tampa, but the deal fell apart during the 2007–08 season. , The Lightning struggled to maintain success during the 2007–08 campaign . Although the \"Big 3\" of Vincent Lecavalier, Martin St. Louis and Brad Richards, along with Vaclav Prospal , had performed up to expectations, they had little consistent play from supporting players. , At the start of the All-Star Break on January 25, 2008, the Lightning had a 20–25–5 record, and with 45 points, were in last place in both the Southeast Division and the Eastern Conference. Only the Los Angeles Kings had a lower point total at this time of the season, with 40 points. , On February 13, 2008, it was announced that Palace Sports & Entertainment had agreed to sell the Lightning to OK Hockey LLC, a group headed by Oren Koules , a producer of the Saw horror movies, and Len Barrie , a former NHL player and real estate developer. , The Lightning were active during the trade deadline, similar to the previous season. More notable trades included Vaclav Prospal's trade to the Philadelphia Flyers in exchange for prospect Alexandre Picard and a conditional draft pick.  Additionally, former Conn Smythe Trophy winner Brad Richards and goaltender Johan Holmqvist were sent to the Dallas Stars for goaltender Mike Smith and forwards Jussi Jokinen and Jeff Halpern , as well as a fourth round pick in 2009 .  Jan Hlavac , a regular contributor, was also traded, moving to the Nashville Predators in exchange for a seventh round pick in 2008 .  Defenseman Dan Boyle was re-signed to a six-year contract extension, reportedly worth $40 million.  , However, after the trade deadline, the Lightning fared no better than they had throughout the entire season. After the February 26 trade deadline, the Lightning won only five games. Finishing with a 31–42–9 record, with 71 points, they had the highest chance of winning the top overall pick in the 2008 NHL Entry Draft through the draft lottery, which they eventually won on April 7. They would use their first overall pick to select Steven Stamkos of the Ontario Hockey League (OHL)'s Sarnia Sting . , The Lightning were the worst team on the road in the NHL, winning only 11 games. Another showing of the team's poor play was the difference from the previous season's success in the overtime/shootout periods. In the 2006–07 season, the Lightning had one of the best extra period records, winning 15 games in either overtime or the shootout. In the 2007–08 season, however, they won only three games, losing nine. , Vincent Lecavalier suffered a dislocated shoulder as the result of an open-ice hit from Matt Cooke of the Washington Capitals in the game before the season finale in Atlanta. Lecavalier, who planned on having arthroscopic wrist surgery after the season's ending, would undergo surgery to repair his right shoulder as well. Cooke was fined $2,500 by the NHL for the hit, as Lecavalier did not have possession of the puck at the time. Perhaps the lone bright spot in the season was Lecavalier's winning both the King Clancy Memorial Trophy and the NHL Foundation Player Award for work through his foundation, including a $3 million pledge to All Children's Hospital in St. Petersburg, Florida, for what would become the Vincent Lecavalier Pediatric Cancer and Blood Disorders Center at All Children's Hospital. , Head coach John Tortorella was fired by the Lightning following their worst season since Tortorella was hired. At the time working as an NHL analyst for ESPN , Barry Melrose stated on June 4 during an episode of Pardon the Interruption that he missed coaching and would entertain any NHL coaching offers. He stated, \"I miss not having a dog in the fight.\" [ citation needed ] On June 23, ESPN reported that Melrose had been chosen to be the head coach of the Tampa Bay Lightning, beginning in the 2008–09 NHL season. The next day, the Lightning officially introduced him as their new head coach. , On July 4, 2008, Dan Boyle, despite coming off a recent contract extension, was traded along with Brad Lukowich to the San Jose Sharks in exchange for Matt Carle , Ty Wishart , a first round draft pick in 2009 and a fourth round draft pick in 2010 . Boyle was pressured to waive his no-trade clause by Tampa Bay's ownership, who said they would otherwise place him on waivers, where he would likely be claimed by the Atlanta Thrashers. In the fallout from the trade, Boyle would call Lightning ownership \"liars\"  for misrepresenting the aforementioned events to the public, while former coach Tortorella later labeled them as \"cowboys\" and said that he had zero respect for them.  Frustrated at interference in the team's hockey operations by Barrie and Koules, seven days later, Jay Feaster resigned as general manager, despite having three years remaining on his contract. , The Lightning opened the season in the Czech Republic against the New York Rangers as a part of the NHL's regular season \"Premiere\" that selects several teams to open the regular season in Europe. , Barry Melrose would record his first win as a head coach in over 13 years on October 21, 2008, with a 3–2 victory over the Atlanta Thrashers . However, the Lightning did not get off to a great start as hoped, and Melrose was eventually fired by the Lightning with a 5–7–4 record. Rick Tocchet , who had been hired as assistant coach during the previous off-season, was promoted to interim head coach. , On March 4, veterans Mark Recchi and Olaf Kolzig were traded by the Tampa Bay Lightning to the Boston Bruins and Toronto Maple Leafs , respectively. The Lightning acquired top round picks Matt Lashoff and Martins Karsums from the Bruins. , After the firing of Melrose, the Lightning went 19–33–14 and would finish the season 24–40–18 with 66 points, their lowest point total since the 2000–01 season. With the second overall pick in the 2009 NHL Entry Draft , the Lightning selected Swedish defenseman Victor Hedman . , In the 2009 off-season, the Lightning removed the interim status of Rick Tocchet , making him the full-time coach and signing him to a multi-year contract.  The Lightning had an up-and-down beginning to the 2009–10 campaign. Despite an overmatched roster on paper, and a team that struggled in the first two periods of many games, the Lightning remained competitive in the playoff race until March, when they went 5–10–1 for the month and fell eight points out of a playoff spot. Unable to make a final push for the playoffs, they were officially eliminated from contention within the first week of April. The Lightning finished the season 34–36–12 for 80 points, fourth in the Southeast Division and 12th in the Eastern Conference. , Steven Stamkos scored 51 goals in just his second NHL season, earning himself a share of the Maurice \"Rocket\" Richard Trophy by finishing tied for the league lead in goals with Pittsburgh Penguins star Sidney Crosby .  , During the season, the team was sold to Bostonian investment banker Jeffrey Vinik . Following the late-season collapse, Vinik cleaned house, firing both head coach Rick Tocchet and general manager Brian Lawton on April 12, 2010, one day after the season ended.  , In May 2010, Vinik hired Steve Yzerman away from the Detroit Red Wings front office to be the new general manager, signing him to a five-year contract. Yzerman then hired Guy Boucher away from the Montreal Canadiens organization to succeed Tocchet as the head coach two weeks later. , Yzerman's first off-season with Tampa Bay began with a splash. With the sixth pick of the 2010 NHL Entry Draft , the Lightning selected forward Brett Connolly despite a history of injuries while playing for the Western Hockey League (WHL)'s Prince George Cougars . When asked about Connolly's injuries being a factor in the decision to draft him, Yzerman boldly declared, \"I think it was a factor that he was available with the 6th pick. Because if he had been healthy all year, based on everything I know, he would not have been available with the 6th pick.\" On July 1, 2010, veteran blueliner Andrej Meszaros was traded to the Philadelphia Flyers in exchange for their second round pick in 2011 . Later that day, the Lightning signed their star winger Martin St. Louis to a four-year, $22.5 million contract extension to come into effect on July 1, 2011. On July 19, in another move with the Flyers organization, the Lightning traded defenseman Matt Walker and Tampa Bay's fourth round pick in 2011 for high-scoring winger Simon Gagne . Other off-season acquisitions included the signing of forwards Sean Bergenheim , Dominic Moore and Marc-Antoine Pouliot , along with defensemen Brett Clark , Randy Jones and Pavel Kubina and goaltender Dan Ellis , as well as the re-signing of restricted free agent forward Steve Downie to a two-year, $3.7 million deal. , With starting goaltender Mike Smith injured, the Lightning called up Cedrick Desjardins , who played with a .950 save percentage and a 1.00 goals against average (GAA) in two games. The team then acquired veteran Dwayne Roloson from the New York Islanders for further coverage in net.  , The Lightning compiled a 46–25–11 record with 103 points, matching a franchise record for wins in a season. After holding the first place in the Southeast Division for several months, they fell to second after a poor performance in March. Their record, however, was solid enough for second in the Southeast Division and fifth in the Eastern Conference, and they returned to the playoffs for the first time since the 2006–07 season. Scoring 31 goals and assisting on 68, Martin St. Louis finished second in the league in points. , In the playoffs , Tampa Bay drew the Pittsburgh Penguins in the Conference Quarterfinals. After losing Game 4 at home in the second overtime period, they fell behind in the series one game to three. However, the Lightning went on to win the next three games, including a 1–0 Game 7 win on the road, taking their first playoff series since winning the Stanley Cup in 2004. In the Conference Semi-finals, the Lightning swept the top-seeded Washington Capitals . , Tampa Bay went up against the Boston Bruins in the Eastern Conference Finals. In Game 4 of the series, the Lightning trailed 3–0 at the end of the first period. When Dwayne Roloson was pulled for Mike Smith, the Bruins failed to score again, and the Lightning tied the game in the second period by scoring three goals in 3:58, going on to win the game 5–3 and tying the series at two games apiece. The series went the full seven games, though the Lightning were eliminated by a single goal, as the game was lost (0–1). , The Lightning finished the season with a 38–36–8 record. With only 84 points, they fell short of reaching the playoffs, ending the season third in the Southeast Division and tenth in the Eastern Conference. , Individually, Steven Stamkos scored a franchise-record 60 goals. He won the Maurice \"Rocket\" Richard Trophy for the second time in his career, the first time in which he was the unanimous victor. Stamkos was also second in the league in points with 97, and was a finalist for both the Hart Memorial Trophy and the Ted Lindsay Award . , As with the 1994–95 NHL lockout , the 2012–13 NHL lockout resulted in a 48-game season. , Nearing the end of a dismal 18–26–4 season for 40 points, in which the Lightning ended fourth in the Southeast and 14th in the East, GM Steve Yzerman looked to their highly-successful American Hockey League (AHL) affiliate, the Syracuse Crunch . On March 25, 2013, head coach Guy Boucher was dismissed for following a 7–16–1 record.  The Lightning announced that Jon Cooper would become the eighth head coach in franchise history.  , Martin St. Louis won his second Art Ross Trophy with 60 points in the shortened season, as Stamkos finished runner-up 57. , On June 27, 2013, the team announced that they would exercise one of their two \" compliance buyouts \" on captain Vincent Lecavalier , as permitted by the collective bargaining agreement . This move would make Lecavalier an unrestricted free agent beginning July 5, free to sign with any team except the Lightning. The team stated the move was made not because of Lecavalier's play on the ice, but simply because of how his contract affected the team's salary cap, which would have been over $7 million per year until its expiration after the 2019–20 season.    , After acquiring goaltender Ben Bishop from the Ottawa Senators in a trade the previous season, the Lightning started the 2013 season with an above average performance. On November 11, 2013, going into the day tied for most goals during the regular season, Steven Stamkos suffered a broken right tibia after crashing into one of the goalposts during play against the Boston Bruins . He would miss 45 games and was not cleared to play again until March 5, 2014.  , In January, GM Steve Yzerman , who also served as the general manager for Canada's team at the 2014 Winter Olympics , elected not to name Lightning captain Martin St. Louis to Canada's roster, instead choosing the still-injured Steven Stamkos. After Stamkos was not medically cleared to play in Sochi in early February, Yzerman ultimately named St. Louis to Team Canada as an injury replacement. In late February, it was reported that St. Louis had requested a trade from Yzerman the month prior.  St. Louis, who had a no-move clause in his contract with Tampa Bay, reportedly consented to only being traded to the New York Rangers . On March 5, 2014, St. Louis was sent to New York along with a conditional 2015 second round pick in exchange for New York captain Ryan Callahan , a 2015 first round draft pick, a conditional 2014 second round pick and a 2015 conditional seventh round pick. The deal came subsequently after Stamkos had been cleared to return to the Lightning's active roster. St. Louis cited his decision based on his family and thanked Lightning fans for their support during his tenure with the franchise, but would not specify any further about the reasons that led to his request.  , On March 6, 2014, Steven Stamkos was named Tampa Bay's tenth captain in franchise history in his first game back after recovering from his tibia injury.  , On April 7, 2014, the team announced it had signed General Manager Steve Yzerman to a four-year contract extension.  , Finishing the season with 101 points, the Lightning placed second in the Atlantic Division, qualifying for the playoffs for the first time since 2011. Tampa Bay, however, was eliminated in the first round of the Atlantic divisional semifinals, losing to the Montreal Canadiens in a four-game sweep.  , On June 25, 2014, the Lightning agreed to terms with Ryan Callahan, who was slated to become a free agent in the offseason, and signed him to a six-year, $34.8 million contract extension.  The same day, the Lightning used its remaining compliance buyout on forward Ryan Malone after his on-ice performance had declined from injuries seasons prior in addition to his off-ice troubles that included a DUI arrest before the end of the season.  , Finishing the 2014–15 season with 108 points, the Lightning placed second in the Atlantic Division and qualified for the playoffs for the second straight season, despite scoring the most goals out of any team in the NHL. Tampa Bay eliminated the Detroit Red Wings in seven games in the first round of the playoffs before facing the Canadiens in the second round. The Lightning won the first three games of the series and had a chance to sweep the Canadiens. However, Montreal responded with wins in games 4 and 5 to extended the series to a sixth game. Tampa Bay won the sixth game of the series to eliminate the Canadiens and advance to the Eastern Conference Finals for the first time since 2011, facing the New York Rangers. , In the Eastern Conference Finals, the Lightning and the Rangers split the first two games of the series in New York, with the Lightning winning game 2 of the series thanks to Tyler Johnson 's hat trick. The series shifted to Tampa, where the Lightning had a come-from-behind overtime victory in game 3 but lost game 4 to even the series at two games apiece. During game 5 in New York, Bishop obtained his second shutout of the playoffs in a 2–0 victory against the Rangers, but the Rangers won game 6 by four goals to tie the series at 3. In game 7, Bishop obtained his third shutout of the playoffs in another 2–0 victory against the Rangers to lead the Lightning to the their first appearance in the Stanley Cup Finals since 2004 . The Lightning not only became the first team to defeat the Rangers in a game 7 at Madison Square Garden , but they also became the first team to successfully defeat three Original Six teams in the first three rounds of the playoffs.  The Lightning would face the Chicago Blackhawks in the Stanley Cup Finals, making it the first time a finalist faced four Original Six teams in the playoffs since the four-round format was introduced in 1980.  After losing game 1 at home, the Lightning built a 2–1 lead, however the Blackhawks would win the following three games to conquer the Stanley Cup in six games at the United Center .  , The Lightning radio broadcasts are on WFLA ; the play-by-play announcer is Dave Mishkin , known for his energetic style and his tendency to shriek when the Lightning score. Phil Esposito is the color commentator for home games. Matthew Sammon is the pregame and intermission host. The Lightning television broadcasts can be seen on Sun Sports . The television play-by-play announcer is Rick Peckham . The color commentator is Bobby Taylor . The studio host is Paul Kennedy . Michelle Gingras is the in-arena host. Former Lightning players Chris Dingman and Dave Andreychuk assist with the television broadcasts on occasion. , On December 10, 2014, long-time color commentator Bobby \"The Chief\" Taylor announced that he would be retiring from the broadcast booth at the end of the 2014–15 season . Taylor had served as the teams color commentator since the 1993–94 season, which was the team's second year of existence. Taylor cited the that he desired to be home with his wife Jan more. Taylor said, \"The road was starting to get a little stale,\" and \"I've been traveling since I was 15, and a that’s a long time.\" However, Taylor announced that he is not completely stepping away from the team broadcasts. He will continue to serve as a sideline or studio analyst during the games on Sun Sports for both home and away games. Taylor may also see sometime between the benches during broadcasts the following season. The Lightning have begun an immediate search for a replacement for Taylor for the coming season.  , Since 2011, the Lightning colors have been blue, black and white. Their logo has been a stylized lightning bolt. This is the origin of one nickname for the team—the \"Bolts.\" , The original Lightning jerseys featured simple stripes on the sleeves and tail, and contrasting shoulders—black shoulders over a white jersey, and white shoulders over the black—with the alternate logo (a lightning bolt over the outline of the state of Florida). The underarm gussets included a feature referred to as \"victory stripes\"—a group of thin stripes, alternating in the team's colors (black-silver-blue on white, or white-blue-silver on black). For the 1996–97 season, the Lightning added a third jersey, primarily blue with a sublimated wave and rain design on the front and back, lightning bolts down the sleeves, a silver-gray shoulder yoke, and black gussets. The third jersey was retired after the 1998–99 season. , In their first two seasons, the Lightning used a stylized block font for player names, with gaps in the upper loops of letters such as A, B, D, and R. The numbers were standard block numbers with drop shadows . The fonts were vertical in 1992–93, and italicized in 1993–94. The following season, the name font changed to a block font, vertically arched, while the number font changed to a painted style resembling the letters \"Tampa Bay\" in the logo. This style was also used on the blue alternate in 1998–99, replacing an \"electrified\" number font used from 1996–98. In 2001–02, the old fonts were replaced with traditional block letters and numbers, which have been used ever since. They also darkened their shades of blue that season from a royal blue to a speed (Indy) blue. , As with all NHL teams for the 2007–08 season, the Lightning debuted in new Reebok \"Rbk Edge\" jerseys. Also, like several other NHL teams, the Lightning updated their team logo. , The Lightning unveiled their new logo on August 25, 2007. The logo was similar to the inaugural one, but with a more modern look. The new logo also kept the same theme as the previous one, but with the words \"Tampa Bay\" across the top now appearing with tall capital initials, and the word \"Lightning\" no longer appearing on the bottom of the logo. , The Edge jerseys use the same template adopted by the Ottawa Senators and Pittsburgh Penguins . Unlike those teams, the Lightning's elbow panels remain the base color of the jersey, and an additional blue panel is added near the cuff of the sleeve. The Edge uniforms retain the underarm gusset \"victory stripes\" of their predecessors. , The Lightning then debuted a new \"alternate\" or \"third\" jersey in the 2008–09 season. The jersey features a dominant \"electric blue\" color, with black and silver accents at the end of the sleeves. The logo is removed, and in its place emblazoned across the front of the jersey descending to the lower left of the jersey is the word \"BOLTS\" (utilizing a layout similar to that of the Ottawa Senators' third jersey). The numbers are featured on the back and sleeves only, using white lettering.  , It was reported on January 23, 2011, that the Lightning had filed paperwork with the NHL to change their logo and colors, beginning with the 2011–12 season.  The new logo, as well as the new home and away jerseys, were unveiled by the team at a press conference at the St. Pete Times Forum on January 31, 2011.  The Lightning began to integrate the new logo onto center ice, and even distributed free T-shirts with the simplified logo on February 4, 2011, while still using the old Lightning logo and uniforms.  , The current uniforms are made in a traditional hockey sweater design. Initially, the colors that were to be used were simply blue and white, but by popular demand, black was later added as a trim color on the numbers. The victory stripes were also eliminated. Despite the introduction of the new uniforms, the previous third jersey was retained, with the new simplified logo replacing the old logo in the shoulders prior to the 2012–13 season. , For the 2014–15 season, the Lightning announced that a new black third sweater will replace the existing \"BOLTS\" sweaters. The new sweaters were unveiled on September 27, 2014. It retained the \"BOLTS\" wordmark, while adding white accents in a similar manner as the Los Angeles Kings ' sweaters. The secondary roundel logo also replaced the primary logo on the sleeves, while the city name was enscripted on the collar. , The Lightning mascot is a lightning bug named ThunderBug.He performs at games and makes appearances in the community. According to the Lightning website,  Thunderbug enjoys birthday parties, street hockey, ice hockey and Lightning fans, while his dislikes include flyswatters and bug zappers. , An official dance team known as the Lightning Girls perform at all home games and community events. The Tampa Bay Lightning Girls are a group of dancers who perform in the stands.  , This is a partial list of the last five seasons completed by the Lightning. For the full season-by-season history, see List of Tampa Bay Lightning seasons , Note: GP = Games played, W = Wins, L = Losses, T = Ties, OTL = Overtime Losses, Pts = Points, GF = Goals for, GA = Goals against , Records as of the 2013–14 season. , Updated May 29, 2015.  , , Hall of Famers , NHL All-Star Team , NHL All-Rookie Team , All-Star Game , NHL YoungStars Game , NHL All-Star Skills Competition (Rookie) , These are the top-ten point-scorers in franchise history. Figures are updated after each completed NHL regular season.  , Note: Pos = Position; GP = Games Played; G = Goals; A = Assists; Pts = Points; P/G = Points per game; * = current Lightning player , Stanley Cup , Prince of Wales Trophy , Bill Masterton Memorial Trophy , NHL Hardest Shot , NHL Puck Control Relay Champion , NHL Elimination Shootout Champion , NHL Fastest Skater , Art Ross Trophy , Conn Smythe Trophy , Lester B. Pearson Award , Hart Memorial Trophy , Jack Adams Award , Lady Byng Memorial Trophy , NHL Plus/Minus Award , Maurice \"Rocket\" Richard Trophy , King Clancy Memorial Trophy , NHL Foundation Player Award , NHL General Manager of the Year Award "
}
