{
  "category": "cricket",
  "article": "The Afghanistan national cricket team ( Pashto : دافغانستان کرکټ ملي لوبډله ‎, Dari : تیم ملی کرکت افغانستان ) is the team that represents the country of Afghanistan in international cricket matches. Cricket has been played in Afghanistan since the mid 19th century, but it is only in recent years that the national team has become successful. The Afghanistan Cricket Federation was formed in 1995 and became an affiliate member of the International Cricket Council (ICC) in 2001  and a member of the Asian Cricket Council (ACC) in 2003.  They are ranked 12th in International Twenty20 cricket as of January 2015  , The national team was formed in 2001,  which played in the 2009 World Cup Qualifier  after rising rapidly through the World Cricket League , starting in Division Five in May 2008.  The team failed to qualify for the 2011 World Cup , but did earn ODI status until 2013.  In February 2010, the Afghan cricket team secured qualification to the 2010 ICC World Twenty20 , the team's first major tournament.  In the same year they won their first Intercontinental Cup , beating Scotland in the final.  Afghanistan also won the Asia Vs Caribbean T20 Championship and beat T&T, Bangladesh and Barbados.  , Afghanistan also qualified for 2012 ICC World Twenty20 held in Sri Lanka as the runner up of the ICC World Twenty20 Qualifier and joined India and England in the group stage. In the first match against India on 19 September, Afghanistan won the toss and elected to field. India posted 159/5 in 20 overs but Afghanistan fell short of that target by scoring 136 in 19.3 overs. In the second match against England on 21 September, Afghanistan won the toss and again elected to field. England set a target of 196/5 (20 overs) but Afghanistan were all out for 80 in 17.2 overs. England and India qualified for the Super Eights and Afghanistan were eliminated as a result of this match. , On October 3, 2013, Afghanistan beat Kenya to finish second in the WCL Championship and qualify for the 2015 Cricket World Cup , becoming the 20th team to gain entry into the tournament overall. Afghanistan secured their passage to Australia and New Zealand in 2015 by beating Kenya comprehensively for the second time in succession in Sharjah, sealing their maiden World Cup qualification. They finished second in the World Cricket League Championship — nine wins in 14 matches — and joined Ireland as the second Associate team in the 2015 World Cup, while the remaining two spots for Associates will be decided by a qualifying tournament in New Zealand in 2014. Afghanistan will join Pool A at the World Cup along with Australia, Bangladesh, England, New Zealand, Sri Lanka and another qualifier.  On November 24, 2013, Afghanistan beat Kenya to qualify for the 2014 T20 world cup. , In March 2014, Afghanistan beat Hong Kong in the 2014 ICC World Twenty20 but could not make it to the next stage of super 10 having lost the two matches to Bangladesh national cricket team and Nepal . , On February 25, 2015 Afghanistan won their first Cricket World Cup match beating Scotland . , , , The earliest record of cricket in Afghanistan is of British troops playing a match in Kabul in 1839, though it appears that no long lasting legacy of cricket was left by the British. In the 1990s, cricket became popular amongst the Afghan refugees residing in Pakistan , and the Afghanistan Cricket Board was formed there in 1995. They continued to play cricket on their return to their home country.  Like all sports, cricket was originally banned by the Taliban , but cricket became an exception in 2000 (being the only sport in Afghanistan to be approved by the Taliban) and the Afghanistan Cricket Federation was elected as an affiliate member of the ICC the following year.  , The national team was invited to play in the second tier of Pakistani domestic cricket the same year,  and the tour brought international media attention to Afghan cricket when the US-led invasion of the country began whilst the team was in Pakistan . The team lost three and drew two of the five matches on the tour.  , They played in two Pakistani tournaments in 2003, winning their first match that year. They began playing in Asian regional tournaments in 2004, finishing sixth in their first ACC Trophy. More success began in 2006 when they were runners-up to Bahrain in the Middle East Cup and beat an MCC side featuring former England captain Mike Gatting by 171 runs in Mumbai . Gatting was dismissed for a duck .  , They toured England in the summer of 2006, winning six out of seven matches. Three of their wins came against the second XIs of Essex , Glamorgan and Leicestershire .  They finished third in the ACC Trophy that year, beating Nepal in a play-off match.  , They won their first tournament in 2007, sharing the ACC Twenty20 Cup with Oman after the two tied in the final.  They began their qualifying campaign for the 2011 World Cup in Jersey in 2008, winning Division Five of the World Cricket League.  They finished third in the ACC Trophy Elite tournament the same year,  and won a second consecutive WCL tournament, Division Four in Tanzania later in the year.  , In January 2009, Afghanistan progressed to the 2009 World Cup Qualifier by winning Division Three of the World Cricket League in Buenos Aires , topping the table on net run rate ahead of Uganda and Papua New Guinea .  , In the 2011 Cricket World Cup qualifying tournament, Afghanistan failed to progress to the World Cup , but earned ODI status for four years.  Their first ODI was against Scotland in the 5th place playoff, having previously beaten the Scots earlier in the tournament; Afghanistan won by 89 runs.  , In the Intercontinental Cup Afghanistan played its first first-class match against a Zimbabwe XI in a four-day match in Mutare . During the match, which was drawn, Afghan batsman Noor Ali scored centuries in both his innings, making him only the fourth player to do so on their first-class debut. Later, in August 2009, they played the Netherlands in same competition at the VRA Cricket Ground , winning a low-scoring match by one wicket.  , Afghanistan then took part in the 2009 ACC Twenty20 Cup in the United Arab Emirates . Afghanistan were drawn in Group A, a group which Afghanistan topped at the end of the group stages by winning all five of their matches. In the semi-finals the Afghans defeated Kuwait by 8 wickets.  In the final they met the hosts, the United Arab Emirates , whom they defeated by 84 runs.  , On 1 February 2010, Afghanistan played their first Twenty20 International against Ireland ,  which they lost by 5 wickets.  On 13 February 2010, Afghanistan first defeated the United Arab Emirates by 4 wickets to make their way to the 2010 ICC World Twenty20 to be in the West Indies in April 2010. Later the same day they defeated Ireland by 8 wickets in the Final of 2010 ICC World Twenty20 Qualifier and won the qualifier.  Afghanistan were in Group C of the main tournament, with India and South Africa . During their first match against India, opening batsman Noor Ali hit 50 runs, helping Afghanistan to a score of 115 in their 20 overs. Despite this they lost the match by 8 wickets.  In their second match, the team were reduced to 14/6 at one stage, before a late rally from Mirwais Ashraf and Hamid Hassan helped Afghanistan post 88 all out, resulting in a loss by 59 runs.  , The teams Intercontinental Cup campaign continued in 2010, with wins over Ireland, Canada , Scotland and Kenya before they beat Scotland by 7 wickets in the final in Dubai .  Also in 2010, they won the ACC Trophy Elite tournament in Kuwait , beating Nepal in the final  and finished third in Division One of the World Cricket League in the Netherlands .  They took part in the cricket tournament at the 2010 Asian Games in China and won the silver medal, losing to Bangladesh in the final.  , In 2011, Afghanistan begun playing in the 2011-13 ICC Intercontinental Cup . They beat Canada and drew with the UAE.  In the parallel one-day league, they won two matches against Canada and lost twice to the UAE.  In March, 2013, they played two T20 Internationals against Scotland in UAE and prevailed in both matches. They also won two ODIs in World Cricket League Championship against the same opponents. Afghanistan drew level with Scotland in second in the WCL Championship table after the two convincing wins that boosted their hopes of securing automatic qualification for the 2015 World Cup. , Ireland won the WCL Championship with 24 points, and Afghanistan came second with 19 points was qualified for World Cup. Netherlands, in fourth, face Namibia next month, while fifth-placed UAE host Ireland later in March. There will be a further two rounds of games, with the top two teams guaranteed a spot at the next World Cup in Australia and New Zealand.  , Afghanistan also inflicted a crushing defeat on Scotland in their ICC Intercontinental Cup match. Afghanistan 275 (Shah 67*, Davey 4-53) beat Scotland 125 (Taylor 48*, Dawlatzai 6-57) and 145 (Coetzer 57, Dawlatzai 5-37) by an innings and 5 runs. Izatullah Dawlatzai took eleven wickets in the match as Afghanistan defeated Scotland by an innings and five runs in Abu Dhabi.  , In December 2011, Afghanistan took part in the ACC Twenty20 Cup in Nepal , where they were drawn in the same group as Hong Kong, Oman, Kuwait and the Maldives . , The event was a qualifier for the 2012 ICC World Twenty20 Qualifier , but Afghanistan have already qualified for the event in the United Arab Emirates .  Further matches in the 2011-13 Intercontinental Cup and the associated one-day league will be played in 2012 against the Netherlands and Ireland and in 2013 against Scotland, Namibia and Kenya.  , Afghanistan played its first One Day International against a Full Member of the International Cricket Council in February 2012 when they played a single match against Pakistan at Sharjah . Afghanistan also took on Australia Cricket Team for only ODI at Sharjah in August 2012 . , In July 2014 Afghanistan toured Zimbabwe to play its 1st full series against a full member. The 4 match ODI series finished 2-2 an the 2 match first class series finished 1-1. , Afghanistan got its associate membership of the ICC on 27 of June 2013.  The decision was taken on the ICC’s annual meeting on 26 of June 2013 in London, England and was attended by ACB CEO Dr Noor Muhammad Murrad. The nomination request had been sent by the Asian Cricket Council (ACC) last year based on the continuous progress made by former ACB CEO Dr Hamid sheenwari, especially in its cricket development. , \"Afghanistan is the only country that receives the Associate membership in a short period of time in reward to the efforts Afghanistan made for the promotion of cricket,\" Dr Noor Muhammad, CEO of the Afghanistan Cricket Board (ACB), said on the ACC website. , Becoming an Associate would mean higher funding and, importantly, more exposure for the passionate and cricket-starved players from Afghanistan, a war-torn country. So far, the ICC was paying $700,000 in annual funding to Afghanistan, which is now likely to rise to $850,000 based on the Associate status.  , In March 2013, Afghanistan received a boost after a two-year Memorandum of Understanding (MoU) was signed between the Afghanistan Cricket Board (ACB) and Pakistan Cricket Board (PCB) for the development of Afghanistan cricket ahead of the 2015 World Cup. , The PCB will provide technical and professional support, including game-education programmes, coaching courses, skill and performance analysis, and basic umpiring and curator courses. High performance camps for emerging players will also be organised. The PCB-regulated National Cricket Academy (NCA) will help in improving technical, tactical, mental and physical skills, and will host lectures on doping, anti-corruption and various codes of conduct. The finance for the project will be decided later, with the NCA-related activities likely to be subsidised.  , In April 2013, the Afghanistan Cricket Board (ACB) was allocated US$422,000 (22,400,000 AFN approx.) from the ICC's targeted assistance and performance programme. The world governing body of cricket approved the grant at its IDI (ICC Development International) board meeting, which concluded in Dubai. , ACB chief executive officer, Noor Mohammad Murad, said the board had requested a total of $1 million in assistance. \"The ICC approved $422,000 for now. They will send a delegation to visit the ACB in two or three weeks, and will decide [from there] whether or not to approve the rest of the money,\" Murad told AFP. , The money, to be given over three years, is aimed at developing more competitive teams among ICC Full, Associate and Affiliate members. Previously, countries such as the Netherlands, Scotland, West Indies, Zimbabwe and Ireland have received assistance through a similar programme. According to an ICC statement, the funding for the ACB is for the development of the National Cricket Academy in Kabul. , Afghanistan became an Affiliate member of the ICC in 2001. In 2009 it attained one-day status till 2015. Over the last two years, the ACB has undergone organisational restructuring in a bid to provide better leadership and find qualified staff to run cricket administration in the war-torn country. They are currently developing their domestic cricket infrastructure, and have signed a two-year deal with the Pakistan board for the development of Afghanistan cricket ahead of the 2015 World Cup. , Last year, the Asian Cricket Council decided to nominate Afghanistan for Associate membership with the ICC, with the request being looked into at the ICC's annual conference in June. At present the ICC provides about $700,000 a year in funding. Based on current distributions, that will rise to $850,000 once Associate status is assured.  , Afghanistan made their World Cup debut in the 50 over format of the game against Bangladesh at the Manuka Oval in Canberra, Australia. The match resulted in a 105 run defeat.  , The competition will see the team compete against elite cricketing nations such as Australia, Sri Lanka, New Zealand and England. Qualification for the tournament is a historic feat for cricket in Afghanistan as the team comprises many players who picked up the game in refugee camps outside their long-suffering country.  , On February 26, 2015, Afghanistan won their first World Cup match against Scotland, winning by one wicket. , Afghanistan do not play their homes matches in Afghanistan due to the ongoing security situation and the lack of international standard facilities. Afghanistan played their 'home' Intercontinental Cup fixture against Ireland at the Rangiri Dambulla International Stadium in Sri Lanka . Following Afghanistan's World Twenty20 qualifying campaign they played two One Day Internationals against Canada at the Sharjah Cricket Association Stadium in the UAE , after which the stadium was named the 'home' ground of Afghanistan.  , As plans to resurrect Afghan cricket and the country itself it was later announced that Kabul National Cricket Stadium would be built and completed by July 2011; it would employ many local Afghans in construction and later maintenance. It would also see new sprinklers, seats, training centre and a 6000-seat capacity built for people to watch and play cricket. The stadium is the hub of international and domestic cricket in Afghanistan.  Outside of Jalalabad , the Ghazi Amanullah Khan International Cricket Stadium has been constructed.   , The following are the major cricket stadiums in Afghanistan: , The ground hosted matches for Afghanistan , This is current players who played for Afghanistan in 2013/14 season. , International Match Summary – Afghanistan   , Last updated 17 March 2015. , ODI record versus other nations  , Records complete to ODI #3639. Last updated 17 March 2015. , Most ODI runs for Afghanistan  , Most ODI wickets for Afghanistan  , Highest ODI score for Afghanistan  , Best bowling figures in an innings for Afghanistan  , T20I record versus other nations  , Records complete to T20I #415. Last updated 17 March 2015. , Most T20I runs for Afghanistan  , Most T20I wickets for Afghanistan  "
}
