{
  "category": "cricket",
  "article": "The Bangladesh national cricket team ( Bengali : বাংলাদেশ জাতীয় ক্রিকেট দল ) represents Bangladesh in international cricket . It is administered by the Bangladesh Cricket Board (BCB). Bangladesh is a full member of the International Cricket Council (ICC) with Test and One Day International (ODI) status. It played its first Test match in November of 2000 against India in Dhaka , becoming the tenth Test-playing nation. , Bangladesh's first official foray into international cricket came in the 1979 ICC Trophy in England. On 31 March 1986, Bangladesh played its first ODI match, against Pakistan in the Asia Cup . For a long time, football was the most popular sport in Bangladesh, but cricket gradually became very popular – particularly in urban areas – and by the late 1990s had surpassed football. , In 1997, Bangladesh won the ICC Trophy in Malaysia and thus qualified for its first Cricket World Cup to participate in England in 1999 . There, it defeated Pakistan – causing much upset – and also Scotland . On 26 June 2000, Bangladesh was granted full ICC membership. , Bangladesh holds the record for most consecutive losses in Tests (21, between 2000 and 2002) and ODIs (23, between 2001 and 2004). After gaining full member status with the ICC, Bangladesh had to wait until 2004 for its first ODI win since the 1999 World Cup. The team on the losing side on that occasion was Zimbabwe , who also participated in Bangladesh's maiden Test victory in 2005; by securing a draw in the second match, Bangladesh won their first Test series. In 2009 Bangladesh toured the West Indies for two Tests and by winning both secured their first overseas series victory. , As of 21 June 2015, Bangladesh has played 91 Tests, winning only seven. Its first victory was against a young and inexperienced Zimbabwe team, which was hit by a player crisis ; the next two were against a West Indian team. Results have improved recently with draws earned against full strength Sri Lankan and New Zealand sides and a win against Zimbabwe  The lack of a first-class tournament in the country before it was granted Test status has been cited as one of the reasons for its struggle to adapt to the longest form of the game. [ citation needed ] , The team has been more successful in ODIs, having won 93 of its 305 matches.  It has also played 42 Twenty20 Internationals , winning 12.  , Bangladesh is currently ranked ninth in Tests, seventh in ODIs and ninth in T20Is by the ICC.  , , , Several East Pakistan -based sides played in Pakistani domestic cricket prior to Bangladesh's declaration of independence of 1971—the East Pakistan cricket team fielded three players who later played ICC Trophy matches. In 1977, Bangladesh became an Associate member of the International Cricket Council (ICC).  Bangladesh was one of fifteen teams to take part in the inaugural ICC Trophy . Held in 1979, it gave non-Test playing countries the opportunity to qualify for that year's World Cup . Bangladesh, under the captaincy of Raqibul Hasan , Bangladesh won two matches and lost two, but failed to progress beyond the first round.   Victory in the South-East Asian Cricket Conference Tournament in February 1984 ensured Bangladesh qualified for the 1986 Asia Cup .  On 31 March 1986, Bangladesh played their first One Day International against a full member of the ICC;  Captained by Gazi Ashraf , Bangladesh were dismissed for 94 and Pakistan reached their target for victory with seven wickets in hand.  They lost their second ODI which was against Sri Lanka, finishing last in the three-team tournament.  Bangladesh qualified for the 1988 Asia Cup , this time hosting the tournament; it was the first time ODIs had been staged in the country. Although they lost all their matches, Bangladesh's fixtures were retrospectively awarded ODI. Floods in the preceding months meant the tournament was in doubt, but it went ahead as planned. A charity match raised $70,000 for the flood victims.  , Bangladesh took part in the 1990 Austral-Asia Cup ,  the Asia Cup in 1990–91 , 1995 ,  and 1997 ,  but it was not until 1998 that they won their first ODI. Their 22-match losing streak since their first ODI was at the time a record.  Bangladesh posted its first ODI win against Kenya in India thanks largely to Mohammad Rafique , who contributed a fiery 77 runs and took 3 wickets. Put on 137 for the first wicket with Athar Ali Khan . Athar's own contribution was 47.  In October 1998, Bangladesh hosted (but did not participate in) the first ever ICC KnockOut Trophy (which later became the ICC Champions Trophy), a knock-out ODI tournament featuring all the Test playing nations. , Bangladesh took part in each of the 1979 , 1982 , 1986 , 1990 , and 1994 editions of the ICC Trophy, and won the trophy in 1997 , in the process qualified for the 1999 World Cup. Bangladesh also became a regular ICC member with the right to play ODIs. Earlier, in February Dhaka hosted the third and final SAARC cricket tournament. Bangladesh played in its first World Cup in England in 1999. Bangladesh created an enormous upset by beating Pakistan by 62 runs in the group match at Northampton . Bangladesh made 9/223 from its full 50 overs, and in reply Pakistan could only manage 161 due to timely run-outs by wicket-keeper Khaled Mashud and some tight bowling by Khaled Mahmud , who took 3/31 from 10 overs. Mahmud was judged man of the match. Bangladesh did not qualify for the Super Six round due to defeats in three of its five matches. However, the win over Pakistan, who finished runners-up to Australia , helped Bangladesh to gain Test playing status the following year. Bangladesh had sacked coach Gordon Greenidge on the morning of the match.  , Former South Africa Test cricketer Eddie Barlow became Bangladesh's coach in 1999.  In preparation for becoming a Test playing country, Bangladesh established its own first-class competition in 1999—2000, although the matches were not given first-class status until the 2000—2001 season.  The lack of an established first-class structure in the country until shortly before Bangladesh played its debut Test has been cited as one of the reasons the side struggled to adapt to the longer format of the game.  The West Indies toured Bangladesh in October, winning both matches in the ODI series.  After suffering a stroke in April 2000, Barlow vacated the position of coach.  In May and June 2000, Bangladesh hosted the Asia Cup ; Bangladesh lost all three of their matches and when playing Pakistan succumbed to what at the time was the heaviest defeat in ODIs, a margin of 233 runs.  Bangladesh participated in the 2000 ICC KnockOut Trophy in October; their only match ended in defeat by England.  , On 13 November 2000, Bangladesh played their inaugural Test match, hosting India in Dhaka. The first test run in the history of Bangladesh Cricket came from the bat of Mehrab Hossain , who also scored the first ever ODI hundred by an individual player for Bangladesh in 1999. Captained by Naimur Rahman , Bangladesh lost by nine wickets, although Wisden noted that they \"surpassed all expectations by matching their neighbours, and at times even enjoying the upper hand\".  Aminul Islam Bulbul scored 145 in the first innings, becoming the third person to have scored a century in their team's first Test; Rahman took six wickets for 132 runs, the second-best bowling figures in a country's maiden Test.  In March 2001, former Australian Test cricketer Trevor Chappell was appointed coach.  The following month Bangladesh embarked on a tour of Zimbabwe to play two Tests and three ODIs. Zimbabwe, who at the time were ranked ninth out of the ten Test teams, won all five matches.  Bangladesh took part in the 2001–02 Asian Test Championship , the second and final time the championship was held and the first the team had been eligible to play in. They lost both their matches by an innings. Mohammad Ashraful made his debut in the series and became the youngest player to score a Test century in his first match.  In November, Bangladesh hosted Zimbabwe for two Tests and three ODIs. The opening Test was curtailed by bad weather and ended in a draw; after losing their first five Tests, it was the first time Bangladesh had avoided defeat. Zimbabwe won all the remaining matches. After the Test series wicketkeeper Khaled Mashud replaced Rahman as captain.  The following month Bangladesh journeyed to New Zealand for two Test matches. Bangladesh's batsmen struggled in unfamiliar conditions and the team slumped to two innings defeats.  , In January 2002 Bangladesh lost two Tests and three ODIs against Sri Lanka. At this point, they had lost ten of their first eleven Tests; only South Africa had struggled as much in their introduction to Test cricket, also losing ten of their first eleven matches. Chappell blamed Bangladesh's batsmen for the loss, saying \"they commit the same mistakes again and again, and need to learn to apply themselves, to bat in sessions\".  In April, former Pakistan Test cricketer Mohsin Kamal replaced Chappell as coach.  When Bangladesh toured Sri Lanka in July and August they were on the receiving end of Sri Lanka's largest margin of victory in Test cricket: an innings and 196 runs. Bangladesh lost both Tests and all three ODIs on the tour, recording their 50th defeat in 53 ODIs. Repeated poor performances prompted people to question whether Bangladesh had been granted Test status too soon.  Test and ODI whitewashes followed in South Africa in October. Wisden noted that \"Time and again ... came the mantra that [Bangladesh] would learn from the experience, that they could only improve by playing against the best, that there was genuine talent in the squad. But it wore thin.\"  The final defeat set a record for most consecutive losses in ODIs (23), beating the previous record which was also held by Bangladesh.  When the West Indies toured in November and December, Bangladesh lost both Test and two out of the three ODIs, and one ended in no result .  South Africa hosted the 2003 World Cup in February and March. Bangladesh lost five of their six matches (one ended in no result),  including fixtures against Canada , who hadn't played international cricket since the 1979 World Cup ,  and Kenya who eventually made the semifinals of the tournament. , In the aftermath of Bangladesh's World Cup campaign, Khaled Mahmud replaced Khaled Mashud as captain,  and Kamal was sacked as coach with Dav Whatmore taking over the role.  Whatmore was not able to begin the job immediately, so Sarwar Imran acted as interim coach during Bangladesh's tour of South Africa in April and May.  In 2003 Bangladesh played nine Test and 21 ODIs, losing every match apart from an ODI against West Indies which ended in no result .   In September, Bangladesh came very close to its first Test victory, when it lost to Pakistan by only one wicket. It was just the tenth time in Test history that a team had lost by a single wicket.  In series against Pakistan, Alok Kapali became the first Bangladesh player to take a hat-trick in Test cricket, dismissing Shabbir Ahmed , Danish Kaneria , and Umar Gul .   When England toured Bangladesh October and November, Bangladesh's captain, Mahmud, was booed. Ahead of Bangladesh's tour of Zimbabwe in February and March the next year, he was dropped from the squad and batsman Habibul Bashar was granted the captaincy.  At the time, Zimbabwe were without many of their senior players. Bangladesh lost the Test series 1–0, and the ODI series 2–1.  The second Test was drawn  and brought to an end their run of 21 consecutive defeats dating back to November 2001, a world record in Test cricket.  The solitary ODI victory was Bangladesh's first international win since defeating Pakistan in the 1999 World Cup.  , Bangladesh's next matches were against the West Indies in May and June. Bangladesh lost the ODI series 3–0 and the Test series 1–0; by drawing the first match, Bangladesh managed to avoid defeat for just the third time in 29 Tests.  In December, Bangladesh defeated India in its hundredth ODI, this being only the third time that it had won against a Test playing nation. , In January 2005, Zimbabwe toured Bangladesh for two Tests and five ODIs. The touring Zimbabwe side had suffered due to player disputes which in 2004 had led to the country's temporary suspension from Test cricket. Of Zimbabwe's 16-man squad, only their captain had played more than nine Tests; Bangladesh were the more experienced team. In the first match, Bangladesh secured their maiden victory in Test cricket.  Bangladesh's batsmen secured a draw in the second Test by batting out the final five session after coach Dav Whatmore had opined that \"Zimbabwe will win, unless our batsmen do something special\".  In the match – which helped secure a historic first series victory for Bangladesh – Enamul Haque Jr broke his own bowling record for best figures in an innings for Bangladesh by taking 7 wickets for 95 runs, and secured the best figures in a match for Bangladesh: 12 wickets for 200 runs.  In the ODI series that followed, Zimbabwe won the opening two contests, and Bangladesh won the final three to take the series.  , After their maiden Test victory, Bangladesh embarked on its first tour of England in May and June 2005 . The team faced unfamiliar conditions and the batsmen struggled against seam bowling . Bangladesh lost both matches in the Test series by an innings; the second Test was the 22nd time it had happened in 38 Tests.  Pundits Mike Atherton and Richie Benaud criticised the team's performances and suggested Bangladesh was not yet suited to Test cricket.  A triangular series with England and Australia followed. Bangladesh won just one match out of six, but their solitary victory was against an Australian side that at the time were world champions in what Wisden described as \"the biggest upset in one-day international history\". Mohammad Ashraful scored his first century in that match with a score of exactly 100, which was enough to take the team to victory and then played a blistering knock of 94 off 53 balls against England the following match.  Bangladesh's next fixture was in Sri Lanka in September for two Tests and three ODIs. After the one-off victory against Australia in England, Bangladesh were a more confident team however Sri Lanka won all five matches by large margins. Captain Habibul Bashar lamented his side's defeat, describing it as \"the worst tour since I took over the captaincy\".  , The first home One-Day International series of 2006 began with some optimism for Bangladesh, which registered its first-ever win against Sri Lanka in the second ODI of the series. At the end of March, Bangladesh played four ODIs against Kenya , winning all four. Then in April, Bangladesh came very close to beating Australia in a Test match, taking a first-innings lead of 158, and eventually losing by only three wickets.  At the end of July, Bangladesh toured Zimbabwe as the ODI series favourites but lost 3–2. In August, the team defeated Kenya in all three matches of a series and subsequently went on to whitewash Zimbabwe in an ODI series staged in Bangladesh. That year, Shahriar Nafees became the first Bangladeshi to score over a thousand runs (which included three centuries) in a calendar year  while Mashrafe Mortaza became the leading wicket-taker in the world in ODIs staged in 2006 with 49 wickets.  , India hosted the 2006 ICC Champions Trophy in October and November. Bangladesh failed to progress beyond the group stages, losing two of their three matches. Their only victory came against Zimbabwe.  Ahead of the World Cup Bangladesh faced Zimbabwe in nine ODIs, Scotland in two, and Bermuda and Canada one each; of those matches, Bangladesh lost a single ODI to Zimbabwe.  On 17 March, in their first match of the 2007 World Cup , hosted by the West Indies, Bangladesh secured a five-wicket win over India; the surprise result triggered late night partying in Bangladesh despite government bans on public gatherings.  In their remaining group matches Bangladesh lost to Sri Lanka and defeated Bermuda which was enough to secure qualification for the second round while India were knocked out. Bangladesh's only victory in the Super Eights was against South Africa, losing to everyone else including Ireland ,  a team mostly made up of amateur cricketers.  , Bangladesh's next fixture after the World Cup was a home series against India in May, with two Tests and three ODIs. After Bangladesh had helped knock India out of the tournament, the series was seen as an opportunity for India to exact revenge. Bangladesh had not played Test cricket since April 2006. The first Test was shortened due to rain and drawn, but India won the second by their largest ever margin. India won the ODI series 3–0.  In the aftermath Habibul Bashar, who had previously resigned as ODI captain, was replaced as captain by 22-year-old Mohammad Ashraful in all forms of the game. Mashrafe Mortaza was appointed vice-captain.  After four years as coach Whatmore chose not to extend his contract, and Shaun Williams temporarily filled the position. Ashraful's first series in charge was a tour of Sri Lanka in June and July. Bangladesh suffered defeat in each of the three Tests, losing by an innings on every occasion, and three ODIs. In the second Test, Bangladesh were bundled out for their lowest total (62).  , South Africa hosted the 2007 ICC World Twenty20 in September. In a match against Bangladesh, Australian fast bowler Brett Lee took the first ever Twenty20 International (T20I) hat-trick. Bangladesh defeated the West Indies to progress to the second stage of the tournament, however it was the only match they won in the tournament.  Jamie Siddons was appointed coach in October.  At the end of 2007 Bangladesh toured New Zealand. Bangladesh was soundly beaten 3–0 in the one dayers. The third match was the largest defeat in the history of ODI cricket for a side batting first. , Bangladesh started the year 2008 with a tour of New Zealand. The Test matches were one sided, with Bangladesh losing 2–0. South Africa toured Bangladesh and won all matches, including both Tests and all three ODIs. Bangladesh then beat non-Test-playing Ireland 3–0 in an ODI series. , In October, New Zealand toured Bangladesh for three ODIs and two Tests. Shortly before the tour, fourteen Bangladesh players left to play in the Indian Cricket League and were subsequently banned for ten years. Six of the players were centrally contracted, including former captain Habibul Bashar. With a less experienced team than usual and a poor record against New Zealand, Bangladesh were expected to lose heavily. After winning the opening ODI, Bangladesh went on to lose series 2–1.  New Zealand won the first Test by three wickets in what their coach, John Bracewell , described as \"one of the great character wins\".  , New Zealand also won the second Test, taking the series 2–0, but in the process Shakib Al Hasan emerged as an all-rounder. Having previously been selected primarily as a batsmen, he went on to take the best bowling figures in an innings for a Bangladesh player, 7 wickets for 36 runs,  beating the record set by Enamul Haque Jr three years earlier. , In November, Bangladesh toured South Africa. They lost all their matches to South Africa, including the only T20I match, two of the three ODIs (the third being washed out due to rain) and both Tests. In December, however, Bangladesh bounced back from the previous lacklustre performances by threatening to win the first Test match against Sri Lanka by chasing down the highest fourth innings of total of 513. Though they fell 107 runs short, their performances were praised but in the second match of the home series in January, Bangladesh fell to an innings defeat. , The year 2009 started with the innings defeat in the 2nd Test match against Sri Lanka. Then Zimbabwe joined the hosts and the Lankan team for a tri-series tournament, which proved to be more evenly matched than was expected. In the first match, Zimbabwe defeated Bangladesh by an excellent performance but then fell to defeat by a huge margin by Sri Lanka leaving Bangladesh needing to win against the Lankans in the last match to go through to the finals to join the Lankans, and that also with a bonus point. , After the World T20 championships in England, the selectors appointed Mashrafe Mortaza as the new captain of the team for the tour to the West Indies so that Ashraful could focus on his batting.  The two Test series was played amidst controversy when a pay dispute between the West Indian players and the West Indies Cricket Board led a number of West Indian players boycotting the series, which forced the West Indies to select a number of inexperienced players as replacements.  Bangladesh went on to win both of the Tests, winning the first Test by 95 runs  and the second by four wickets.  In the process they achieved their first ever overseas Test series victory.  , In the ODI series which followed Bangladesh secured their first ever ODI win against the West Indies at the 14th attempt.  Bangladesh won the series 3–0,  but lost the only Twenty20 match.  In November, Shakib was named The Wisden Cricketer 's \"Test Player of the Year\".  , In January 2010, Bangladesh hosted a tri-series ODI tournament with India and Sri Lanka. They failed to win a match and went out of the tournament. They lost the two match Test series against India by 2–0. In March 2010, England visited Bangladesh to play three ODIs and two Test matches . Bangladesh lost all their ODIs and Tests in the series. In April, Bangladesh took part in the 2010 World Twenty20 . They lost all their matches and failed to progress to the Super Eights stage. In May and June, Bangladesh played two Test matches against England away , losing both, although Tamim Iqbal scored two centuries in the series. Between the Tests and ODIs against England, Bangladesh took part in the 2010 Asia Cup during June, but lost all their matches. In the ODI series, England comfortably won the first match. However, in the second match at Bristol, Bangladesh beat England for the first time in international cricket (England were the only Test playing nation yet to be beaten by Bangladesh), bowling England out in the final over to win by five runs.  , In October New Zealand went to Bangladesh for five ODIs. Mortaza suffered an injury in the first match and Shakib took over as captain. Under his leadership Bangladesh won the series 4–0, securing their first series victory against a full strength ICC Full Member nation.    Although unable to play against New Zealand due to injury, while the series was in progress Tamim Iqbal was named The Wisden Cricketer's \"Test Player of the Year\".  In December Bangladesh hosted Zimbabwe for five ODIs . After losing the opening match,  Bangladesh went on to win the next three complete matches, with one called off due to rain, to beat Zimbabwe 3–1.  , In February and March 2011, Bangladesh co-hosted the World Cup with India and Sri Lanka. West Indies dismissed Bangladesh for 58 runs, the team's lowest score in ODIs and a record low for a Full Member at the World Cup.  The West Indies and Bangladesh team buses were stoned as they left the ground,  and so was Shakib's house.  Bangladesh beat England, Ireland, and the Netherlands, making their final match of the first round a must-win contest. Against South Africa, Bangladesh succumbed to a their second-largest defeat in ODIs and became the first Full Member team to be bowled out for under 100 twice in World Cups, thereby failing to progress to the second stage of the tournament.  After the World Cup, Siddons' contract was allowed to lapse.  During his three-and-a-half-year tenure as coach Siddons introduced a full coaching staff for the first time, including coaches for bowling, strength and conditioning, and fielding. Under Siddons Bangladesh's reliance on spin bowlers continued, partly because pitches in the country encourage spin bowlers, and frequently only two seam bowlers were used in a match. Siddons was credited with helping the team improve mentally.  , A lengthy hunt for a head coach followed Siddons' exit encountering the names of Vincent Barnes and Stuart Law as possible appointees.  Law, who at the time was the acting head coach of Sri Lanka following Trevor Bayliss ' departure, was named Bangladesh's new head coach in June.  Bangladesh toured Zimbabwe in August for a one-off Test and five ODIs.  The Test marked Zimbabwe's return to the longest-format of the game after a self-imposed withdrawal in January 2006 as the sport in the country was in a state of disarray. Bangladesh lost the match by 130 runs.  Though they were expected to with the Test and the ODIs, Bangladesh lost the subsequent one-day series 3–2. In the aftermath of the series, Shakib was sacked as captain, with a BCB representative citing his poor leadership.  Later that month, wicket-keeper Mushfiqur Rahim was named captain, with all-rounder Mahmudullah as his deputy.  Bangladesh' struggles at international level have been epitomised by the ineffectiveness of their fast bowlers. Between January 2010 and August 2011, they took 37 wickets in 8 Tests at an average of 67.67, the worst out of the nine teams playing regular Test cricket in this period.  , Though Bangladesh won Rahim's first match in charge, a T20I against the West Indies in October, the team lost the subsequent ODI series 2–1 and the two-match Test series 1–0.  Pakistan toured in December , and during the first of three ODIs Bangladesh were dismissed for their 13th score of less than 100 in the format, overtaking Zimbabwe's record of 12 times.  In March Bangladesh hosted in the 2012 Asia Cup featuring India, Pakistan, and Sri Lanka. Bangladesh entered the tournament with just two wins from 29 Asia Cup matches.  Victories against India and Sri Lanka saw Bangladesh face Pakistan in the final, only the second time the team had reached the final of a multi-national competition.  Though Pakistan won the final by two runs, Bangladesh had exceeded expectations.  During the tournament, Tamim Iqbal became the first Bangladeshi player to score four consecutive fifties in ODIs. Shakib Al Hasan was named man of the series after contributing with both the bat and the ball, making 237 runs and taking 6 wickets respectively.  The following month Law announced he would be stepping down as coach in June when his contract was due to expire for personal reasons.  , Shane Jurgensen , the 36-year-old Australian, was appointed as Bangladesh's head coach. He was the side's interim coach in their previous international series, against West Indies in which the home side won the ODI series 3–2.  , Bangladesh toured Sri Lanka in March for a full series. They achieved a huge feat in the 1st Test at Galle. Mushfiqure Rahim scored the first double century for Bangladesh in test cricket,  Mohammad Ashraful chipping in with a handy 190. They drew the Test against Sri Lanka, first time against them on the way to creating some new Bangladesh records. The 2nd test was lost and they ultimately lost the series (0–1). After losing the 1st ODI by 8 wickets and no result in the 2nd ODI (due to heavy rain) Bangladesh won the rain affected 3rd ODI to share the ODI series (1–1). They lost the one-off T20I. , Then they toured Zimbabwe for Zimbabwe's Test comeback series. Bangladesh lost the 1st Test by 335 runs and won the 2nd Test by 173 runs and drew the series (1–1). Lost the ODI series (1–2) and drew T20I series (1–1). , Later in 2013 Bangladesh drew the two-test series (0–0) at home soil against New Zealand for the first time in their history, followed by 3–0 series whitewash win in ODIs. But lost the one off T20I. , After a relatively good year (2013) for Bangladesh, 2014 started with a full series at home against Sri Lanka. 1st Test was lost by an innings and the 2nd test was a draw, ended up losing the series (0–1). Bangladesh got whitewashed in both ODI (0–3) and T20I (0–2) series. , That was followed up by a series of defeats against Asian Cricketing nations (India, Afghanistan, Pakistan and Sri Lanka) at the Asia Cup 2014 league matches conducted at their home soil. The highlight was the loss to Afghanistan which is an Associate member. Lost all (0–4) and finished at the bottom of the table. , Bangladesh ended their winless run for 11 games in 2014 defeating two associates (Afghanistan and Nepal) in consecutive T20Is at the World T20 2014 Qualifying round but lost to another associate Hong Kong. In the following Super 10, Bangladesh lost all (0–4) their matches. , Bangladesh coach, has resigned from his position less than a month after the World T20, where his team won just two out of seven matches.  , The BCB has appointed Chandika Hathurusingha , the former Sri Lanka batsman, as Bangladesh's head coach for a two-year period.  The first series under the new coach was against India at home. Bangladesh lost the first & second ODI comprehensively and the 3rd was washed out and lost the series 2–0. , Later Bangladesh toured West Indies for a full series in August. West Indies beat Bangladesh 3–0 in the ODI series extending Bangladesh's win-less ODI run for 13 matches. In the 2nd ODI Bangladesh was bundled out for 70 which is the 3rd lowest total for Bangladesh. Bangladesh lost the match by 177 Runs. Only the T20 match was abandoned. Futher,West Indies white washed Bangladesh in the Test series 2–0, defeating Bangladesh by 10 wickets in the 1st Test and by 296 runs in the 2nd Test respectively. Bangladesh finally emerged victorious during the Zimbabwe tour in Bangladesh whitewashing the visitors 3-0 during the Test series. Bangladesh claimed #9 ranking with the series victory pushing Zimbabwe to #10. In the ODI series Bangladesh whitewashed Zimbabwe 5-0. At the turn of the new year, Bangladeshi all-rounder Shakib Al Hasan  emerged as the number one all rounder in all formats of the game. This was the first time ever that any player achieved such a feat, after the ICC introduced ranking system.  , During the group stage of the ICC World Cup 2015 , Bangladesh defeated Afghanistan and the match against Australia was washed up. They then lost to Sri Lanka by 92 runs. Following that, they achieved their highest successful run-chase in an ODI when they chased down Scotland's 318 and later qualified for the second quarterfinal in 2015 world cup by defeating England. At the second quarter final, India defeated Bangladesh by 109 runs.But Bangladeshi fans, cricket administrators and politicians alleged that the Bangladeshi team was robbed of the victory because of an incorrect no ball called by the on-field umpires Ian Gould and Aleem Dar at 40.4 overs. Bangladesh was finally knocked out of the 2015 World Cup, after reaching the quarter-finals for the first time. , On arriving back in Bangladesh on the 22nd of March after a successful World Cup campaign, the whole team was given a grand reception at the Airport. After arrival recently Bangladesh played a ODI series where they won 3-0against Pakistan . , A full strength Indian team arrived to Bangladesh on June after the series \"Banglawash\" against Pakistan. The Indians were expected to win comfortably. However, excellent performances by the batsmen and ODI debutant bowler Mustafizur Rahman had the tables turned over as Bangladesh convincingly won the first two ODIs and for the first time, won a bilateral series against India by a margin of 2-1 to Bangladesh. All the matches were hosted in Mirpur , The following is a list of the 15 players awarded central contracts by the Bangladesh Cricket Board  and others who have represented Bangladesh in the last year, and the forms of the game in which they have played. , The Bangladesh Cricket Board (BCB) is the governing body for the Bangladeshi cricket team  and the sport in the country. The BCB is responsible for maintaining grounds and promoting the sport. It was founded in 1972 as the Bangladesh Cricket Control Board.  Its first constitution was drafted in 1976.  The board changed its name, dropping \"control\" from its title, in January 2007.  The president of the BCB is appointed by the government of Bangladesh.  The board also controls the team's sponsorship. Since 2003 telecommunications company Grameenphone has sponsored the men and women's national teams. Between 2007 and 2011 they invested 151.5 million Bangladeshi taka in developing sport in the country.  In 2006 the Board established an academy to encourage the development of young and inexperienced players.  The Board issues central contracts to the national players and issuing match fees. In 2005 players were given about $1,000 for each Test they played and $500 per ODI.  , Before Bangladesh had even secured Test status, cricket fans in the country took the game seriously; when the team lost an ODI against Kenya in March 1999, several hundred fans protested outside the offices of the Bangladesh Cricket Board (BCB).  On learning of Bangladesh's promotion to Test status, thousands of people celebrated on the streets. Then Prime Minister Sheikh Hasina remarked that \"I can't express my joy in words at this happiest hour of the nation\".  At the time cricket was the second-most popular sport in the country behind football.  When Bangladesh began its first Test match on 10 November 2000 at Bangabandhu National Stadium in Dhaka, the stadium was nearly full on the first day as around 40,000 people watched the team take on India. As the match partly overlapped with the festival of Shab-e-Barat , numbers attending declined as the match progressed.  In 2011, Bangladeshi politician Saber Hossain Chowdhury , opined that \"In Bangladesh cricket is not simply a game, it is a symbol of national unity\",  and in the words of AHM Mostofa Kamal, president of the BCB in 2011, \"People of [Bangladesh] take cricket religiously\".  , The people of Bangladesh are referred as \"the most passionate cricket fans\" among the cricket world. When Bangladesh are victorious, the fans sometimes take to the streets in celebration. When Bangladesh defeated South Africa in the 2007 World Cup, thousands of people celebrated into the night on the streets of Dhaka despite there being a ban on public gatherings at the time.  Although fans are jubilant in victory, they can also be vocal in defeat. When Bangladesh lost to England in an ODI in November 2003, the then captain Khaled Mahmud was booed off the field.  During the 2011 World Cup, Bangladesh succumbed to a record defeat against West Indies, registering the team's lowest score in ODIs. The buses of both teams were stoned (Bangladesh's intentionally, West Indies' mistakenly), as was Shakib Al Hasan's house.  , International Match Summary – Bangladesh    , Last updated 21 June 2015. , Most Test runs for Bangladesh  , Most Test wickets for Bangladesh  , Test record versus other nations  , Records complete to Test #2165. Last updated 14 June 2015. , Most ODI runs for Bangladesh  , Most ODI wickets for Bangladesh  , ODI record versus other nations  , Records complete to ODI #3660. Last updated 21 June 2015. , Most T20I runs for Bangladesh  , Most T20I wickets for Bangladesh  , T20I record versus other nations  , Records complete to T20I #416. Last updated 24 April 2015. "
}
