{
  "category": "cricket",
  "article": "The England cricket team  is the team that represents England and Wales (and until 1992 also Scotland ) in international cricket . Since 1 January 1997 it has been governed by the England and Wales Cricket Board (ECB), having been previously governed by Marylebone Cricket Club (MCC) from 1903 until the end of 1996.   , England and Australia were the first teams to play a Test match (between 15–19 March 1877), and these two countries together with South Africa formed the Imperial Cricket Conference (predecessor to today's International Cricket Council ) on 15 June 1909. England and Australia also played the first One Day International (ODI) on 5 January 1971. England's first Twenty20 International (T20I) was played on 13 June 2005, once more against Australia. , As of 2 June 2015, England has played 957 Test matches, winning 341 and losing 277 (with 339 draws).  The team has played 644 ODIs, winning 309,  and its record in ODI tournaments includes finishing as runners-up in three Cricket World Cups (1979, 1987 and 1992), and also as runners-up in the ICC Champions Trophy in 2004 and 2013. Finally, the team has played 74 T20Is, winning 34,  and won the ICC World Twenty20 in 2010. , England is currently ranked fifth in Tests, sixth in ODIs and eighth in T20Is by the ICC.  , , , The first recorded incidence of a team with a claim to represent England comes from 9 July 1739 when an \"All-England\" team, which consisted of 11 gentlemen from any part of England exclusive of Kent , played against \"the Unconquerable County\" of Kent and lost by a margin of \"very few notches\".  Such matches were repeated on numerous occasions for the best part of a century. , In 1846 William Clarke formed the All-England Eleven . This team would eventually compete against a United All-England Eleven with annual matches occurring between 1847 to 1856. These matches were arguably the most important contest of the English season, if judged by the quality of the players. , The first overseas tour occurred in September 1859 with England touring North America. This team had six players from the All-England Eleven, six from the United All-England Eleven and was captained by George Parr . , With the outbreak of the American Civil War , attention turned elsewhere. English tourists visited Australia in 1861-62 with this first tour organised as a commercial venture by Messrs Spiers and Pond, restaurateurs of Melbourne . Most matches played during tours prior to 1877 were \"against odds\", with the opposing team fielding more than 11 players to make for a more even contest.  This first Australian tour were mostly against odds of at least 18/11. , The tour was so successful that George Parr led a second tour in 1863–64 . James Lillywhite led a subsequent England team which sailed on the P&O steamship Poonah on 21 September 1876. They would play a combined Australian XI, for once on even terms of 11 a side. The match, starting on 15 March 1877 at the Melbourne Cricket Ground came to be regarded as the inaugural Test match. The combined Australian XI won this Test match by 45 runs with Charles Bannerman of Australia scoring the first Test century. At the time, the match was promoted as James Lillywhite's XI v Combined Victoria and New South Wales .  The teams played a return match on the same ground at Easter, 1877, when Lillywhite's team avenged their loss with a victory by four wickets. The first Test match on English soil occurred in 1880 with England victorious; this was the first time England fielded a fully representative side with W.G. Grace included in the team.  , England lost their first home series 1–0 in 1882 with The Sporting Times printing an obituary on English cricket: , As a result of this loss the tour of 1882–83 was dubbed by England captain Ivo Bligh as \"the quest to regain the ashes\". England with a mixture of amateurs and professionals won the series 2–1.  Bligh was presented with an urn that contained some ashes, which have variously been said to be of a bail , ball or even a woman's veil and so The Ashes was born. A fourth match was then played which Australia won by 4 wickets but the match was not considered part of the Ashes series.   England would dominate many of these early contests with England winning the Ashes series 10 times between 1884 and 1898.  During this period England also played their first Test match against South Africa in 1889 at Port Elizabeth .  , The 1899 Ashes series was the first tour where the MCC and the counties appointed a selection committee. There were three active players: Lord Hawke , W. G. Grace and Herbert Bainbridge who was the captain of Warwickshire. Prior to this, England teams for home Tests had been chosen by the club on whose ground the match was to be played. , The start of the 20th century saw mixed results for England as they lost four of the eight Ashes series between 1900 and 1914.  During this period England would lose their first series against South Africa in the 1905–06 season 4–1 as their batting faltered.  The 1912 season saw England take part in a unique experiment. A nine Test triangular tournament involving England, South Africa and Australia was set up. The series was hampered by a very wet summer and player disputes however and the tournament was considered a failure with the Daily Telegraph stating:  , With Australia sending a weakened team and the South African bowlers being ineffective England dominated the tournament winning four of their six matches. The Australia v South Africa match, at Lord's, was notable for a visit by King George V , the first time a reigning monarch had watched Test cricket.  England would go on one more tour against South Africa before the outbreak of World War I. , England's first match after the war was in the 1920–21 season against Australia. Still feeling the effects of the war England went down to a series of crushing defeats, and suffered their first whitewash losing the series 5–0. Six Australians scored hundreds while Mailey spun out 36 English batsmen. Things were no better in the next few Ashes series losing the 1921 Ashes series 3–0 and the 1924–5 Ashes 4–1. England's fortunes were to change in 1926 as they regained the Ashes and were a formidable team during this period dispatching Australia 4–1 in the 1928–29 Ashes tour. , On the same year the West Indies became the fourth nation to be granted Test status and played their first game against England. England won each of these three Tests by an innings, and a view was expressed in the press that their elevation had proved a mistake although Learie Constantine did the double on the tour. In the 1929–30 season England went on two concurrent tours with one team going to New Zealand (who were granted Test status earlier that year) and the other to the West Indies. Despite sending two separate teams England won both tours beating New Zealand 1–0 and the West Indies 2–1. , The 1930 Ashes series saw a young Don Bradman dominate the tour, scoring 974 runs in his seven Test innings. He scored 254 at Lord's, 334 at Headingley and 232 at the Oval. Australia regained the Ashes winning the series 3–1. As a result of Bradman's prolific run-scoring the England captain Douglas Jardine chose to develop the already existing leg theory into fast leg theory, or bodyline, as a tactic to stop Bradman. Fast leg theory involved bowling fast balls directly at the batsman's body. The batsman would need to defend himself, and if he touched the ball with the bat, he risked being caught by one of a large number of fielders placed on the leg side. , Using his fast leg theory England won the next Ashes series 4–1. But complaints about the Bodyline tactic caused crowd disruption on the tour, and threats of diplomatic action from the Australian Cricket Board , which during the tour sent the following cable to the MCC in London: , Later, Jardine was removed from the captaincy and the laws of cricket changed so that no more than one fast ball aimed at the body was permitted per over, and having more than two fielders behind square leg were banned. , England's following tour of India in the 1933–34 season was the first Test match to be staged in the subcontinent. The series was also notable for Morris Nichols and Nobby Clark bowling so many bouncers that the Indian batsman wore solar topees instead of caps to protect themselves. , Australia won the 1934 Ashes series 2–1 and would keep the urn for the following 19 years. Many of the wickets of the time were friendly to batsmen resulting in a large proportion of matches ending in high scoring draws and many batting records being set. , The 1938–39 tour of South Africa saw another experiment with the deciding Test being a timeless Test that was played to a finish. England lead 1–0 going into the final timeless match at Durban. Despite the final Test being 'timeless', the game ended in a draw after 10 days as England had to catch the train to catch the boat home. A record 1,981 runs were scored, and the concept of timeless Tests was abandoned. England would go in one final tour of the West Indies in 1939 before World War II , although a team for an MCC tour of India was selected more in hope than expectation of the matches being played. , After World War II, England fell under difficult times suffering a heavy defeat 3–0 to Australia. This was followed by a 4–0 loss to Bradman's 'invincibles' and a stunning 2–0 loss to the West Indies. These loses were tempered by victories against India and South Africa. , Their fortunes would change in the 1953 Ashes tour as they won the series 1–0. England would not lose a series between their 1950–51 and 1958–59 tours of Australia and secured famous victory in 1954–55 thanks to Typhoon Tyson whose 6–85 at Sydney and 7–27 at Melbourne are remembered as the fastest bowling ever seen in Australia. The 1956 series was remembered for the bowling of Jim Laker who took 46 wickets at 9.62 which included bowling figures of 19/90 at Old Trafford . After drawing to South Africa, England defeated the West Indies and New Zealand comfortably. The England team would then leave for Australia in the 1958–59 season with a team that had been hailed as the strongest ever to leave on an Ashes tour but lost the series 4–0 as Richie Benaud 's revitalised Australians were too strong. , The early and middle 1960s were poor periods for English cricket. Despite England's strength on paper, Australia held the Ashes and the West Indies dominated England in the early part of the decade. However, from 1968 to 1971 they played 27 consecutive Test matches without defeat, winning 9 and drawing 18 (including the abandoned Test at Melbourne in 1970–71). The sequence began when they drew with Australia at Lords in the Second Test of the 1968 Ashes series and ended in 1971 when India won the Third Test at the Oval by 4 wickets. They played 13 Tests with only one defeat immediately beforehand and so played a total of 40 consecutive Tests with only one defeat, dating from their innings victory over the West Indies at The Oval in 1966. During this period they beat New Zealand, India, the West Indies, Pakistan and, under Ray Illingworth 's determined leadership, regained The Ashes from Australia in 1970–71. , The 1970s, for the England team, can be largely split into three parts. The early 70s saw Ray Illingworth 's side dominate world cricket winning the Ashes away in 1971 and then retaining them at home in 1972. The same side beat Pakistan at home in 1971 and played by far the better cricket against India that season. However, England were largely helped by the rain to sneak the Pakistan series 1–0 but the same rain saved India twice and one England collapse saw them lose to India. This was, however, one of (if not the) strongest England team ever with Boycott, Edrich, D'Oliveira, Amiss, Illingworth, Knott, Snow, Underwood amongst its core. , The mid-1970s were more turbulent. Illingworth and several others had refused to tour India in 1972–73 which led to a clamour for Illingworth's job by the end of that summer – England had just been thrashed 2–0 by a flamboyant West Indies side – with several England players well over 35. Mike Denness was the surprising choice but only lasted 18 months; his results against poor opposition were good but England were badly exposed as ageing and lacking in good fast bowling against the 1974–75 Australians, losing that series 4–1 to lose the Ashes. , Denness was replaced in 1975 by Tony Greig . While he managed to avoid losing to Australia, his side were largely thrashed the following year by the young and very much upcoming West Indies for whom Greig's infamous \"grovel\" remark acted as motivation. Greig's finest hour was probably the 1976–77 win over India in India. When Greig was discovered as being instrumental in World Series Cricket, he was sacked, and replaced by Mike Brearley . , Brearley's side showed again the hyperbole that is often spoken when one side dominates in cricket. While his side of 1977–80 contained some young players who went on to become England greats, most notably future captains Ian Botham , David Gower and Graham Gooch , their opponents were often very much weakened by the absence of their World Series players, especially in 1978, when England beat New Zealand 3–0 and Pakistan 2–0 before thrashing what was probably Australia's 3rd XI 5–1 in 1978–79. , The England team, with Brearley's exit in 1980, was never truly settled throughout the 1980s, which will probably be remembered as a low point for the team. While some of the great players like Botham, Gooch and Gower had fine careers, the team seldom succeeded in beating good opposition throughout the decade and did not score a home Test victory (except against minnows Sri Lanka) between September 1985 and July 1990. In this time, undoubted highlights were the Ashes victories of 1981 \"Botham's Ashes\", 1985 and 1986–87. The 1985 and 1986–87 victories, while sweet for the team, exposed more Australia's weakness than England's strength. , If the 1980s were a low point for English Test cricket then the 1990s were only a slight improvement. The arrival of Graham Gooch as captain in 1990 forced a move toward more professionalism and especially fitness, though it took some time for old habits to die. Even in 2011, one or two successful county players have been shown up as physically unfit for international cricket. Creditable performances against India and New Zealand in 1990 were followed by a hard fought draw against the 1991 West Indies but landmark losses against Australia in 1990–91 and especially Pakistan in 1992 showed England up badly in terms of bowling. So bad was England's bowling in 1993 that Rodney Marsh described England's pace attack at one point as \"pie throwers\". Having lost three of the first four Tests played in England in 1993 Graham Gooch resigned to be replaced by Mike Atherton . , More selectorial problems abounded during Atherton's reign as new chairman of selectors / coach Ray Illingworth (then into his 60s) assumed almost sole responsibility for the team off the field. The youth policy which had seen England emerge from the West Indies tour of 1993–94 with some credit (though losing to a seasoned WIndies team) was abandoned and players such as Gatting and Gooch were persisted with when well into their 30s and 40s. England duly continued to do well at home against weaker opponents such as India, New Zealand and a West Indies side beginning to fade but struggled badly against improving sides like Pakistan and South Africa. Atherton had offered his resignation after losing the 1997 Ashes series 3–2 having been 1–0 up after 2 matches – eventually to resign one series later in early 1998. England, looking for talent, went through a whole raft of new players during this period, such as Ronnie Irani , Adam Hollioake , Craig White , Graeme Hick , Mark Ramprakash . At this time, there were two main problems: , Alec Stewart took the reins as captain in 1998 but another losing Ashes series and early World Cup exit cost him Test and ODI captaincy in 1999. This should not detract from the 1998 home Test series where England showed great fortitude to beat a powerful South African side 2–1. , Another reason for their poor performances were the demands of County Cricket teams on their players, meaning that England could rarely field a full strength team on their tours. This would eventually lead to the ECB taking over the MCC as the governing body of England and the implementation of central contracts. 1992 also saw Scotland sever ties with the England and Wales team, and begin to compete independently as the Scotland national cricket team . , By 1999, with coach David Lloyd resigning after the World Cup exit and new captain Nasser Hussain just appointed, England hit rock bottom (literally ranked as lowest-rated Test nation) after losing in shambolic fashion to New Zealand 2–1. Hussain was booed on the Oval balcony as the crowd jeered \"We've got the worst team in the world\" to the tune of \" He's Got the Whole World in His Hands \". , One year later, with central contracts now installed reducing players workloads and the arrival of Zimbabwean coach Duncan Fletcher , England had thrashed the fallen West Indies 3–1 . England's results in Asia improved markedly that winter with series wins against both Pakistan and Sri Lanka though one-day success still eluded them. , England's fortunes improved under the new management – not without the occasional \"blip\" particularly against Australia but home Test wins became commonplace. Hussain's side had a far harder edge to it, even managing to avoid the anticipated \"Greenwash\" in the 2001 Ashes series against the all-powerful Australian team. The nucleus of a side of fighters was slowly coming together as players such as Hussain himself, Graham Thorpe , Darren Gough and Ashley Giles began to be regularly selected. By 2003 though, having endured another Ashes drubbing as well as another first-round exit from the World Cup , Hussain felt he could not continue and resigned after one Test against South Africa , though carried on as a batsman until 2004. , Michael Vaughan took over and, while keeping the emphasis as Hussain on fitness and control, encouraged players to express themselves. This especially brought the best out of Andrew Flintoff who, in a career blighted by serious injury managed a real purple patch of 18 months from 2004 to 2005 in which England won five consecutive test series prior to facing Australia in the 2005 Ashes series , taking the team to second place in the ICC Test Championship table. During this period England defeated the West Indies home and away , New Zealand , and Bangladesh at home, and South Africa in South Africa. , In June 2005, England played its first ever T20 international match , defeating Australia by 100 runs . , Later that year, England defeated Australia 2–1 in a thrilling series to regain the Ashes for the first time in 16 years having lost them in 1989. Following the 2005 Ashes win, the team suffered from a spate of serious injuries to key players such as Vaughan, Flintoff, Giles and Simon Jones . As a result, the team underwent an enforced period of transition. A 2–0 defeat in Pakistan was followed by two drawn away series with India and Sri Lanka . , In the home Test series victory against Pakistan in July and August 2006, several promising new players emerged. Most notable were the left-arm orthodox spin bowler Monty Panesar , the first Sikh to play Test cricket for England; and left-handed opening batsman Alastair Cook . Meanwhile England's injury problems allowed previously marginal Test players such as Paul Collingwood and Ian Bell to consolidate their places in the team. , The 2006–07 Ashes series was keenly anticipated and was expected to provide a level of competition comparable to the 2005 series. In the event, England, captained by Flintoff who was deputising for the injured Vaughan, lost all five Tests to concede the first Ashes whitewash in 86 years. , England's form in ODIs had been consistently poor. They only narrowly avoided the ignominy of having to play in the qualifying rounds of the 2006 ICC Champions Trophy . Despite this, in the ODI triangular in Australia, England recorded its first ODI tournament win overseas since 1997. But, in the 2007 Cricket World Cup , England lost to most of the Test playing nations they faced, beating only the West Indies and Bangladesh , although they also avoided defeat by any of the non-Test playing nations. Even so, the unimpressive nature of most of their victories in the tournament, combined with heavy defeats by New Zealand, Australia and South Africa, left many commentators criticising the manner in which the England team approached the one-day game. Coach Duncan Fletcher resigned after eight years in the job as a result and was succeeded by former Sussex coach Peter Moores . , Afterwards, England's Test record was indifferent and the team slumped to fifth in the ICC rankings. There was a convincing 3–0 Test series win over West Indies in 2007 but it was followed in the second half of the summer by a 1–0 loss to India , although England did defeat India 4–3 in the ODI series . , In 2007–08, England toured Sri Lanka and New Zealand , losing the first series 1–0 and winning the second 2–1. They followed up at home in May 2008 with a 2–0 home series win against New Zealand , these results easing the pressure on Moores, who was not at ease with his team, particularly star batsman Kevin Pietersen , who succeeded Vaughan as captain in June 2008, after England had been well beaten by South Africa at home . , The poor relationship between Moores and Pietersen came to a head in India on the 2008–09 tour . England lost the series 1–0 and both men resigned their positions, although Pietersen remained a member of the England team. Moores was replaced as coach by Zimbabwean Andy Flower . Against this background, England toured the West Indies under the captaincy of Andrew Strauss and, in a disappointing performance, lost the Test series 1–0. , The second Twenty20 World Cup was held in England in 2009 but England suffered an opening day defeat to the Netherlands. They recovered to defeat both eventual champions Pakistan and reigning champions India but were then knocked out by West Indies. , This was followed by the 2009 Ashes series which featured the first Test match played in Wales, at SWALEC Stadium , Cardiff. England drew that match thanks to a last wicket stand by bowlers James Anderson and Monty Panesar . A victory for each team followed before the series was decided at The Oval . Thanks to fine bowling by Stuart Broad and Graeme Swann and a debut century by Jonathan Trott , England regained the Ashes. , After a drawn Test series in South Africa , England won their first ever ICC tournament, the 2010 ICC World Twenty20 . The following winter, they thrashed Australia 3–1 to retain the Ashes; it was their first series win in Australia for 24 years, and included three innings victories and 766 runs by opener Alastair Cook . , England struggled to match their Test form in the 2011 ICC Cricket World Cup . Despite beating South Africa and tying with eventual winners India, England suffered shock losses to Ireland and Bangladesh before losing in the quarter-finals to Sri Lanka.  However the team's excellent form in the Test match arena continued and they became the world's top ranked Test team after comfortably whitewashing India 4–0 , their sixth consecutive series victory and eighth in the past nine series. However, this status only lasted a year – having lost 3–0 to Pakistan over the winter, England were beaten 2–0 by South Africa , who replaced them at the top of the rankings. It was their first home series loss since 2008, against the same opposition. , This loss saw the resignation of Strauss as captain (and his retirement from cricket). His replacement, Alastair Cook, who was already in charge of the ODI side, led England to a 2–1 victory in India – their first in the country since 1984–85. In doing so, Cook became the first ever captain to score centuries in his first five Tests as captain and became England's leading century-maker with 23 hundreds. , After finishing as runners-up in the ICC Champions Trophy , England faced Australia in back-to-back Ashes series. A 3–0 home win secured England the urn for the fourth time in five series. However, in the return series , they found themselves utterly demolished in a 5–0 defeat, their second Ashes whitewash in under a decade. Their misery was compounded by batsman Jonathan Trott leaving the tour early due to a stress-related illness and the mid-series retirement of spinner Graeme Swann . Following the tour, head coach Andy Flower resigned his post whilst batsman Kevin Pietersen was dropped indefinitely from the England team.  Flower was replaced by his predecessor, Peter Moores, but he was sacked for a second time after a string of disappointing results including failing to advance from the group stage at the 2015 World Cup . , As set out by the ICC 's Future Tours Programme, below is England's full international fixture list until the end of the 2019–20 season.  It therefore does not include the 2021 ICC World Test Championship to be held in India, the 2023 Cricket World Cup to be held in India or the 2020 ICC World Twenty20 to be held in Australia. The venues for the home games are in brackets and reflect the announcement made in 2011 for hosting until 2016.   , Summer 2015 , Winter 2015–16 , Summer 2016 , Winter 2016–17 , Summer 2017 , Winter 2017–18 , Summer 2018 , Winter 2018–19 , Summer 2019 , Winter 2019–20 , England have traditionally been one of the stronger teams in international cricket, fielding a competitive side for most of cricket's history . Up to the start of June 2015, England had played 957 Test matches, winning 341 (35.63%), losing 277 (28.94%), and drawing 339 (35.43%).  As of 25 May 2015, 666 players had played Test matches for England.   Up to May 9, 2015, England had played 645 ODIs, winning 309 (47.91%), losing 307 (47.6%), tying 7 (1.08%) and having 22 (3.41%) with no result. 222 players had played for England in One Day International matches up to 28 August 2011.  After Australia won The Ashes for the first time in 1881–82, England had to fight with them for primacy and one of the fiercest rivalries in sport dominated the cricket world for 70 years. In 1963 this duopoly of cricket dominance began to fall away with the emergence of a strong West Indies team. , England failed to win a series against the West Indies between 1969 and 2000. England similarly failed to compete with Australia for a long period and The Ashes stayed in Australian hands between 1989 and 2005. England struggled against other nations over this period as well and after a series loss to New Zealand in 1999 they were ranked at the bottom of the ICC Test cricket ratings. From 2000, English cricket had a resurgence and England reached the final of the ICC Champions Trophy in 2004 and regained The Ashes in 2005. The team was second behind Australia in the Test rankings following victory in the 2005 Ashes series, although the 2006–07 whitewash, coupled with a 2008 series defeat to South Africa and the 2008–09 series loss to the West Indies, meant England were ranked fifth in the ICC Test rankings as of May 2009. ODI performances have been very poor, with England falling to seventh place in the ICC rankings. , In the 2006–07 tour of Australia, The Ashes were lost in a 0–5 \"whitewash\" but England did succeed in clinching victory in the Commonwealth Bank ODI Tri-series against Australia and New Zealand . The loss of The Ashes prompted the announcement by the England and Wales Cricket Board of an official review of English cricket amid much criticism from the media, former players and fans. England failed to reach the semi-finals of the 2007 World Cup in the West Indies after defeats against New Zealand, Sri Lanka and South Africa. , In the summer of 2009 England regained The Ashes in a 2–1 series win with a 197-run victory against Australia at the Brit Oval, Kennington, London (20–23 August). Andrew Strauss was named nPower Man of the Series and all-rounder Andrew Flintoff retired from international Test cricket at the end of the fifth Test. , The England and Wales Cricket Board (ECB) is the governing body of English cricket and the England cricket team. The Board has been operating since 1 January 1997 and represents England on the International Cricket Council . The ECB is also responsible for the generation of income from the sale of tickets, sponsorship and broadcasting rights, primarily in relation to the England team. The ECB's income in the 2006 calendar year was £77 million.  , Prior to 1997, the Test and County Cricket Board (TCCB) was the governing body for the English team. Apart from in Test matches, when touring abroad the England team officially played as MCC up to and including the 1976–77 tour of Australia, reflecting the time when MCC had been responsible for selecting the touring party. The last time the England touring team wore the bacon-and-egg colours of the MCC was on the 1996–97 tour of New Zealand. , England's kit is manufactured by Adidas , who replaced previous manufacturer Admiral on 1 April 2008.  , When playing Test cricket, England's cricket whites feature the three lions badge is on the left of the shirt and the name and logo of the sponsor Waitrose is on the right. The Adidas logo appears on either the left or right sleeve depending on which handed bat the player is, allowing the sponsor logo to always face camera when the player is on strike. English fielders may wear a navy blue cap or white sun hat with the ECB logo in the middle. Helmets are also coloured navy blue. , In limited overs cricket , England's ODI and Twenty20 shirts feature the Waitrose logo across the centre, with the three lions badge on the left of the shirt and the Adidas logo on the right. In ODIs, the kit comprises a blue shirt with navy trousers, whilst the Twenty20 kit comprises a red shirt with black trousers. In ICC limited-overs tournaments, a modified kit design is used with sponsor's logo moving to the sleeve and 'ENGLAND' printed across the front. , Until January 2010, Vodafone were the official shirt sponsor across all formats in a long-lasting deal whilst Brit Insurance sponsored the team before Waitrose. , Listed chronologically in order of first Test match , (known as the \"ICC Knockout\" in 1998 and 2000) , Figures correct as on 23 February 2013. Qualification of 20 innings minimum where appropriate. , Note: this list only includes bowlers who have bowled at least 50 balls in T20 Internationals for England. , This lists all the players who have played for England in the past year, and the forms in which they have played. Batsman Jonathan Trott , and wicket-keeper Matt Prior have both represented England in the last 12 months, but have subsequently retired from international cricket and are therefore not listed below.  , Key , The England cricket team represents England and Wales. However, under ICC regulations,  players can qualify to play for a country by nationality, place of birth or residence, so (as with any national sports team) some people are eligible to play for more than one team. ECB regulations  state that to play for England, a player must be a British or Irish citizen, and have either been born in England or Wales, or have lived in England or Wales for the last seven years (reduced to four years if this period commenced before their 18th birthday). This has led to players of many other nationalities becoming eligible to play for England. , Of the current squad (see above), Matt Prior , Michael Lumb , Sam Robson and Jason Roy were born to British parents outside England and Wales and had to fulfil residency requirements. In addition, Jade Dernbach , Chris Jordan and Ben Stokes have British citizenship, having lived in England since their youth, while Eoin Morgan is an Irish citizen. , ICC regulations also allow cricketers who represent associate (i.e. non-Test-playing) nations to switch to a Test-playing nation, provided nationality requirements are fulfilled. In recent years, this has seen Irish internationals Ed Joyce , Boyd Rankin and Eoin Morgan switch to represent England, whilst Gavin Hamilton previously played for Scotland – though both Joyce and Hamilton were later able to re-qualify for and represent their home countries. "
}
