{
  "category": "cricket",
  "article": "The Ireland cricket team is the cricket team representing all of Ireland. They are an Associate member of the International Cricket Council, and ranked 11th in One Day International cricket, the highest of the Associate teams. Ireland played their first One Day International (ODI) in 2006 against England. Since then, they have gone on to play 96 ODIs, resulting in 44 victories, 44 defeats, 5  no results , and 3  ties .  Contracts for players were introduced in 2009, marking the transition to becoming a professional team. Cricket Ireland is the sport's governing body in Ireland. , Cricket was introduced to Ireland in the 19th century, and the first match played by an Ireland team was in 1855. Ireland toured Canada and the United States in the late 19th century, and occasionally hosted matches against touring side. Rivalry with the Scotland national cricket team was established when the teams first played each other in 1888.  Ireland's maiden first-class match was played in 1902. , In 1993 the Irish Cricket Union , the predecessor to Cricket Ireland, was elected to the International Cricket Council (ICC) as an Associate member. Associates are the next level of team below those that play Test cricket . Due to their successes in the Intercontinental Cup and at the World Cup, they have been labelled the \"leading Associate\"  and have stated their intention to become a full member by 2020. This would allow Ireland to become a permanent One Day International playing nation and eventually grant them Test status.  , Ireland qualified for the Cricket World Cup for the first time in 2007, and has since played in the 2011 and 2015 tournaments. They also qualified for the 2009, 2010, 2012, and 2014 World Twenty20 competitions. Ireland also play international cricket in the ICC Intercontinental Cup , which they have won four times since 2005, including the most recent competition in 2013. , , , Cricket was introduced to Ireland by the English in the towns of Kilkenny and Ballinasloe in the early 19th century. In the 1830s, the game began to spread; many of the clubs which were founded in the following 30 years are still in existence today.  The first Irish national team played in 1855 against The Gentlemen of England in Dublin. In the 1850s, the Englishman Charles Lawrence was responsible for developing the game in Ireland through his coaching.  In the 1850s and 1860s, Ireland was visited for the first time by touring professional teams. Ireland's first match against Marylebone Cricket Club (the M.C.C.) was in 1858.  , The game gained popularity until the early 1880s. The land war in the 1880s resulting from the Irish Land Commission and a ban on playing \"foreign\" games by the Gaelic Athletic Association set back the spread of cricket. The ban was lifted in 1970, and before then anyone playing foreign games such as cricket was banned from the Irish games such as hurling and Gaelic football . Irish teams toured Canada and the USA in 1879, 1888, 1892, and 1909. On top of this, Ireland defeated a touring South African side in 1904.  Their first match with first-class status was played on 19 May 1902 against a London County side including W.G. Grace . The Irish, captained by Sir Tim O'Brien , won convincingly by 238 runs .  , After the 1902 tour of England, where four matches yielded one win, two draws and one loss, Ireland did not play first-class cricket again for five years.  Although the team had lost to the South Africans in 1894 – Ireland's first match against a Test-playing nation – Ireland defeated South Africa in 1904; it was the team's first victory against a Test side.  In 1909, the first annual first-class match between Ireland and Scotland was held, and an annual match against the M.C.C. was arranged from 1924 onwards.  , The Irish played yearly first-class matches with the Scots, only interrupted by world wars, up until 1999, but all their other cricket depended upon touring international sides finding it convenient to include a visit to Ireland in their schedules. However, Ireland sometimes surprised Test nations on these occasions, winning by 60 runs in a three-day match in Dublin over the West Indies in 1928, for example; it was Ireland's first match against the West Indies.  In 1969, in a match played at Sion Mills in County Tyrone , the team defeated a West Indian side including Clive Lloyd and Clyde Walcott by nine wickets, after bowling them out for 25.  This was the last time Ireland defeated a touring side until 2003, when they beat Zimbabwe by ten wickets.  , The Scots and the Irish were mostly competing with Sri Lanka for the title as the best non-Test nation at the time – indeed, Ireland drew with Sri Lanka in a rain-hit first-class match in 1979, Ireland scoring a total of 341 for 7 in two innings, while Sri Lanka made 288 for 6 in one innings. Ireland, along with Scotland and the Netherlands, has at times played in competitions for English county cricket sides , including the Benson & Hedges Cup and the Friends Provident Trophy (previously the C&G Trophy ). Since there is no nationality restriction in county cricket, non-Irish were allowed to compete for Ireland in these matches. For example Hansie Cronje of South Africa competed for Ireland in 1997,  as did New Zealander Jesse Ryder in 2007.  , Ireland joined the ICC as an Associate member in 1993, a year before Scotland.  This meant Ireland were able to compete in the ICC Trophy for the first time in 1994 and they finished seventh in the tournament.  Three years later they progressed to the semi-finals of the competition but lost the third place play-off with Scotland, thus missing a place at the 1999 cricket World Cup . Ireland finishing eighth at the 2001 the tournament.  After this, Adrian Birrell was hired as coach.  , With the introduction of the ICC Intercontinental Cup in 2004,  Ireland received a chance to play first-class on a regular basis. After failing to progress beyond the group stages in the 2004 competition ,  Ireland won their first Cup title in October 2005 with a six-wicket win over Kenya.  The 2005 ICC Trophy , which was hosted in Ireland – the group stages in Belfast , Northern Ireland , the final stages in Dublin , Republic of Ireland  – saw the Irish make the final where they lost to Scotland.  Though Ireland were runners-up, they had secured their place at the 2007 World Cup as well as an extra $500,000 over the next four years from the ICC to encourage development of Irish cricket.  They also gained official ODI.  , Ireland's inaugural ODI was played in front of a full house of 7,500 spectators at the Civil Service Cricket Club , Stormont , on 13 June 2006 against England. It was the first time Ireland had played the full England side. Though Ireland lost by 38 runs, they were praised by Andrew Strauss , England's stand-in captain.   August saw them participate in Division One of the European Championship, against Denmark, Italy , the Netherlands and Scotland. The games against the Netherlands and Scotland had ODI status. In the tournament, and what was the team's second ODI, Ireland recorded their first ODI win, beating fellow Associates Scotland by 85 runs after man-of-the-match Eoin Morgan made 99.   Although the match against the Netherlands was a no-result, Ireland won the European Championship title.  Ireland's second Intercontinental Cup title came in the 2006–2007 competition . They faced Canada in the final and won by an innings and 115 runs, the four-day match concluding within two days. This made Ireland the first team to successfully defend the Continental Cup.  , For the 2006 season, the C&G Trophy was reorganised to include a round-robin stage instead of being entirely knock-out. Whereas Ireland had only one match guaranteed in the tournament before, they now had more fixtures against English county sides. Ireland recorded one win in their nine matches.  Ireland participated in the competition until it was restructured again in 2009. In that time they played 25 matches and won two.   The latter of those victories was against Worcestershire ; in that match Ireland bowled Worcestershire out for 58, which was their lowest ever one-day total. It was the first time that Ireland had bowled out a county for less than a hundred.   Though Ireland were invited to participate in the reformatted competition from 2010 onwards, the team chose not to and instead focused their limited financial resources on international cricket.  , January 2007 saw the start of more than three months of almost constant cricket. First was a visit to Kenya, where they took part in Division One of the ICC World Cricket League . They finished fifth in the league after four narrow defeats and Kenya won the league.  Prior to the World Cup, the team participated in a high-performance camp in South Africa.  Ireland's performance in their inaugural World Cup in the 2007 Cricket World Cup took many pundits by surprise. Their first game was on 15 March when they tied with Zimbabwe , primarily thanks to Ireland's first ever World Cup century by man-of-the-match Jeremy Bray and economical bowling in the final overs by Trent Johnston and Andre Botha.  In their second match, played on Saint Patrick's Day , they beat the fourth-ranked team in the world, Pakistan , by three wickets, thus knocking Pakistan out of the competition.  These two results were sufficient to advance Ireland to the Super 8 stage of the tournament. Their final group stage game was against the West Indies, where they lost by eight wickets.  In the Super 8 stage, they lost their four matches against England, South Africa, New Zealand, Australia, and Sri Lanka, but recorded a 74-run victory against the 9th ranked team in the world and Test playing nation Bangladesh . The team received a heroes welcome in Dublin.  , After the World Cup, former West Indies cricketer Phil Simmons took over the role of coach from Birrell.  India were scheduled to play South Africa in a series of One Day Internationals in Ireland in June 2007. Ireland also played one-off matches at Stormont against the two teams. Missing several players from their World Cup squad, Ireland lost both games.  Ireland hosted a quadrangular tournament in Dublin and Belfast in July involving the West Indies, the Netherlands, and Scotland. Ireland and the West Indies both won their games against Scotland and the Netherlands with their direct encounter ending in no result due to rain. The West Indies were declared tournament winners because of a bonus point won against the Netherlands.  Trent Johnston stepped down as captain and was replaced by William Porterfield in March 2008.  , The 2007–08 ICC Intercontinental Cup began in June, with Ireland playing their first match in August. In November 2008, the team's campaign drew to a conclusion. After finishing second in the round-robin stage of the competition, Ireland faced Namibia in the final. Ireland won by nine wickets, securing their third consecutive Intercontinental Cup title.  In March 2008 Ireland toured Bangladesh, playing three ODIs against the hosts and losing all of them.  In July, Ireland played a tri-series against New Zealand and Scotland in Aberdeen and lost both matches.  , Reigning champions Ireland hosted the European Cricket Championship (Division One) in late July and they won their third European title, winning every game, including the decisive encounter against Scotland by seven wickets.  In early August, Ireland hosted five other Associate nations at the 2009 ICC World Twenty20 Qualifier in Belfast. During the tournament, Ireland made their Twenty20 International debut. Ireland would have faced the Netherlands in the final, however the match was rained off and the teams shared the trophy.  By getting to the final of the tournament, Ireland qualified for the 2009 ICC World Twenty20 in England in June 2009. Later in August, Ireland played three ODIs at home against Kenya. Ireland won the first game, the second game could not be finished due to rain and the last match was completely washed out.  In October, the team visited Kenya for a tri-series of ODIs with the hosts and Zimbabwe. Only two of Ireland's four games in the round-robin stage could be played, the others were rained off. Ireland suffered defeat in their first match to Zimbabwe,  but won their second against Kenya, though they failed to qualify for the final.   , In the run up to the 2009 ICC World Twenty20, Ireland were deprived of batsman Eoin Morgan , similarly to Ed Joyce several years earlier, who was selected to play for England, making him ineligible to play for Ireland again.  Ireland played their first Twenty20 International against a full ICC member side on 8 June 2009 and in their opening match of the tournament defeated Bangladesh by four wickets and knocked them out of the tournament.   Ireland progressed to the second stage of the competition. They were grouped with New Zealand , Pakistan and Sri Lanka and lost all three of their matches. In 2009, Ireland played nine ODIs, winning the seven they played against Associate nations, losing their only match against a Test team (England), and one match was abandoned.  , Ireland played 17 One Day Internationals in 2010, winning 11 (including a victory over Bangladesh) and losing 6 including.  Ireland were knocked out of the 2010 ICC World Twenty20 , hosted by South Africa in April and May, after being beaten by the West Indies and a washed out match against England. , The 2011 Cricket World Cup was held between February and March and hosted by Bangladesh, India and Sri Lanka. Though Ireland did not progress beyond the first round they secured a historic victory against England.  Ireland beat England by 3 wickets with Kevin O'Brien hitting the fastest century in World Cup history, managing the feat in just 50 balls.  In passing England's total of 327 for victory, Ireland broke the record for the highest successful run chase in the World Cup.  , Shortly after the tournament ended, the ICC announced that the World Cups in 2015 and 2019 would contain ten teams; the Associate countries, who were most likely to miss out in a tournament with fewer teams strongly objected and, led by Ireland, urged the ICC to reconsider and in June the decision was reversed.   After the World Cup Ireland played Pakistan, England, and Scotland in ODIs but lost each match.  A further ODI against Sri Lanka was rained off. In all, Ireland played 12 ODIs in 2011, winning four.  , Ireland qualified for the 2015 Cricket World Cup , and were promoted to the ICC ODI Championship, leaving the World Cricket League, but not the ICC Intercontinental Cup. In their first match of the World Cup, Ireland defeated the West Indies by 4 wickets, chasing down 304 runs with 25 balls to spare.  In their second match they beat the United Arab Emirates by two wicket with four balls to spare; the target was 279. Out of only five successful World Cup chases of 300 runs or more, Ireland have provided three of them.   , The Irish Cricket Union (ICU) – the governing body of Irish cricket – was officially founded in 1923, although its predecessor had been active since 1890.  In common with a number of other Ireland sporting governing bodies, the Union was formed to represent cricket throughout the island of Ireland, rather than just the Republic of Ireland and in common with its counterparts for rugby union and field hockey , the Union therefore does not use the Irish tricolor , but instead employs its own flag, which is used by such bodies as the International Cricket Council to represent the team and in ICC tournaments, Ireland's Call is used as the national anthem.   In 2007, it announced major changes to bring it in-line with the main cricket governing bodies.  After the World Cup, Irish cricket experienced a dip in success with poor results in the 2007 Friends Provident Trophy as many players were unavailable. The Irish cricket team was an amateur side and most of the players had full-time jobs with commitments conflicting with cricket.  , Warren Deutrom, the chief executive of the ICU, has stated that it wants to \"seek actively to place Irish players into top-level cricket, by developing relationships with [especially] county cricket which will incorporate appropriate player release for Irish international duty, and feeder systems for developing Irish cricketers\".  The reorganised ICU sought closer links with the English county teams, encourage the development of age group cricket, and to introduce a professional element into the Irish game. They also want to take the Ireland cricket team on winter tours more often.  , In an attempt to prevent the game losing players to counties or other commitments such as jobs, it was suggested that central contracts should be introduced.  This was done in June 2009, with the first two going to Trent Johnston and Alex Cusack .  The number of full-time contracts was expanded to six in January 2010 with support for a further nine players; the contracts were split into three categories.   In January 2012 the number of contracts was increased to 23, and coach Phil Simmons highlighted the process of becoming professional as an important factor in the team's success.  , In January 2012 Cricket Ireland chief executive Warren Deutrom publicly declared Ireland's ambition to play Test cricket by 2020. Their desire to achieve Test status is in part to stem the tide of Irish players using residency rules to switch to England for the opportunity to play Test cricket. Deutrom outlined the ambition as he unveiled the new strategic plan for Irish cricket to 2015. The plan sets out a series of stretching goals including increasing the number of participants in the game to 50,000, setting a target of reaching 8th in the World rankings, establishing a domestic first-class cricket structure, and reinforcing cricket as the 5th major team sport in Ireland .   , Deutrom had already sent a letter to the ICC in 2009 stating his board's intention to apply for Full Membership – a potential pathway to Test cricket – and to seek clarification on the process.  Former Australian bowler Jason Gillespie said that if Ireland got Test status it \"Would be huge news in world cricket, and it would be a massive positive story for the world game\".  Following Ireland's victory over the West Indies in the 2015 Cricket World Cup , former fast bowler Michael Holding said that the International Cricket Council should grant Ireland Test status immediately saying \"they need to be recognised now\".  , See Main article: Ireland at the Cricket World Cup , Cricket Ireland awarded 24 contracts to its players in February 2015, the following is a list of these 24 players awarded central contracts and others who have played for Ireland in the last 12 months. Category A contracts are full-time, while B and C are part-time; the category B contracts were given to those players with contracts with English county clubs.  , Most ODI runs for Ireland  , Most ODI wickets for Ireland  , Highest ODI score for Ireland  , ODI record versus other nations  , Most first-class runs , Most first-class wickets , Highest individual innings  , Note: Ivan Anderson 's 198* v Canada was in a non-first-class match , Most Twenty20 runs for Ireland  , Most Twenty20 wickets for Ireland  , Highest Twenty20 score for Ireland  "
}
