{
  "category": "cricket",
  "article": "The Pakistan cricket team ( Urdu : پاکستان کرکٹ ٹیم ‎), also known as The Green Shirts or Shaheen , is the national cricket team of Pakistan . Represented by the Pakistan Cricket Board (PCB), the team is a full member of the International Cricket Council , and participates in Test , ODI and Twenty20 International cricket matches. , Pakistan have played 840 ODIs , winning 444 (54.43%), losing 371, tying 8 and with 17 ending in no-result .  Pakistan were the 1992 World Cup champions, and also came runners-up in the 1999 tournament . Pakistan, in conjunction with other countries in Southeast Asia, have hosted the 1987 and 1996 World Cups, with the 1996 final being hosted at Gaddafi Stadium in Lahore . The team has also played 88 Twenty20 Internationals , the most of any team, winning 52 losing 34 and tying 2.  Pakistan won the 2009 ICC World Twenty20 and came runners-up in the inaugural tournament in 2007 . , Pakistan have played 390 Test matches, with winning 123, losing 110 and drawing 157. The team has the third-best win/loss ratio in Test cricket of 1.118, and the fifth-best overall win percentage of 31.53%.  Pakistan was given Test status on 28 July 1952, following a recommendation by India, [ citation needed ] and made its Test debut against India at Feroz Shah Kotla Ground , Delhi, in October 1952, with India winning by an innings and 70 runs.  In the 1950s, several Pakistani Test players had played Test cricket for the Indian cricket team before the creation of Pakistan in 1947. , As of 24 May 2015, the Pakistani cricket team is ranked sixth in Tests , ninth in ODIs and fifth in T20Is by the ICC .  , , , Cricket in Pakistan has a history of even before the creation of the country in 1947. The first ever international cricket match in Karachi was held on 22 November 1935 between Sindh and Australian cricket teams. The match was seen by 5,000 Karachiites.  Following the independence of Pakistan in 1947, cricket in the country developed steadily and Pakistan was given Test match status at a meeting of the Imperial Cricket Conference at Lord's Cricket Ground in England on 28 July 1952 following recommendation by India,  which, being the successor state of the British Raj , did not have to go through such a process. The first captain of the Pakistan national cricket team was Abdul Hafeez Kardar . , Pakistan's first Test match was played in Delhi in October 1952 as part of a five Test series which India won 2–1. Pakistan made their first tour of England in 1954 and drew the series 1–1 after a memorable victory at The Oval in which fast bowler Fazal Mahmood took 12 wickets. Pakistan's first home Test match was in Bangabandhu National Stadium , Dacca , East Pakistan (now Bangladesh ). in January 1955 against India, after which four more Test matches were played in Bahawalpur , Lahore , Peshawar and Karachi (all five matches in the series were drawn, the first such occurrence in test history  ). , The team is considered a strong but unpredictable team. Traditionally Pakistani cricket has been filled with players of great talent but limited discipline, making them a team which could play inspirational cricket one day and then perform less than ordinarily another day. Over the years, competitions between India and Pakistan have always been emotionally charged and provide for intriguing contests, as talented teams and players from both sides of the border elevate their game to new levels to produce high-quality cricket. Pakistani contests with India in the Cricket World Cup have seen packed stadiums and elevated atmospheres no matter where the World Cup has been held. However the fans love their team. , The 1986 Austral-Asia Cup , played in Sharjah in the United Arab Emirates , is remembered as a famous last-ball victory for Pakistan against arch-rivals India, with Javed Miandad emerging as a national hero.  India batted first and set a target of 245 runs, leaving Pakistan with a required run rate of 4.92 runs per over. Javed Miandad came in to bat at number 3 and Pakistan lost wickets at regular intervals. Later recalling the match, Miandad stated that his main focus was to lose with dignity. With 31 runs needed in the last three overs, Miandad hit a string of boundaries while batting with his team's lower order, until four runs were required from the last delivery of the match. Miandad received a leg side full toss from Chetan Sharma , which he hit for six over the midwicket boundary.   , At the 1992 World Cup Semi-final , having won the toss, New Zealand chose to bat first and ended with a total of 262 runs. Pakistan batted conservatively yet lost wickets at regular intervals. With the departure of Imran Khan and Saleem Malik shortly thereafter, Pakistan still required 115 runs at a rate of 7.67 runs per over with veteran Javed Miandad being the only known batsman remaining at the crease. A young Inzamam-ul-Haq , who had just turned 22 and was not a well-known player at the time, burst onto the international stage with a match-winning 60 off 37 balls. Once Inzamam got out, Pakistan required 36 runs from 30 balls, which wicketkeeper Moin Khan ended with a towering six over long off, followed by the winning boundary to midwicket. The match is seen as the emergence of Inzamam onto the international stage.    , The 1992 Cricket World Cup in Australia and New Zealand marked Pakistan's first World Cup victory. It is remembered for the comeback Pakistan made after losing key players such as Waqar Younis and Saeed Anwar and being led by an injured captain Imran Khan . Pakistan lost 3 of their first 5 matches and were nearly eliminated in the first round of the tournament after being bowled out for 74 runs against England, until the match was declared as a \"no result\" due to rain. Imran Khan famously told the team to play as \"cornered tigers\", after which Pakistan won five successive matches, including, most famously, the semi-final against hosts New Zealand and the final against England.  , The 2007 Cricket World Cup was one of the biggest upsets in World Cup history when Pakistan was knocked out of the competition in a shock defeat to Ireland , who were playing in their first competition. Pakistan, needing to win to qualify for the next stage after losing to the West Indies in their opening match, were put into bat by Ireland. They lost wickets regularly and only 4 batsmen scored double figures. In the end they were bowled out by the Irish for 132 runs. The Irish went on to win the match, after Niall O'Brien scored 72 runs. This meant that Pakistan had been knocked out during the first round for the second consecutive World Cup.    Tragedy struck the team when coach Bob Woolmer died one day later on 18 March 2007 in a hospital in Kingston, Jamaica . Jamaican police spokesman, Karl Angell, reported on 23 March 2007 that, \"Mr Woolmer's death was due to asphyxiation as a result of manual strangulation\" and that, \"Mr Woolmer's death is now being treated by the Jamaica police as a case of murder.\"  Assistant coach Mushtaq Ahmed acted as temporary coach for the team's final group game of the tournament.  Subsequent to his team's defeat and the death of Woolmer, Inzamam-ul-Haq announced his resignation as captain of the team and his retirement from one-day cricket, stating that he would continue to take part in Test cricket but not as captain.  Shoaib Malik was announced as his successor.  Following his return to the squad, Salman Butt was appointed as vice-captain until December 2007.  , On 23 March 2007, Pakistan players and officials were questioned by Jamaican police and submitted DNA samples along with fingerprints, as part of the routine enquiries in the investigation into Woolmer's murder.  Three days after leaving the West Indies for Pakistan, via London, the Pakistan team were ruled out as suspects. The deputy commissioner of Jamaican police. Mark Shields, the detective in charge of the investigation, announced, \"It's fair to say they are now being treated as witnesses.\" \"I have got no evidence to suggest it was anybody in the squad.\"  A memorial service was held in Sacred Heart Church, Lahore, for Bob Woolmer on 1 April 2007. Among the attendees were Pakistan players and dignitaries, including Inzamam-ul-Haq, who was quoted as saying, \"After Woolmer's family, the Pakistan team was the most aggrieved by his death.\"  After the World Cup ended, serious doubts were raised about the investigation, with increasing speculation that Woolmer died of natural causes. This has now been accepted as fact, and the case has been closed.  , On 20 April 2007, a PCB official announced that former Test cricketer Talat Ali would act as interim coach, in addition to his rôle as team manager, until a new coach had been appointed.  On 16 July 2007, Geoff Lawson , previously head coach of New South Wales, was appointed coach of the Pakistan for two years, becoming the third foreigner to take on the rôle.  In the 2007 ICC World Twenty20 , Pakistan exceeded expectations to reach the final but ended as runners-up, after losing the final to India in a nail-biting finish. On 25 October 2008, Intikhab Alam was named as a national coach of the team by the PCB . , On 21 June 2009 Pakistan won the 2009 ICC World Twenty20 , beating Sri Lanka in the final by eight wickets. Pakistan had begun the tournament slowly losing two of their first three matches but after dismissing New Zealand for 99 runs in the Super 8 stage they had a run of four consecutive wins against teams including previously unbeaten South Africa(in the semi-final) and SriLanka in the Final.Due to his top form, Shahid Afridi immersed as Pakistan's hero in the final taking the last single and making Pakistan win their first Twenty 20 world cup. Shahid Afridi was announced player of the match in both Semifinal and Final of the Tournament vs SA and SL respectively. , The 2010 World T20 was held in West Indies, where Pakistan was able to reached for the semi-final stage. Pakistan, Australia and Bangladesh were in Group A. Pakistan won the first match against Bangladesh by 21 runs. Salman Butt became the hero of the match with his 73 runs from just 46 balls. The second match for Pakistan was with Australia, where Australia won the toss and elected to bat. They scored 191/10 with 49 ball 81 runs by Shane Watson .In this match, final over of Australian innings was bowled by Mohammad Aamer . He took a triple-wicket maiden and there were two run-outs, and eventually five wickets fell in the final over of Australia's innings. , In Super 8s stage, Pakistan lost to England, and New Zealand, only won against South Africa. They finished only behind England in Group E of Super 8s, reached to the semi-finals The semi-final for Pakistan was again with Australia, where they only scored 191/6 with Umar Akmal's not out 56 runs. Australia had a good start, where Michael Hussey scored a match winning unbeaten 64 runs from just 24 balls. Australia scored 197/7 in 19.5 overs and won the match. With this match, Pakistan lost their defended World T20 title. , Pakistan started well in the ICC Cricket World Cup, which was held in India, Sri Lanka and Bangladesh, after beating Kenya, Sri Lanka(one of the tournament favourites) and bye a margin, beating Canada. Shahid Afridi clearly stated that his team is capable of qualifying for the Semifinals.After a huge loss against New Zealand, Pakistan defeated Zimbabwe by 7 wickets.After victory against Zimbabwe Pak cemented their shot at playing the ICC CWC 2011 Quarters. One of the highlights of the tournament for Pakistan was when they beat Australia, who were led by 3 brilliant pace bowlers, Brett Lee , Shaun Tait and Mitchell Johnson . However Pakistan defied the odds and defeated Australia, courtesy of a brilliant bowling display. In the quarter-finals they played West Indies. Pakistan were ruthless, as they emphatically won against the West Indies side by 10 wickets, due to another brilliant bowling display. In the semi-finals on 30 March, Pakistan had a match with its fiercest rival, India. India, due to Tendulkar who was as always dominant against the Pakistani bowling attack, managed 260 after they batted first. Not having a good batting line-up along with a slow start to the chase, Pakistan were 29 runs short as India reached the final (India went on to win the final, by defeating Sri Lanka). , The 2012 edition of World T20 was held in Sri Lanka , where Pakistan grouped in Group D with New Zealand, and Bangladesh. They won comfortably against the two teams, and stood up as top of group D. In super eight contest, Pakistan first played against South Africa, where Pakistan won the match by just 2 runs. next match was against India, which always given a much publicity by all over the fans. Pakistan bowled out for just 128 runs, where India reached the target with only 2 wickets given. Pakistan won their last Super eight match against Australia by 32 runs, where Saeed Ajmal performed well in the match by taking 3 wickets for 17 runs. Pakistan qualified for the semi-finals after superior net run rate than India. , The Pakistan semi-final was with the host-Sri Lanka. Sri Lanka scored 139/ with Mahela Jayawardena took the gear. Pakistan chased the target, but wickets in crucial interval gave them backward. Skipper Mohammad Hafeez scored 42 runs and all the other batsmen not going well. The match was turned towards Sri Lanka with magical spell by Rangana Herath , who took wickets of Mohammad Hafeez, Shahid Afridi and Shoaib Malik . Finally Pakistan lost the match by 16 runs. , The 2014 ICC World T20 was held by Bangladesh . the Pakistani team was in Bangladesh prior to the World T20, due to 2014 Asia Cup , which was held by Bangladesh. Pakistan played for the Group 2, with mighty oppositions. The tournament was a disappointed series for the Pakistanis, where they won 2 and lost 2, finished the group as third and disqualified for the semi-finals. , The first group match was with rivals, India, where Pakistan only scored 130/7, no one scored even a half-century. India won the match by 7 wickets. Next match was with Australia, where Pakistan scored huge 191/5 with brilliant batting of Umar Akmal . Australia had a fierce going with 33 ball 74 runs by Glenn Maxwell, but only managed to score 175. Pakistan won the match by 16 runs. The match against Bangladesh was a comfortable win with 50 runs. Pakistani opening batsman Ahmed Shehzad scored the maiden T20I century by a Pakistani. he finished with unbeaten 111 by 62 balls. The crucial match was with West Indies, where the winning team gone through to the semi-final. West Indies won the toss and elected to bat first. They scored 166/6 in their 20 overs, West Indies scored 82 runs off the last 5 overs giving a fearsome hitting for the Pakistani bowlers. Pakistan chasing was unsuccessful as in the past chasings, where they were bowled out for just 82 runs. Pakistan was eliminated from the tournament with this result. , Pakistan started very poorly in the ICC Cricket World Cup, which was held in Australia and New Zealand. Pakistan started he World Cup with their cricket rivals - India, where India scored 300/7 with Virat Kohli 's century. Pakistan chasing was devastated with their poor opening partnerships. Skipper Misbah ul Haq rescued the team with his 76 runs, but eventually lost the match by 76 runs. The second match against West Indies was worse than any other where West Indies posted 310/6. Pakistan batsmen were all over with 4 wickets for 1 run on the board, recorded the worst start to an innings in an ODI match ever. They got 160 runs, and lost the match with 150 runs. , Pakistan won gainst Zimbabwe, UAE and mighty South Africa. It was the first time Pakistan defeated South Africa in a World Cup match. The final group stage match for Pakistan was a crucial one from their point of view, because the winner would go through to the quarter-finals. They easily won the match against Ireland and finished the group stage as third in group B. , Pakistan quarter-final match was with Australia, where they scored 213 runs. Australia took a steady start, but few wickets have been fallen in middle overs. The match gain lot of attraction due to the rival between Aussie Shane Watson and Pakistani pacer Wahab Riaz . Bouncers and beamers has given Watson a bad start, with one catch was dropped by Rahat Ali . The rhythm was then given by Steve Smith and Glenn Maxwell , in turn Australia won the match and made their way towards the semi-final. This match was final ODI for Pakistani skipper Misbah ul Haq and legendary Shahid Afridi . , After the 2015 Cricket World Cup, Pakistan's captain Misbah and Afridi ended their ODI careers. As a result, the captaincy of the ODI team was given to newcomer Azhar Ali . Under his captaincy, Pakistan played their first ODI series against Bangladesh . The tournament was highly disappointing for them, where Pakistan lost all three ODIs, as well as the only T20 match, as they were outplayed in all departments. Clever bowling coupled with wonderful batting and fielding allowed the hosts to stroll past the visitors. This was Bangladesh's first win over Pakistan since the 1999 Cricket World Cup, and also this victory gave Bangladesh their first ever series win over Pakistan.  , Pakistan played a home series against Zimbabwe in May 2015 after 6 years. This was the first tour by a Test-playing nation since the attack on the Sri Lankan cricket team in 2009 . Pakistan won the T20I series 2–0 and also ODI series 2–0 after the third match with a no result. This is Pakistan's first ODI series win in two years. , The Pakistan Cricket Board (PCB) is responsible for all first class and Test cricket played in Pakistan and by the Pakistan cricket team. It was admitted to the International Cricket Council in July 1953. The corporation has been run by former cricketers, professional administrators and trustees, who are often respected businessmen. The Board governs a network of teams sponsored by corporations and banks, city associations and clubs including advertising, broadcasting rights and internet partners.  , The PCB's experiment with the Twenty20 cricket model has also proven popular and hopes to similarly revive popular interest in domestic games, which it did. The PCB also set up major domestic competitions such as the Quaid-i-Azam Trophy and the Faysal Bank T20 Cup .  , A red box around the year indicates tournaments played within Pakistan , The Pakistan women's cricket team has a much lower profile than the men's team. For all national women's cricket teams, the female players are paid much less their male counterparts and the women's teams do not receive as much popular support or recognition as the men's team. The women's teams also have a less packed schedule compared to men's teams and play fewer matches. The team played it first match during 1997, when it was on tour of New Zealand and Australia and were invited to the World Cup later that year and in the Women's Asia Cup during 2005 the team came third place. During 2007, the team with face South Africa and later in the year travel to Ireland to play in the Women's World Cup Qualifier. The team also played at the T20 England World Cup , the team finished 6th place, beating Sri Lanka and South Africa in 2009. , In Test matches, the team wears cricket whites, with an optional sweater or sweater-vest with a green and gold V-neck for use in cold weather. The team's official sponsors have been Pepsi since the 1990s with their logo displayed on the right side of the chest and sleeve with the Pakistan Cricket star deployed on the left in test cricket. Boom Boom Cricket signed a deal with Pakistan Cricket Board in April 2010 to become the kit sponsors of the Pakistan team; the deal ended at the end of 2012 Asia Cup .  , Pakistan's One Day and Twenty 20 kits vary from year to year with the team wearing its green color in various shades from kit to kit. Historically, Pakistan's kits have had shades of blue, yellow and golden in addition to green. For official ICC tournaments, 'Pakistan' is written on the front of the jersey in place of the sponsor logo, with the sponsor logo being placed on the sleeve. However for non-ICC tournaments and matches, the 'Pepsi' logo feature prominently on the front of the shirt. As always the Pakistan Cricket Board logo is placed on the left chest. An example of the different shades of green Pakistan wears from kit to kit can be seen in the 2010–11 kit which was in the lime green color.   However for the World Cup a new jersey with a dark green to light green fade was introduced in February 2011.     CA Sports became Pakistan team's sponsor during 2012, and is currently providing kits for all three cricket formats. , Pakistan's cricket team's logo is a star, usually in the color gold or green, with the word \"Pakistan\" (پاکِستان) written inside in Urdu , Pakistan's national language. , This is a list of all the players with the forms of cricket in which they play. , General , Hanif scored 337 runs against the West Indies in 1958, which was also the first triple century by an Asian cricketer, and at the time the longest innings by any batsman in terms of time spent at the wicket. , 14th most Test runs. , Akram also holds the record of most Test wickets by a Pakistani bowler. "
}
