{
  "category": "cricket",
  "article": "The South African national cricket team , nicknamed the Proteas , represents South Africa in international cricket. It is administered by Cricket South Africa . South Africa is a full member of the International Cricket Council (ICC) with Test and One Day International (ODI) status. , As of 22 June 2015, South Africa has played 390 Test matches, winning 144 and losing 129.  The team has played 536 ODIs, winning 331, losing 184 and tying six, with 15 no-results .  Finally, it has played 76 Twenty20 Internationals (T20Is), winning 44 and losing 31, with one no-result.  , On 28 August 2012, South Africa became the first team to top the rankings in all three formats of the game.  , South Africa is currently ranked first in Tests, fourth in ODIs and seventh in T20Is by the ICC.  , , , The South African cricket team toured England in 1947. At Nottingham, Captain Alan Melville and vice-captain, Dudley Nourse achieved a Test match record for a third wicket partnership of 319. The following year Nourse, 38-year-old captain of Natal, was appointed Captain for the 1948 MCC Test matches in South Africa.  , In 1970, the ICC voted to suspend South Africa from international cricket indefinitely because of its government's policy of apartheid , a policy which led them to play only against the white nations (England, Australia, New Zealand), and field only white players. This decision excluded players such as Graeme Pollock , Barry Richards and Mike Procter from partaking in international Test Cricket. It would also cause the emigration of future stars like Allan Lamb and Robin Smith , who both played for England, and Kepler Wessels , who initially played for Australia, before returning to South Africa. , The ICC reinstated South Africa as a Test nation in 1991 after the deconstruction of apartheid, and the team played its first sanctioned match since 1970 (and its first ever One-Day International) against India in Calcutta on 10 November 1991. South Africa's first test match after re-admission was against the West Indies in April 1992. The match was played in Bridgetown, Barbados and South Africa lost by 52 runs. , Since South Africa have been reinstated they have achieved mixed success, and hosted the International Cricket Council Cricket World Cup in 2003. However, it is widely believed  the sides containing the likes of Allan Donald , Shaun Pollock , Gary Kirsten and Hansie Cronje grossly underachieved, gaining a reputation as \" chokers \", due to them reaching the semi-finals of the Cricket World Cup three times, but failing to progress into the finals. In the second part of the 1990s, South Africa had the highest winning percentage in ODIs of any team, but they were knocked out of the 1996 World Cup in the quarter-finals, and then were eliminated on countback after tying their semi-final against Australia in 1999. In 2003, South Africa were one of the favourites but were eliminated by one run in the group stages after they had mistakenly counted the number of runs they needed. , They have also had bad press for failing in vital matches in global tournaments including the 2002 ICC Champions Trophy and the 2007 ICC World Twenty20 .  , With Donald retiring, Cronje banned for match-fixing and later dead in a plane crash, and Pollock also retiring from international cricket, the team once again changed shape. Graeme Smith was made captain, although following injuries to Smith and Jacques Kallis , Ashwell Prince deputised as Test captain on 12 July 2006. At the age of 29, he became the first non-white man to captain the once all-white South African cricket team. Due to a racial quota policy, the side was once required to contain black players, unlike the past. However, that policy was rescinded in 2007.  , After many of the major players in the Australian side that had dominated the early 2000s had retired, the number one place in the ICC Test Championship was a wide open race, with India and England having short stints as the number one side. South Africa toured England in 2012 for a three Test series with the winner assured of being the world number one. South Africa went on to take the series comfortably 2–0 and claim the top spot in the rankings, a position they have held onto for over a full calendar year.  , During this time of dominance in the Test arena, the ODI and T20I performances were far less consistent, as South Africa search for a winning formula ahead of the 2014 ICC World Twenty20 and the 2015 ICC Cricket World Cup . A notable ODI series loss to New Zealand at home in January 2013, and a further loss in Sri Lanka highlighted South Africa's recent difficulties. Exits from the 2012 ICC World Twenty20 and the 2013 ICC Champions Trophy only served to improve South Africa's reputation as 'chokers' in major tournaments. In the latter years of Smith's career, South Africa split the captaincy in the shorter forms of the game, with the ODI side being led by AB de Villiers and the T20I side by Faf du Plessis . After Smith's retirement, Hashim Amla was appointed captain of the test side, leading his side to victory in his first test in charge, in Galle in Sri Lanka . , The South African cricket team has gained a reputation as a frequent choker at global cricket tournaments conducted by the International Cricket Council . Despite being consistently one of the best-performing nations in all forms of cricket since its return from isolation , the Proteas have never progressed beyond the semi-final stage at a World Cup. This reputation was further cemented by the fact that South Africa had never won a game during the knock-out stage of the World Cup; a record which was broken in the quarter-finals of the ICC Cricket World Cup 2015, when they won against highly rated Sri Lanka.   , This reputation arises largely from two events: , In addition to surrendering commanding positions in the above matches, South Africa suffered upset losses against the West Indies in 1996 and New Zealand in 2011 .  South Africa's win in the 1998 ICC KnockOut Trophy remains their only international tournament victory to date. In the 2015 World Cup semi finals against New Zealand, the South Africans batted first, however as a result of a rain interruption the game was halted. New Zealand who were set a Duckworth-Lewis score of 298, chased it down. South Africa lost the game marginally as they missed two run outs and two catches. , South Africa has a record of failing to win major tournaments and is much-maligned because of this. The 1992 Cricket World Cup , for example, featured a rain-affected semi-final played before the introduction of the Duckworth-Lewis rain rule. South Africa needed 22 runs from 13 balls when rain intervened. After the delay they were left in the situation of requiring 22 runs from one ball to progress. In 1996 they were eliminated in the quarter-finals despite being one of the fancied teams and having qualified first in their group. , South Africa hosted the 2003 Cricket World Cup , but failed to progress beyond the group stage due to a misunderstanding of how many runs they needed to score in a rain-affected run chase. As a result of this, Shaun Pollock resigned as captain and was replaced by young batsman Graeme Smith , although Pollock continued to play for the team. Under Smith's leadership, South Africa has achieved some success, although they have been hampered by the retirements of many star players, including fast bowler Allan Donald and one-day specialist Jonty Rhodes . As a result, they had a poor 2004, only winning against the West Indies. , In the 2007 World Cup they had a rollercoaster ride that included dominant wins over England, the West Indies, Ireland, Netherlands and Scotland, and a narrow win over Sri Lanka, but devastating losses to Australia, New Zealand and Bangladesh that cost them the number one ranking. Then they bowed out in the semifinals with their lowest ever score in a World Cup as Australia bowled them out for 149 and won by 7 wickets. , In the 2011 World Cup, South Africa topped Group B with the distinction of bowling out every side they played within the 50 over limit. In the quarter final they were beaten by New Zealand after suffering a dramatic collapse and losing eight wickets for 68 runs. They also hold the record of the highest successful run chase and made the highest total (the latter record has been surpassed) in One-Day Internationals (438–9 in 49.5 overs), in an iconic match against Australia on 12 March 2006. This game is considered by many to be the greatest One-Day International ever played. , South Africa beat Netherlands by 231 runs in Mohali in Group matches in ICC World Cup 2011, The 231-run win is the fourth largest margin of victory for any team in World Cups and the largest for South Africa in World Cups. It is also the second largest margin of victory for South Africa in ODIs on 3 March 2011.  The 87-run stand between JP Duminy and Colin Ingram is the highest for the sixth wicket for South Africa in World Cups. The highest sixth-wicket stand for South Africa in ODIs is the 137 between Hansie Cronje and Shaun Pollock against Zimbabwe in 1997. The triumph is South Africa's seventh by a fringe of hundred or more runs in World Cups.  , For World Cups from 1975 to 1987 inclusive, South Africa was not an ICC member, and therefore ineligible to compete in the tournament. , This is a list of every player to have played for South Africa in the last year, and the forms of the game in which they have played. , For the 2014–15 season Cricket South Africa have announced 17 players contracted to the national side from which selectors choose Test, One-Day and Twenty20 International teams.  Uncontracted players remain eligible for selection and can be upgraded to a Cricket South Africa contract if they gain regular selection. The players contracted are shown in bold. "
}
