{
  "category": "cricket",
  "article": "The Sri Lankan cricket team is the national cricket team of Sri Lanka . The team first played international cricket in 1926–27, and were later awarded Test status in 1982, which made Sri Lanka the eighth Test cricket playing nation. The team is administered by Sri Lanka Cricket . , Sri Lanka's national cricket team achieved considerable success beginning in the 1990s, rising from underdog status to winning the Cricket World Cup in 1996 . Since then, the team has continued to be a force in international cricket. The Sri Lankan cricket team reached the finals of the 2007 and 2011 Cricket World Cups consecutively. But they ended up being runners up in both those occasions.  The batting of Sanath Jayasuriya , Aravinda de Silva , Mahela Jayawardene , Kumar Sangakkara and Tillakaratne Dilshan backed up by the bowling of Muttiah Muralitharan , Chaminda Vaas , Lasith Malinga and Ajantha Mendis , among many other talented cricketers, has underpinned the successes of Sri Lankan cricket in the last two decades. , Sri Lanka have won the Cricket World Cup in 1996 , the ICC Champions Trophy in 2002 (co-champions with India ), have been consecutive runners up in the 2007 and 2011 Cricket World Cups , and have been runners up in the ICC World Twenty20 in 2009 and 2012 . The team have won the ICC World Twenty20 championship for the first time in 2014. The Sri Lankan cricket team currently holds several world records, including world records for highest team totals in all three forms of the game, Test , ODI and Twenty20 . , , , Ceylon, as the country was known before 1972, played its first first-class match under that name against Marylebone Cricket Club at Nomads Ground, Victoria Park, Colombo in 1926–27, losing by an innings .  The team's first win came against Patiala at Dhruve Pandove Stadium in 1932–33.  , The Ceylonese side competed in the M. J. Gopalan Trophy games from the 1950s, through the change of name to Sri Lanka, well into the 1970s. Sri Lankan cricket team's One Day International debut came in the 1975 Cricket World Cup and their first One Day International win against a Test cricket playing nation came in the 1979 Cricket World Cup against India . Sri Lanka were later awarded Test cricket status in 1981, by the International Cricket Council . , 1996 Cricket World Cup , which was hosted by India, Pakistan and Sri Lanka. Sri Lanka team was lead by Arjuna Ranatunga , where they played first round in Group A with Australia, West Indies, India, Zimbabwe and Kenya. Australia and West Indies forfeited the match against Sri Lanka in Sri Lanka soil due to safety concerns, so Sri Lanka won both matches by a walkover. Sri Lanka won comfortably against Zimbabwe by 6 wickets courtesy of Aravinda de Silva 's 91 runs. Sanath Jayasuriya overtake Indian bowlers in next match, where Sri Lanka won the match by 6 wickets. Last group match was against Kenya, Sri Lanka recorded the highest team total in that time by scoring 398/5, Aravinda again played a jem of an innings with 145 runs. This score was the highest score by a Sri Lankan player in World Cups. , In the first quarter finals, Sri Lanka played with England, where Sanath devastated the English players with his fast 82 runs just off 44 balls. Sri Lanka won the match by 5 wickets and through to their first semi final in World Cups. Sri Lanka met India again in the semi-final, and the match was played in Punjab under lot of Indian fans. Sri Lanka came into bat first, but their first three wickets gone very early. But then, Aravinda and Roshan Mahanama paced the innings with their half-centuries. Skipper Arjuna and Hashan Tillakaratne also played valuable innings. Indian pacer Javagal Srinath took 3 wickets. , Sri Lanka finished with 251/8 in 50 overs, giving Indians a good chance of winning the match. But Sri Lanka bowling was so good, where Navjot Singh Sidhu and skipper Mohammad Azharuddin out very early. Sachin Tendulkar along with Sanjay Manjrekar slowly build the innings, but their wickets gave Sri Lanka a big chance of winning. When India was 120/8, Indian fans gets aggressive, throwing battles and other materials into the ground, where match was not going to finished. The umpires went onto discussion with both teams and finally match awarded to Sri Lanka. Sri Lanka went to their first final in World Cup history. , The final was against mighty Australians lead by Mark Taylor at Gaddafi Stadium , Lahore . Before the match, former 1992 Cricket World Cup winning captain Imran Khan talked with Sri Lankan captain Ranatunga, stated that if won the toss, choose batting first. This was because the ground was too favored when batting first and bowling under lights. In the toss, Ranatunga won the match, but choosed to field first. After a blazing start from captain Mark Taylor and young superstar and future captain Ricky Ponting , Australia fell from being 1–137 to 5–170 after which Sri Lanka's four prong spin attack took its toll. After Australia limped to 7–241 in its quota of 50 overs, Sri Lanka overcame a nervous start where they lost both openers before the score was 30, to win in 45 overs. Sri Lankan batting sensation Aravinda played a match-winning knock of 107 not out and was assisted ably by fellow veterans Asanka Gurusinha (65) and captain Ranatunga (47*). De Silva was named man of the match after he had taken 3–42 in his 10 overs eairlier in the Australian innings as well & Sanath Jayasuriya got man of the series award. , Sri Lankan cricket's greatest moment undoubtedly came during the aforementioned 1996 World Cup , when they defeated the top-ranked Australian team under the leadership of Arjuna Ranatunga in the final. Sri Lanka's game style over the course of the series revolutionised One Day International Cricket, and was characterised by highly aggressive batting of their openers Sanath Jayasuriya and Romesh Kaluwitharana in the first fifteen overs of the innings to take advantage of the fielding restrictions imposed during this period. This strategy has since become a hallmark of One Day International cricket. , 1999 Cricket World Cup hosted by England and Netherlands, where Sri Lanka came as defending champions. Ranatunga against lead the team with 1996 World Cup winning members - Jayasuriya, Muralitharan , Mahanama, Hashan, Kalu, Vaas , Aravinda, Pramodya and Upul Chandana . They grouped in Group A with South Africa, India, Zimbabwe, England and Kenya. , Sri Lanka played their first group match with England, where only scored 204 bowled out in 48.2 overs. the high bouncing pitches gave subcontinent players a real headache. England won the match comfortably by 8 wickets. In the second group match, against South Africa, the played very badly. By chasing 199 runs of South Africa, Sri Lanka only scored 110 runs, only Mahanama scored 36 runs. Against Zimbabwe, Sri Lanka finally won the match by 4 wickets. Zimbabwe only scored 197/9 and Sri Lanka scored 198/6. Next match was with India, where they posted 373/6 in total with Sourav Ganguly played a magnificent 183 runs in 158 balls. Sri Lanka played only 216/10, and India won by 157 runs. With this loss, Sri Lanka eliminated from the World Cup. Being the champions in last World Cup, this world cup campaign was really disappointed. Their last match was against Kenyans, where Sri Lanka won the match by 45 runs. , 2003 Cricket World Cup was moved to the African continent, where South Africa, Zimbabwe and Kenya hosted the tournament. Sanath Jayasuriya lead the team. The team was grouped in Pool B with South Africa, New Zealand, West Indies, Bangladesh, Canada and Kenya. The first match was against New Zealand, where Blackcaps captain Stephen Fleming won the toss and sent Sri Lanka in to bat first. Sri Lanka’s opening batsmen- Jayasuriya and Marvan Atapattu were going strong and kept a steady run rate until the fifth over when they conceded their first wicket. Skipper Jayasuriya dominated the Blackcaps bowling attack by scoring 120 runs. The final score at the end of the innings was 272/7. The second innings didn’t start very well for New Zealand, losing their opening batsman, Nathan Astle , in the first over and captain Flemming in the second. The first real form of excitement came for New Zealand supporters when Styris and Cairns start hitting a few boundaries. Scott Styris overpassed Jayasuriya's batting by his 141 runs, but New Zealand all out for 217 in the total. Sri Lanka won by 47 runs and Jayasuriya was named man of the match. , Next match was against Bangladesh, where Chaminda Vaas became the only bowler to claim a hat tricks in the first three balls of any form of international cricket when he took the first three wickets off the opening three balls of the match. With this feat, Vaas became the third of only four players to have achieved two hat tricks. Bangladesh poorly scored 124/10. Sri Lankan opening batsmen reached the target without a wicket falling. At the very next match against Canada, Sri Lanka again involved for a World record, where Canada total of 36 was the lowest total in World Cup history and second lowest in all ODIs. Sri Lanka comfortably won the match by 9 wickets. , All these World Record matches next became a desperate sad for all the Sri Lankans. They lost the match to underdog Kenyans for the first time. The match was at Kenyan soil , Kenya batted first and scored Kennedy Otieno scored 60 runs. Murali took 4 wickets and Vaas with 3 wickets. Sri Lanka came to bat, only Aravinda scored 41 runs. All the others scored less than 30. Sri Lanka all out for just 157 runs in 45 overs. This was the first time that, Sri Lanka lost a match to affiliate nation. Against West Indies, Sri Lanka back in the game, where they chased 222 runs and won the match by 4 wickets. Last group match was against South Africa, Sri Lanka batted first and scored 268/9. South Africa was at 229/6 when rain came. According to Duckworth–Lewis method , match was tied. Finally Sri Lanka reached top of the Pool B, and selected for the quarter finals. , In the quarter finals, they lost to Australia and India, only won over Zimbabwe. This result gave them fourth place in standings, where Kenya recorded first semi-final occasion in the history. Sri Lanka's semi-final was against Australia. On a difficult, slow pitch at Port Elizabeth, Australia struggled their way to 212 (7 wickets, 50 overs) against tight Sri Lankan bowling, thanks mainly to a great innings from Andrew Symonds (91* from 118 balls, 7 fours, 1 six), demonstrating again captain Ricky Ponting's faith in him. Vaas, continuing his excellent tournament, took three wickets. Australia's pace attack then ripped through the Sri Lankan top order, with Brett Lee (3/35 in 8 overs) taking three early wickets and Glenn McGrath (1/20 in 7 overs) taking one. By the time rain arrived in the 39th over, continued tight bowling had squeezed Sri Lanka to 123 (7 wickets, 38.1 overs), well behind the target given by the Duckworth–Lewis method. This is the match in which Adam Gilchrist famously \"walked\" despite being given not out. , West Indies islands hosted the 9th Cricket World Cup , where Sri Lanka was lead by Mahela Jayawardena . The 12 teams were grouped into four groups, where Sri Lanka in group B. India, Bangladesh and Bermuda played with Sri Lanka in group matches. Bermuda's World Cup debut became the second-heaviest defeat at the World Cup, 40 runs worse than Scotland's defeat the day before. After Sri Lanka won the toss and batted, they scored 321/6 in 50 overs while skipper Jayawardene, Kumar Sangakkara and Chamara Silva all collected half-centuries. Kevin Hurdle took two wickets for Bermuda, but his second over lasted 14 balls due to no-balls and wides. Bermuda fell to 20 for four after Lasith Malinga had taken three wickets in three overs, ending with bowling figures of three for 10. With the seven first men down, Lionel Cann paired up with Delyone Borden for a 25-run partnership, the largest of the innings. Farveez Maharoof removed both before Murali had Dwayne Leverock lbw to end the innings for 78, Bermuda's lowest total ever in One-day Internationals. Sri Lanka won the match by 243 runs. , Next match for Sri Lanka was against Bangladesh, who won the match against India and was in good performance before coming to this match. But Bangladesh' chances of reaching the Super Eights by means of net run rate diminished after a 198-run defeat to Sri Lanka, the third-heaviest of their history and the largest since their 200-run defeat to India in 2003. Indeed, it was only due to the rain during Bangladesh' innings and the consequently readjusted target that the margin of victory was smaller; Bangladesh were bowled out for 112, with all the Sri Lankan bowlers except Jayasuriya taking wickets, but Jayasuriya had already contributed with seven sixes in his 24th One-day International century as Sri Lanka totalled 318 for four. Spinners Mohammad Rafique and Abdur Razzak were the only ones to keep the economy rate below five an over, while for Sri Lanka only Russel Arnold cost more than five an over. Four Sri Lankan batsmen outscored Bangladesh' top-scoring batsman, Mohammad Ashraful , who made 45 not out from number seven. , Last group match was against the neighbors-India, who was at brink of eliminating from the tournament. So the match was highly valuable to Indians than Lankans. Sri Lanka, meanwhile, went through to the second stage unbeaten, after newcomers to the team Upul Tharanga and Chamara Silva both struck half-centuries and Murali took three wickets, including wicket-keeper MS Dhoni for a duck. , Indian pacer Zaheer Khan started off with a wide, but also had Jayasuriya caught behind in his opening spell, striking at the end of the seventh over, and also had Tharanga in trouble with in-cutters. Tharanga, however, batted through nearly two thirds of the match for his 64, and none of the bowlers managed to keep the run rate below four as Sri Lanka made it to 254 for six, due to poor cricket from India. For Sri Lanka, Vaas struck twice within eleven overs, taking a return catch off Robin Uthappa and having Ganguly caught for a 23-ball seven. Tendulkar followed in the next over, bowled by Dilhara Fernando for his second duck of the tournament, but Virender Sehwag and skipper Rahul Dravid made it through the next ten overs, before the \"turning point\" arrived when Murali had Sehwag caught at first slip in his third over; the next six overs yielded only 14 runs and two more wickets, after Dhoni went lbw to Murali, and India needed 141 runs off 22 overs. Despite double-digit scores from Ajit Agarkar , Harbhajan Singh and Munaf Patel , they were bowled out for 185. India eliminated and Sri Lanka through to Super 8s. , Super 8s has gone pretty well for Sri Lankans, with their performances, only lost to South Africa and Australia. In the first Super 8 match for Sri Lanka vs South Africa, Malinga became the first bowler to take four wickets with four consecutive deliveries in international cricket. Sri Lanka won the toss and elected to bat, and lost their first five wickets for 98, with Charl Langeveldt taking two in his first spell. Tillakaratne Dilshan and Russel Arnold built a sixth-wicket stand of 97 in nearly 20 overs, but Dilshan was caught off Makhaya Ntini 's bowling, and then Langeveldt took 3 in 5 balls as Sri Lanka were bowled out in the final over for 209. In reply, Vaas had AB de Villiers bowled in the first over, but Jacques Kallis added 95 with Graeme Smith and 65 with Herschelle Gibbs , leading South Africa to within four runs of victory with his 86. Then Sri Lanka's Lasith Malinga struck. His four-in-four had Shaun Pollock , Andrew Hall , Kallis and Ntini. Though South Africa managed a run off Vaas in the intermediate over. South Africa now needed three runs to win with one wicket in hand, and eleven deliveries went by before Robin Peterson got an outside edge to a Malinga ball, which went out of reach of slip and went fine for four. South Africa won the match by only 1 wicket, in a very tied game. , Next match was against the hosts-West Indies. The start of the match was delayed due to bad weather, but a full 50-over match was played, which resulted in West Indies' third defeat in four days. Jayasuriya and Jayawardene added 183 for the third wicket, before Dilshan came in and took 39 off 22 deliveries as the final eleven overs yielded 84 runs. In reply, West Indies needed 170 off 94 when Ramnaresh Sarwan was stumped off Jayasuriya; they only got 56 of those, and were bowled out for 190, with four batsmen out in single figures. Sri Lanka won the match by huge 113 runs. , Against England, the match was again became a nail biter. Sri Lanka batted first and made 235, bowled out off the last ball with a run out. England lost their openers for 0 and 10, but Ian Bell and Kevin Pietersen made a stand of 90 for the third wicket, and skipper Paul Collingwood joined Pietersen to add a further 25 before Pietersen was caught and bowled by Murali. England then lost two more wickets for seven runs to Dilhara Fernando, and required 103 off 16.3 overs with four wickets in hand. However, Ravi Bopara scored a half-century in his fourth One-Day International innings, as he and Paul Nixon took England within three runs of victory. However, Fernando returned for the last over, and bowled Bopara off the last ball giving Sri Lanka victory. Sri Lanka won two of last three matches -won against New Zealand and Ireland, lost to Australia, secured their place to semi-finals. , In the semi, Sri Lanka met New Zealand again, where Sri Lanka scored 289/7 courtesy of century by skipper Jayawardena. New Zealand only scored 208 runs and eliminated from the World Cup. Sri Lanka selected for their second final in World Cups, against same opponent as in 1996-Australians. Aussie skipper Ricky Ponting won the toss and elected to bat. However, the start of play was delayed due to rain, and the match was reduced to 38 overs per side. Gilchrist played an incredible innings of 149 – the highest for any batsman in a World Cup final – to give Australia an imposing total going in at the break., but the innings was in controversy due to Gilchrist usage of squash ball inside the left glove. , While Sri Lankan batsmen Sangakkara and Jayasuriya were adding 116 for the second wicket, the contest was alive, but after the pair got out, Sri Lanka's chances slowly diminished. Further rain forced the reduction of Sri Lanka's innings to just 36 overs, with the target revised to 269. At the end of the 33rd over, with Sri Lanka still trailing the adjusted D/L target by 37 runs, the umpires suspended the game due to bad light. While Australia's players began to celebrate their victory (since the minimum 20 overs had been reached), the umpires incorrectly announced that because the match was suspended due to light and not rain, the final three overs would have to be bowled the following day. With Sri Lanka needing 61 runs from 18 deliveries, Jayawardene agreed there was no need to return the following day, and instructed his team to resume batting, with Ponting agreeing to play only spinners. The umpires later apologised for their error: the match should have ended then with Australia winning by 37 runs. The last three overs were played in almost complete darkness, during which Sri Lanka added just nine runs, giving Australia a 53-run victory by the D-L method, as Sri Lanka had batted two overs fewer than they had. , The first edition of World Twenty20 World Championship , which was hosted by South Africa. Sri Lanka played under the captaincy of Mahela Jayawardena in Group C along with New Zealand and Kenya. First match was against Kenyans, which was a World Record breaking match. Kenya won the toss and gave Lankans to bat first. Tharanga and Jayasuriya started the innings, but Tharanga was bowled by Thomas Odoyo . Then Sangakkara joined Jayasuriya. Sangakkara bowled by Jimmy Kamande when the score was 94 in 9 overs. The show time begun then, where Jayasuriya and Jayawardena scored unfaithfully for all the bowlers. Jayasuriya caught when he was in magnificent 88, with 11 fours and 4 sixes. Jayawardena on the other hand, played a brilliant innings, scored 65 from just 27 ball when until he was lbw. Sri Lanka was 215/6 in 18 overs, when Jehan Mubarak came to the crease. He scored an unbelievable sixes down the ground to Nehemiah Odhiambo and Peter Ongondo . He smashed 46 off 13 balls with 3 fours and 5 huge sixes. The strike rate of this innings was 353.84. Sri Lanka finished with 260/6, which recorded highest T20 total in any top-level Twenty20 match . Kenyans came to bat with chasing the huge task. Vaas immediately made a breakthrough, dismissing opening batsman Maurice Ouma for a duck. Kenya never recovered, and were reduced to just 88 runs in the 20th over as Sri Lanka dismissed their batsmen cheaply. The win, by 172 runs, is the largest margin of victory in a Twenty20 internationals. , Next group match was with Blackcaps, where they scored 164/7. Sri Lanka won the match in 18.5 overs with 3 wickets gone. Jayasuriya became the Man-of-the-Match in both these matches. Within Super 8s, Sri Lanka qualified to Group F. In first Super 8 match with Pakistan, Sri Lanka lost by 33 runs. In the next match against Bangladesh, they bounced back well with a 64 run victory. The crucial match to qualify for the semi-finals was with Australians and Sri Lanka only scored 101 against Aussie pacers. Australia won the match by 10 wickets and Sri Lanka eliminated from the tournament. , The second T20 tournament was given England to host. Kumar Sangakkara lead the Sri Lankan team in the tournament. Within Group C, they played with West Indies and Australia. Sri Lanka gain prominence in World Twenty20 arena with this series. Against Australia, Sri Lanka won by 6 wickets, eliminating Australia for the first time from group stage in a major tournament. Ajantha Mendis took 3 wickets, and in batting, skipper Sangakkara scored unbeaten 55. Next match was with West Indies, who were in poor performance in the T20 cricket. Sri Lanka batted first scored 192/5 courtesy of blistering 81 runs from Jayasuriya. Tillakaratne Dilshan , who was promoted to open the batting with Jayasuriya, gain attention from the crowd, due to his innovative stroke play. The shot he played above the Wicket-keeper's head, came to known as \" Dilscoop \". He played the shot in almost every match in this series, which earned him good runs. West Indies only scored 177/5 in 20 overs and Sri Lanka through to the Super 8s. , Pakistan, New Zealand, and Ireland played with Sri Lanka in Group F of Super 8s. Against Pakistan, Sri Lanka won the match by 19 runs. Dilshan scored 46 runs with some innovative Dilscoops. Against Ireland, Sri Lanka won by 9 runs, where Irish players came hard at Lankan bolwers. In the last Super 8 match, Sri Lanka beat New Zealand by 48 runs. Dilshan played another magnificent 48 runs and Mendis took 3/9 in the bowling. The semi-final was against West Indies for the second time in the tournament, where Sri Lanka scored 158/5 in their 20 overs. Dilshan scored another blistering knock with 96 unbeaten runs. He was just a boundary behind to score first T20I century by a Sri Lankan. Dilshan scored 60.76% of Sri Lanka's runs, which was a new Twenty20 International record. However, this only stood for a matter of hours, as Chris Gayle scored 62.38% of West Indies' total. West Indies scored just 101 all out in their 20 overs. Angelo Mathews proved his ability also with the ball, where he took first 3 wickets of West Indian top order. Sri Lanka easily moved to their first T20 International final. However, Mahela ended the tournament as highest run scorer with 302 runs. , In the final at Lord's , Sri Lanka won the toss and elected to bat. The first over was bowled by Mohammad Amir . After failing to score off the first four balls – all short – Dilshan went for his scoop and mistimed it, resulting in him being caught at short fine-leg. Soon after this, Mubarak top edged a delivery by Abdul Razzaq which went high in the air and was caught by Shahzaib Hasan , leaving Sri Lanka at 2 for 2. Jayasuriya was able to stabilise the innings for Sri Lanka hitting 17 runs off 10 balls, however, Jayasuriya soon fell as he dragged a good length ball back on to the stumps. Jayawardene followed after edging a shot into the hands of Misbah-ul-Haq, leaving Sri Lanka on 32/4. Sangakkara and Chamara Silva added further runs, before the latter was caught by Saeed Ajmal playing a pull shot off the bowling of Umar Gul . Pakistani captain Afridi soon after, took the wicket of Isuru Udana with a googly which drifted into the right-hander, knocking the off-stump. This brought in Mathews, who along with Sangakkara took the score from 70/6 to 138/6, with 17 runs being scored off the last over bowled by Mohammad Amir. Sri Lanka finished on 138/6 from 20 overs. , Pakistan started off well with openers Kamran Akmal and Shahzaib Hasan adding 48 run for the 1st wicket, before Kamran Akmal was stumped by Sangakkara by the first delivery of Jayasuriya. Pakistan reached the target in 18.4 overs, with Shahid Afridi, who hit the winning runs, earning Man of the Match while Tillakaratne Dilshan was declared Man of the Series for his 317 runs at an average of 63.40. , Although the tournament was held every two years beginning in 2007, the scheduled ICC Champions Trophy ODI tournament to be held in the West Indies in 2010 was revised to a Twenty20 format because the 2008 ICC Champions Trophy tournament in Pakistan was postponed due to security concerns and there was a need to correct the international cricketing tournament calendar. This ICC World Twenty20 took place only 10 months after the last one. , In this third T20I occasion , Sri Lanka was again lead by Kumar Sangakkara. Sri Lanka was in Group B with New Zealand and Zimbabwe. The first match was with New Zealand, where Sri Lanka scored only 135/6 with 81 of Mahela. In chasing, New Zealand were shaky in the start, but Jesse Ryder recovered the match to their way with 27 ball 42 runs. At the end, New Zealand won by 2 wickets, with a six scored by Nathan McCullum to Chaminda Vaas in last over. , In next match, Mahela scored first T20 International century which is scored by a Sri Lankan, against Zimbabwe. He reach hundred with 64 balls. With this century he became the fourth man in all T20 Internationals, and the third in the ICC World Twenty20 Cricket history to score a century. Zimbabwe came to the crease to chase 173 of Lankans, but rain interrupted when they were 29/1 in 5 overs. With this Sri Lanka won the match by 14 in D/L method. , In Super 8 stage at Group F, Sri Lanka won against West Indies by 57 runs. In this match, Mahela came very close to score his second consecutive century but overs ended when he was not out in 98. Against Indian in the next match, India scored 163/5, where Sri Lanka chased the scored with only 5 wickets down. With 2 wins and 1 loss, Sri Lanka selected for their second consecutive T20I World Cup semi-finals. This time with England. Sri Lanka batted first, but couldn't reach even 150 mark. They scored 128 runs only. Sri Lankan hopes came fade with this performance, where Kevin Pietersen (42 from 26 balls) attacked Sri Lankan bowling line-up. He took the match away from Lankans, and England finally won by 7 wickets. , India, Bangladesh and Sri Lanka jointly hosted the 10th edition of Cricket World Cup . Kumar Sangakkara lead Sri Lankan side. In group A, Sri Lanka played with Pakistan, Australia, New Zealand, Zimbabwe, Canada and Kenya. They started off their tournament against minnows Canada. They won the toss and elected to bat first. Canada bowled well in the early overs, but did not get a wicket, as openers Tharanga and Dilshan reached 50 runs. When the first wicket did fall, it was a run-out when the batsmen had a mix-up with the score at 63, and Tharanga was dismissed. Dilshan got to his half-century, but fell trying to go for a big hit. The Canadians restricted Sri Lanka to 88/2 with over 19 overs bowled; but the two experienced Sri Lankan batsmen, captain Sangakkara and Jayawardene came together and got a partnership of 50. Both batsmen got the run rate to over 6 and both seemed to be coasting to their centuries, until Sangakkara on 92 gave a simple return catch to John Davison with the score at 267/2. Jayawardene reached his century but fell immediately afterwards. More wickets fell and the game got hot-tempered, with a confrontation between Angelo Mathews and Harvir Baidwan and Sri Lanka finished with 332/7. , The Canadian chase went nowhere, with Thisara Perera and Nuwan Kulasekara getting three wickets quickly. Captain Ashish Bagai tried to lead a recovery, but once Perera took his wicket to reduce Canada to 53/5, all doubts about the result finished. Big-hitter Rizwan Cheema took 37, including two huge sixes off spinner Murali, but the latter ultimately got his wicket as Canada fell to 122 all out. Sri Lanka won the match by 210 runs. , Next match was with Pakistani team, which gave Lankans their first World Cup defeat in home soil. Pakistan captain Shahid Afridi won the toss and decided to bat first against Sri Lanka, one of the pre-tournament favorites. Sri Lanka got the wicket of Ahmed Shehzad in the sixth over, but Pakistan still managed to proceed along at a rapid run rate in the first ten overs. Mohammed Hafeez , proceeded along at over a run a ball until a mix up with Kamran Akmal had him run out, and Kamran himself was stumped a few overs later to leave the match evenly poised at 105/3 in the 21st over. Younis Khan and Misbah-ul-Haq then built a 104 run partnership in 20 overs without taking too many risks, until Younis fell to Rangana Herath for 72 while trying to accelerate. Misbah stayed not out till the end for a well made 83, kept Pakistan to 277/7 at the end. , Sri Lanka started off with a very good reply, with their openers Tharanga and Dilshan accelerating steadily after a slow start to add 76 in just over 14 overs until Hafeez had Tharanga caught at point. This was the turning point of the match, as three more wickets, including that of Dilshan fell soon after to leave Sri Lanka tottering at 96/4. Sangakkara rode his luck with Kamran missing two stumpings off him, and staged a recovery with Chamara Silva, but his luck eventually ran out as the required run rate went up, with Afridi having him caught at long on one short of his fifty. Jayawadena was bowled by pacer Shoaib Akhtar with a magnificent in swing. Silva struggled to time the ball early in his innings, being 16 off 49 balls at one point, but he then accelerated rapidly to reach his half-century, but Afridi returned to remove dangerous looking Angelo Mathews. Silva eventually fell for 57 when Kamran did get a stumping right, and despite Kulasekara's cameo, Sri Lanka ended up 11 short. , In the next match against Kenyans, Malinga took a hat-trick, the second in his career. He became the first bowler to take two World Cup hat-tricks, and the fourth bowler to take two career ODI hat-tricks. Sri Lanka comfortably chased the target of 146b by giving one wicket only. , Sri Lanka against Australia match was abandoned due to heavy rain. In the next match against Zimbabwe, Tharanga and Dilshan set a new World Cup record for the opening partnership, scoring 282 runs, beating the previous record of 194. It was also the first occasion in a World Cup that both openers made a century. With their victory over Zimbabwe, Sri Lanka became the first team to qualify for the Quarter Finals of the tournament. In reply, Zimbabwe made a good start, but were dismissed for 188 runs with 11 overs spare. As in previous wins against New Zealand, this New Zealand vs Sri Lanka match was not a surprising one, because Lankans were the better ones to win the match even before the match. Skipper Sangakkara scored 111 runs and Lankans managed to get 265/9. Blackcaps were struggled from the very first ball, where they were all out for 153. , In the quarter finals, Sri Lankan counterpart was England. England total of 229 was easily reached by Dilshan and Tharanga. Both made centuries as Sri Lanka chased down a target by ten wickets. This run chase set a new record for the highest successful run chase in a ten-wicket victory in ODI history. Sri Lanka qualified easily for the semi-finals. In the semi-finals, for a second consecutive time Sri Lanka defeated New Zealand in the semi-finals of the World Cup and made it to the finals. This was the last match Murali played on Sri Lankan soil. Sri Lanka won the match by 5 wickets and reached their first consecutive World Cup final. , Sri Lanka started the innings slowly, constrained by good bowling from Zaheer and committed fielding from Yuvraj Singh , Suresh Raina , and Virat Kohli inside the 30-yard circle. Zaheer began with three consecutive maidens and the wicket of Tharanga, conceding only six runs in his five-over spell. Dilshan was bowled by Harbhajan when a delivery carried on to the stumps after deflecting off his gloves. Sangakkara came in after Tharanga's dismissal, and was building a solid foundation with Dilshan before the latter was dismissed. Jayawardene came to the crease when Sri Lanka were 60/2 in the 17th over. Sangakkara and Mahela went about the task of consolidating the innings, but eventually Sangakkara was caught behind by Dhoni at 48. New batsman Thilan Samaraweera was adjudged not out by the umpire when a ball hit his thigh pad off the bowling of Yuvraj Singh. The Indians decided to review the decision and he was ultimately given out. Chamara Kapugedera , who was playing his first World Cup match, was caught off a deceptive slower ball by Zaheer Khan. Jayawardene, meanwhile, continued with his quality batting, ultimately scoring 103 not out from 88 balls in a high-class batting display. Helped by the hard-hitting of Kulasekara and Thisara, Sri Lanka scored 91 runs in the last 10 overs, including 63 in the batting powerplay (45–50 overs) to take the score to 274/6. , India had a shaky start, with Sehwag and Tendulkar both dismissed early by Malinga, leaving them struggling at 31 for two. Kohli and Gautam Gambhir started the recovery with some fluent stroke play and quick running between wickets, taking India to 114 before Kohli was caught-and-bowled by Dilshan for 35. When he was on 30, Gambhir mistimed a shot off the bowling of Suraj Randiv , sending the ball high up in the air, but Kulasekara could not hold on to a difficult chance at long off. Kohli and Gambhir put together an 83-run partnership before Kohli's dismissal. Dhoni came in after Kohli to bat at number five. Gambhir and Dhoni added 109 for the fourth wicket with Gambhir scoring 97. Gambhir tried to finish his century with a boundary, but was bowled by Thisara. Following Gambhir's dismissal, 52 runs were required off 52 balls. Yuvraj and Dhoni took India to victory, and Dhoni sealed the match hitting a six off Kulasekara, when only 4 runs were required off 11 balls. Dhoni finished on 91 not out from 79 deliveries. With this defeat, Sri Lanka lost their second consecutive World Cup final defeat in ODIs. , Finally, Sri Lanka hosted a World T20 after being the runner-up in 2011 Cricket World Cup. This is the first World Twenty20 tournament held in an Asian country, the last three having being held in South Africa, England and the West Indies. Sri Lankan pacer Lasith Malinga has been chosen as the event ambassador of the tournament by ICC. Sri Lanka was lead by Mahela Jayawarderna for the second time after 2007 World Twenty20. Sri Lanka played in Group C with South Africa and Zimbabwe. All group matches were held in Hambantota . , The first match of the tournament was between the Hosts and Zimbabwe. Zimbabwe won the toss and put Sri Lanka onto bat. They finished with 182/4 in 20 overs, giving a huge task for opposite. Zimbabwe came to the crease, but didn't took too long to dismissed to 100 runs on the board. Ajantha Mendis was all over the vultures, where he took 6 wickets for 8 runs, giving Sri Lanka a 82 run victory. This is the best bowling figures in Twenty20 International history, that was previously also held by Mendis against Aussies. (6/13) , In the next against Proteas, rain interrupted in numerous occasions, which gave only 7 over per side match. South Africa batted first and AB de Villiers smashed 30 runs from 13 balls, where they finished with 78/4 in 7 overs. Sri Lanka was not good at all, only scored 46/5, no any batsmen scored more than 15 runs. South Africa won the match by 32 runs, which is a huge margin in T20s. However, both team qualified for the Super 8s. , Sri Lanka played in Group 1 with West Indies, England, and New Zealand. Against New Zealand, the match was tied, where both teams scored 174. But, Sri Lanka had good chance to win the match, wickets in last over and misunderstandings gave a tied game. However, Sri Lanka won the Super Over and won the match. In the next two matches, Sri Lanka won very easily against West Indies and England. , The Sri Lankan third consecutive World T20 semi-final was against Pakistanis. Sri Lanka scored 139/4, where Mahela paced the innings with his 42 runs. While chasing, skipper Mohammad Hafeez scored 40 runs, all the other players were undone by Rangana Herath. The 16 runs victory gave Sri Lankans to win their first T20 title, which was against West Indies. , After Chris Gayle , who had decimated Australia in the semifinals, was dismissed for just 3 to leave the West Indies at 2-14 after 5.5 overs, Marlon Samuels produced 78 from 55 balls, including the longest six of the tournament at 108 meters. Captain Darren Sammy also led a late charge that produced 108 runs in the latter 10 overs to set Sri Lanka a target of 138. They then restricted Sri Lanka to 39/1 after eight overs, produced two run outs and held each Sri Lankan batsman to no more than 33 (posted by captain Mahela Jayawardene). Kulasekara mustered a brief fightback (26 runs from 16 balls) but holed out to leave the tail end exposed, and Sri Lanka was soon all out 36 runs short. Samuels earned Man of the Match honors for being the top-scoring batsman on either side while also taking 1-15 in his four overs of bowling. For the first time, a host nation (Sri Lanka) competed in the final of the ICC World Twenty20. Ajantha Mendis was the highest wicket-taker with 15 wickets. , As the runner-up of previous World T20 competition, Sri Lanka went Bangladesh under the captaincy of Dinesh Chandimal to this edition of World T20 . In the group stage at Super 10 stage, they played with South Africa, New Zealand, England, and Netherlands. In the first match, Sri Lanka played with South Africa. Sri Lanka won the toss and elected to bat first. They had a good understanding about Bangladeshi pitches, due to Bangladesh bilateral tournament and 2014 Asia Cup , which was held prior to the World T20 at the same site. Sri Lankan opener Kusal Perera reminded all sorts of aggressive shots by legendary Sanath Jayasuriya. Kusal's master stroke was a photocopy of Jayasuriya and he devastated Dale Steyn , Morné Morkel , and Lonwabo Tsotsobe . He scored 61 runs off 40 balls giving Sri Lanka a total of 165/7. South Africans was not down as yet, where they progressively built the innings. With the wickets in crucial intervals, they ended up in the losing side with 5 runs short. Kusal was the Man-of-the-Match. , The next match was against talented Netherlands, who show their powerful strokes against Ireland in this tournament. But all those stroke play was undone by magnificent bowling by Mathews, Kulasekara, and Malinga. Dutch were all out for 39 runs, which is the lowest by any team in a T20I match . Sri Lanka chased this easy target by 5 overs, which also earns Biggest victory in terms of balls remaining in all T20I. , In the very next match against England, beat Sri Lanka by 6 wickets with courtesy of unbeaten 116 by Alex Hales . Sri Lanka batted first and scored 189/4. Mahela scored 89 runs. England always maintained the required run rate very well, which gave them a fast hitting in last few overs. England scored 190/4 in 19.2 and won the match. , The last group match was a thrilling match for the both teams, where Sri Lanka came as the favorites to win the match. Skipper Chandimal was out of play due to some injuries, so Lasith Malinga captained the match. By batting first, Sri Lanka scored only 119 all out, Mahela scored 25 runs as the best batsman. Blackcaps came to the crease as the favorites to win the match, because 120 is not a huge task at all to them as smashers - Brendon McCullum , Martin Guptill , Ross Taylor , and Corey Anderson . During the match, Anderson was injured and so New Zealand played with only 10 players in batting. New Zealand started pretty well with Guptill and Kane Williamson . At this time, Malinga decided to go with Rangana Herath , who turned the match in nowhere. Herath ball Guptill and he lunges forward to push to mid-on. Sets off for a single straight away but his partner is not at all interested. The bowler is wise to the mistake, rushes across to his right and cuts the ball in its path and sends in a rocket throw and Sangakkara whips the bails off. After this run-out, it wall all Herath. he stumped skipper McCullum, then caught Ross Taylor to lbw. Next, Herath bowled James Neesham in first ball he faced. He then captured Luke Ronchi for lbw, and New Zealand were never in the game. Finally New Zealand all out for just 60 runs, which is the lowest score by a test playing nation in Twenty20 Internationals. Herath finished with 5 wickets for 3 runs, earned him Man-of-the-match. With this win, Sri Lanka moved their fourth consecutive World T20 semi-finals. , The semi-finals was against defending World T20 champions- West Indies. Malinga again lead the team. But this time, Lankans were all over West Indies, where Sri Lanka scored 160/6. In chasing, West Indies was 80/4 when rain came into play. Rain and hail ended the match after 13.5 overs in the West Indies' innings. Their par score was 107 runs according to the Duckworth–Lewis method. So, Sri Lanka won by 27 runs in D/L method. At the presentation, West Indies skipper Darren Sammy stated that, \"rain and god gave Sanga and Mehela\" a big farewell party. This World Cup belongs to them. So, good luck to both of them\". The final was not easy at all, with their opposition being a difficult one - India. The match was lead by Malinga for third time, where he gave permanent T20I captaincy. , Sri Lanka and India had played each other over sixty times in the last seven years, with India winning the majority of the matches. During the tournament India was the only unbeaten team heading into the final, whereas Sri Lanka had lost a group match to England. Despite this, statistically there had been little between the two teams during the tournament. India, sent into bat by Sri Lanka after they won the toss, posted 130 runs in their 20 overs. Virat Kohli top scored with 77, but Yuvraj Singh's 11 runs off 21 balls slowed the innings momentum in the final overs. Sri Lanka reached 134 runs in 17.5 overs with the loss of 4 wickets. Kumar Sangakkara, playing his last Twenty20 international match, guided Sri Lanka home with an unbeaten 52 runs. Sangakkara was named Player of the Match, while Kohli was named Player of the Tournament. After all losses in major World Cups in 4 times, Sri Lanka finally ended with Champions. With this match, Mahela and Sanga retired from twenty20 internationals. The words of Sammy became true at last. , The last edition of Cricket World Cup was hosted by Australia and New Zealand. Sri Lanka was captained by Angelo Mathews . The first match was against New Zealand, where Blackcaps scored a huge total of 331/6 with blasted innings of Corey Anderson . Sri Lanka opened with very well, but the wickets in crucial intervals gave them a backward push. Lahiru Thirimanne scored 65 runs, and finally Sri Lanka bowled out for 233, with 98 runs lost at the end. , The next match was against debut World Cup contestants- Afghanistan. Afghanistan got off to a solid start before both their openers were dismissed off consecutive overs and the score read 40/2 in the tenth over. Asghar Stanikzai and Samiullah Shenwari built a steady third-wicket partnership which was broken when Afghanistan had reached 128 in the 28th over. Following this, Afghanistan started losing wickets at regular intervals to the Sri Lankan pace bowlers before finally being bowled out for 232 in 49.4 overs. Malinga and Mathews picked 3 wickets each for Sri Lanka. , Sri Lanka's innings got off to a disastrous start as both openers fell for ducks within the second over, which was the second time in ODI history where this has occurred. Then in the sixth over, they lost the wicket of Sangakkara with the score at 18/3. They slipped into further trouble when Dimuth Karunaratne was dismissed in the 12th over with the Sri Lankan total still at 51. Then the maestro Jayawardene came to the crease. He and Mathews then added 126 runs for the fifth wicket and Mathews was run out for 44 and Jayawardene was dismissed soon after completing his 19th ODI hundred. Thisara, who came in to bat with Sri Lanka in a precarious position of 178/6, struck an unbeaten 47 from 26 balls to guide his team to a four-wicket win with ten balls to spare. , Against Bangladesh, Sri Lanka off to a flier with magnificent hundreds by Dilshan (161*) and Sangakkara (). With this century, Dilshan broke the earlier record of highest individual score by a Sri Lankan in World Cups by Aravinda (144). This century is also the highest individual score in an ODI without hitting a six. Bangladesh only scored 240/10 and Sri Lanka won the match by 92 runs. , Next match was against English, where English captain Eoin Morgan won the toss and elected to bat first. England openers started solidly, but, from 62/0, the innings was reduced to 101/3 in the 21st over. Joe Root and Morgan added 60 runs for the 4th wicket before the dismissal of Morgan. The fifth wicket partnership between Root and James Taylor yielded 98 runs in 11 overs. Taylor fell for 25, following which Root was also dismissed for a 108-ball 121. England were 265/6 in the 47th over, before Jos Buttler struck an unbeaten 39 in 19 balls to take the total to 309/6 at the end of 50 overs. , Sri Lankan innings began with Thirimanne being dropped on 3. His opening partner Dilshan was out for 44 immediately after their partnership had reached 100 runs. Sangakkara joined Thirimanne and the left-hand duo punished the England bowlers with each of the batsmen making hundreds. Thirimanne struck a six off the third ball of the 48th over to complete an emphatic 9-wicket victory. Thirimanne remained unbeaten on a 143-ball 139, while Sangakkara won the Man of the Match for his unbeaten 117 off just 86 balls. This was Sangakkara second consecutive century. , The match against Australians was a real thriller. Australia batted first where they posted a huge 376/9, with the help of brutal 51 ball century of Glenn Maxwell . Sri Lanka chasing was not good at first, where Thirimanne was got out early. but then Dilshan joined Sangakkara to a 196 run partnership. Dilshan hit six fours off an over, bowled by Mitchell Johnson , which was the first time this has happened in World Cup history. After dismissal of Dilshan, the middle-order failed to gain partnerships with Sangakkara, who batting really well. Sangakkra scored his third consecutive century. With Sanga's wicket, Sri Lanka lost wickets quickly and scored 312/9 in 50 overs. Australia won the match by 64 runs. In the last group stage match, Sri Lanka easily defeated Scotland by 148 runs. Sangakkara scored his fourth consecutive century by scoring 124 runs. He became the first batsmen in ODI history to done so. Sri Lanka scored 363/9. Scotland only scored 215 runs. , In the quarter final, Sri Lanka met South Africans. The match was a shock to all the fans across the globe, where Sri Lanka scored 133 runs all out. Sanga scored 45 runs and all the others were struggled by South African impressive bowling attack- Dale Steyn , Morne Morkel and Imran Tahir . South Africa won the match very easily, only one wicket fell. With this match, Sanga and Jayawardena ended their ODI career. This match gave Lankans, their first defeat without making for the semi-finals after 1999 World Cup. , In 2004, Sri Lankan cricket team whitewashed South Africa 5–0 in an ODI series in Sri Lanka, which is the heaviest defeat of a South African cricket team in a bilateral One Day International series.  Sri Lanka whitewashed England 5–0 in the NatWest Series in 2006, which is England's heaviest home defeat in a bilateral ODI Series.  Sanath Jayasuriya was the Man of the Series . Sri Lanka also whitewashed Zimbabwe 5–0 in two ODI series, which took place in Zimbabwe in 2004 and 2008. Sri Lanka also whitewashed Bangladesh in many occasions. , Despite of Whitewashing other teams, Sri Lanka also involved in a whitewash. This was happened during Sri Lankan cricket team in India in 2014–15 , where all five matches were lost by Sri Lanka to India. So India whitewashes Sri Lanka for the first time in ODI cricket and this defeat was also the biggest lost by Sri Lanka since winning 1996 World Cup. , On 3 March 2009, the Sri Lankan team's convoy was attacked in Lahore , Pakistan by gunmen. This led to the death of five policemen and injuries to seven cricketers and a member of the coaching team.  The team was on its way to the Gaddafi Stadium where they were scheduled to begin the third day of the Second Test. After the incident the test match was called off by the Sri Lankan Cricket board. Sri Lanka had agreed to tour Pakistan, replacing India who refused to do so citing security concerns.  , As of December 2011, the Sri Lankan team has played 209 Test matches, winning 29.66%, losing 35.41% and drawing 34.93% of its games.  , Since gaining Test Status in 1982, the Sri Lanka cricket team has achieved numerous milestones, some of these include , Sri Lanka Cricket, formerly the Board for Cricket Control in Sri Lanka (BCCSL), is the controlling body for cricket in Sri Lanka. It operates the Sri Lankan cricket team and first-class cricket within Sri Lanka. Sri Lanka Cricket oversees the progress and handling of the major domestic competitions: the First-class tournament Premier Trophy , the List A tournament Premier Limited Overs Tournament and the Twenty20 Tournament . Sri Lanka Cricket also organise and host the Inter-Provincial Cricket Tournament , a competition where five teams take part and represent four different provinces of Sri Lanka . , Listed in order of date first used for Test match , Updated 25 June 2015 , Updated 16 December 2014 , Updated 22 November 2014 , This shows the players who were called up to represent Sri Lanka in 2015 International arena. , International match Summary – Sri Lanka  , Updated 21 June 2015 , Test record versus other nations  , Updated 21 June 2015 , ODI record versus other nations  , Note that career records are for Sri Lanka only and exclude matches for ICC World XI and Asia XI. Updated 18 March 2015 , T20I record versus other nations  , Updated 20 May 2014 , "
}
