{
  "category": "cricket",
  "article": "The Zimbabwean cricket team is the team that represents Zimbabwe in international cricket. It is administered by Zimbabwe Cricket (formerly known as the Zimbabwe Cricket Union or ZCU). Zimbabwe is a full member of the International Cricket Council (ICC) with Test and One Day International status. , As of 17 June 2015, Zimbabwe is ranked tenth in Tests, eleventh in ODIs and twelfth in Twenty20 Internationals by the ICC.  , , , In common with all the other full members of the ICC, Zimbabwe – known as Rhodesia until independence from the United Kingdom in 1980 – had a national cricket team before it achieved Test status. , A brief summary of key moments: , Zimbabwe's first World Cup campaign in 1983 ended in the group stage, as they lost five of their six matches. However, they threw a surprise against Australia. Batting first, Zimbabwe reached a total of 239-6 in the allotted 60 overs, with skipper Duncan Fletcher top-scoring with 69 not out. Fletcher then produced career-best figures of 4-42 to restrict Australia to 226-7, thereby recording a stunning upset in cricket history.  , In the 1987 World Cup, Zimbabwe lost all six of their group-stage matches, though they came very close to winning against New Zealand. Chasing 243 to win from 50 overs, wicketkeeper -batsman David Houghton scored 142, but Zimbabwe were all out for 239 in the final over, thus losing by three runs.  , In the 1992 tournament, Zimbabwe failed to progress beyond the round-robin stage, losing seven of their eight matches, though there were two notable achievements. Against Sri Lanka in their first match, Zimbabwe posted their then-highest total of 312-4, with wicketkeeper-batsman Andy Flower top-scoring with 115 not out. However, the Sri Lankans chased this total down with four balls to spare, winning by three wickets.  , In their final match, Zimbabwe faced England in an inconsequential encounter, England having already made the semi-finals. Batting first, Zimbabwe were all out for 134. Eddo Brandes then produced a stunning spell of 4-21, including dismissing Graham Gooch first ball, to help restrict England to 125 all out and thus give Zimbabwe a shock nine-run victory.  , These twenty World Cup matches were Zimbabwe's only international games during this period.  , Zimbabwe was granted Test status by the ICC in July 1992 and played its first Test match in October that year, against India at Harare Sports Club . They became the ninth Test nation.  , Zimbabwe's early Test performances were consistently weak, leading to suggestions that they had been granted Test status prematurely. Of their first 30 Test matches, they won just one, at home against Pakistan in early 1995. , In the one-day arena, however, the team soon became competitive, if not particularly strong. In particular, world respect was gained for their fielding ability. , In spite of his team's difficulties, wicket-keeper/batsman Andy Flower was at one point rated the best batsman in world cricket. During this era, Zimbabwe also produced such cricketers as Flower's brother Grant , and allrounders Andy Blignaut and Heath Streak (who was later appointed national captain). Murray Goodwin was also a world-class batsman; following his retirement from international cricket, he has scored heavily for Sussex . Another world-class batsman was David Houghton , who holds the record for the highest individual Test score for Zimbabwe of 266 against Sri Lanka in 1994/95. Sometime captain and middle order batsman Alistair Campbell , leg-spinning all rounder Paul Strang , Eddo Brandes , and pace bowler/opener Neil Johnson were other important contributors for Zimbabwe on the world stage at this time. , With the appearance of these quality players, a breakthrough was achieved in levels of performance in the late 1990s where the Zimbabwean team began winning Tests against other nations, which included a series win against Pakistan . Unfortunately, the political situation in Zimbabwe declined at around the same time, which had a detrimental effect on the national team's performances. , Zimbabwe excelled at the 1999 ICC Cricket World Cup coming in fifth place in the Super Sixes, only missing out on a semi-final place due to having an inferior net run-rate than New Zealand. Zimbabwe beat India and South Africa in the league stage. , During this period, Zimbabwe beat all Test-playing nations (except Australia) regularly. Zimbabwe beat New Zealand both home and away in 2000-2001. The team also reached finals of many multi-national one day tournaments. , Increasing politicisation of cricket, including selectorial policy, along with the declining situation in Zimbabwe disrupted the 2003 Cricket World Cup , which was jointly hosted by Zimbabwe and South Africa. , England forfeited a match scheduled to be played in Zimbabwe, risking their own progress through the competition, citing \"security concerns\" as their reason. , Zimbabwean players Andy Flower and fast bowler Henry Olonga wore black armbands , for \"mourning the death of democracy\" in Zimbabwe. Both were immediately dismissed from the team and applied for political asylum overseas. This public political protest caused considerable embarrassment to the co-hosts and disrupted team harmony.   , Since the 2003 World Cup, with a succession of Zimbabwe's best players ending their international careers early, a new side began to develop, featuring the likes of Travis Friend , Andy Blignaut , Hamilton Masakadza , Douglas Hondo, Craig Wishart , Ray Price , Sean Ervine , Mark Vermeulen , Tatenda Taibu , Elton Chigumbura , Prosper Utseya , Dougie Marillier , and Barney Rogers . Whilst not of the same calibre of Streak, Goodwin, and the Flower brothers, this new breed of predominantly multi-disciplined players formed a solid backbone to a competitive, if usually unsuccessful, side. , In late 2003, Zimbabwe toured Australia in a two-match series. The series was more memorable for Australian opener Matthew Hayden 's innings in the first Test – in which he overcame a back strain to score a then record 380 runs – than for the Zimbabwean performance.  , Zimbabwe lost its first match against Bangladesh in 2004. , In 2004, captain Heath Streak was sacked by the ZCU (now Zimbabwe Cricket), prompting a walkout by 14 other players in protest against political influence in the team's management and selection policies. A scheduled tour by Sri Lanka went ahead, but this was a lopsided affair, with Zimbabwe represented by fringe players who were not of international standard.   , Because of this, the ZCU accepted that Zimbabwe were to play no further Test cricket in 2004, though its status as a Test nation was unaffected.  , After a series of poor Test performances following the resignation of several senior players, the Zimbabwean team was voluntarily suspended from Test cricket in late 2005 by its cricket board, with ICC encouragement.  , In early 2005, Heath Streak was reinstated into the national side, but the political situation in Zimbabwe involving Operation Murambatsvina disrupted the Zimbabwean team. During overseas tours, the players were often said to be buying necessities which were unavailable – or prohibitively expensive – at home, as opposed to the souvenirs which other touring teams would purchase. , In 2005 an agreement was signed which led to the return of many of the rebels to the Zimbabwe side.  However, results failed to improve as in March Zimbabwe lost both their Tests on tour against South Africa by an innings. Worse was to follow in August, when they were crushed on home soil by New Zealand , in a match that was completed in just two days, instead of the usual five. In the process, Zimbabwe were humiliated; they became only the second side in Test history (after India in 1952) to be bowled out twice in the space of one day. Then they lost both their Tests to India at home later in September. After the series against India, Streak announced his retirement from international cricket, dealing yet another blow to the beleaguered team. , By November 2005, the players were once again in dispute with Zimbabwe Cricket over political interference in the management of the game, as well as contract negotiations, and the new captain, Tatenda Taibu , resigned from international cricket. By then the team had been further weakened by the departure of the likes of Dougie Marillier , Craig Wishart and Sean Ervine , all of whom retired in protest and expressed disillusionment in the local cricket hierarchy. , By January 2006, 37 Zimbabwean cricketers had failed to receive any offer of renegotiation talks from Zimbabwe Cricket after their contracts with the board had expired. This body of players demanded that the chairman and managing director of Zimbabwe cricket, Peter Chingoka and Ozias Bvute , be removed from office for there to be any hope for the players to return to the international stage. , On 6 January 2006, the Sports and Recreation Commission, a division of the Zimbabwean government, took over the offices of Zimbabwe Cricket. The apparent takeover has resulted in the firing of all whites and Asians among the board directors, because of \"their racial connotations and saving their own agendas and not government policy\" according to Gibson Mashingaidze , an army brigadier and chairman of the government's Sports and Recreation Commission. , An interim board was appointed as the new leading party of cricket in Zimbabwe, with Peter Chingoka appointed as the committee's head. Given Chingoka's close ties to Bvute, it was likely that the latter would continue in his post as well. , On 18 January 2006, Zimbabwe Cricket announced that they were suspending the playing of Test cricket for the rest of the year.  Zimbabwe's coach Kevin Curran said that Zimbabwe were aiming to play their next Test against the West Indies in November 2007.  It was felt by observers that the Zimbabwean national team was not of sufficient Test standard, and that competing against Full Member sides would do little to improve standards, given the likely one-sided nature of the games. Bangladesh , for a long time seen as the 'whipping boys' of Test cricket, recorded their first win against Zimbabwe, and were thereafter regarded as being of a superior standard. On 8 August 2011, Zimbabwe recorded a resounding victory in the one Test match series over Bangladesh, played in Harare. , Domestically, the Logan Cup – Zimbabwe's first class competition played amongst the provinces – was cancelled in 2006 for the first time since its inception over a century ago (though the Cup was not played during some of the years of the World Wars). This was widely seen as due to concern by ZC that the standard of play would be so poor as to be both not worthwhile and potentially harmful to the external image of cricket in Zimbabwe. The one-day trophy, the Faithwear Cup, was contested, and drew complaints from observers that the quality was less than club level. As well as player exodus, the main reason for this catastrophic fall in standards was put down to wrangling within Zimbabwe Cricket, where internal politics motivated the removal of the historic provinces and their replacement with revamped, newly designated provincial teams. Zimbabwe's economic collapse led to scanty attendance at games and players not receiving their salaries for long periods of time. , In a further harmful incident, ex-player Mark Vermeulen was arrested after attempting to burn down ZC's offices, and successfully destroying the Zimbabwe Cricket Academy's premises. In a nation in increasing social and economic turmoil, such facilities are hard to replace, and their loss has proven difficult to manage for a cricket administration already short of top quality facilities. , In the period coming up to the 2007 Cricket World Cup in the West Indies , and to stop a similar exodus of players as after the 2003 World Cup, the selected players were asked to sign a new contract. The players were summoned to meet Ozias Bvute, Zimbabwe Cricket's managing director, a week or so before they were due to set off and given an ultimatum – sign the contract on offer or be removed from the squad. It is understood that they were not allowed to take advice, and were told they had to make the decision there and then. , One player told his team-mates that there were certain things contained in the contracts that needed clarification. He was summoned back into Bvute's office and warned that it was a take-it-or-leave-it offer: this player was later revealed to be Anthony Ireland .  Another said that when he told Bvute he wanted to consult with friends, Bvute picked up the phone and called Kenyon Ziehl, the head of selection, and told him he wanted the player replaced in the squad. Unsurprisingly, the player backed down and signed. , In light of the poor state of Zimbabwe's finances, and that Zimbabwe Cricket had to borrow around US$1 million in early 2007 pending receipt of monies from the World Cup to help them over an ongoing cash crisis, the board agreed to pay match fees in US dollars. The players were to be paid US$2000 per appearance and a series of US$500 bonuses based on wickets taken and fifties scored. The maximum payment was believed to be capped at around US$8000. However, fees were not paid until June 2007 to stop the exodus and help cash flow.  , The spectre of continued problems with the ZC board has influenced some players to cut their losses and seek to finish their careers abroad: Anthony Ireland accepted a contract to play for Gloucestershire during 2007, while opener Vusi Sibanda also left. More are thought to be considering following suit. , Zimbabwe fared poorly in the 2007 Cricket World Cup , even failing to beat non-Test playing Ireland . , Zimbabwe upset Australia in its opening match of the Twenty20 World Championship in Cape Town , defeating them by 5 wickets. Brendan Taylor led the way for Zimbabwe, with first class wicket keeping (a catch, stumping and run out) and a crucial unbeaten 60 from 45 deliveries. He was announced as Man of the Match. They then lost to England by 50 runs, meaning they exited the tournament at the first stage due to their net run rate being inferior to both Australia and England after Australia had beaten England in the other group match. , There was more encouraging news in October 2007, when it was announced that Zimbabwe would compete in all three domestic competitions in South Africa as part of Cricket South Africa's attempts to improve the standard of cricket in Zimbabwe. [3] , However, their participation in the above competitions was thrown into doubt when the plans were postponed pending a Cricket South Africa board meeting.  A compromise was reached late in November 2007, meaning Zimbabwe would have taken part in the MTN Domestic Championship and the Standard Bank Pro 20 Series , but not the SuperSport Series as originally planned.  Instead, they played three first-class four-day games against a South African Composite XI made up of franchise and provincial players. The three games, in Paarl , Potchefstroom , and Kimberley were all won by Zimbabwe.  , In between those games, they played a five match One Day International series against the West Indies , scoring an upset win in the opening match  before losing the series 3–1. The final match was abandoned due to rain.  , Zimbabwe's performance against Bangladesh during this time was extremely poor as they lost every ODI series except one at home, including a 0-5 whitewash in 2006. , Zimbabwe also lost against non-Test playing nation Kenya very often. But in 2009, they bounced back beating their African neighbors 9-1 in ten games. , Zimbabwe won an ODI and a T20 during their tour of the West Indies . Zimbabwe reached the finals of a triangular tournament which included India and Sri Lanka. They lost their remaining matches in the year except against Ireland whom they beat 2-1 at home. , Zimbabwe started their World Cup 2011 campaign with a 91 run defeat by Australia at Ahmadabad on 21 February 2011. They then recorded a comfortable victory over Canada, before losing by 10 wickets to New Zealand on 4 March 2011. Further heavy defeats by Sri Lanka and Pakistan followed, before a consolation victory over Kenya was achieved in Zimbabwe's final game of the tournament. After these defeats, opening batsman Brendan Taylor was announced as captain of all formats on 24 June 2011, replacing Elton Chigumbura. , Zimbabwe returned to Test cricket on 4 August 2011, after a six-year exile. They hosted Bangladesh in a one-off Test match at Harare . The national team's re-introduction to Test cricket was successful, as they beat Bangladesh by 130 runs.  , As part of the lead-up to their Test return, Zimbabwe Cricket announced major upgrades to the Harare Sports Club and Mutare Sports Club grounds.  Plans for a new Test ground at Victoria Falls were also revealed.  ZC also signed a three-year deal with Reebok worth $1mn. The deal will see Reebok sponsor the Domestic competitions and make the kits of the Zimbabwean national cricket team.  , Zimbabwe played their first Test match, after regaining their Test status, against Bangladesh at the Harare Sports Club in Harare . The only Test started on Thursday 4 August 2011. Bangladesh won the toss and elected to field first. Zimbabwe won the Test on day five by 130 runs. , Zimbabwe won the ODI series 3-2. This was the first time they beat Bangladesh in five years. , Zimbabwe were beaten in all the formats by Pakistan . After this they played a home series with New Zealand . They were defeated 2–0 in the Twenty20 series, and New Zealand were 2–0 up in the ODI series. The final ODI was being played at the Queen's Sports Club , Bulawayo . They were at a 12-match losing streak at that time. , Furthermore, when batting first, New Zealand scored 328 in 50 overs, nobody gave Zimbabwe a chance of winning. The Zimbabweans have never chased an ODI total in excess of 300 before. However, they did it successfully for the first time in their history. , Zimbabwe's main aim in the innings break was to lose with dignity. When opener Vusi Sibanda was out for a duck, even that seemed to be a tall order, but skipper Brendan Taylor changed the entire complexion of the match. Taylor scored a brilliant 75 before he was dismissed fresh from the centuries he scored from the last games. , After Taylor's dismissal, Tatenda Taibu 's speedy fifty kept Zimbabwe in the hunt. However, the match-changing partnership was between the two all-rounders Malcolm Waller and Elton Chigumbura . Waller played one of the greatest innings in ODI history as he scored 99 * . In the end, he even did not think of his century but to just take his team over the line. His selflessness brought about for Zimbabwe a much-needed victory. His partner Chigumbura scored a brisk 47 and was quite unlucky to miss out on his half-century, bowled by Jacob Oram after he along with Waller had taken the equation below a run a ball. When Keegan Meth was bowled two balls later for a duck, Waller kept his cool as he marshalled the middle order efficiently, assisted by a six by debutant Natsai Mushangwe , and then enough support by Ray Price brought the scores level. After Price was dismissed (caught), it was the last wicket Zimbabwe had and the new man in was another debutant Njabulo Ncube . Waller is said to have advised him, \"'No matter what happens, if I get bat on ball, let's take the run.' And the run they did take, thereby recording a legendary victory for Zimbabwe. According to an interview later, Waller said that he was thinking of a swing and get the ball over the ground so that both his team could win and he could get a century, but later he though that he would rather take the team home rather than get 100,\". Waller was the Man of the Match for his spectacular performance, while Brendan Taylor was Man of the Series.    , Zimbabwe came close to winning the only Test against New Zealand when they almost chased down 365. , Zimbabwe toured New Zealand in early 2012 but were thrashed in all formats. , In June 2012, Zimbabwe beat South Africa in a t20 match of an unofficial triangular T20 tournament where Bangladesh national cricket team also featured. This was the 3rd match of the tournament. They beat South Africa by 29 runs. They also had beaten Bangladesh in the first match of that tournament by 10 runs. In the 3rd match against South Africa, although there were no AB de Villiers and Jacques Kallis , the South Africa team were very much strong. Winning the toss and electing to bat first, Vusi Sibanda and Hamilton Masakadza opened the innings and scored 58 and 55 respectively. The wicket keeper captain Brendan Taylor scored a quickfire 38 from 21 balls in the end. They scored 176/4 in 20 overs. Coming to chase, South African batsmen Richard Levi and Colin Ingram scored 40 and 48 respectively. But the other batsmen struggle to make it and went all out on 147 within 19.2 overs. Christopher Mpofu took 3 for 20. In the next meetings with South Africa and Bangladesh, Zimbabwe lost both of the matches and ended in the same points as those of South Africa and Bangladesh. Due to better net run rates, Zimbabwe and South Africa progressed to the final. On 24 June 2012, in the final match, South Africa batted first and scored 146 runs with the loss of 6 wickets in 20 overs. While an early collapse occurred in their innings, South Africa managed to get back with a fair score as Faf du Plessis scored 66 off 57 balls and Albie Morkel scored a quickfire 34 not out off 23 balls. Kyle Jarvis of Zimbabwe took 2 wickets for 22 runs. coming out to chase, Zimbabwe started well but Vusi Sibanda went out on 24 off 16. But then the captain Brendan Taylor and Hamilton Masakadza well built the innings scoring 59 not out and 58 not out respectively. They took Zimbabwe to victory as they scored 150 for the loss of 1 wicket in 17.1 overs. Zimbabwe won by 9 wickets and clinched the T20 series in front of a full house packed with native Zimbabwean crowd at the Harare Sports Club ground. Once it was said that cricket is the game only of the white people in Zimbabwe. But the scenario has changed. Now its no doubt that cricket has touched the hearts of all the Zimbabwean people. Brendan Taylor was the man of the match and Hamilton Masakadza got the man of the series award. , Zimbabwe lost all their matches in 2010 and 2012 World t20s in the opening stage. , Zimbabwe toured West Indies again in 2013. This time they were less successful and lost all matches. , Zimbabwe then hosted Bangladesh in June. Zimbabwe won the One Day International series 2-1 while the Test and T20 series were tied 1-1. They lost an ODI series 0-5 at home to world champions India. , In August 2013, Zimbabwe hosted Pakistan. Zimbabwe beat Pakistan in the first ODI before losing the next two games. Zimbabwe came close to winning the first Test but lost following a double ton by Younis Khan . , Zimbabwe beat Pakistan in the second Test drawing the series 1-1. This was Zimbabwe's third victory against Pakistan and only their overall fifth against Test-playing nations not including Bangladesh. ,  , Zimbabwe were ousted in the first round of 2014 world t20 following an absolutely shell shocking victory by Netherlands over Ireland after which Netherlands progressed over Zimbabwe and Ireland by net run-rate. Zimbabwe hosted Afghanistan in July 2014 and the series was drawn 2-2. , Zimbabwe then hosted South Africa for a Test and 3 ODI series where they lost all the matches.  , Following the South African Tour, Australia arrived in Zimbabwe for a triangular ODI series with the hosts and South Africa.  While Zimbabwe lost their first two matches, to Australia and South Africa respectively, they pulled off a significant upset by beating Australia in the 4th match of the series.  This was the first time Zimbabwe had beaten Australia in 31 years, with their last win coming in the 1983 world cup in England.  Zimbabwe lost their final match and were knocked out of the tournament. , In late 2014, Zimbabwe toured Bangladesh for a three-Test and five-ODI series. They lost all eight matches.  Following this, Stephen Mangongo was sacked as coach.  , Throughout the period, Zimbabwe's financial condition has deeply worsened. The ICC had to step in and provide financial assistance but the usage of monetary benefits has been a question of debate.   Zimbabwe players have threatened boycott many times of late and have formed a players' Union.   Zimbabwe team has struggled to attract sponsors and this has affected its domestic structure leading to cancellation of many tournaments such as Pro40 . A number of franchises also have been cancelled. Multiple tours have been postponed, cancelled or have gone un-televised.   , In late December 2014, Zimbabwe Cricket appointed Dav Whatmore as coach, replacing Mangongo.   , Zimbabwe geared up for the ICC Cricket World Cup 2015 by winning all games against Northern Districts XI  before facing New Zealand in their first warm-up game.  New Zealand were reduced to 157/7 before rain played spoilsport. In the next game, Zimbabwe upset Sri Lanka by seven wickets.  , Zimbabwe lost their opening game to South Africa , following which they beat UAE before losing to West Indies. Zimbabwe then went on to lost a close encounter to Pakistan.  , During the Pool B match between Ireland and Zimbabwe, Sean Williams was caught by Ireland's John Mooney in a close run chase. Mooney was extremely close to the boundary and eight different television replays were inconclusive as to whether his foot had touched the boundary rope. Meanwhile, Williams had walked and the umpires signaled him out. Zimbabwe went on to lose the game and were knocked out of the tournament as a result.  , In their last game, Zimbabwe lost to India.  , Zimbabwe finished their world cup campaign with just one win over UAE in the first round. Despite this, Zimbabwe turned out to be very competitive and suffered four of the closest losses in the preliminary round of the tournament. , During the tournament, Brendan Taylor announced his retirement from Zimbabwe cricket  even as he finished the tournament with 433 runs and two centuries. At the finish of the tournament, Taylor was among the leading run-getters of the tournament.  , In May 2015, Zimbabwe became the first team in six years to tour Pakistan. Zimbabwe lost the t20 series 0-2 and the ODI series by an identical margin.  , Players are included here because of outstanding achievement or other prominence/notoriety. For a fuller list of Zimbabwean cricketers, see Category:Zimbabwean cricketers . , International Match Summary – Zimbabwe    , Most Test runs for Zimbabwe  , Most Test wickets for Zimbabwe  , Test record versus other nations  , Most ODI runs for Zimbabwe  , Most ODI wickets for Zimbabwe  , ODI record versus other nations  , Most T20I runs for Zimbabwe  , Most T20I wickets for Zimbabwe  , T20I record versus other nations  "
}
