{
  "articles": [
    {
      "title": "Auto taskforce marks first year with bleak jobs outlook",
      "description": "A taskforce helping South Australian firms prepare for the closure of Holden's Adelaide manufacturing plant in 2017 meets with more than 30 companies as they face a bleak outlook."
    },
    {
      "title": "Queensland CSG jobs being shed as construction boom ends abruptly",
      "description": "The mayor rural Queensland's Western Downs region says the coal seam gas construction boom has ended quicker than expected."
    },
    {
      "title": "Greek PM calls referendum to decide on bailout agreement",
      "description": "Greek prime minister Alexis Tsipras calls a referendum to decide whether the country should accept or reject a bailout agreement offered by creditors."
    },
    {
      "title": "Superannuation shake-up a 'political stunt'",
      "description": "A prominent industry fund executive accuses the Federal Government of a political stunt over its plans to shake up superannuation boards."
    },
    {
      "title": "Asian tourists, low dollar driving Australian luxury retail sector",
      "description": "Demand for luxury products in Australia is steadily increasing due to a depreciating dollar and a spike in Asian tourists, analysts say."
    },
    {
      "title": "SA car industry set to lose another 50 jobs",
      "description": "Up to 50 jobs will be axed from car component makers Monroe and Walker in Adelaide in the wake of Holden's decision to cut 270 positions at its Elizabeth plant."
    },
    {
      "title": "Share market drops to lowest in nearly a month",
      "description": "Worries about Greece's debt negotiations and weaker commodity prices drive the local share market's worst loss in nearly a month."
    },
    {
      "title": "Contractors on new Perth children's hospital project not being paid, Opposition says",
      "description": "Long delays in paying contractors involved in building the new $1.2-billion Perth Children's Hospital should be investigated by the Western Australian Government, the Opposition says."
    },
    {
      "title": "Tagara Builders enters liquidation following claims of unpaid workers",
      "description": "Construction company Tagara Builders, whose sub-contractors claim they have not been paid for three months, enters liquidation after its managing director resigns as head of an industry association."
    },
    {
      "title": "Jetstar expansion stalled by Hong Kong authorities",
      "description": "Hong Kong officials have rejected an application for an offshoot of cut-price airline Jetstar to operate out of the Asian financial hub."
    },
    {
      "title": "Mine workers made $47k payment described as 'donation': AWU",
      "description": "The Victorian branch of the Australian Workers Union moves to explain a $47,500 payment that was described in its accounts as a donation made by mining company Roche in 2007 — the same year Bill Shorten ended his time as national secretary of the union."
    },
    {
      "title": "Third Maxi-Cosi child car seat withdrawn from sale",
      "description": "A third Maxi-Cosi child car seat is removed from sale due to safety concerns, with the company under increasing pressure from angry parents for an explanation."
    },
    {
      "title": "Australia risks becoming nation of 'tenant serfs', Liberal MP says",
      "description": "Liberal MP John Alexander issues a stark warning about the current housing market, saying it is putting Australia at risk of becoming a nation of \"imprisoned tenant serfs\"."
    },
    {
      "title": "NSW to grant travel concessions to asylum seekers",
      "description": "Asylum seekers in New South Wales will receive travel concessions, Premier Mike Baird announces on social media."
    },
    {
      "title": "Tarkine Mine appeal dismissed by Federal Court",
      "description": "The Federal Court dismisses conservationists' appeal against a mine in a contentious area of Tasmania's north-west, but its operator says it will not re-open the site in the near future due to the fall in iron ore prices. "
    },
    {
      "title": "Launceston retailers join forces to ban shoplifters",
      "description": "Launceston business owners are escalating their campaign to stop shoplifting and anti-social behaviour in the city."
    },
    {
      "title": "150 out of work as shopping complex construction stops in SA: union",
      "description": "Construction of a shopping complex in Murray Bridge is halted, leaving about 150 workers in the dark amid claims sub contractors have not been paid for at least three months, a union says."
    },
    {
      "title": "Sydney cyclists take to traffic lanes to protest demolition of CBD cycleway",
      "description": "Cyclists are riding down College Street in Sydney's CBD during peak hour to protest against the State Government's decision to rip up the adjacent cycleway to allow construction of a new light rail line."
    },
    {
      "title": "Australia Post to slash 1,900 jobs amid $500m mail losses",
      "description": "Australia Post announces major job cuts as the decline in its traditional letter delivery service continues to accelerate, with losses of $500m prompting boss Ahmed Fahour to warn the mail carrier is at a \"tipping point\"."
    },
    {
      "title": "Stocks ease as Greek debt talks remain deadlocked",
      "description": "Global share markets ease again as Greece and its international creditors remain deadlocked over its debt crisis, despite a series of top level meetings."
    },
    {
      "title": "Swift shakes off fight with tech giant Apple Music",
      "description": "Pop star Taylor Swift says she will put her latest hit album 1989 on Apple Music, days after the tech giant did an about-face and agreed to pay artists during a free trial of its new streaming music service."
    },
    {
      "title": "Greek talks 'go backwards' as default looms",
      "description": "Greece and its EU-IMF creditors fail to break the deadlock at emergency talks on a bailout deal, raising fresh fears of a default by Athens that could send it crashing out of the euro."
    },
    {
      "title": "Union-backed super funds face shake-up under controversial reforms",
      "description": "The Federal Government is on a collision course with unions over superannuation reform, with controversial draft legislation due to be tabled in parliament today."
    },
    {
      "title": "French cabbies vent fury in Uber protests",
      "description": "Protests in France against ride-booking app Uber turn violent as taxi drivers burn cars and block access to airports and train stations. "
    },
    {
      "title": "Maxi-Cosi A4 child car seats recalled over safety concerns",
      "description": "An additional 5,000 high-end child car seats are being officially recalled nationwide over serious safety concerns, following a mass recall of a similar model last Wednesday."
    },
    {
      "title": "'We're on Australia's side', ABC boss Mark Scott says",
      "description": "ABC managing director Mark Scott declares the broadcaster is \"on the side of Australia\" after Tony Abbott accused it of betraying the nation over a former terror suspect's appearance on Q&amp;A."
    },
    {
      "title": "Share market closes lower as Greek debt impasse continues",
      "description": "The Australian share market closes lower as the Greek debt impasse drags on, with talks between Greece's prime minister and the country's creditors stalling and Europe and the US markets also falling."
    },
    {
      "title": "Energy Minister angry over regulator's report on Synergy merger",
      "description": "Western Australia's Energy Minister hits back at an Economic Regulation Authority report which warns of the increasing dominance of Synergy as a result of the utility's merger."
    },
    {
      "title": "Queensland lemon laws website attracts dozens of cases",
      "description": "At least 60 people post \"lemon\" car case studies to a Queensland Government website gathering evidence for a consumer law review."
    },
    {
      "title": "Analysts, business praise Australia's Asian Infrastructure Investment Bank investment",
      "description": "The Federal Government's decision to join China's Asian Infrastructure Investment Bank will boost the country's leadership credentials in the Asia-Pacific region, according to analysts."
    },
    {
      "title": "Tasmanian boat building consortium to bid for $600m federal contract",
      "description": "Tasmanian ship building companies vie for a $600-million Australian Defence contract to build 21 new patrol boats. "
    },
    {
      "title": "Rental vacancies spike in Perth property market",
      "description": "There are further signs of weakness in Perth's property market with a big spike in the number of homes for rent."
    },
    {
      "title": "Life insurance changes could cost financial planners $250m",
      "description": "Sweeping changes to the life insurance industry could eventually cost financial planners as much as $250 million a year in lost fees and commissions."
    },
    {
      "title": "Atlas Iron shareholders approve company-saving capital raising bid",
      "description": "Atlas Iron shareholders vote overwhelmingly in favour of a company-saving capital raising."
    },
    {
      "title": "Roy Hill asks employees to accept pay cut in bid to keep family-friendly roster",
      "description": "Gina Rinehart's mining company Roy Hill asks employees to accept a reduction in base salaries ranging from 5 to 10 per cent."
    },
    {
      "title": "Nationals senator names, shames IOOF figures for financial wrongdoing",
      "description": "National Party senator John Williams launches a stinging attack on IOOF, outlining evidence of insider trading and other financial misconduct."
    },
    {
      "title": "BHP Billiton to cut 140 jobs in SA",
      "description": "BHP Billiton announces it will be cutting 140 jobs, with the majority of those roles coming from its Adelaide office. The SA Opposition says the cuts come at \"the worst possible time\" for the state economy."
    },
    {
      "title": "Productivity Commission doubts claimed free trade deal benefits",
      "description": "The Productivity Commission has cast serious doubt on the value of free trade agreements, just as Australian participation in the Trans-Pacific Partnership is looking far more likely."
    },
    {
      "title": "WA Premier escalates row with Fremantle over department relocation and freight link",
      "description": "West Australian Premier Colin Barnett escalates his war of words with the City of Fremantle, threatening to shelve government plans to move the Department of Housing to the port city."
    },
    {
      "title": "Shares fall as creditors reject Greek debt proposals",
      "description": "Investor optimism about Greece's high level debt negotiations hits a wall, with the country's creditors rejecting proposals to resolve the crisis."
    },
    {
      "title": "Putin extends Russia's ban on Western food for one year",
      "description": "Russian president Vladimir Putin extends a retaliatory ban against most Western food imports, including those from Australia, just days after EU officials prolong sanctions against Moscow over the Ukraine conflict."
    },
    {
      "title": "Uber, Airbnb should be embraced and regulated: NSW Labor",
      "description": "NSW should lead the country by regulating \"sharing economy\" businesses such as Uber and Airbnb rather than trying to block their operations, the state's Opposition Leader says."
    },
    {
      "title": "US Senate approves Trans-Pacific Partnership fast track",
      "description": "The US Senate approves legislation key to securing the Trans-Pacific Partnership (TPP) trade deal, which could span 12 countries including Australia, advancing US president Barack Obama's efforts to strengthen US economic ties with Asia."
    },
    {
      "title": "Legacy Way tunnel to open to traffic tonight: Quirk",
      "description": "Brisbane's long awaited Legacy Way tunnel will open to traffic at 9pm, Lord Mayor Graham Quirk says."
    },
    {
      "title": "Greek PM slams creditors as hopes for bailout deal fade",
      "description": "Greek prime minister Alexis Tsipras lashes out at his country's creditors ahead of critical talks in Brussels, denting hopes of a final deal to prevent Athens from defaulting and leaving the euro."
    },
    {
      "title": "Imported construction materials putting lives at risk, experts say",
      "description": "Substandard imported building materials are putting Australian lives and property at risk, according to industry leaders. "
    },
    {
      "title": "Chanel 'bullies' SA business over Chocolate at No.5 logo",
      "description": "An Adelaide Hills chocolate maker is forced to change her business' logo after being threatened with legal action by global fashion brand Chanel."
    },
    {
      "title": "Legacy Way open to traffic before weekend, Brisbane Mayor says",
      "description": "Brisbane's Legacy Way tunnel should be open before the weekend, Mayor Graham Quirk says."
    },
    {
      "title": "Queensland budget to see $3b write-down in mining royalties: Treasurer",
      "description": "The Queensland budget will take a $3 billion hit over the next four years due to a downturn in the mining sector, Treasurer Curtis Pitt says."
    },
    {
      "title": "Share market quiet amid continuing Greek debt negotiations",
      "description": "Investors take a breather in the local share market as high-level negotiations over Greece's massive debt continue."
    },
    {
      "title": "WA to open public land sales to unsolicited bids: Minister",
      "description": "Unsolicited bids for publicly owned land or buildings in Western Australia will be considered after the debt-laden State Government expands the scope of its land sales program."
    },
    {
      "title": "Thousands of child car seats taken off shelves over safety concerns",
      "description": "More than 10,000 high-end Maxi-Cosi child car seats are being recalled across the country after parents found the straps of the model could dangerously loosen while driving."
    },
    {
      "title": "Former Victorian premier appointed to Seven West Media board",
      "description": "Former Victorian premier Jeff Kennett is appointed to the board of Seven West Media, as part of an overhaul at the top of the Kerry Stokes-controlled company."
    },
    {
      "title": "Air Force drone takes to civilian skies over Rockhampton in national first",
      "description": "In an Australian first, the Air Force's remotely piloted Heron aircraft has flown in civilian airspace without disrupting domestic flights over Rockhampton in Queensland this week as part of preparations for war games."
    },
    {
      "title": "Galilee Basin coal mining could double Australia's emissions: report",
      "description": "Mining should not go ahead in Queensland's untapped Galilee Basin as it risks doubling Australia's emissions and a dwindling export market means the industry faces a risky future, the Climate Council says."
    },
    {
      "title": "Australia to contribute $930 million to AIIB: Hockey",
      "description": "Treasurer Joe Hockey announces Australia will become a founding member of the Asian Infrastructure Investment Bank, contributing $930 million to the bank over five years."
    },
    {
      "title": "Atlas Iron chief confident of deal to save WA miner",
      "description": "The head of Atlas Iron David Flanagan says he is confident shareholders will vote overwhelmingly in favour of capital raising at a meeting tomorrow."
    },
    {
      "title": "Adelaide River community declares 'gas field free' status",
      "description": "The Northern Territory township of Adelaide River passes a resolution to keep the region \"gas field free\" and register its opposition to potential fracking plans."
    },
    {
      "title": "ASIC takes miner to court for 'misleading' investors over $6b funding announcement",
      "description": "Corporate watchdog ASIC launches legal action against WA miner Padbury for allegedly misleading investors over a $6 billion funding announcement that went sour."
    },
    {
      "title": "Road upgrade opens up Tasmania's Tarkine region to more tourists",
      "description": "An upgraded 90-kilometre tourist road is officially opened in the Tarkine region of north-west Tasmania."
    },
    {
      "title": "Care urged over Royal Perth Hospital private investment suggestion",
      "description": "The Health Consumers Council will provide \"in-principle\" support for private sector investment in Royal Perth Hospital, but says it should only involve experienced medical services providers."
    },
    {
      "title": "Qantas moves to block publication of memoir that 'exploits' company secrets",
      "description": "Qantas is seeking to block the publication of a memoir by its speechwriter, who wrote CEO Alan Joyce's speech when he made the radical decision to ground the airline's entire fleet during an industrial dispute in 2011."
    },
    {
      "title": "Electric car tour of Tasmania unplugged for want of power",
      "description": "An electric car tour of Tasmania has stalled in Hobart due to a lack of charging options, as the Tasmanian Opposition spruiks its policy of government support for the technology."
    },
    {
      "title": "Greeks flock to Melbourne to escape economic, social crisis",
      "description": "The bleak economic outlook in Greece is seeing thousands of people move to Australia to find work and join their extended families, with many coming to Melbourne, the city with the largest Greek population outside the country itself."
    },
    {
      "title": "Global markets rise overnight as Greece continues creditor talks",
      "description": "Global markets rise as the world awaits to see if Greece and its creditors will strike a deal."
    },
    {
      "title": "US Senate pushes Trans-Pacific Partnership forward",
      "description": "US president Barack Obama's call for \"fast track\" negotiations for the Trans-Pacific Partnership clears a hurdle in the US Senate, paving the way for a final vote on the legislation."
    },
    {
      "title": "Voters oppose China-Australia FTA due to controversial elements",
      "description": "Voters in marginal seats across four states strongly oppose key aspects of Australia's free trade deal with China, according to an opinion poll."
    },
    {
      "title": "Legislation to cut renewable energy target passes Parliament",
      "description": "Legislation to cut the renewable energy target passes Federal Parliament, along with the contentious inclusion of native wood waste as a possible fuel source."
    },
    {
      "title": "Hobart City Council decides against court appeal for foreshore boardwalk",
      "description": "Hobart City Council decides against a Supreme Court challenge to build a foreshore walkway around Battery Point. "
    },
    {
      "title": "Mayor pushes for Government assistance to deal with Alinta closures",
      "description": "Port Augusta's mayor calls on the State Government to provide assistance to the region to help deal with the fall-out from the closure of the town's power station and Leigh Creek coal mine."
    },
    {
      "title": "Market rises as Greece shows signs of debt deal progress",
      "description": "Signs of progress over Greece's massive debts drive markets higher around the world, including in Australia."
    },
    {
      "title": "Trans-Pacific Partnership returns to US Senate for second test",
      "description": "Legislation to fast-track the Trans-Pacific Partnership, a wide-ranging proposed trade agreement that could include more than 10 countries including Australia, returns for a second run through the US Senate chamber."
    },
    {
      "title": "Gold royalties hike not ruled out by WA minister",
      "description": "WA's Mines Minister Bill Marmion says he cannot rule out further State Government moves to lift the gold royalty rate in its next budget, but promises to oppose any attempt to do so."
    },
    {
      "title": "WA Government, Woodside sign $1 billion gas deal",
      "description": "The WA Government signs a deal with oil and gas giant Woodside to receive domestic gas supplies from the Browse floating LNG project off the Kimberley coast."
    },
    {
      "title": "Warning over WA man involved in $200k scam",
      "description": "Western Australia's consumer protection agency is warning people against an \"insidious\" scam by a former fraud victim in which $200,000 has been lost to date."
    },
    {
      "title": "Flights resume in NZ after radar fault grounds all aircraft",
      "description": "Flights resume in New Zealand after an air traffic control system fault grounded all aircraft, the country's air navigation service says."
    },
    {
      "title": "Chevron urged to house Wheatstone workers in Onslow",
      "description": "Oil and gas giant Chevron is called on to house workers from its Wheatstone project in Onslow in the wake a report on the mental health impacts of fly-in, fly-out operations."
    },
    {
      "title": "Sydney stands alone in home price surge",
      "description": "Sydney's home price growth is almost three times as fast as the nation's next strongest capital city market, the latest official figures show."
    },
    {
      "title": "Petrol tax to rise twice yearly after Labor, Government strike deal",
      "description": "The Federal Government and Labor strike a deal that will increase tax on petrol twice every year, with the next hike coming in August."
    },
    {
      "title": "Business sales index points to post-budget boost",
      "description": "A private business sales gauge shows the federal budget's small business incentives may be starting to pay off."
    },
    {
      "title": "European markets rally despite uncertainty on Greece deal",
      "description": "European markets rally their socks off overnight, despite nothing being resolved with Greece."
    },
    {
      "title": "10 recommendations for governments to tackle climate change",
      "description": "The Lancet Commission presents 10 recommendations for governments to implement to improve public health by managing climate change."
    },
    {
      "title": "Climate change 'risks undoing health gains of last 50 years'",
      "description": "Public health gains over the last 50 years risk being undone by climate change, a major study published in The Lancet medical journal finds."
    },
    {
      "title": "Greece offers new plan to avert default, creditors see some hope",
      "description": "Eurozone finance ministers cautiously welcome new reform proposals presented by Greece to avert a looming default."
    },
    {
      "title": "Market results modest ahead of Greece debt crisis meeting",
      "description": "The share market has posted modest gains in a light trade day as investors await an emergency meeting of eurozone leaders on Greece's debt crisis."
    },
    {
      "title": "Creditors of collapsed stockbroker BBY battle to recover lost millions",
      "description": "Creditors of failed stockbroker BBY find out it could be months before administrator KPMG understands where millions of dollars went missing."
    },
    {
      "title": "Asian workers encouraged to lodge bogus visa applications",
      "description": "Asian workers in Australia's poultry industry are being encouraged to lodge bogus refugee visa applications to extend their stay in Australia."
    },
    {
      "title": "Swift response: Apple bows to pop princess",
      "description": "Taylor Swift's threat to boycott Apple's new music streaming service sees the tech giant back down and agree to pay artists for streams during customers' three-month, free trial."
    },
    {
      "title": "Greece faces moment of truth in last-minute debt talks",
      "description": "Greece is facing its last chance to unlock more bailout funds at a meeting of European leaders and finance ministers tonight."
    },
    {
      "title": "Treasurer pledges not to sell SA Water after privatisation speculation resurfaces",
      "description": "Treasurer Tom Koutsantonis pledges not to sell SA Water, but confirms an unsolicited bid has been received for a regional asset."
    },
    {
      "title": "Three resign from board of Ranger uranium mine operator",
      "description": "Half of the board members of the uranium miner Energy Resources of Australia announce their resignations amid uncertainty over the future of the Ranger mine in Kakadu National Park."
    },
    {
      "title": "IOOF shares slump on Fairfax reports of misconduct",
      "description": "Financial services giant IOOF rejects reports alleging insider trading and compliance issues, but its shares slump despite the denial."
    },
    {
      "title": "Credit card interest rates too high: Hockey",
      "description": "Credit card rates are \"too high\", according to Federal Treasurer Joe Hockey, while independent Senator Nick Xenophon says he will push for reform by the end of the year."
    },
    {
      "title": "Rich getting richer, wealth gap increasing: ACOSS report",
      "description": "The peak welfare lobby group says inequality between the richest and poorest has grown alongside the nation's run of nearly a quarter of a century without recession."
    },
    {
      "title": "Hackers ground 1,400 passengers at Warsaw airport",
      "description": "About 1,400 passengers aboard Polish airline LOT are kept grounded at Warsaw's Chopin airport after hackers attack the airline's computer systems."
    },
    {
      "title": "CFMEU to pay Grocon $3.55m over 2012 Melbourne CBD blockade",
      "description": "The CFMEU will pay $3.55 million to building company Grocon over the blockade of several of its sites in Melbourne, including the Myer Emporium project."
    },
    {
      "title": "Taylor Swift boycotts Apple streaming service over payments",
      "description": "The performer says she will not allow her latest album on Apple Music to protest its \"shocking\" lack of artist compensation during a free trial period."
    },
    {
      "title": "Greece scrambles for debt deal with fresh plan before summit",
      "description": "Negotiations over Greece's debt have reach a crucial stage, with prime minister Alexis Tsipras offering European leaders a new proposal to end the dangerous impasse."
    },
    {
      "title": "Future of Greece debt crisis still in limbo as payment deadline looms",
      "description": "As Greece and its creditors continue to bicker and reschedule crisis meetings, the time is fast approaching when a decision will need to be made about whether the debt-ridden nation will exit the eurozone."
    },
    {
      "title": "Smarter, smaller homes needed for housing affordability: taskforce head",
      "description": "Smaller, smarter properties are key to resolving affordability and practicality issues, says the head of a new Queensland-based taskforce on future housing."
    },
    {
      "title": "Low dollar sees more overseas tourists head west",
      "description": "Western Australia has seen a jump in international tourist numbers, with an extra 60,000 visitors flocking to the state in the past year, the state's tourism lobby group says."
    },
    {
      "title": "Greece to present compromise debt deal to creditors",
      "description": "Greece says it will present new proposals to its creditors to reach a debt deal as the country's outspoken finance minister Yanis Varoufakis puts the onus on the leader of paymaster Germany to make a deal."
    },
    {
      "title": "Canberra region turns Amish for SAFIA's latest music video",
      "description": "Parts of the Canberra region are transformed to resemble an Amish community for local electric-indi trio SAFIA's latest music video."
    },
    {
      "title": "Tens of thousands march against austerity measures in London",
      "description": "Tens of thousands of demonstrators march against austerity in London in the first major public protest since the re-election of Conservative prime minister David Cameron."
    },
    {
      "title": "Engineers say NSW has country's worst building certification system",
      "description": "Engineers warn that a major fire in a high-rise Sydney apartment is inevitable because \"the building system in New South Wales has broken down\"."
    },
    {
      "title": "Interstate flights to WA's South West a 'game changer'",
      "description": "Interstate visitors to WA's South West will be able to fly directly into the region from 2018 after a $60 million expansion of Busselton Airport."
    },
    {
      "title": "SA shipbuilder ASCI bids for Pacific patrol boat contract",
      "description": "Port Adelaide-based shipbuilder ASCI launches a joint bid to build the next generation of Pacific patrol boats, a project valued at more than $1 billion."
    },
    {
      "title": "ECB boosts emergency funding to Greece as banks bleed",
      "description": "European Central Bank expands emergency funding for Greek banks as savers withdraw 1.2 billion euros in a single day, but prime minister Alexis Tsipras insists the nation's future in the euro was secure."
    },
    {
      "title": "Local shares bounce back to end week on high",
      "description": "The local share market bounces back from yesterday's heavy losses to end a volatile week with an even healthier gain."
    },
    {
      "title": "Media laws 'look foolish' in current digital landscape",
      "description": "A media analyst says current media laws \"don't account for the horizon that now exists\" in Australia."
    },
    {
      "title": "Supabarn announces plan to sell ACT, NSW stores to Coles",
      "description": "Independent supermarket chain Supabarn announces the sale of several of its Canberra stores to supermarket giant Coles."
    },
    {
      "title": "TPP fast track takes a step forward and half a step back in US Congress",
      "description": "Moves to fast track US approval processes for the planned Trans-Pacific Partnership free trade deal have narrowly passed the House of Representatives but need fresh Senate approval."
    },
    {
      "title": "News Corp CEO to retire, publisher poaches APN's CEO Miller as chairman",
      "description": "Julian Clarke will step down at the end of the year as chief executive of News Corporation Australia, while APN's CEO Michael Miller will join the publisher as executive chairman."
    },
    {
      "title": "SA budget surplus forecast overly optimistic: economist",
      "description": "The South Australian budget is unlikely to achieve a projected surplus in 2016-17 because its economic forecasts are overly optimistic, an economist from Adelaide University says."
    },
    {
      "title": "Share markets rally on Greek aid extension speculation",
      "description": "Wall Street rallies strongly, and other markets rise, on unconfirmed reports that Greece might get an aid extension."
    },
    {
      "title": "New survey shows more Canberrans oppose light rail than support it",
      "description": "A new poll from Unions ACT finds more Canberrans oppose light rail than support it."
    },
    {
      "title": "High-level talks on possible Greek default 'urgent'",
      "description": "Eurozone leaders will hold an emergency summit to try to avert a Greek default on Monday, after a meeting of finance ministers failed to reach a breakthrough."
    },
    {
      "title": "Mine failures take shine off northern development enthusiasm for NT community",
      "description": "Aboriginal traditional owners from the Roper River region of the Northern Territory are wary of talk about northern development, after two mines fail to deliver on promised jobs and economic activity for their communities."
    },
    {
      "title": "FIFO suicide family urge miners to embrace report findings",
      "description": "The family of a fly-in, fly-out worker who died from suicide urges the resources sector to embrace the findings of a parliamentary committee report examining the mental health impact of FIFO operations."
    },
    {
      "title": "Senate inquiry to examine flag of convenience shipping after suspicious deaths",
      "description": "The Senate announces an inquiry into flag of convenience shipping after a Four Corners program highlights the suspicious deaths of three seafarers on board Japanese owned ship the Sage Sagittarius."
    },
    {
      "title": "Ten Network biggest loser as share market falls sharply",
      "description": "The share market underlines its recent volatility, falling sharply on weaker commodity prices and deepening anxiety over Greece's debt negotiations."
    },
    {
      "title": "Chinese medicine's mention in free trade deal 'a tragedy for Australian science'",
      "description": "The inclusion of traditional Chinese medicine in the free trade agreement is a step backwards for the health system and for science in Australia, a critic warns."
    },
    {
      "title": "Power prices to drop slightly in Queensland, regulator recommends",
      "description": "Consumers will get some power price relief as Queensland's Competition Authority recommends slight reductions for common electricity tariffs."
    },
    {
      "title": "Outback Qld roads get priority under northern Australia plan",
      "description": "Queensland's outback roads to get priority development under the Federal Government's plan to grow northern Australia."
    },
    {
      "title": "United States to put woman on $10 bill",
      "description": "The United States is set to put the picture of a woman on an American banknote for the first time in over a century, breaking the hold that white male political heroes have had on the greenback."
    },
    {
      "title": "Abbott's northern plan will help NT play 'catch up', Adam Giles says",
      "description": "The NT Chief Minister says Tony Abbott's vision for northern Australia \"isn't rhetoric\" and will help the Northern Territory \"play catch up\" to the rest of the country."
    },
    {
      "title": "Decay threatens historic officers quarters on convict dog line",
      "description": "A Legislative Council committee hearing in Hobart hears concerns a historic building on Tasmania's historic dog line is falling into disrepair."
    },
    {
      "title": "Banks reap $12b in fees in 2014: RBA",
      "description": "Banks reaped $12 billion in fees in 2014, with credit cards providing the strongest source of growth."
    },
    {
      "title": "BBY client trust fund shortfall rises to $16m: KPMG",
      "description": "The administrator of collapsed broking firm BBY dramatically lifts its estimate of the amount of money missing from client accounts."
    },
    {
      "title": "ANZ leads big four bank exposure to fossil fuel industry",
      "description": "A new report finds that Australia's big four banks have almost $37 billion in loan exposures to the fossil fuel sector."
    },
    {
      "title": "FIFO work can increase mental health risk: report",
      "description": "A WA parliamentary committee is unable to corroborate media reports of suicides among fly-in, fly-out employees, but says the FIFO work can lead to a heightened risk of mental health issues."
    },
    {
      "title": "Cash Converters to refund thousands of people for interest repayments of up to 633 per cent",
      "description": "Thousands of Australians who were charged up to 633 per cent interest on loans from Cash Converters will be eligible for partial refunds after two class action lawsuits are settled out of court."
    },
    {
      "title": "Woolworths hit by savage broker downgrades",
      "description": "The upheaval at Woolworths has failed to impress key analysts who have issued a spate of savage downgrades to the company overnight."
    },
    {
      "title": "Financial sector slows economic growth, widens inequality: OECD",
      "description": "A new OECD report finds that the bloated banking systems in most developed countries are sucking growth out of their economies."
    },
    {
      "title": "Wall St rises while Greece concerns pull Europe down",
      "description": "Markets around the world move in opposite directions, as Greek jitters drive Europe lower and continued low interest rates boost US shares."
    },
    {
      "title": "CEO charity sleepout fails to attract sponsors",
      "description": "The biggest annual fundraiser for Western Australia's St Vincent de Paul homeless services raises only half the money it did last year, threatening the provision of services to homeless people."
    },
    {
      "title": "Greece could exit eurozone and EU: central bank",
      "description": "The Greek finance minister has joined several eurozone officials in doubting a breakthrough can be achieved in talks today to reach a vital bailout deal with international creditors."
    },
    {
      "title": "Foreign workers exploited at Baiada chicken processing plants: investigation",
      "description": "An investigation by the Fair Work Ombudsman reveals foreign workers are being exploited and underpaid at one of Australia's biggest chicken processors."
    },
    {
      "title": "China-Australia Free Trade Agreement puts local jobs at risk: unions",
      "description": "Unions and industry groups say the free trade deal between Australia and China will put local jobs at risk, as Prime Minister Tony Abbott describes the deal as \"history making\"."
    },
    {
      "title": "WA winemakers to benefit from free trade deal with China",
      "description": "The WA wine industry says the signing of a free trade agreement between Australia and China will be a boon for local winemakers who are already trying to target Chinese markets."
    },
    {
      "title": "Saul Eslake resigns from US banking giant to run Tasmanian consultancy",
      "description": "Prominent economic commentator Saul Eslake announces he is leaving Bank of America Merrill Lynch to run a consultancy in Tasmania."
    },
    {
      "title": "Finance sector drives local share market higher",
      "description": "The local share market rises strongly, but Woolworths stocks miss out despite the company announcing its chief executive will depart."
    },
    {
      "title": "IAG deal opens Asian insurance doors to Warren Buffett: analysts",
      "description": "Analysts say Warren Buffett's $500 million investment in IAG is not a sign of faith in the local economy, but a move to gain entry into China's insurance market."
    },
    {
      "title": "Queensland to push for national lemon laws for when new cars go bad",
      "description": "The Queensland Government is starting a campaign for national lemon laws to protect new car buyers from vehicles that turn up repeated faults.  "
    },
    {
      "title": "Australia and China sign 'history making' free trade agreement",
      "description": "Prime Minister Tony Abbott says Australians will pay less for cars, clothes and electronics imported from China under a \"history making\" free trade deal signed in Canberra today."
    },
    {
      "title": "Beston buys out troubled milk processor United Dairy Power",
      "description": "Adelaide-based food company Beston announces it will buy troubled milk processor United Dairy Power and reopen plants in Murray Bridge and Jervois."
    },
    {
      "title": "NT Government bill leaves motorists unsure if RDH parking fines should be paid",
      "description": "Confusion reigns over whether the 8,500 people who have been issued parking \"fines\" at Royal Darwin Hospital will need to pay them."
    },
    {
      "title": "Greens concede super changes unlikely under Abbott",
      "description": "Greens leader Richard Di Natale concedes his deal with the Government to cut pensions is unlikely to reap the party any of its sought-after changes to superannuation."
    },
    {
      "title": "Markets rise strongly overnight despite Greece debt talks stalling",
      "description": "Markets seem to stabilise after recent slumps caused by fears over Greece's debt, but talks stall as prime minister Alex Tsipras accuses creditors of humiliating the Greek people."
    },
    {
      "title": "Parking machine glitch to cost WA $120,000 in lost revenue",
      "description": "Perth commuters can park for free for a third day running at Perth train stations, with a technical glitch in parking machines costing the WA Government up to $120,000 in lost revenue."
    },
    {
      "title": "Woolworths chief executive Grant O'Brien departs",
      "description": "The Woolworths boss is leaving after almost three decades with the supermarket giant following the company's poor performance."
    },
    {
      "title": "Brisbane rates to rise, road upgrades a priority",
      "description": "Brisbane ratepayers will pay an average of $32 extra in their rates bills in the coming financial year, the 2015 budget reveals, with a focus on roads and beautification of the city."
    },
    {
      "title": "Australian household debt triples, new study finds",
      "description": "Australian households are holding three times as much debt on average than they did 25 years ago, a report finds."
    },
    {
      "title": "Australia and China to sign free trade deal",
      "description": "Australia and China will sign a free trade agreement in Canberra today after more than a decade of negotiations."
    },
    {
      "title": "Labor says Greens 'dudded' by Government in age pension deal",
      "description": "Labor criticises the deal struck by the Greens with the Government on pension reform, saying the Coalition has made it clear they will not change superannuation."
    },
    {
      "title": "Perth's petrol price cycle upset after retailer switches timing of weekly price hike",
      "description": "Perth's petrol price cycle has been overturned after a fuel retailer shifted the timing of its weekly hike, and others followed suit."
    },
    {
      "title": "Morrison says Greens will support $2.4 billion pension changes",
      "description": "The Social Services Minister moves quickly to secure the Greens' 10 Senate votes on pension changes, thwarting Bill Shorten's efforts to block the budget's biggest savings measure."
    },
    {
      "title": "Share market closes lower despite day of solid gains",
      "description": "The Australian share market closes fractionally in the red, after anxiety over Greece's debt negotiations drives global markets to fall."
    },
    {
      "title": "Serco prisoner transport contract to be opened to tender",
      "description": "Serco will have to compete for Western Australia's prison transport and court security contract after the State Government decided to put it out to competitive tender."
    },
    {
      "title": "Corporate tax whistleblowers should receive reward: Uniting Church",
      "description": "The Uniting Church is calling for whistleblowers who reveal company tax evasion or avoidance to receive a reward out of any tax collected by the Australian Tax Office."
    },
    {
      "title": "'Image problem' hampering IT industry's ability to attract workers",
      "description": "The IT sector is suffering from an \"image problem\" and this could hamper its ability to attract people into the profession, according to a new report by Deloitte Access Economics."
    },
    {
      "title": "Clinton speaks out against Obama's plans to fast-track TPP",
      "description": "Hillary Clinton complicates Barack Obama's quest to \"fast-track\" the Trans-Pacific Partnership (TPP), throwing her support behind fellow Democrats who have revolted against the trade deal."
    },
    {
      "title": "IAG shares gain on partnership with Berkshire Hathaway",
      "description": "Insurance Australia Group shares are up strongly after it announced a strategic partnership with Warren Buffett's Berkshire Hathaway."
    },
    {
      "title": "Labor will not support $2.4 billion worth of pension changes",
      "description": "Opposition Leader Bill Shorten says his party will not support pension changes targeting \"liquid asset millionaires\", with the wealthiest couples affected only receiving $55,000 in super."
    },
    {
      "title": "Joyce backs ban on foreign governments buying Australian farms",
      "description": "Agriculture Minister Barnaby Joyce says he supports banning foreign state-owned enterprises from buying Australian farmland."
    },
    {
      "title": "Reserve Bank says Sydney real estate boom won't derail rate cut prospect",
      "description": "Booming Sydney housing prices alone would not derail another cut to interest rates, according to the minutes from the Reserve Bank's most recent board meeting."
    },
    {
      "title": "Australians don't trust the news - except when it comes from their favourite sources",
      "description": "Australians say they do not trust 'most news most of the time' but they are much more likely to trust the news outlets they personally use, new research suggests."
    },
    {
      "title": "European shares slide as ECB's Draghi warns on Greece",
      "description": "Markets around the world are on edge as Greece once again teeters on the brink of default after debt negotiations collapsed."
    },
    {
      "title": "Retailers say job fears stop SA consumers from spending",
      "description": "Retailers in South Australia say the industry is facing tough trading conditions because many people lack job security and are reluctant to spend."
    },
    {
      "title": "Greece ready to 'resume negotiations' as default, eurozone exit loom",
      "description": "Greece says it is ready to restart negotiations with its international creditors, despite earlier talks over the country's debt crisis breaking down and the threat of a default and an exit from the eurozone moving closer. "
    },
    {
      "title": "Sydney house prices could rise further, RBA official says",
      "description": "A senior Reserve Bank official warns house prices in Sydney, which are already growing at an annual pace of 15 per cent, could rise further."
    },
    {
      "title": "Nearly $1 million to be allocated to film set workshop in SA budget",
      "description": "A film an TV set construction workshop in Adelaide worth nearly $1 million is announced in the 2015-16 South Australian budget."
    },
    {
      "title": "Share market recovers after early losses, closes slightly lower",
      "description": "The Australian share market closes slightly lower, clawing back most of its steep early losses when banking stocks made a late recovery."
    },
    {
      "title": "1 William St fails to attract private sector interest: Queensland Treasurer",
      "description": "Public servants and government ministers will move into 1 William Street in Brisbane's CBD when it is built next year, Queensland Treasurer Curtis Pitt confirms."
    },
    {
      "title": "Petrol set for largest quarterly price rise in 25 years",
      "description": "Petrol prices are on track for their largest three-month rise in nearly a quarter of a century, with analysts warning they will increase further."
    },
    {
      "title": "New uranium extraction method discovered by WA researchers",
      "description": "Perth researchers discover a method to extract uranium from a mineral long viewed as a waste product in a technique that could boost the industry's value by more than $100 million annually. "
    },
    {
      "title": "MAC changes to increase car insurance costs by '70 per cent' in SA",
      "description": "A plan to privatise third-party car insurance in South Australia will push fees up 70 per cent over five years, Family First MLC Robert Brokenshire says."
    },
    {
      "title": "NSW Treasurer Gladys Berejiklian considering reviewing stamp duty",
      "description": "New South Wales Minister for Social Housing Brad Hazzard confirms his colleague, Treasurer Gladys Berejiklian, is considering reviewing stamp duty."
    },
    {
      "title": "Cultural shift as elderly Australians working longer: researchers",
      "description": "A 20-year analysis of workplace participation rates finds older Australians are clinging to work for longer, signalling a \"cultural shift\" in favour of older workers."
    },
    {
      "title": "Austal keen to buy ASC if defence firm privatised",
      "description": "Perth-based shipbuilder Austal confirms it would be interested in buying government-owned Adelaide defence firm ASC."
    },
    {
      "title": "Arrium signals sale of assets to cope with low iron ore prices",
      "description": "Mining company Arrium flags potential asset sales and announces $320 million in write-downs due to the significant fall of iron ore prices."
    },
    {
      "title": "Foxtel buys 15pc stake in Ten for $77m",
      "description": "Pay TV company Foxtel comes to the rescue of a free-to-air network, taking a 15 per cent stake in the Ten Network."
    },
    {
      "title": "ACT power prices set to drop $80 a year for average household",
      "description": "Average households in Canberra could see their electricity bill cut by $80 according to the latest decision from the ACT price regulator."
    },
    {
      "title": "Stamp duty abolition could be funded by GST increase: Property Council",
      "description": "The Property Council is urging an increase in the GST to fund the abolition of state stamp duties on real estate transactions."
    },
    {
      "title": "Greece last-chance IMF talks end with no deal",
      "description": "Last-ditch talks between Greece and its EU-IMF creditors end with no deal, setting the countdown towards a disastrous default by Athens with the threat of a Greek exit from the euro closer than ever."
    },
    {
      "title": "Brisbane parking fees to be frozen for second year, new app introduced",
      "description": "Parking fees will be frozen for another year in Brisbane, while a new app will be introduced to help drivers find and pay for parks in the city."
    },
    {
      "title": "IGA wholesaler Metcash posts $384m loss, sells auto division",
      "description": "IGA wholesale supplier Metcash declares a $384.2 million loss on massive write-downs, and announces the sale of its automotive division."
    },
    {
      "title": "Alinta executives fly to outback Leigh Creek for mine closure talks",
      "description": "Alinta Energy executives and two South Australian Government ministers go to outback Leigh Creek to discuss fallout from the company's decision to close its coal mine there."
    },
    {
      "title": "Federal Reserve interest rate meeting the market focus",
      "description": "All eyes are on the US Federal Reserve this week, as investors try to gauge when the central bank will lift rates away from zero."
    },
    {
      "title": "Parliament House cleaners on strike in Canberra",
      "description": "Cleaners at Parliament House in Canberra go on strike in protest over cuts to pay and conditions."
    },
    {
      "title": "Carrot beer on offer after Queensland craft brewer teams up with farmer",
      "description": "Beer and carrots do not usually go hand-in-hand, but an unusual bright orange brew has been successfully blended from produce out of the Scenic Rim, south of Brisbane."
    },
    {
      "title": "Australia 'stuck in the past' defending fossil fuels, Rockefeller descendant says",
      "description": "A descendant of America's first billionaire John D Rockefeller, whose fortune was built on oil, accuses the Australian Government of being \"stuck in the past\" for continuing to defend fossil fuels like coal."
    },
    {
      "title": "WA town of Irwin declares itself gas field-free",
      "description": "As concerns towards unconventional gas in Western Australia continue to grow, the town of Irwin becomes the fifth community in the Mid West to declare itself gas field-free. "
    },
    {
      "title": "Lounge room gigs create 'unique experience' for music fans",
      "description": "Melbourne's musical in-crowd finds a new venue for live music - the lounge room, where bands play in an individual's home for a unique experience."
    },
    {
      "title": "New philanthropy program raises nearly $40,000 for WA film industry",
      "description": "The Film and Television Institute of WA raises nearly $40,000 for local screen projects, under a new philanthropy program launched less than a fortnight ago."
    },
    {
      "title": "Brisbane residents raise concerns planning rules are 'bent' for developers",
      "description": "The debate over development in suburban Brisbane is heating up, with some residents concerned rules are being bent to accommodate new high-rise housing projects."
    },
    {
      "title": "SA tourism spending to increase by nearly $50 million",
      "description": "Tourism spending will increase by nearly $50 million in South Australia over the next four years as the Government looks to bid for more events and boost visitor numbers from China."
    },
    {
      "title": "No approval for future uranium mining in Kakadu, say traditional owners",
      "description": "Jabiru traditional owners warn they will not support future mining in Kakadu National Park after the Ranger Mine's lease ends in 2021."
    },
    {
      "title": "SA builders look for budget incentives to lift construction industry",
      "description": "The South Australian building industry calls on the State Government to use this week's budget to kickstart the housing sector."
    },
    {
      "title": "Banks chasing luxury car hire company for $2.5m in unreturned security deposits",
      "description": "An exotic sportscar rental business is failing to return big security deposits, leaving customers fuming and banks out of pocket."
    },
    {
      "title": "Victoria's new regional rail link opens to cater for busy western suburbs",
      "description": "The final section of Victoria's $3.65 billion regional rail link from Tarneit to Wyndham Vale is officially open, paving the way for more commuter services in regional centres and Melbourne's west."
    },
    {
      "title": "Egypt's new Suez Canal aims to double trade on the key route",
      "description": "Bigger ships will be making their way through Egypt's new Suez Canal from early August in an ambitious plan to double trade on the historic route."
    },
    {
      "title": "Inner Sydney public school plans scrapped due to cost of remediation",
      "description": "The New South Wales Government has abandoned a plan to build a new school at Ultimo in inner Sydney on a council-owned site, saying the remediation would cost too much."
    },
    {
      "title": "Nationals motion to stop CSG mining in NSW Northern Rivers fails",
      "description": "Efforts by the Nationals to make the Northern Rivers of New South Wales coal seam gas free have fallen flat."
    },
    {
      "title": "Trans-Pacific Partnership stalls as US Congress defeats fast-track authority",
      "description": "The Australian Government's hopes of joining a massive Pacific free trade agreement are up in the air after the United States Congress voted to slow down the negotiations."
    },
    {
      "title": "EU officials formally discuss Greek default possibility for first time",
      "description": "EU officials formally discuss the possibility of a Greek debt default for the first time, as negotiations between Athens and its creditors stall ahead of an end-of-month repayment deadline."
    },
    {
      "title": "Three Perth roof repair scammers sentenced",
      "description": "Three men implicated in a dodgy roof repair scam targeting the elderly are sentenced in a Perth court."
    },
    {
      "title": "WA miners signal move into medicinal cannabis market",
      "description": "Perth-based metal explorer company International Goldfields will head to market within weeks to raise money for its foray into medicinal cannabis in South America."
    },
    {
      "title": "Fish quota scientist resigns in row over trawler owner's alleged conflict of interest",
      "description": "An Australian scientist resigns from an advisory group on fish quotas over her concerns that trawler owner Gerry Geen has what she says is an unacceptable conflict of interest."
    },
    {
      "title": "Women in the boardroom: Female executive says husbands could be the barrier",
      "description": "Chief executive of Newton Investment Management and mother of nine Helena Morrissey says equality in the boardroom will not happen until the partners of female directors start pulling their weight at home."
    },
    {
      "title": "BBY may have been insolvent as early as June 2014",
      "description": "A damning report into the collapsed broking firm BBY reveals the firm may have been insolvent a year ago, which would be a serious breach of the Corporations Act."
    },
    {
      "title": "Share market finishes week with a whimper, despite overseas gains",
      "description": "The local share market finishes its four-day trading week with a whimper, despite gains for US, European and Asian markets."
    },
    {
      "title": "Commonwealth Bank restores service after three-hour outage",
      "description": "The Commonwealth Bank says it has restored its systems after customers complained EFTPOS terminals, credit and debit cards and online banking were not working for three hours. "
    },
    {
      "title": "Defence SA boss leaving after less than a year for new job",
      "description": "The man in charge of lobbying for defence projects in South Australia resigns after less than a year in the job."
    },
    {
      "title": "Bosses welcome decision on forcing workers to take leave",
      "description": "Workers could be asked to take enforced holiday leave if they accrue more than eight weeks under a ruling by the Fair Work Commission."
    },
    {
      "title": "Rental growth slowest on record says CoreLogic RP Data",
      "description": "A surge in property investment has seen rents post their slowest annual growth on record according to one leading private index."
    },
    {
      "title": "There cannot be uranium mining forever in Kakadu: traditional owners",
      "description": "Planning must begin now for the future of uranium mining at Kakadu National Park, the Indigenous organisation which represents traditional owners of the area says."
    },
    {
      "title": "NT Transport changes tack to reduce Indigenous road deaths",
      "description": "More than half of the road deaths in the Northern Territory are Indigenous people, leading the Department of Transport to try a new strategy to help reduce that number."
    },
    {
      "title": "Twitter CEO Costolo steps down as growth pressure mounts",
      "description": "Twitter boss Dick Costolo steps down under pressure from investors frustrated by the internet company's slow growth and seemingly constant shake-ups in its upper ranks."
    },
    {
      "title": "IMF abandons debt talks with Greece",
      "description": "The IMF dramatically abandons Greece debt talks in Brussels, blaming major disagreements with Athens, as the EU tells Greek PM Alexis Tsipras to stop gambling with his cash-strapped country's future."
    },
    {
      "title": "Wall St gains tempered by Greek debt standoff",
      "description": "US markets end a little higher, helped by strong retail sales, but gains are tempered as the International Monetary Fund breaks off debt talks with Greece."
    },
    {
      "title": "SA to see higher electricity prices after Port Augusta power stations close: economist",
      "description": "A closure of Port Augusta's coal-fired power stations by early 2018 could drive up electricity prices in South Australia, an economic forecaster says."
    },
    {
      "title": "Rupert Murdoch still firmly at top of his world empire",
      "description": "Rupert Murdoch, who is to step down as chief executive of 21st Century Fox — the media-entertainment conglomerate — still sits at the top of a massive empire."
    },
    {
      "title": "Gina Rinehart charity to provide training, education in Pilbara",
      "description": "Gina Rinehart's Roy Hill company and its contractors are to pool funds in a charity to provide training, education and cultural benefits in Western Australia's Pilbara. "
    },
    {
      "title": "Alan Bond farewelled at public funeral in Fremantle",
      "description": "Hundreds of mourners have farewelled controversial business identity Alan Bond at a public funeral at St Patrick's Basilica in Fremantle."
    },
    {
      "title": "Rupert Murdoch hands reins of 21st Century Fox to son James",
      "description": "The 84-year-old tycoon is standing down as chief executive of his media-entertainment conglomerate and will hand the role to his 42-year-old son James."
    },
    {
      "title": "Mines with 100pc FIFO workforce splitting community",
      "description": "More than 230 submissions have been made to an inquiry into fly-in, fly-out arrangements in Queensland mines with job prospects for locals and lost business among the concerns raised."
    },
    {
      "title": "Uranium miner pulls plug on NT expansion",
      "description": "Uranium miner Energy Resources of Australia will not proceed with its proposed 3 Deeps expansion project at the present time, the company announces to the stock exchange."
    },
    {
      "title": "Tasmanian exporters concerned about changes to freight subsidies",
      "description": "Tasmanian exporters have raised concerns about some of the detail of a $203 million expansion of the freight equalisation scheme."
    },
    {
      "title": "WA's lowest paid workers to receive extra $14 a week",
      "description": "Western Australia's lowest paid workers will receive a $14 a week pay rise, the Industrial Relations Commission decides."
    },
    {
      "title": "Bank of England governor Mark Carney issues warning to rogue traders",
      "description": "Bank of England governor Mark Carney effectively throws down the gauntlet to London's rogue traders in his annual Mansion House speech, declaring \"the age of irresponsibility is over\"."
    },
    {
      "title": "Share market posts strongest gains in nearly seven weeks",
      "description": "The local share market posts its strongest gains in nearly seven weeks, while the Australian dollar rises on the back of strong employment figures."
    },
    {
      "title": "Tax breaks for cyclists worth closely considering: Opposition",
      "description": "The Federal Opposition says new tax breaks for cyclists are worth \"closely considering\" to get more commuters riding to work."
    },
    {
      "title": "Fair Work Commission terminates AWU deal with cleaning company that cost workers $2m",
      "description": "The Fair Work Commission terminates an employment agreement between the Australian Workers Union and cleaning company Cleanevent, which cost workers $2 million a year in penalty rates."
    },
    {
      "title": "Shorten denies union's 'sweetheart deal' disadvantaged workers",
      "description": "Opposition Leader Bill Shorten denies that a deal he oversaw with civil construction company Winslow Constructors while secretary of the Victorian branch of the Australian Workers Union, disadvantaged workers."
    },
    {
      "title": "BHP Billiton, Rio Tinto credit ratings on negative outlook",
      "description": "Fitch places BHP Billiton, Rio Tinto and Anglo American on negative ratings outlooks due to the slide in commodity prices."
    },
    {
      "title": "Two major mining announcements give hope to Tasmania's struggling sector",
      "description": "Tasmania's struggling mining sector is given a boost on two fronts with the pending reopening of a mothballed nickel mine and a brand new iron ore project that is expected to create hundreds of jobs."
    },
    {
      "title": "ACCC raises issues with TPG's iiNet takeover",
      "description": "The competition watchdog indicates it has reservations about allowing internet company TPG Telecom's proposed takeover of rival iiNet."
    },
    {
      "title": "Hundreds of jobs to go in Victoria as Woolworths moves distribution centre",
      "description": "Up to 700 full-time and part-time jobs are set to go as Woolworths announces plans to move its Hume distribution centre in Broadmeadows to the east, in what the union calls a \"devastating blow\" for Melbourne's northern suburbs."
    },
    {
      "title": "Unemployment falls from 6.1 to 6pc as 42,000 jobs added",
      "description": "Unemployment falls to 6 per cent in May with an estimated 42,000 jobs added to the economy last month."
    },
    {
      "title": "World Bank urges nations to 'fasten seatbelts' for Fed rate rises",
      "description": "The World Bank warns of a rocky road ahead as the US moves toward tightening monetary policy and the greenback strengthens."
    },
    {
      "title": "Alinta Energy to close SA power stations, 440 workers affected",
      "description": "Coal-fired power stations at Port Augusta in South Australia and the outback mine which supplies them will close by 2018, resulting in the loss of 440 jobs."
    },
    {
      "title": "NBN announces plan to speed up rollout by 2020",
      "description": "The company signs contracts with five companies to connect 4 million homes and businesses to high-speed broadband within the next five years."
    },
    {
      "title": "Economists tip steady unemployment but risk is for rise",
      "description": "The latest jobs figures are expected to show unemployment remaining steady, but economists believe it could rise in the coming months."
    },
    {
      "title": "Wall St, European shares rise as Greek debt deal hopes grow",
      "description": "Global markets rise sharply on optimism that Greece will strike a deal with its creditors to avoid default."
    },
    {
      "title": "Barrack Square traders given rent relief after meeting with minister",
      "description": "All 15 Barrack Square traders hit by ongoing works on the Elizabeth Quay project in Perth are granted immediate three-month rent relief, after a much-anticipated meeting with Transport Minister Dean Nalder."
    },
    {
      "title": "Packed Gold Coast beaches turn off surfers, artificial breaks needed: researchers",
      "description": "Many surfers would rather stay at home than risk injury by braving overcrowded breaks on the Gold Coast, a new survey finds."
    },
    {
      "title": "Former Fairfax snappers cry foul over library at centre of alleged digitisation fraud",
      "description": "An ownership row is breaking out over the Fairfax media archive, with photographers saying they hold part of the copyright over the library that was sent to be digitised in the United States."
    },
    {
      "title": "ANZ boss defends big bank culture amid financial planning scandal",
      "description": "ANZ Bank chief executive Mike Smith gives assurances the culture within his bank is fine as corporate and prudential regulators step up pressure on the financial planning industry."
    },
    {
      "title": "Sports betting and share trading scams snare WA residents",
      "description": "West Australians have so far this year lost more than $200,000 on sports betting and share trading scams, with one business owner promised his money would be doubled in 12 months."
    }
  ]
}
