{
  "articles": [
    {
      "title": "Victorian-era photographs of the dead reveal moments of tenderness",
      "description": "Researchers are collecting photos of the dead, including images of deceased infants, for a planned exhibition that will examine how photographers deal with challenging subjects."
    },
    {
      "title": "South Sudanese parents living in regional Victoria tell their stories, inspired by children",
      "description": "The art of story telling helps a group of refugees from South Sudan deal with their often brutal personal experiences as well as helping them settle into a regional town in eastern Victoria."
    },
    {
      "title": "Hit movie Inside Out questions if we can truly live happily ever after",
      "description": "The hit new movie Inside Out carries a serious message for all of us — that living happily ever after may be the stuff of fairytales, but it is generally not a good strategy for real life."
    },
    {
      "title": "NSW woman 'privileged' to leave lip germs on 'down-to-earth' Johnny Depp",
      "description": "Tweed coast woman Whitney Aldridge plants a kiss on Captain Jack Sparrow's cheek as a \"down-to-earth\" Johnny Depp greets fans during filming for the Pirates of the Caribbean in NSW."
    },
    {
      "title": "The Avengers star Patrick Macnee dies in California aged 93",
      "description": "Actor Patrick Macnee, best known as bowler-hatted secret agent John Steed in the 1960s TV series The Avengers, dies at the age of 93 at home in California."
    },
    {
      "title": "Swift shakes off fight with tech giant Apple Music",
      "description": "Pop star Taylor Swift says she will put her latest hit album 1989 on Apple Music, days after the tech giant did an about-face and agreed to pay artists during a free trial of its new streaming music service."
    },
    {
      "title": "Funding changes creating deep division within arts community, director says",
      "description": "Prominent Australian theatre and film director Neil Armfield warns a deep division is forming within the arts community, while it waits to find out the details of a new federal funding model announced in last month's budget."
    },
    {
      "title": "Canberra film companies sign multi-million-dollar deal with Chinese production house",
      "description": "Canberra film companies Jia Films and SilverSun Pictures sign a lucrative 10-year deal with China's Yuezhong Pictures to produce 10 films in Australia."
    },
    {
      "title": "Twerking is so 1820, Oxford dictionary says",
      "description": "The word \"twerk\" existed as early as 1820, the Oxford English Dictionary reveals, as it announces it as one of 500 new entries this year."
    },
    {
      "title": "Heavy metal combats depression, anger: study",
      "description": "Listening to heavy metal or extreme kinds of music helps purge emotions like anger and depression, according to research."
    },
    {
      "title": "War portraits by Hilda Rix Nicholas once deemed 'too intimate' bought by AWM",
      "description": "The Australian War Memorial acquires nine portrait sketches by Victorian artist Hilda Rix Nicholas, which were once deemed too intimate and not nationalistic enough to go on go display at the institution."
    },
    {
      "title": "Sofie Laguna's novel isn't your traditional Miles Franklin winner (and that's a good thing)",
      "description": "Sofie Laguna isn't a man and her novel The Eye of the Sheep isn't focused on history and national identity - that's why it represents a welcome change for Australia's top literature prize."
    },
    {
      "title": "Qantas moves to block publication of memoir that 'exploits' company secrets",
      "description": "Qantas is seeking to block the publication of a memoir by its speechwriter, who wrote CEO Alan Joyce's speech when he made the radical decision to ground the airline's entire fleet during an industrial dispute in 2011."
    },
    {
      "title": "Artefacts recovered after blaze guts iconic Queensland museum",
      "description": "Authorities recover several artefacts from the ruins of the Waltzing Matilda Centre, a museum in Winton in western Queensland destroyed by fire last week."
    },
    {
      "title": "Titanic film composer James Horner dies in plane crash",
      "description": "James Horner, the celebrated composer of the scores of several Hollywood smash hit films including Titanic and Avatar, dies in a plane crash at the age of 61."
    },
    {
      "title": "Sofie Laguna wins 2015 Miles Franklin Literary Award",
      "description": "Sofie Laguna takes out Australia's top fiction prize, the Franklin Literary Award, for her novel The Eye Of The Sheep."
    },
    {
      "title": "Canberra kids step up to hip hop world championships",
      "description": "A group of talented young Canberrans are set to take on the world's best hip hop dancers at the international championships in the United States. "
    },
    {
      "title": "Daleks, Santa, nude women: Costumed termite mounds become art subject",
      "description": "A Northern Territory artist begins documenting the peculiar art of decorating termite mounds, a practise which is an outback tradition."
    },
    {
      "title": "P. Diddy charged with assault with deadly weapon at college campus",
      "description": "Sean \"P. Diddy\" Combs is arrested and charged with assault after getting into a fight with his son's college football coach."
    },
    {
      "title": "Photographer captures amazing Aurora Australis over Victoria",
      "description": "An amazing natural display of light from the Aurora Australis is captured in a series of images taken by a photographer in eastern Victoria."
    },
    {
      "title": "Miles Franklin Literary Award: Who were the five finalists?",
      "description": "Find out who was in line to take out Australia's top literary prize, which has been announced in Melbourne."
    },
    {
      "title": "Indigenous teen's art takes off on social media",
      "description": "A school project turns into a profitable small business for a 14-year-old Indigenous student from Newman, in WA's Pilbara."
    },
    {
      "title": "China bans celebrities from hosting television shows",
      "description": "Chinese celebrities are banned from appearing as presenters on television shows to ensure no \"improper remarks\" are made on air."
    },
    {
      "title": "Saudi comedian shrugs off threats after mocking IS on satirical show",
      "description": "A prominent Saudi comedian who mocked the Islamic State group and Islamists on his satirical sketch show says he will not be deterred after receiving death threats."
    },
    {
      "title": "Japan confirms plan to resume whale hunt",
      "description": "Japan's chief whaling negotiator says its ships will return to the Antarctic this year, despite a call by global regulators to provide more evidence that the whale hunt has a scientific purpose."
    },
    {
      "title": "Budding WA composers win rare chance to work with chamber orchestra",
      "description": "Most young classical composers struggle to have their work heard, but four students have won the opportunity to have their compositions played by musicians WA's premier orchestra."
    },
    {
      "title": "Swift response: Apple bows to pop princess",
      "description": "Taylor Swift's threat to boycott Apple's new music streaming service sees the tech giant back down and agree to pay artists for streams during customers' three-month, free trial."
    },
    {
      "title": "Marina Abramovic: The Artist is in Australia",
      "description": "Performance artist Marina Abramovic speaks about her legacy, feminism, Lady Gaga and how Aboriginal Australians inspired her art. "
    },
    {
      "title": "Perth's Elizabeth Quay to get eight-storey sculpture",
      "description": "The WA artist creating an eight-storey sculpture for Perth's Elizabeth Quay hopes the giant artwork will serve as a focal point for the $440 million development."
    },
    {
      "title": "Artists begin delivering entries for prestigious Archibald Prize",
      "description": "Artists hoping to win Australia's most prestigious portrait award, The Archibald Prize, begin delivering their entries to the Art Gallery of New South Wales in Sydney."
    },
    {
      "title": "Nitschke gets green light for comedy show from UK police",
      "description": "Controversial euthanasia advocate Philip Nitschke is set to make his comedy debut after police in the United Kingdom said they would not consider his performance to be encouraging suicide."
    },
    {
      "title": "Madonna heading back to Australia after 23-year break",
      "description": "Madonna will tour Australia for the first time in 23 years, with dates in Melbourne, Sydney and Brisbane in 2016."
    },
    {
      "title": "Hundreds take chilly skinny dip in Hobart's River Derwent for winter solstice",
      "description": "Hundreds of people brave the chilly waters of Hobart's River Derwent for the city's annual nude swim to mark the winter solstice."
    },
    {
      "title": "Taylor Swift boycotts Apple streaming service over payments",
      "description": "The performer says she will not allow her latest album on Apple Music to protest its \"shocking\" lack of artist compensation during a free trial period."
    },
    {
      "title": "Woman pays to rescue 100 dogs from meat festival",
      "description": "A Chinese woman pays more than $1,400 to save 100 canines from being eaten during a dog meat festival, as activists lash out at the \"cruel\" event."
    },
    {
      "title": "Documentary about Burmese refugees in Perth wins international awards",
      "description": "A documentary about a refugee family from Burma who made Perth their home is awarded a second international film award as Refugee Week draws to a close."
    },
    {
      "title": "FashHack brings fashion and technology together in Australian first",
      "description": "Some of the brightest minds in Australian technology and fashion come together in Sydney for the FashHack bootcamp and business building competition."
    },
    {
      "title": "Canberra region turns Amish for SAFIA's latest music video",
      "description": "Parts of the Canberra region are transformed to resemble an Amish community for local electric-indi trio SAFIA's latest music video."
    },
    {
      "title": "American author James Salter dies aged 90",
      "description": "Critically-acclaimed American author James Salter dies aged 90 during \"a gym session\" near his home in New York state."
    },
    {
      "title": "Retro computer, software collection helps National Library access digital treasures",
      "description": "One of the nation's largest collections of vintage software and computer equipment is forced to expand so the National Library of Australia can access valuable donations that are often in outdated digital formats."
    },
    {
      "title": "'I got it wrong': Brian Williams blames ego for exaggerated war story",
      "description": "Fallen anchorman Brian Williams says he was not trying to mislead people by exaggerating stories about his work, but that his ego drove him to make the mistakes that cost him his job on NBC's Nightly News."
    },
    {
      "title": "Woollen hat 'pilgrims' flood Alice Springs for annual beanie festival",
      "description": "A four-day beanie festival begins in Alice Springs, presided over by a \"chief beanieologist\" and attracting hundreds of interstate woollen hat aficionados."
    },
    {
      "title": "Perth's Eliza statue kitted out for Men's Health Week",
      "description": "The Eliza statue standing in Perth's Swan River in Crawley is no stranger to being dressed up in all kinds of clothing - but her current outfit supports a cause close to the heart of the sculptor who created her."
    },
    {
      "title": "World's largest book on display at State Library of NSW",
      "description": "The world's largest book, a giant atlas weighing 150 kilograms, will be on display at the State Library of NSW for the next four weeks."
    },
    {
      "title": "Neil Young tells Donald Trump not to use his music in US presidential bid",
      "description": "White House hopeful Donald Trump lands himself in hot water with Neil Young, after the billionaire developer used the singer-songwriter's hit Rockin' In The Free World without permission."
    },
    {
      "title": "Thousands flock to Winter Feast as chefs turn up the heat for Dark Mofo event",
      "description": "Hobart's Winter Feast attracts thousands of tourists and businesses to the city as Dark Mofo organisers hope to rival the hugely popular summer event, the Taste of Tasmania."
    },
    {
      "title": "LNP branch holds fundraiser by screening The Killing Season",
      "description": "An ABC documentary about the leadership battles between former Labor prime ministers Kevin Rudd and Julia Gillard is being used to raise funds for a branch of Queensland's Liberal National Party. "
    },
    {
      "title": "The top eight gaming reveals at E3 2015",
      "description": "From augmented reality to huge video game announcements, the world's top annual gaming expo has revealed what is coming to gamers this year and beyond."
    },
    {
      "title": "Fringe delivers $68.8m economic boost to Adelaide",
      "description": "More interstate and overseas visitors came to Adelaide for this year's Fringe festival than in previous years, which delivered South Australia more than $68.8 million in economic benefits."
    },
    {
      "title": "Chris Evans named as new host of Top Gear",
      "description": "Television and radio presenter Chris Evans is to replace Jeremy Clarkson as the lead presenter of the BBC's hit motoring show Top Gear."
    },
    {
      "title": "Visitors to Sydney's Vivid Light Festival up 20pc on previous year",
      "description": "Sydney's Vivid Light Festival records a 20 per cent increase in visitor numbers with 1.7 million people attending the event this year."
    },
    {
      "title": "Books-on-wheels road trip to promote French culture in Australia",
      "description": "Two West Australians are about to embark on a 17,000-kilometre books-on-wheels road trip to spread French culture around Australia."
    },
    {
      "title": "Tess Holliday the world's biggest plus-sized super model",
      "description": "Meet Tess Holliday, the largest model ever to be signed to a mainstream modelling agency, who is leading the body positivity movement in the fashion industry."
    },
    {
      "title": "Nearly $1 million to be allocated to film set workshop in SA budget",
      "description": "A film an TV set construction workshop in Adelaide worth nearly $1 million is announced in the 2015-16 South Australian budget."
    },
    {
      "title": "Frog caught on film eating carpet python",
      "description": "Carpet pythons often make a meal of green tree frogs but a new video shows the tables being turned, with one of the amphibians exacting revenge by chomping down on a snake in Darwin."
    },
    {
      "title": "Jurassic World sets box office record for opening weekend",
      "description": "The new Jurassic Park film rakes in a whopping $661 million worldwide in its first weekend, the largest opening take in history."
    },
    {
      "title": "Stormtrooper completes around Australia charity walk",
      "description": "He has swum with a crocodile, survived a snake bite and trekked through the desert but now stormtrooper Scott Loxley has arrived back home."
    },
    {
      "title": "Child abuse royal commission puts spotlight on entertainment industry",
      "description": "The royal commission into child sexual abuse launches an investigation into the entertainment industry, following revelations of abuse perpetrated by a number of high-profile entertainers in Australia and abroad. "
    },
    {
      "title": "Lawyer calls for Rolf Harris parole review over song mocking victims",
      "description": "A lawyer representing women abused by paedophile Rolf Harris says the disgraced entertainer's parole should be reviewed in the wake of reports he wrote a song mocking his victims."
    },
    {
      "title": "Two refugees and a blonde: Using humour to break down stereotypes",
      "description": "Two refugees from Iran and Iraq use YouTube and humour to break down stereotypes by creating a 10 part web series called Two Refugees and a Blonde."
    },
    {
      "title": "Lounge room gigs create 'unique experience' for music fans",
      "description": "Melbourne's musical in-crowd finds a new venue for live music - the lounge room, where bands play in an individual's home for a unique experience."
    },
    {
      "title": "Giving up the day job and surviving as an artist",
      "description": "Most artists in Australia find it almost impossible to pay the rent and survive financially on the sale of their pieces alone."
    },
    {
      "title": "Broken arm 'the most excruciating thing I've ever felt', Ben Ross says",
      "description": "Ben Ross describes the pain when his arm broke during a televised arm-wrestle with fellow former footballer Wendell Sailor as \"the most excruciating thing I've ever felt\"."
    },
    {
      "title": "Harper Lee's personal letters fail to sell at auction",
      "description": "Personal letters written by To Kill a Mockingbird author Harper Lee fail to sell at a New York auction, despite feverish interest in the publication of her second novel due for release next month."
    },
    {
      "title": "Hobart locals not warming to proposal which would change Hobart's skyline",
      "description": "Hobartians are not warming to a Dark Mofo proposal to build a tower in Hobart's CBD which would be taller than London's Big Ben and would change the city's skyline."
    },
    {
      "title": "Rocker Dave Grohl breaks leg on stage, returns to perform in cast",
      "description": "Foo Fighters frontman Dave Grohl gives new meaning to the advice for performers to \"break a leg\" after breaking his leg on stage and returning to play in a cast."
    },
    {
      "title": "'Spice age' art goes on show in SA",
      "description": "An exhibition of \"spice age\" artworks from the period in which ships crossed the oceans to load up with delicate goods goes on show in Adelaide."
    },
    {
      "title": "Dark Mofo draws people onto Hobart's streets",
      "description": "Hobart's Dark Mofo festival has taken over the port city with tens of thousands coming out for the celebrations."
    },
    {
      "title": "New funding gives students chance to sleep at Sydney's Hyde Park Barracks",
      "description": "Children from around New South Wales will now have the opportunity to sleep over in the World Heritage-listed Hyde Park Barracks, as the State Government launches the Unlocking Heritage funding program."
    },
    {
      "title": "Brisbane's cultural precinct heritage listed, high-rise plan scrapped",
      "description": "Brisbane's South Bank cultural precinct is being heritage listed, which will preserve the area from major redevelopment in future."
    },
    {
      "title": "Gallery crowdfunding purchase of Howard Arkley painting",
      "description": "The National Gallery of Victoria turns to crowdfunding to fill a gap in its collection, seeking public donations to help buy a key work from the acclaimed Australian artist Howard Arkley."
    },
    {
      "title": "Rock icon Mark Seymour: I'm as ambitious as I've ever been",
      "description": "Former Hunters and Collectors frontman Mark Seymour speaks candidly to Jane Hutcheon about song-writing, social conscience and how he is not ready to settle down."
    },
    {
      "title": "Jazz great Ornette Coleman dies aged 85",
      "description": "Ornette Coleman, one of jazz's most groundbreaking artists, who brushed aside convention with his prophetically titled 1959 album The Shape of Jazz to Come, dies in New York aged 85."
    },
    {
      "title": "Ex-NRL prop Ben Ross breaks arm on live TV",
      "description": "The former NRL front-rower breaks his arm during a live television arm-wrestle with former NRL star Wendell Sailor."
    },
    {
      "title": "British actor Christopher Lee dies aged 93",
      "description": "Christopher Lee, who devoted his long acting career to portraying villains in horror classics such as Dracula before moving on to the Star Wars and Lord of the Rings franchises, dies at the age of 93."
    },
    {
      "title": "Dark Mofo winter festival puts a fire in Hobart's belly",
      "description": "Dark Mofo festival is changing the way Australia's southernmost capital is being seen and enjoyed, by locals and tourists alike."
    },
    {
      "title": "German big band leader James Last dies",
      "description": "German composer and big band leader James Last, famous for his trademark easy-listening music, dies in Florida at the age of 86."
    },
    {
      "title": "Aboriginal art collection sells for $2 million in historic auction",
      "description": "A stand-alone collection of Aboriginal art goes under the hammer for the first time at a major auction house in London, with the 75 high-quality and rare pieces on offer going for a total of more than $2 million."
    },
    {
      "title": "The Kettering Incident premiere sets scene for Tasmania's Dark Mofo festival",
      "description": "The Dark Mofo winter festival gets off to a suitably dark and creepy start with the world premiere of the television series The Kettering Incident."
    },
    {
      "title": "Jimmy Little's Thumbs Up program has funding rejected, likely to close",
      "description": "A charity program started by late musician Jimmy Little that provides nutrition education to Indigenous children has had its funding cut and is likely to close. "
    },
    {
      "title": "Romantic street art replaces love locks on Paris bridge",
      "description": "Panels of street art are installed on Paris's Pont des Arts to replace the hundreds of thousands of \"love locks\" that were weighing down the bridge."
    },
    {
      "title": "Former Fairfax snappers cry foul over library at centre of alleged digitisation fraud",
      "description": "An ownership row is breaking out over the Fairfax media archive, with photographers saying they hold part of the copyright over the library that was sent to be digitised in the United States."
    },
    {
      "title": "Urban exploration: Australia's 'tunnel rats'",
      "description": "Urban explorers from Sydney risk arrest to shed light on the beauty of hidden urban landscapes. "
    },
    {
      "title": "Hundreds of rare World War I posters to be auctioned",
      "description": "A collection of about 2,000 posters from the World War I era by US army officer Edward H. McCrahon will be sold at auction later this month, Guernsey's auction house says."
    },
    {
      "title": "Hitler's watercolour paintings to be auctioned in Germany",
      "description": "Watercolour paintings and drawings by Adolf Hitler from about 100 years ago will be auctioned in southern Germany this month."
    },
    {
      "title": "Arrest warrant issued for alleged Fairfax Media photo fraudster John Rogers",
      "description": "An arrest warrant is issued for John Rogers, the alleged fraudster at the centre of a legal battle over the future of the valuable photo archives belonging to Fairfax Media newspapers."
    },
    {
      "title": "Fitzroy Narrows: Photos capture inner-city Melbourne before 'trendification'",
      "description": "Amateur photographs from the late 1960s capture the inner-city suburb of Fitzroy as the Victorian government embarked on \"slum reclamation\". "
    },
    {
      "title": "Laughing at cancer, one Naked Tuesday at a time",
      "description": "Craig Coombes chooses to laugh in the face of cancer, stripping off once a week for what he calls Naked Tuesday."
    },
    {
      "title": "Tasmanian Premier talks up savings progress at estimates hearing",
      "description": "Tasmania's Premier uses estimates hearings to claim progress is being made on savings on supplies, consumables, and spin doctors."
    },
    {
      "title": "Helen Mirren, musical Fun Home take out major Tony Awards",
      "description": "British film star Helen Mirren scores her first Tony Award, while a lesbian coming-of-age musical and a play about a teenager with autism dominate Broadway's top awards night."
    },
    {
      "title": "Meteorite worth more than $16,000 stolen from Queensland museum",
      "description": "A soccer ball-sized meteorite worth $16,000 has been stolen from a museum in the far north Queensland town of Atherton."
    },
    {
      "title": "Medieval festival celebrates 800 years of the Magna Carta",
      "description": "Knights and princesses were everywhere as the Magna Carta's 800th anniversary was celebrated at Old Parliament House in Canberra."
    },
    {
      "title": "Hopes public can identify faces of WA diggers in forgotten photos",
      "description": "Faces of Australian soldiers now hang on the walls of the WA Museum in Perth, youthful, smiling and in remarkable clarity."
    },
    {
      "title": "Barunga Festival prompts renewed call for Indigenous treaty",
      "description": "The Northern Territory's Barunga Festival ends a weekend of 30th anniversary celebrations, which included renewed calls for a treaty with Indigenous people. "
    },
    {
      "title": "Singer song-writer Archie Roach honoured on Queen's Birthday",
      "description": "Victorian Indigenous singer song-writer Archie Roach, who brought the story of the stolen generation to a broad Australian audience 25 years ago, is among those recognised in the 2015 Queen's Birthday honours."
    },
    {
      "title": "Fairfax photo archives under threat after US company goes into receivership",
      "description": "Thousands of historic photos are in limbo as Fairfax Media tries to save its valuable archive after the US company that holds them went into receivership."
    },
    {
      "title": "Star performers return to celebrate Dancenorth's 30th anniversary",
      "description": "Queensland's only regional professional dance company, Dancenorth, celebrates 30 years treading the boards with the return of some of its star performers."
    },
    {
      "title": "'Mighty' Wurlitzer organ saved from decay, plays again",
      "description": "One of the most renowned instruments ever brought to Australia is still being heard thanks to the efforts of a group of enthusiasts in Melbourne, who rescued and restored it from rot. "
    },
    {
      "title": "Dame Edna makes rare appearance at Adelaide Cabaret Festival",
      "description": "Dame Edna Everage comes out of retirement and takes to the stage at the Adelaide Cabaret Festival's opening gala night."
    },
    {
      "title": "Luminous Lantern Parade lights up Brisbane for new refugees",
      "description": "A welcome wagon of giant lanterns of all shapes and sizes are rolled out in Brisbane to greet new refugees calling Queensland's ever growing multicultural community home."
    },
    {
      "title": "Oscar-winning director says Church of Scientology should lose tax-free status",
      "description": "The Oscar-winning director of a documentary that exposes brutality and spying within the Church of Scientology says the group should lose its tax-free status. "
    },
    {
      "title": "'Bad feminist' Roxane Gay talks truth and fiction",
      "description": "She's a writer, commentator, academic and rising feminist icon. Outspoken American author Roxane Gay polarises opinion — and she has set the literary world on fire."
    },
    {
      "title": "Miss Piggy 'not surprised' to receive feminist award",
      "description": "Screen and television star, diva and beloved Muppet Miss Piggy is to receive a feminist award in New York."
    },
    {
      "title": "Comedian Barry Humphries helps Tim Storrier open new Brisbane exhibition",
      "description": "Archibald Prize winner Tim Storrier was not the only artist to have works catch collectors' eyes at his new Brisbane exhibition opening this week."
    },
    {
      "title": "Secret history of Perth's Toastface Grillah",
      "description": "Pawn broking, toasted cheese sandwiches, cool office attics and the incredible complexity of maintaining a heritage building."
    },
    {
      "title": "Celebrity chef apologises for photos of kangaroo hunt",
      "description": "Colin Fassnidge says \"it was never his intention to cause any distress\" after posting a series of photographs from a kangaroo hunting trip on social media."
    },
    {
      "title": "Australian journalist Michael Ware still haunted by Iraq war experience",
      "description": "The only war correspondent to survive being kidnapped by Al Qaeda in Iraq opens up about his time there and what he calls \"the dark chamber of my heart\"."
    },
    {
      "title": "Tasmanian rising music star Asta Binnie signs international deal",
      "description": "Young Tasmanian and rising singing star Asta Binnie is set to launch internationally after signing a contract with major label Warner Music."
    },
    {
      "title": "Deaf movie goers hit out at 'appalling' captioning service",
      "description": "Deaf movie lovers say they can rarely go to the cinema because the captioning service in Australia is so poor."
    },
    {
      "title": "Brisbane mum in PJs snaps selfie with Johnny Depp",
      "description": "A \"starstruck\" Brisbane mum dressed in her PJs snaps a selfie with Pirates of the Caribbean star Johnny Depp, dressed as Jack Sparrow, after he singles out her daughter in a small gathering at Raby Bay."
    },
    {
      "title": "Social media reacts to Caitlyn Jenner's debut in Vanity Fair",
      "description": "Social media reacts to Caitlyn Jenner's debut on social media and her photo shoot with Vanity Fair."
    },
    {
      "title": "Enrique Iglesias slices hand on drone during concert",
      "description": "Pop star Enrique Iglesias is treated in Los Angeles after cutting his hand on a drone used during a concert in nearby Tijuana, Mexico."
    },
    {
      "title": "Barunga Festival funding 'smashed' as government grant denied, organiser says",
      "description": "Funding for cultural programs at a major Northern Territory Indigenous cultural festival has been \"smashed\" and some are struggling to survive, organisers say."
    },
    {
      "title": "Hobart composer to distil wild north-west in hour-long opus",
      "description": "The sounds of the north-west region are being turned into music as part of an artist's residency sponsored by the University of Tasmania."
    },
    {
      "title": "Koalas to be listed as vulnerable species across Queensland",
      "description": "Koalas will soon be listed as a \"vulnerable species\" across Queensland in a move that will bring renewed focus to their plight, Premier Annastacia Palaszczuk says."
    },
    {
      "title": "Google to develop clothes with touch-screen technology",
      "description": "Google says it is working with US jean maker Levi Strauss to make clothing from specially woven fabric with touch-screen control capabilities."
    },
    {
      "title": "Wanderlust 108 brings 'world's kindest triathlon' to Brisbane",
      "description": "A different take on the traditional triathlon which replaces a long run, swim and cycle with a short jog, yoga and meditation takes over Brisbane's South Bank."
    },
    {
      "title": "Michael Jackson's Neverland on sale for $131 million",
      "description": "Neverland, the sprawling California ranch that was once the location of \"King of Pop\" Michael Jackson's mind-boggling amusement park, is up for sale for $131 million, real estate agents say."
    },
    {
      "title": "NSW country town hosts world's only festival dedicated to ABBA",
      "description": "The New South Wales country town of Trundle hosts the world's only festival dedicated to Swedish pop group ABBA."
    },
    {
      "title": "Embassies in Canberra to open doors for cultural showcase",
      "description": "The Windows to the World program will make a comeback this year with dozens of embassies and high commissions in Canberra set to throw open their doors to the public to share their cultures."
    },
    {
      "title": "Spelling bee ends in tie after 10-round showdown",
      "description": "The world's biggest spelling bee ends in a tie in the US for a second year in a row, after an intense 10-round showdown between two young contestants who tackled some of the English language's most obscure words."
    },
    {
      "title": "Pop queen Colleen Hewett rides life's highs and lows",
      "description": "70s pop queen, TV star and anti-domestic violence campaigner, Colleen Hewitt says life is about riding its high and lows."
    },
    {
      "title": "NT arts funding freeze 'could result in artistic exodus'",
      "description": "Darwin arts organisations are reeling after being told their funding has been suspended under the new Abbott Government Federal arts grant scheme, with one warning of an exodus of artists and writers from the NT."
    },
    {
      "title": "CareFlight helps actor Dwayne Johnson prepare for disaster movie",
      "description": "Queensland-based rescue helicopter service CareFlight has come to the aid of thousands of people over the years — but no one like Dwayne \"The Rock\" Johnson."
    },
    {
      "title": "U2 tour manager dies in LA hotel",
      "description": "U2's longtime tour manager is found dead in a hotel in Los Angeles, where the Irish rockers are playing a series of concerts."
    },
    {
      "title": "NSW Art Gallery reveals winners of competition for $450 million gallery extension",
      "description": "The Art Gallery of New South Wales reveals the winners of an international design competition to build a $450 million extension dubbed the 'Sydney Modern Project' by 2021."
    },
    {
      "title": "Brumbies players take centre stage at National Simultaneous Storytime",
      "description": "Children in Canberra take part in National Simultaneous Storytime, with help from two multi-talented storytellers from the ACT Brumbies. "
    },
    {
      "title": "American awarded AM for promoting Indigenous art in US",
      "description": "American Dr Margo Smith, who runs the only museum in the US dedicated to Australian Indigenous art, is recognised with an Order of Australia honour."
    },
    {
      "title": "Las Vegas police deny probe into BB King poison claims",
      "description": "Las Vegas police say they are not investigating claims blues legend BB King was poisoned, after coroners said they were investigating but had no evidence so far of foul play."
    },
    {
      "title": "Film legend Omar Sharif has Alzheimer's disease: agent",
      "description": "Egyptian-born film legend Omar Sharif, star of Oscar-winning classics such as Lawrence of Arabia and Doctor Zhivago, is suffering from Alzheimer's disease, his agent confirms."
    },
    {
      "title": "Art 'evokes memories' for dementia sufferers",
      "description": "Dementia sufferers in Bunbury are taken on a tour of their local art gallery in a bid to provide intellectual stimulation and social inclusion."
    },
    {
      "title": "Ed Husic lashes out at SBS over Struggle Street documentary during advertising rules debate",
      "description": "Labor MP Ed Husic says he cannot support changes to SBS's advertising restrictions if increased revenue would be used to produce content such as the controversial documentary Struggle Street, saying the program \"denigrated and demeaned\" his constituents. "
    },
    {
      "title": "Man who threw glass at X Factor judge Redfoo sentenced",
      "description": "A 21-year-old man is given a two-year good behaviour bond for throwing a glass at X Factor judge Redfoo at an eastern Sydney hotel."
    },
    {
      "title": "BB King's death to be treated as homicide after poisoning claim",
      "description": "Las Vegas police have launched a homicide investigation into the death of BB King, a Nevada coroner's office says, after the blues guitar legend's daughters reportedly accused his aides of poisoning him."
    },
    {
      "title": "Depp's dogs only found through social media, officials concede",
      "description": "The Agriculture Department concedes that Johnny Depp's illegally imported dogs were only discovered because of photos on social media."
    },
    {
      "title": "Rare episode of Australia's most 'swinging' 60s music show revived",
      "description": "The only remaining, full episode of 60s music show, The Go! Show is restored and goes on show for festival audience in Melbourne."
    },
    {
      "title": "Where were the freaks? Eurovision 2015 was far too respectable",
      "description": "Guy Sebastian's performance at Eurovision was the opposite of embarrassing, which was good news for Australia but not so good news for a competition which yesterday lost the eccentricity we love it for."
    },
    {
      "title": "Ben Stiller's mother Anne Meara dies aged 85",
      "description": "Actress and comedian Anne Meara, mother of actor Ben Stiller and known for her opposites-attract comedy routine with husband Jerry Stiller, dies aged 85."
    },
    {
      "title": "Sawrey, Heysen artworks draw keen interest at Adelaide auction",
      "description": "Art lovers and investors turn out in force for an Adelaide auction of paintings, including by Hugh Sawrey and Sir Hans Heysen."
    },
    {
      "title": "French immigration thriller Dheepan wins Palme d'Or",
      "description": "A French thriller spotlighting the plight of traumatised refugees building new lives, Dheepan, captures the Palme d'Or top prize at the Cannes Film Festival."
    },
    {
      "title": "Swedish Eurovision hero returns home in triumph",
      "description": "Sweden's Eurovision winner Mans Zelmerlow returns home to a hero's welcome after edging out Russia to win Europe's leading music extravaganza."
    },
    {
      "title": "Melbourne jazz institution Bennetts Lane to close its doors",
      "description": "The Australian jazz landscape is about to lose a landmark, as Melbourne's Bennetts Lane will close its doors in June after more than two decades."
    },
    {
      "title": "Film program helps Indigenous teenagers in Sydney's west find their voice",
      "description": "Disadvantaged and disengaged Aboriginal teenagers in western Sydney are given the chance to express themselves by telling their own stories through filmmaking."
    },
    {
      "title": "Sydney Symphony pilots Chinese mentoring program",
      "description": "Three musicians from Shanghai will travel to Sydney in July for an 11-day performance residency with the Sydney Symphony Orchestra, as the SSO builds on its push into the vast Chinese market."
    },
    {
      "title": "Watch the top five Eurovision performances",
      "description": "Watch the top five performances from Eurovision 2015 in Vienna, including Guy Sebastian, who performed on behalf of Australia as a wildcard entry this year."
    },
    {
      "title": "Sweden's Mans Zelmerlow narrowly beats Russia to win Eurovision 2015",
      "description": "Swedish singer Mans Zelmerlow wins the 60th Eurovision Song Contest, with Guy Sebastian coming in fifth for wildcard entry Australia."
    },
    {
      "title": "Giant puppets made by Australian artists visit Singapore",
      "description": "Giant moving body parts made by Australian puppeteers are performing in Singapore for its birthday celebrations."
    },
    {
      "title": "As it happened: 60th Eurovision Song Contest",
      "description": "Sweden's Mans Zelmerlow wins the 60th Eurovision Song Contest in Vienna, with Australia coming in fifth as a wildcard entry this year. Look back on how the contest unfolded."
    },
    {
      "title": "Get to know the Eurovision 2015 finalists",
      "description": "Find out more about all of this year's finalists in the Eurovision Song Contest."
    },
    {
      "title": "GammaCon 2015 brings together K-pop, cosplay and comic fans",
      "description": "Lovers of comics, K-pop and cosplay gather in Canberra for pop-culture festival GammaCon 2015."
    },
    {
      "title": "US reality TV show pulled after reports star molested girls",
      "description": "US cable network TLC pulls all episodes of its top-rated television reality show 19 Kids and Counting, which features a large Christian family, after reports surface that the eldest son molested underage girls as a teen."
    },
    {
      "title": "Vienna abuzz with Eurovision grand final hype",
      "description": "The running order for the grand final of the Eurovision Song Contest has been revealed and, as the competition ramps up, so does the excitement in Vienna, the ABC's Barbara Miller reports."
    },
    {
      "title": "Restored 'flying boat' takes pride of place at Qantas museum in Longreach",
      "description": "Years of work and countless hours of restoration culminates in the launch of a new vintage plane display at a museum in outback Queensland this weekend."
    },
    {
      "title": "Opera singers, orchestra bring love story to remote Arnhem Land",
      "description": "Some of Australia's finest opera singers gather in Darwin as they prepare to bring the classical art form to the remote town of Nhulunbuy."
    },
    {
      "title": "Finding happiness means knowing where to look",
      "description": "According to author Paul Dolan, happiness is nothing more than the experience of pleasure and purposefulness in one's everyday life. Sounds simple, but we make it much more complicated."
    },
    {
      "title": "Vivid Sydney festival of light, sound and ideas powered by green energy",
      "description": "City's landmarks light up as world's largest festival of light sound and ideas returns."
    },
    {
      "title": "John Marsden says selling millions of books unrelated to true success",
      "description": "Bestselling Australian author and educator John Marsden talks about his life as a pioneering author of teen fiction and founder of alternative school Candlebark. "
    },
    {
      "title": "Quiz: Are you Euro enough for Eurovision?",
      "description": "Australia is competing at Eurovision for the first time. Do you know enough about the contest to justify Australia's inclusion?"
    },
    {
      "title": "Jeremy Clarkson says leaving Top Gear has left 'big hole' in life",
      "description": "Jeremy Clarkson admits being dismissed from Top Gear was entirely his \"own fault\" and leaving the program has left a \"big hole\" in his life."
    },
    {
      "title": "Striking images of Rama go on show at National Gallery",
      "description": "A total of 101 striking miniature paintings from India go on display at the National Gallery of Australia in Canberra to help heighten cultural understanding. "
    },
    {
      "title": "Controversial moments from The Late Show",
      "description": "Veteran American talk show host David Letterman has ended his late-night television career, taping his final episode of The Late Show after 33 years. "
    },
    {
      "title": "Letterman signs off with star-studded final Late Show",
      "description": "David Letterman signs off the Late Show for the last time with a huge bill of Hollywood's brightest stars including Steve Martin, Tina Fey, Chris Rock, Jerry Seinfeld and a host of US presidents."
    },
    {
      "title": "Is bin Laden's book list a literary assassination?",
      "description": "The US has released a list of books purportedly owned by Osama bin Laden. But in a world where the reading habits of political figures can mean so much, does this list belong in the fact or fiction section?"
    },
    {
      "title": "Model sues Bill Cosby for defamation over rape claim",
      "description": "US model Janice Dickinson sues Bill Cosby for defamation, saying the comedian falsely called her a liar after she publicly claimed that he sexually assaulted her 35 years ago."
    },
    {
      "title": "Hitler's lost Walking Horses found in Germany",
      "description": "Two life-sized bronze horse sculptures once owned by Adolf Hitler have been found by German police after being missing since 1989."
    },
    {
      "title": "Prayer book worth $15.5m goes on show at National Library",
      "description": "One of the world's most expensive manuscripts, the Rothschild Prayer Book, goes on display at the National Library in Canberra."
    },
    {
      "title": "Cannes Film Festival apologises over high heel furore",
      "description": "The director of the Cannes Film Festival apologises after some women are controversially refused access to the red carpet for not wearing high-heels and denies the existence of a strict no-flats rule."
    },
    {
      "title": "10 controversial moments in Eurovision history",
      "description": "Having played host to contestants donning anything from bulletproof vests to lady-beards, Eurovision has had its fair share of controversy over its 60-year history. Take a look back at some of the international song contest's most memorable moments."
    },
    {
      "title": "Sydney University Dramatic Society celebrates 125th anniversary",
      "description": "The Sydney University Dramatic Society (SUDS) has spawned some of Australia's leading actors, directors, playwrights and even the odd prime minister."
    },
    {
      "title": "Game of Thrones reduces rape to entertainment",
      "description": "Thirty-eight Australian women have been killed this year in violent acts. And on Monday nights we tune in to Game of Thrones to witness rape as entertainment.The issue isn't that we should shy from the difficult or confronting problems in society.But that it's a quietly disturbing thing to have such ugly human extremity reduced to a deftly filmed narrative device. Just another plot point."
    },
    {
      "title": "Eurovision and Twitter is a match made in entertainment heaven",
      "description": "If you were to go into your Twitter factory and build the perfect event for live-tweeting, you would come up with Eurovision. It has everything you need."
    },
    {
      "title": "Liberal MP opposes TAB sale in WA, raises consultation concerns",
      "description": "The West Australian Government's push to privatise the TAB comes under fire from a Liberal MP concerned that no proper discussions with the racing community have taken place."
    },
    {
      "title": "'Authentic' Shakespeare portrait discovered in botany handbook",
      "description": "A British magazine publishes an image it says is the first and only known demonstrably authentic portrait of William Shakespeare made in his lifetime."
    },
    {
      "title": "Eurovision 2015: Eight things you need to know",
      "description": "As Guy Sebastian prepares to represent Australia, our resident expert Andrew Bell sheds some light on the 60-year-old event."
    },
    {
      "title": "Dark Mofo artist suggests high school students use drugs to expand creativity",
      "description": "An artist appearing at Hobart's Dark Mofo festival next month suggests high schools should give drugs to students to fuel their creativity."
    },
    {
      "title": "Darwin kids win film award for animation project",
      "description": "Playing with plasticine all day just became even more of a legitimate career choice for a group of Northern Territory children."
    },
    {
      "title": "Tasmanian artist's work bound for Louvre",
      "description": "A Tasmanian artist is selected to have one of her artworks displayed in the Louvre in France in an international photography competition."
    },
    {
      "title": "Canberra author wins $40,000 literary fiction award",
      "description": "Canberra author Mark Henshaw wins this year's New South Wales Premier's Literary Award for fiction with his psychological thriller The Snow Kimono. "
    },
    {
      "title": "The Mad Max monstrosity still pleases the hordes",
      "description": "The monstrosity that is Mad Max exploits every pop culture fad around and is just a glorified monster truck rally, but it achieves something few Aussie films do: it gives people precisely what they want."
    },
    {
      "title": "French paintings of Aboriginal life before colonisation to tour Australia",
      "description": "A collection of 19th century French illustrations depicting Indigenous life in Tasmania before British colonisation will go on show in the state for the first time next year."
    },
    {
      "title": "WA greyhound trainer pleads guilty to misconduct after live baiting probe",
      "description": "A prominent WA greyhound trainer has pleaded guilty to charges of misconduct and failing to provide evidence at a Racing and Wagering inquiry."
    },
    {
      "title": "Tasmanian Symphony Orchestra reaps benefits of box office surge",
      "description": "A jump in subscriptions and more paying customers boost the bottom line for the Tasmanian Symphony Orchestra."
    },
    {
      "title": "100th anniversary of the military death that shocked Australia",
      "description": "Major General William Throsby Bridges is the only identified Australian soldier to have died in combat in World War I and have his body to returned home. This week marks 100 years since his death at Gallipoli."
    },
    {
      "title": "Crack croc team reunites nine years after Irwin death",
      "description": "For the first time since Steve Irwin's death nearly a decade ago, some of the original members of his crack croc team break their silence to talk about their boss."
    },
    {
      "title": "Dog world record smashed at Million Paws Walk in Canberra",
      "description": "A world record for the number of dogs wearing bandanas in one location has been broken in Canberra, with 764 dogs turning up to be counted at the Million Paws Walk."
    },
    {
      "title": "Mayor makes bid to bring Hollywood to outback Queensland",
      "description": "A tiny outback Queensland town is as far away as you can get from Hollywood, but its mayor hopes to put the region on the map as a movie-making destination."
    },
    {
      "title": "Girl band with disabilities in Adelaide to 'challenge' perceptions",
      "description": "Australia's first pop girl group with disabilities has released their debut album in Adelaide in an effort they say will change perceptions of what disabled people are capable of."
    },
    {
      "title": "Elvis Presley still 'king of the auction'",
      "description": "A custom-designed tour bus bought in the 1970s by Elvis Presley sells at auction in New York for more than $300,000."
    },
    {
      "title": "Barnaby Joyce and Johnny Depp in YouTube political mash-up",
      "description": "Agriculture Minister Barnaby Joyce has become the latest figure to feature on political satirist Huw Parkinson's YouTube channel, following the media frenzy caused by Johnny Depp's dogs, Pistol and Boo, breaching Australia's quarantine laws."
    },
    {
      "title": "Artists fight to raise $1 million to restore historic home",
      "description": "The Victorian Arts Society is trying to raise $1 million to restore its 19th-century-era home which has been severely damaged by water and requires urgent repairs."
    },
    {
      "title": "David Lynch returns to direct Twin Peaks revival after pay dispute",
      "description": "David Lynch confirms he will return to direct a revival season of 1990s cult series Twin Peaks, after having left the project in April over a funding dispute with the Showtime network."
    },
    {
      "title": "Veterans set down chronicles of war for future generations",
      "description": "The secret diary of a WWII Australian prisoner of war is set to be published, with other veterans urged to preserve their stories for future generations."
    },
    {
      "title": "'Child prodigy' reflects on touring with BB King as a 14-year-old",
      "description": "Nathan Cavaleri was just 14 years old when he got the chance to tour and play guitar with the late  blues legend BB King."
    },
    {
      "title": "Dogs gone: Johnny Depp's pooches leave Australia for flight home",
      "description": "Johnny Depp's dogs leave Queensland's Gold Coast on a flight back to the United States after breaching Australia's strict quarantine rules."
    },
    {
      "title": "Struggle Street's bong-smoking Billie Jo behind bars",
      "description": "Struggle Street's bong-smoking pregnant 21-year-old Billie Jo Wilkie is charged and refused bail after being caught twice driving while disqualified in Sydney's west."
    },
    {
      "title": "Legendary blues guitarist BB King dies aged 89",
      "description": "The man who took the blues from rural juke joints to the mainstream and influenced a generation of rock guitarists from Eric Clapton to Stevie Ray Vaughan, dies in his sleep in Las Vegas."
    },
    {
      "title": "50 people filmed exiting six-seater van in China",
      "description": "Chinese police film the moment they discover 50 workers crammed into a six-seater van in China's southern Guiyang city, state media reported."
    },
    {
      "title": "Curse of the Pirates of the Caribbean franchise strikes again",
      "description": "Sea sickness, it seems, is the least of the ills to have plagued the cast and crew of Pirates of the Caribbean movies over the past decade."
    },
    {
      "title": "Cannes slips into high gear with Mad Max screening",
      "description": "The Cannes Film Festival slips into high gear by screening the new Mad Max blockbuster and starting the competition for its Palme d'Or."
    },
    {
      "title": "The woman behind the double mastectomy breast tattoos",
      "description": "A Darwin woman whose post-breast cancer double mastectomy tattoos were widely shared on social media says the attention was \"a bit of a shock and quite intimidating\" but mostly \"wonderful\"."
    },
    {
      "title": "Artworks from French voyage to Australia in 1800s to go on show",
      "description": "Hundreds of artworks made by French artists on a scientific voyage to Australia in the 19th Century will be shown in Australian museums next year."
    },
    {
      "title": "Doggone it, Depp! Time to obey some local customs",
      "description": "When you're an uber-celebrity like Johnny Depp a door is always open, a smoother ride on offer - and next thing you know, you've stuffed your dogs in a carry bag and can't imagine what all the fuss is about."
    },
    {
      "title": "Media camp outside Depp's mansion in wait for news on death-row dogs",
      "description": "Queensland media dodge water sprinklers and flag down food vans as the wait for Johnny Depp and his two dogs drags out on the Gold Coast."
    },
    {
      "title": "Time to give Johnny Depp's pooches a grilling from Dr Harry",
      "description": "Frankly, with the global attention this story is getting, there's only one vet Australia can trust to take on the delicate task of giving Johnny Depp's smuggled terriers the all-clear."
    },
    {
      "title": "Depp's dogs set to board private jet back to US",
      "description": "Johnny Depp is set to take his dogs Pistol and Boo out of Australia tonight as Barnaby Joyce clashes with Kyle Sandilands over the quarantine wrangle."
    },
    {
      "title": "Will economics replace edgy in arts funding?",
      "description": "There's a real fear the arts funding shake-up will favour the so-called \"heritage\" arts that George Brandis clearly loves and push out edgy alternative works. But is this fear premature?"
    },
    {
      "title": "Fashfest designers determined to change Canberra's 'boring' stereotype",
      "description": "Canberra's fashion designers are determined to change the stereotype that the national capital has little more to offer the country than federal politics."
    },
    {
      "title": "Okely dokeley: Voice of Ned Flanders, Mr Burns quits The Simpsons",
      "description": "Harry Shearer, the Emmy-winning actor who voices Ned Flanders and Mr Burns in The Simpsons, says he is leaving the long-running series but the show's manager hopes to change his mind."
    },
    {
      "title": "Depp's pooches could be dogs with no country if hounded from Australia",
      "description": "Agriculture Minister Barnaby Joyce fears star actor Johnny Depp might not be able to get his two pet dogs back into the United States, meaning the animals could be put down."
    },
    {
      "title": "Changes to arts funding disastrous, says former chair of Australia Council",
      "description": "Former chair of the Australia Council Rodney Hall says changes to arts funding revealed in the federal budget are \"disastrous\"."
    },
    {
      "title": "Education is the key to turning Struggle Street around",
      "description": "SBS documentary Struggle Street provided a strong reminder of just how essential a good public school system is. Life for William, Bob and Billy Jo may have been very different had they been better educated."
    },
    {
      "title": "Open Drum: dogs prescribed to sit, stay and heal",
      "description": "The doctor tore the page from the prescription pad and handed it to me. \"Get a dog,\" it read. Who knew that a furry friend could help me so much?"
    },
    {
      "title": "Johnny Depp's dogs could be put down as Barnaby Joyce issues ultimatum",
      "description": "Agriculture Minister Barnaby Joyce says Johnny Depp's dogs Pistol and Boo should \"bugger off back to the United States\" or be euthanased, after the Hollywood star brought them into the country without permission."
    },
    {
      "title": "Budget 2015: George Brandis' extraordinary raid of the Australia Council",
      "description": "With a tiger's pounce that blindsided everyone, George Brandis has moved ruthlessly to carve out his own arts fiefdom. But in doing so, he has taken on an industry with a loud voice."
    },
    {
      "title": "Edinburgh Military Tattoo coming to Melbourne",
      "description": "The world-renowned Royal Edinburgh Military Tattoo is heading to Melbourne for the first time in the show's 65-year history with more than 1,000 performers with pipes, drums and a replica Scottish castle."
    },
    {
      "title": "Palaszczuk brings back public funding for Literary Awards",
      "description": "The Queensland Government will reinstate public funding for the state's Literary Awards after it was scrapped by Campbell Newman in 2012."
    },
    {
      "title": "Mad Max convoy hits Sydney ahead of film premiere, closes Cahill Expressway",
      "description": "The motley cars and characters of Mad Max menaced central Sydney this morning, taking over one of the city's main freeways."
    },
    {
      "title": "Brown Skin Baby songwriter and Stolen Generations advocate dies",
      "description": "The writer of a song that became an anthem for the Stolen Generations dies in a remote community near Uluru."
    },
    {
      "title": "Arts funding shake-up introduces $100m national program",
      "description": "Arts funding is set for a shake-up with the Government announcing a $104.8 million National Programme for Excellence in the Arts to rival the Australia Council."
    },
    {
      "title": "Picasso painting sells for $US160m, smashes auction records",
      "description": "A Picasso masterpiece sells for $US160 million in New York, smashing the world record for most expensive art sold at auction."
    },
    {
      "title": "Celebrated bird illustrator William Cooper dies at home in Queensland",
      "description": "Renowned wildlife illustrator William T. Cooper, once described as the best ornithological illustrator alive by Sir David Attenborough, dies at his home in far north Queensland."
    },
    {
      "title": "Environmental Defenders Office auctions art to stay open",
      "description": "Aboriginal artists donate works of art to the Northern Territory's Environmental Defenders Office in a final bid to keep it open."
    },
    {
      "title": "Former abusive husband calls on men to 'take responsibility'",
      "description": "Jerry Retford used to abuse his wife but a Relationships Australia course helped him turn his life around. Now he is a vocal domestic violence activist hoping to help other men \"take responsibility\" for their actions."
    },
    {
      "title": "Teenage refugees take to the stage to share stories of their ordeal",
      "description": "Young refugees in Sydney are sharing their stories through theatre to help ease the trauma of their struggle and educate the community."
    },
    {
      "title": "Digitised Indigenous photos reveal family histories",
      "description": "Aboriginal families across Western Australia are getting a fresh glimpse of their family histories by viewing thousands of previously inaccessible images in the State Library."
    },
    {
      "title": "Mao's last dancer Li Cunxin says honesty, dignity and integrity vital",
      "description": "Artistic director of Queensland Ballet, Li Cunxin, tells One Plus One how his journey from a life of poverty to success as \"Mao's Last Dancer\" taught him that life's most valuable lessons come from mistakes."
    },
    {
      "title": "Senior WA greyhound vet steps aside after investigation",
      "description": "A senior trackside greyhound vet with over 30 years experience could lose his licence after an investigation by the Veterinary Surgeons Board."
    },
    {
      "title": "Italian immigrant builds replica Trevi Fountain in Darwin",
      "description": "An Italian immigrant to Darwin builds a replica Trevi Fountain that he hopes will bring romance to those attending the city's annual Italian festival and some money for charity."
    },
    {
      "title": "Men don high heels in Adelaide march against domestic violence",
      "description": "About 100 men and women don high heels in Adelaide in a one-mile march to raise awareness of domestic violence against women."
    },
    {
      "title": "VE Day commemorations to mark 70 years since World War II end",
      "description": "The Australian War Memorial in Canberra is today marking 70 years since the first Victory in Europe Day with a symposium bringing together prominent military historians."
    },
    {
      "title": "Israeli clowns help ease Nepal quake trauma",
      "description": "Israeli \"medical clowns\" are trying to help ease the trauma of children caught up in Nepal's devastating earthquake."
    },
    {
      "title": "Dallas Buyers Club ruling to have 'chilling effect': copyright lawyers",
      "description": "Copyright lawyers warn that the latest ruling in the Dallas Buyers Club judgement could have a \"chilling effect\" on future cases, saying ISPs may be reluctant to fight similar cases in the future."
    },
    {
      "title": "Struggle Street: Western Sydney has many more stories of hardship like this",
      "description": "I've been a resident of Western Sydney almost all my life. I can categorically state that there are many more people dealing with even greater levels of chaos and hardship than shown on this SBS documentary."
    },
    {
      "title": "School students joke to raise funds for rural families suffering in drought",
      "description": "Children at a small school in the Wide Bay region of Queensland are using jokes to raise funds for drought-affected rural families."
    },
    {
      "title": "Neil Armfield, Rachel Healy announced as first Adelaide Festival co-directors",
      "description": "Neil Armfield and Rachel Healy will be the first artistic co-directors of the Adelaide Festival in the event's 55-year history."
    },
    {
      "title": "Happy 100th birthday to a film legend",
      "description": "Orson Welles may never have won an Oscar for best director, but it's fair to say many filmmakers have won them by following his example and innovations. A hundred years after his birth his influence is still being felt."
    },
    {
      "title": "Organisers welcome thousands to first day of Tasmania's three-day AgFest",
      "description": "Organisers of Tasmania's annual AgFest delighted to see more than 14,000 people attended the first day of the event including an unexpected visit from the Prime Minister."
    },
    {
      "title": "Hot Chocolate lead singer Errol Brown dies, aged 71",
      "description": "Errol Brown, whose funky numbers with British soul band Hot Chocolate — such as You Sexy Thing — became sensations in the disco era, dies of liver cancer at 71."
    },
    {
      "title": "Bollywood superstar jailed over hit-and-run case",
      "description": "Bollywood star Salman Khan is sentenced to five years' jail for killing a homeless man in a 2002 hit-and-run incident."
    },
    {
      "title": "Festival of Voices reveals sweet line-up to echo across Tasmania",
      "description": "This year's Festival of Voices features Grammy award winning group Sweet Honey in the Rock and will reach Launceston for the first time."
    },
    {
      "title": "Brisbane unveils Cirque du Soleil-inspired street art project",
      "description": "Lord Mayor Graham Quirk unveils Brisbane's newest street art project along Coronation Drive in a world first collaboration with Cirque du Soleil."
    },
    {
      "title": "Charlie Hebdo honoured for its 'dauntlessness' at NY gala",
      "description": "French satirical weekly Charlie Hebdo, which was targeted in a deadly attack in January by Islamist gunmen, is honoured at a New York gala under heavy security."
    },
    {
      "title": "Garbage truck protest against SBS 'publicly-funded poverty porn' Struggle Street",
      "description": "A blockade of garbage trucks that descended on SBS headquarters fails to convince the broadcaster to pull a documentary series a western Sydney mayor has labelled as \"publicly-funded poverty porn\"."
    },
    {
      "title": "Struggle Street: what's tacky is telling Western Sydneysiders how helpless they are",
      "description": "Drug users and unemployed people have as much a right as anyone to sign up to be exploited by reality TV shows. But there are other legitimate questions about the ethical procedures of this new SBS documentary series."
    },
    {
      "title": "The Simpsons renewed for two more seasons",
      "description": "US television network Fox renews the long-running animated series The Simpsons for two more seasons, taking it to 28 seasons and 625 episodes."
    },
    {
      "title": "World-first medical student orchestra funds Aboriginal scholarship",
      "description": "A world-first medical school orchestra in Adelaide will use proceeds from a concert to fund a scholarship for a young Aboriginal woman."
    },
    {
      "title": "Blacktown Mayor slams SBS over 'poverty porn' Struggle Street",
      "description": "The mayor of a town at the centre of a controversial SBS reality series calls the program a waste of taxpayers' money and accuses the broadcaster of misrepresenting members of the community."
    },
    {
      "title": "National Library finds Australia's first pound note, thought to be lost for nearly 80 years",
      "description": "The National Library finds Australia's first pound note, thought to be lost to history for nearly 80 years, in its very own archives. "
    },
    {
      "title": "Saltie 'menacing' popular fishing hole caught",
      "description": "Wildlife officers capture a 3.7-metre saltwater crocodile that was menacing tourists in Western Australia's Kimberley."
    },
    {
      "title": "Iran bans 'devil-worshipping' haircuts",
      "description": "Hairstyles of a spiky and unorthodox nature are reportedly being banned in Iran because they are \"devil worshipping\", while tattoos and other male bodily adornments are also being outlawed."
    }
  ]
}
