{
  "articles": [
    {
      "title": "US same-sex marriage ruling could influence Australian debate: MPs",
      "description": "Federal politicians say the United States Supreme Court ruling that same-sex couples have a fundamental right to marry could influence the debate in Australia."
    },
    {
      "title": "UK must prepare for many citizens killed in Tunisia, David Cameron says",
      "description": "UK prime minister David Cameron warns the country to prepare for the fact that \"many\" of those killed in the attack on a Tunisian beach resort were British."
    },
    {
      "title": "Surfer injured in massive wave off WA's Margaret River coast",
      "description": "A surfer is injured while being towed into massive waves off the Margaret River coast in Western Australia's south-west."
    },
    {
      "title": "Matildas head into Japan clash in top condition and confident despite underdog status",
      "description": "Matildas coach Alen Stajcic says his side's poor recent record against quarter-finals opponent Japan will count for little on Sunday."
    },
    {
      "title": "Liberal Party base supports motion to eliminate race references in constitution",
      "description": "The Liberal Party base sends Prime Minister Tony Abbott a strong message on race issues which could have significant implications for his push to recognise Aboriginal people in the constitution."
    },
    {
      "title": "Police search for person involved in deaths of three in rural NSW",
      "description": "Police confirm they are looking for a person believed to be involved in the suspicious deaths of three people on a rural property in central New South Wales."
    },
    {
      "title": "Waratahs' Super Rugby defence over in semi-final loss to Highlanders",
      "description": "The Waratahs' Super Rugby title defence ends at the semi-final stage after losing 35-17 to the Highlanders."
    },
    {
      "title": "Mitchell regrets making injection gesture mocking Essendon over ASADA troubles",
      "description": "Hawthorn midfielder Sam Mitchell says his mock injection gesture aimed at Essendon players will not be repeated on an AFL field."
    },
    {
      "title": "Queensland CSG jobs being shed as construction boom ends abruptly",
      "description": "The mayor rural Queensland's Western Downs region says the coal seam gas construction boom has ended quicker than expected."
    },
    {
      "title": "Coronation of Tonga's King Tupou VI begins with ancient kava ceremony",
      "description": "Tonga begins 11 days of celebrations to mark the coronation of monarch King Tupou VI with an ancient kava ceremony and gifts of pigs and yams from the country's chiefs."
    },
    {
      "title": "'Flying' paint tin which ruined Maserati interior among oddest SA insurance claims",
      "description": "A tin of paint that \"liberally splashed\" a Maserati interior after the driver swerved to avoid a dog has led to an expensive insurance claim in South Australia."
    }
  ]
}
