{
  "category": "tennis",
  "article": "Milos Raonic ( / ˈ m iː l oʊ ʃ ˈ r aʊ n ɪ tʃ / MEE -lohsh ROW -nich ;   Serbian : Miloš Raonić, Милош Раонић, [mîloʃ râonitɕ] ; born December 27, 1990) is a Canadian professional tennis player of Montenegrin origin who grew up in Thornhill, Ontario .   , Born in Titograd , SFR Yugoslavia (now Podgorica , Montenegro ), Raonic moved to Canada with his family at the age of three,  learning the game at the Bramalea Tennis Club in Brampton .  He qualified for his first Grand Slam event at the 2010 U.S. Open . In 2011 he rose from World No. 102 to No. 37 in a month, after he reached the fourth round of the Australian Open and won his first ATP title at the 2011 SAP Open . Raonic, who prefers to play on hard courts ,  plays an all-court game. From late 2010 until May 2013, he was coached by former Spanish pro player Galo Blanco in Barcelona . Raonic is coached by Ivan Ljubičić . , Statistically, his serve is one of the strongest on the tour. In 2012, he served more aces per match and won a higher percentage of service games than any other player. Novak Djokovic has commented that Raonic \"has one of the best serves in the world. Very powerful, very precise.\"  , , , Raonic's first ITF -sanctioned junior tennis event was the qualifying draw for the Canadian ITF Group 4 Championships in October 2003, where he lost in the first round to fellow Canadian Kirill Sinitsyn, 6–7, 3–6. His next junior circuit action was a year later at the Canadian ITF Championships 1 event, where he lost in the first round of the main draw 4–6, 4–6 to compatriot Peter Marrack. In doubles at the same event he and partner Sheharyar Wali, also Canadian, reached the second round. , He won his first ITF tournament singles match in October 2005, defeating compatriot Tony Dang in three sets before falling in the round of 16 to American Christopher Racz. In doubles, he and compatriot Mohammed Niaki reached the semi-finals. Two weeks later, at the Canadian ITF Grade 3 Championships, Raonic reached his first final, where he and partner Sinitsyn lost to Marrack and Peter Polansky . In singles, he lost again to Marrack in the first round. , In April 2006, Raonic reached the later rounds in a singles event, defeating Marrack in straight sets in the quarter-finals at the 24th All-Canadian ITF Junior Championships before losing to Julien Gauthier in the semis. After reaching the second round in singles of the Canadian Junior Open (Grade 1) in August, he then won the 2006 U18 ITF World Ranking Event (Grade 4) in early October, defeating Gauthier in the final 6–4, 6–0. He also captured the doubles title partnering compatriot John Taylor. , Raonic reached the third round in singles at a Grade 1 junior event in November–December 2006, the Eddie Herr International Junior Tennis Championships. Two weeks later he lost the singles final of the Grade 4 Prince Cup and won the doubles. In 2007 he lost early in the Grade 2 and Grade 1 junior events he entered. Raonic did however reach the finals of the Grade 3 US Junior International Hard Court Championships in August and won both the Grade 3 2007 U18 ITF World Ranking Event and Grade 4 U18 ITF World Ranking Event 2 in October on home soil. He also won the doubles at these events, partnering compatriot Nathaniel Gery for both. In doubles, he also lost in the final of the Pan American Closed ITF Championships (Group B1) in early October, partnering American Waylon Chin. , In December 2007, Raonic qualified for the prestigious Orange Bowl Tennis Championships , a Grade A event. He went on to reach the third round where he lost to American Chase Buchanan 4–6 in the third. Raonic began 2008 with a bang in juniors, winning the Grade 1 Nottinghill ITF event doubles event, partnering American Bradley Klahn . He and Klahn the following week reached the second round of the Australian Open before winning the Grade 1 USTA International Spring Championships in March–April. At the USTA International Spring, Raonic reached the quarter-finals for the first time in singles at a Grade 1 event, losing to Klahn in straight sets. , Junior Grand Slam results - Singles: , Junior Grand Slam results - Doubles: , Raonic was given wild cards into three Tennis Canada and Banque Nationale sponsored ITF Futures events in March, held indoors in the Province of Quebec . At Gatineau he won his first ever singles match played, over World No. 687 Fabrice Martin 7–5, 2–6, 6–4. He lost in the next round to World No. 661 Patrick Schmolzer 3–6, 3–6. The following week he lost in the first round to No. 2 seed John Paul Frattero 6–7, 3–6. In doubles, at both events, Raonic partnered fellow junior Vasek Pospisil and lost in the first round. Then in Rock Forest he again reached the second round, going out to No. 1 seed, Davis Cup teammate, hometown favourite and future coach Fred Niemeyer . He and Niemeyer played doubles in Sherbrooke too and reached the semi-finals. , Raonic was again a wild card entrant in singles in the Banque Nationale Futures events in Quebec in March, faring far better this time. At Canada F1 in Gatineau , he and partner Milan Pokrajac, unseeded, won the doubles title, while in singles he lost to World No. 457 Michael Yani in the quarter-finals in three sets. The following week in Montreal Raonic and Pokrajac finished doubles runners-up and in singles Raonic went out in the second round. Then in Canada F3 in Sherbrooke , Raonic reached his first tour finals in singles, winning four three-set matches to do so. In the final he lost 5–7, 6–7 to unseeded Italian Enrico Iannuzzi . In doubles, he and Pokrajac lost in the first round. , In late April, Raonic next competed in an ITF tour event, defeating compatriot Kirill Sinitsyn 6–2, 6–0 to qualify (as the No. 5 seed) for the main draw in singles at U.S.A. F9 in Vero Beach on outdoor clay. In the main draw he lost however in the first round to fellow qualifier American Marcus Fugate 1–6, 4–6. Raonic was a direct entrant into the main doubles draw, but he and partner Adam El Mihdawy lost in the first round. The following week at U.S.A. F10 in Orange Park, Florida , Raonic lost in the third round of singles qualifying despite being the No. 3 seed. He did not compete in any tour events next until July. , In July, Raonic, as a wild-card entrant, lost in the first round in singles of back-to-back Canadian held Challenger events, Granby and Moncton. In doubles he and partner Vasek Pospisil reached the second round at Granby but lost in the first in Moncton. The following week he received a wild card in qualifying for the 2008 Rogers Cup and lost in the first round to World No. 203 Alexander Kudryavtsev 3–6, 4–6. , The next tour action Raonic saw was in October in Japan. In Kashiwa at Japan F10 he lost in the first round to fellow unseeded player Hiroki Kondo 4–6, 2–6. In doubles he and partner Tadayuki Longhi reached the second round. The following week at Japan F11 in Tokyo, Raonic upset No. 2 seed Tatsuma Ito in three sets before falling to Thailand Davis Cupper Peerakiat Siriluethaiwattana in the second round. He did not play doubles. , Raonic competed his 2008 tour play as a wild card entrant in the Rimouski Challenger , where he lost in the first round to José de Armas after taking the first set. In doubles however, he and partner Vasek Pospisil teamed to capture their first Challenger title. The wild cards defeated the No. 2 seeds in the semis and the No. 3 seeded team of Kristian Pless and Michael Ryderstedt in the final 5–7, 6–4, 10–6. Raonic finished 2008 World No. 915 in singles and No. 513 in doubles. Following the 2008 season Raonic turned down an offer from the University of Virginia and turned pro signing on with the SFX agency.  , Raonic began his year in mid-January attempting to qualify in singles for U.S.A. F1 in Boca Raton, Florida , losing in three sets in the qualifying round as the No. 13 seed. He qualified the following week for the main draw at U.S.A. F2 as the No. 12 seed, but lost in the first round of the main draw. Qualifying for singles allowed him to enter the doubles draw as a wild card—he and partner Kevin Botti reached the second round. , The next week at U.S.A. F3 in Plantation, Florida , Raonic again lost in singles in the qualifying round, this time as the No. 9 seed. After a week off, he qualified for Croatia F1, as the No. 11 seed. He then knocked off World No. 293 and No. 7 seed Jan Mertl , World No. 425 Ivaylo Traykov , and No. 606 Denis Matsukevich before falling to No. 8 seed Louk Sorensen in the semi-finals. In doubles he and compatriot Erik Chvojka, the No. 3 seeds, reached the second round. The following week the Canadian doubles duo reached the finals of Croatia F2; in singles, Roanic again qualified for the main draw and then reached the quarter-finals. , After a couple weeks off, Raonic captured his first tour singles title, Canada F2 in Montreal.  Receiving a wild card from Tennis Canada to play in the main draw, Raonic faced no seeded players and two qualifiers—he defeated World No. 594 Gregoire Burquier in the final 6–3, 6–4. In doubles, he and Vasek Pospisil, the top seeds, reached the second round. The team then did one better the following week at Canada F3 in Sherbrooke , Quebec, reaching the semi-finals, again as the top seeds. In singles, Raonic lost to Pospisil in the quarter-finals in three close sets. , Two weeks later Raonic again qualified for the main draw at a Futures event, this time as the No. 4 seed at U.S.A. F7, and reached the quarter-finals. He and partner Philip Bester , as the No. 3 seeds, captured the doubles title, defeating the No. 1 seeds in the final, Lester Cook and Treat Conrad Huey . The following week in Little Rock, Arkansas , Raonic qualified for the main draw as the No. 2 seed, but lost in the first round. He did not play doubles. , Raonic's next action was in June at Slovenia F2. For the first time he received a spot in the main draw of a singles tournament based solely on this ranking. He lost however in the first round, to No. 1 seed Pavol Červenák 4–6, 2–6. In doubles, he and partner Aljaz Bedene lost in the second round. The following week at Slovenia F3 Raonic again lost in the first round, this time to No. 3 seed Denis Molchanov . He and Molchanov teamed to win the doubles title however, the fourth tour doubles title of Raonic's career. The next week, Raonic reached the quarter-finals of Italy F15, on clay in Padova , while in doubles he and partner Marc Fornell-Mestrs reached the second round. He completed his European swing losing in the first round of Italy F16 in singles while reaching the semis in doubles, partnering with Stefano Valenti. , After two weeks off, Raonic resumed play at U.S.A. F16 in Pittsburgh , on clay. The No. 7 seed, he was upset in the second round by Rhyne Williams . In doubles he and partner Pospisil, the top seeds, lost in the semi-finals. The following week in Peoria, Illinois , the No. 6 seed Raonic reached the quarter-finals where he was upset by the unseeded Pospisil. He and Vasek captured the doubles title however, winning their final three matches handily. After a week off, Raonic once again received a wild card into the main draw of the Granby Challenger . He played World No. 262 to a first-set tie-break loss before succumbing in the second set 1–6. In doubles, he and Pospisil lost in a second-round tie-break to the No. 2 seeds Colin Fleming and Ken Skupski . , The following week Raonic was given a wild card into singles qualifying for the 2009 Rogers Cup , where he began by beating World No. 77 Teymuraz Gabashvili in three sets following up with a straight sets win over World No. 113 Michaël Llodra in the qualifying round.  In the main draw, he lost to World No. 10 Fernando González in three sets. Raonic finished the match having served and returned better on first serves than his opponent, and having won more points in the match, 112 to 107.  In the week following this result, he lost to Kittipong Wachiramanowong in three sets in the final of Thailand F1 and, with partner Nikolaus Moser , won the doubles title. Then playing just singles in the next two weeks, he won the title for Thailand F2 and reached the semis of Thailand F3 (l/ Jamie Baker ). , Raonic spent the autumn of 2009 playing on the American Challenger circuit, but with less success than he had in summer. He finished 2009 ranked World No. 373 in singles and No. 425 in doubles. , Raonic started the 2010 season with new coach, former teammate Frédéric Niemeyer .  Raonic reached the semi-finals of three of his first five ITF Futures events in doubles, Great Britain F1, F2, partnering with Uladzimir Ignatik , and France F2 playing with Romain Jouan. He also won his doubles Davis Cup tie playing against Colombia with World No. 1 Daniel Nestor .  He lost, however, both of his singles rubbers in Bogotá. , In mid-April Raonic captured the Korea F2 singles title as the top seed, defeating No. 3 Hiroki Kondo in the final 6–1, 6–1. He did so without losing a set and by winning his first match without conceding a game, over World No. 668 Min-Hyoek Cho. In May he captured his second title in three weeks, dropping just one set in taking Korea F4. The following week he lost to No. 8 seed Tatsuma Ito in the first round of the 2010 Busan Open Challenger Tennis tournament. Despite the loss he saw his singles ranking reach a career high for the second time in two weeks, at World No. 303. Raonic reached a new career high singles ranking in late June, rising to World No. 276. , In July Raonic reached the singles finals of the 2010 Challenger Banque Nationale de Granby before falling to No. 1 seed Tobias Kamke 3–6, 6–7. This result saw Raonic's ranking go to yet another new career best World No. 209. The following week Raonic received a special exemption to appear in the main draw of the 2010 Odlum Brown Vancouver Open where he has lost to No. 7 seed Robert Kendrick in the first round 6–7, 4–6. Granted a wild card into the singles main draw of the 2010 Rogers Cup , Raonic lost in the first round to Victor Hănescu 4–6, 4–6. In doubles he and partner Vasek Pospisil had the privilege of playing against Rafael Nadal and Novak Djokovic , and winning 10–8 in the tie-break. It was first time that the World Nos. 1 and 2 had played together in a tour doubles match since Jimmy Connors and Arthur Ashe did so in 1976. Raonic and Pospisil lost in the second round, however. , Raonic qualified for the U.S. Open but lost his main draw first round match to Australia No. 3 and wild card entrant Carsten Ball . Two weekends later in the Davis cup, versus the Dominican Republic , Raonic won his singles match 9–7 in the fifth set over Víctor Estrella , as Canada won the tie 5–0 to stay in the Americas Zone Group 1 for 2011. , After a week off, Raonic qualified for the 2010 Proton Malaysian Open . He reached quarterfinals before losing to Igor Andreev . One week later, Raonic qualified for the 2010 Rakuten Japan Open Tennis Championship . He lost to World No. 1 Rafael Nadal in the second round.  Raonic competed well against Nadal, returning better on first serve in fact (winning 20% of points to Nadal's 14) while serving well on first serve (getting 67% of his first serves in play, winning 86% of those points). He had more chances to break point but experience and poise won out for the veteran as Nadal converted both of his only two break points and Raonic, none of his five. , The next two weeks playing in Asia, Tennis Canada hired Galo Blanco , who had worked with fellow Canadian player Steven Diez in Spain, on a two-week trial basis.  (Niemeyer wished to step down and he and Blanco co-coached during this period.) Unseeded, Raonic reached the quarter-finals of the 2010 Tashkent Challenger . After defeating No. 2 seed and Indian No. 1 Somdev Devvarman in the second round in straight sets, he was forced to retire with a sore shoulder trailing No. 5 seed Karol Beck . After a couple of weeks off, with Blanco now in charge, Raonic lost in the first round of qualifying for the 500 Series 2010 Valencia Open 500 , to No. 2 seed Pablo Cuevas . It was turned out to be the last tour action he had for the year. Instead, he turned his attention to a six-week off-season training regiment in Barcelona , under the guidance of Blanco and trainer Tony Estalella, one that Blanco later described, during the 2011 Australian Open, as \"amazing.\"  , Raonic ended 2010 ranked World No. 156 in singles and No. 349 in doubles. , Raonic started 2011 playing qualifying matches for the 2011 Aircel Chennai Open where he lost in the qualifying round against Édouard Roger-Vasselin . Next, he qualified for the 2011 Australian Open . He won his first round match against German Björn Phau in three sets, his first victory in a main draw Grand Slam match.  In the second round he defeated No. 22 seed Michaël Llodra of France, again in three sets, becoming the first Canadian man in 10 years to reach the third round of a singles Grand Slam.  He then knocked out the Russian World No. 10 Mikhail Youzhny in four sets to reach the fourth round, the first qualifier to make the 4th round of a Grand Slam since 1999.  Playing his next match at the Hisense Arena , he fell to World No. 7 David Ferrer after he lost the last three sets, despite winning the first.  , Despite the loss, Raonic received rave reviews for his performance at the Australian Open, such as when John McEnroe referred to Raonic as \"the real deal\" on Twitter ,  or the BBC 's reference to Raonic as part of \"a new generation\".  Martina Navratilova referred to Raonic as \"a new star\" saying that \"the sky is the limit\" for the young tennis player,  and the Sydney Morning Herald referred to Raonic as a \"future superstar\".  , Two weeks later, Raonic began play at the SAP Open tournament. After upsetting No. 4 seed Xavier Malisse in the first round in two sets, he then beat James Blake , again in two sets.  After beating Ričardas Berankis in the quarterfinal match 6–4, 7–6, he reached ATP tournament semifinals for the first time in his career. Raonic advanced to his first final of an ATP tournament when the No. 2 seed Gaël Monfils defaulted in the semifinals citing a wrist injury.  In the final, Raonic beat 1st seeded Fernando Verdasco 7–6, 7–6, winning his first ATP title, and became the first Canadian player to win an ATP singles tournament since Greg Rusedski in 1995 (before Rusedski started representing Great Britain).  , Raonic received a wild card into the main singles draw of the following week's 2011 Regions Morgan Keegan Championships . Interestingly, he opened against Fernando Verdasco, the player he had just faced two days earlier, and prevailed again, this time in three sets. Raonic next defeated Radek Štěpánek also in three sets, serving a career-high 38 aces in the process.  After defeating qualifier Robert Kendrick in the quarter-finals, again losing the second set before prevailing, Raonic continued his unbeaten run, defeating No. 4 seed Mardy Fish in the semis, once again despite dropping the second set. He lost a closely contested final, however, to No. 1 seed and two-time Memphis champion Andy Roddick 6–7, 7–6, 5–7, with Roddick making a diving forehand to win break point, on his fifth championship point for the match.  Raonic's performance in this tournament elevated him to yet another career high ranking of World No. 37, making him the highest-ranked Canadian male singles player in ATP Rankings history.  , Raonic won both his singles Davis Cup rubbers against Mexico on clay as well as the doubles tie together with Vasek Pospisil to advance Canada to the second round.  , He was given a wild card berth for the Indian Wells Masters 1000 tournament main draw,  where he lost to Ryan Harrison in the third round after wins over Marsel İlhan and Mardy Fish in the first two rounds. , Raonic started the clay court season at the Monte-Carlo Masters tournament by winning over Michaël Llodra and Ernests Gulbis before falling to 4th seed and eventual finalist David Ferrer in the third round.  After the tournament, Raonic rose to a new career-high ranking of 28, his first time in the top 30. It was also his 7th week in the top 50. He reached the third round at the 2011 Barcelona Open Banco Sabadell , and advanced to the semifinals at the 2011 Estoril Open (5th seeded there, he disposed of Igor Andreev in the first round, of João Sousa in the second round, and upset Gilles Simon in the quarterfinal before retiring due to a back injury against Fernando Verdasco 4–6 0–0). At the French Open he lost in the first round to Michael Berrer of Germany. , On grass courts , Raonic's reached the quarterfinals at the 2011 Gerry Weber Open by taking out both Pablo Andújar and Tobias Kamke in straight sets before losing to Philipp Petzschner in three. In doubles with partner Robin Hasse, he reached his first ATP World Tour doubles final. The pair lost to Rohan Bopanna and Aisam-ul-Haq Qureshi (the nicknamed \" Indo-Pak Express \") 9–11 in the deciding tie-break. At Wimbledon 31st seeded Raonic advanced to the second round after disposing of Marc Gicquel . However, in his second-round match against Gilles Muller , Raonic had to retire, due to injury, after winning 3 games in the first. , After hip surgery, Raonic returned to action following the US Open , where he was defeated by Israel 's Amir Weintraub in Canada's Davis Cup matchup. He reached the semifinals at 2011 If Stockholm Open (lost to Gaël Monfils ). On November 17, 2011, Raonic won an exhibition match against Pete Sampras 7–6, 6–1. Sampras' serve approached 200 km/h throughout the night, while Raonic topped out at 222 km/h. , On January 8, he won his second ATP title at the 2012 Aircel Chennai Open in Chennai, India, defeating Janko Tipsarević in the final. Raonic did not drop serve during the tournament, becoming the first player to do so since Roger Federer at the 2008 Gerry Weber Open . Later in January, Raonic advanced to the third round of the Australian Open , disposing of Filippo Volandri of Italy and Philipp Petzschner of Germany. He was then beaten by Lleyton Hewitt of Australia in 3 hours 6 minutes, after going to deuce (5) for the match point. , On February 19 in San Jose, California, Raonic won his third ATP title and second SAP Open in a row, defeating Denis Istomin in the final.  The following week in Memphis, Raonic reached the final of the Regions Morgan Keegan Championships for the second straight year where he lost to Jürgen Melzer .  , In Indian Wells , Raonic reached the third round, before losing to eventual title winner Roger Federer in three sets. He was one of only two opponents who forced Federer to a third set in this tournament. He reached the semifinals at the Barcelona Open Banco Sabadell by defeating world no.4 Andy Murray in straight sets in the quarterfinals. Raonic reached the third-round of the French Open where he lost to Juan Mónaco .  He made a second-round exit at Wimbledon , being defeated by Sam Querrey . , As a home favourite, he reached the quarterfinals of the Rogers Cup , defeating Viktor Troicki in the second round and getting a walkover to the quarterfinals after Andy Murray withdrew because of a knee injury. He lost to John Isner in the quarterfinals. Following this that run he reached a career-high ranking of no. 19, which put him into the world's top 20 for the first time. , At the US Open , Raonic was seeded 15th, but lost in the fourth round to eventual champion Andy Murray .  Raonic was the first Canadian male to reach the fourth round of the US Open since Martin Laurendeau in 1988. , At the Rakuten Japan Open Tennis Championships, Raonic made his third ATP World Tour 500 final, defeating Radek Štěpánek , Viktor Troicki , Janko Tipsarević , and Andy Murray , before dropping the final to Japan's Kei Nishikori . Raonic finished the year at a career high ranking of world no. 13 in singles and 203 in doubles. He was circuit's no. 1 in average number of aces served per match (15.4), points won on 1st serve (82%) and games won on his serve (93%). , Raonic played his first tournament of the year in Brisbane, where he bowed out to Grigor Dimitrov in the second round after a first-round bye. He reached the fourth round of the Australian Open , falling to semifinalist and world no. 2 Roger Federer . , Raonic earned his first title of the year in San Jose, defeating Tommy Haas in the final for his third consecutive title at the event. At the French Open he lost in the third round to Kevin Anderson . At Wimbledon he lost in the second round to Igor Sijsling . , Raonic reached his first Masters 1000 series final in Montreal, beating former US Open champion Juan Martin Del Potro and compatriot Vasek Pospisil before bowing out to Rafael Nadal in the final in just 68 minutes.  As a result, Raonic reached a career-high world ranking as world no. 10. In September, he won the PTT Thailand Open tournament, defeating Tomáš Berdych in the final.  One week later at the Rakuten Japan Open Tennis Championships, Raonic reached the final but lost a close match to Juan Martin del Potro.  , Despite an ankle injury, Raonic reached the third round of the Australian Open , where he lost to Grigor Dimitrov . This injury, however, forced him off the courts for a month. He returned in March to play the BNP Paribas Open where he would beat Andy Murray to reach the quarterfinals. However, Raonic would end up losing to Alexandr Dolgopolov in straight sets. At the Miami Masters he reached the quarterfinals for a second consecutive Masters 1000 tournament, where he lost to Rafael Nadal . This run saw him return to the top 10. , Raonic then participated in the Monte-Carlo Rolex Masters , making his third consecutive quarterfinals at Masters 1000 events before dropping the semifinal decision to Stanislas Wawrinka in straight sets. The result garnered Raonic a career-high ranking as world no. 9. At the Internazionali BNL d'Italia , Raonic defeated Jérémy Chardy in the quarterfinals to reach his first Masters 1000 semifinal on clay.  He lost in the semis to eventual champion Novak Djokovic . , In the third round of the French Open , Raonic outlasted Gilles Simon in five sets, followed by a fourth round win over Marcel Granollers in straight sets. By reaching his first Grand Slam quarterfinal, Raonic became the first Canadian man to do so in the Open Era .  Novak Djokovic won their quarterfinal encounter in straight sets. , Raonic next played at Halle, but had a disappointing early round exit. However, at the 2014 Wimbledon Championships , Raonic reached his first Wimbledon quarterfinal, only losing one set to Kei Nishikori in the process.  He then defeated Nick Kyrgios in four sets; in doing so, he became the first Canadian men's singles player to reach the semifinals at a Grand Slam since Robert Powell in 1908.  Raonic then faced Roger Federer in the semifinals. It was the fifth meeting between the two, and Raonic lost again to Federer, this time in straight sets. Despite the loss, Raonic saw his world ranking rise from No. 9 to No. 6.  In his next tournament, Raonic reached his first final of the year at the Citi Open where he faced compatriot Vasek Pospisil in the first all-Canadian final in ATP history,  where he won the title in straight sets. It was his first career 500 series title, after previously losing in the final of four other 500 series events. He went on to win his first Emirates Airline US Open Series men's championship, after reaching the quarterfinals at the Rogers Cup in Toronto and the semifinals at the Western & Southern Open in Cincinnati.  , Raonic began 2015 in the 2015 Brisbane International and successfully made it to the grand final against Roger Federer . Federer won the title against Raonic in three sets, whilst clocking up his 1,000th match win on the professional tour.  Later in the month he returned to the Australian Open reaching the quarterfinals after beating world no. 12 Feliciano López . His quarterfinals match against Djokovic was lost in three sets. At Indian Wells , Raonic made it to the semifinals, beating Rafael Nadal en route, after saving three match points from Nadal in the second set tie break. He lost to Roger Federer in the semifinal. Raonic reached the fourth round at the 2015 Miami Open , losing in three tiebreaks 7-6(7-3) 6-7(6-8) 6-7(5-7) to John Isner. At the 2015 Monte-Carlo Rolex Masters – Singles , Raonic lost in the fourth round Tomas Berdych after retiring while trailing 2-5, due to a foot injury. Raonic next participated at the 2015 Mutua Madrid Open , losing in the quarter-finals to Andy Murray 6-4 7-5. However, Raonic gained more points since he did better than the previous year , and as a result, Raonic moved up two spots to 4th in the rankings, his career best and in male or female, the best-ever in Canadian tennis history. Raonic then withdrew from the 2015 Rome Masters and the 2015 French Open due to a foot injury.  , In the first round of the 2013 Davis Cup , Raonic won both of his rubbers against Albert Ramos and Guillermo García-López to propel Canada to a win over 2012 finalist, Spain. In the second round Canada was matched up against Italy, and Raonic was able to win both of his matches to get Canada into an historic first semifinal for Canada. , On July 31, 2012, Raonic broke two Olympic Games tennis records in the second round at London 2012 by playing both the longest match at 66 games over three sets (beating the previous record of 61 games achieved during the five-set doubles final in Seoul in 1988), as well as the longest Olympic Games set ever played (beating the previous record by 18 games set in Athens in 2004). , Raonic eventually lost to Jo-Wilfried Tsonga , 23–25, in the third and final set, after splitting the first two sets, 3–6, 6–3.  , Raonic's record for the longest Olympic singles match by time was broken three days later by Roger Federer , who defeated Juan Martín del Potro , 3–6, 7–6 (7–5) , 19–17, in a semifinal match that lasted four hours and 26 minutes, half an hour longer than the Raonic-Tsonga match; the final set took two hours and 43 minutes.  , On the morning of Sept. 2, 2014, Milos Raonic and Kei Nishikori tied the all-time latest finish for a match at the U.S. Open , along with Mats Wilander and Mikael Pernfors in 1993, and John Isner and Philipp Kohlschreiber in 2012; all ended at 2:26 a.m. The match lasted 4 hours and 19 minutes. Raonic lost. , Raonic employs an all-court style of playing with an emphasis on quick points with strong groundstrokes and fast serves. Raonic's ground strokes are both solid and consistent, but his forehand is much stronger. He uses this to dominate points by moving his opponents around and hitting winners. Due to his backhand being weaker than his forehand, he has been known to run around his backhand and hit inside-out forehands instead. His main emphasis when playing from the baseline is hitting dominating ground strokes to end points quickly. Occasionally, after hitting a strong ground stroke, Raonic will come up to the net to put the ball away. , Raonic's serve is considered one of the best in the game, being very strong and precise. This is because of his height and his unorthodox grip on his racket when he serves, allowing him to pronate his wrist and arm a lot to serve accurately and quickly. His first serves can reach up to 230 kmh. His second serve is slightly slower, but has more top-spin on it and is still comparatively fast to other players' second serves. His serves have been compared to Ivo Karlović and John Isner 's who are considered the best servers in the game. , Due to his strong serve and powerful baseline play, Raonic often uses a chip-and-charge method on returns or serve-and-volley on his serves and comes up to the net to finish off points before his opponents can stabilise. He is adept at employing touches or deep volleys at the net, which contributes greatly to his offensive playstyle. , Raonic's weaknesses lies in his fitness. Apart from his occasional injury, his height also impedes his agility and speed slightly. Thus, he is hurt by players that can return his fast shots and move him around at the same time, such as Novak Djokovic , Andy Murray , Rafael Nadal and Kei Nishikori . He has also been beaten by David Ferrer numerous times due to Ferrer's speed and his ability to move him around. , Raonic endorses the Wilson BLX Blade 98 and he uses LUXILON M2 Pro 1.25 16L Strings. He endorsed Lacoste clothing until 2012. He is currently wearing New Balance clothing and shoes, and also wears SAP AG on his sleeve. In June 2015, Raonic sign a new ZEPP App contact. , This table is current through the 2015 French Open . , Raonic worked for Rogers Sportsnet as an analyst for their broadcast of the 2011 Rogers Cup .  , Raonic moved together with his family to Canada at the age of three from Titograd (Podgorica), Yugoslavia .  He is of Serbian descent.   He started playing tennis at the age of six at the Blackmore Tennis club in Richmond Hill , Ontario with coach Casey Curtis.  , Having grown up in the suburbs of Toronto , Ontario, Raonic stated that Canada is mostly an ice hockey (as opposed to tennis) country. He says he chose tennis because of its \"individuality and [because he] felt [he] could train more alone and on a ball machine with [his] dad\".  His elder brother, Momir, and elder sister, Jelena, have moved back to Montenegro, and Raonic says he visits his family there often.  , Raonic's uncle Branimir Gvozdenović is a former Minister of Urbanism and Environmental Protection in the Government of Montenegro , where he also acted as vice-prime minister.   His parents live in Canada and are both engineers—his father Dušan holds a PhD in engineering and his mother Vesna has a master's degree in the same field—while his sister also has a master's degree.  Raonic is fluent in Serbian and English .  His four favourite sports teams are FC Barcelona , the Toronto Raptors , the Toronto Blue Jays and the Toronto Maple Leafs .   , In an interview after his third-round win at the 2011 Australian Open, he was questioned about whether he would follow in the footsteps of Greg Rusedski , the last great Canadian tennis player, who ended up playing for his second nationality in Great Britain. When asked if he would continue to play for Canada, he replied, \"Yes\".  Raonic has shown a passion for Canada and the game of tennis in the country. This was displayed in an October 2010 interview, in which he said: \"I want to make a singles career. I enjoy it more and I want to make a difference in Canada with it. I feel if I were to achieve my goals it could make a great difference to the growth of tennis in Canada and help to produce more top players in the future.\"  , In 2012, Raonic launched a charity, Milos Raonic Foundation, which aims to help children needing prosthetic limbs to play sports.  That same year, he took up residence in Monte Carlo in a 50 m 2 apartment close to where fellow tennis players Novak Djokovic and Caroline Wozniacki live.  , "
}
