{
  "category": "afl",
  "article": "The Australian Football League ( AFL ) is the highest-level professional competition in the sport of Australian rules football . Through the AFL Commission , the AFL also serves as the sport's governing body, and is responsible for controlling the Laws of the Game . The league was founded as the Victorian Football League (VFL) as a breakaway from the previous Victorian Football Association (VFA), with its inaugural season commencing in 1897. Originally comprising only teams based in the Australian state of Victoria, the competition's name was changed to the Australian Football League for the 1990 season, after expanding to other states throughout the 1980s. , The league currently consists of 18 teams spread over five of Australia's six states ( Tasmania being the exception). Matches have been played in all mainland states and territories of Australia , as well as in New Zealand . The AFL season currently consists of a pre-season competition (currently branded as the \"NAB Challenge\"), followed by a 23-round regular (or \"home-and-away\") season, which runs during the Australian winter (March to September). The top eight teams then play off in a four-round finals series , culminating in the AFL Grand Final , which is held at the Melbourne Cricket Ground each year. The winning team in the Grand Final is termed the \" premiers \", and is awarded the premiership cup. The current premiers are Hawthorn . , The Victorian Football League was established in 1896 when six of the strongest clubs in Victoria – Collingwood, Essendon, Fitzroy, Geelong, Melbourne and South Melbourne – broke away from the established Victorian Football Association to establish the new league. The six clubs invited two more VFA clubs – Carlton and St Kilda – to join the league for its inaugural season in 1897. Among the notable initiatives established in the new league was an annual finals tournament, rather than awarding the premiership directly to the team with the best record through the season; and, the formal establishment of the modern scoring system, in which six points are scored for a goal, and one point is scored for a behind. , Although the Victorian Football League and the Victorian Football Association continued to compete for spectator interest for many years, the VFL quickly established itself as the premier competition in Victoria. In the early years Fitzroy and Collingwood were the dominant teams. Following the arrival of Jack Worrall as coach in 1903, Carlton began a dominating period, during which they won three successive flags from 1906 to 1908; although Worrall was the club secretary, he took on a player management and direction role which is today recognised as the first official coaching job in the league. Essendon won flags in 1911 and 1912, also under Jack Worrall's coaching. , In 1908, the league expanded to ten teams, with Richmond crossing from the VFA and University from the Metropolitan Football Association. University, after three promising seasons, finished last each year from 1911 until 1914, including losing 51 matches in a row; this was in part caused by its players' focus on their studies rather than football, particularly during examinations, and it was partly because the club operated on an amateur basis at a time when player payments were becoming common – and as a result, the club withdrew from the VFL at the end of 1914. University teams now compete in the Victorian Amateur Football Association .   , From 1907 until 1914, the VFL premier and the premier of the Adelaide-based South Australian Football League met in a playoff match for the Championship of Australia . Port Adelaide was the most successful club of the competition winning three titles during the period along with an earlier victory. , In 1919, the VFL established a seconds/reserves competition to run alongside the senior competition. In 1924 the VFL inaugurated the Brownlow Medal for the player who received the most votes from the umpires for the Best and Fairest player. Richmond won its first Premierships in 1920 and 1921 but Essendon – battlers since their 1912 flag – took over as the dominant team between 1922 and 1926. , In 1925, the VFL expanded from nine teams to twelve, with Footscray , Hawthorn and North Melbourne each crossing from the VFA. North Melbourne and Hawthorn remained very weak in the VFL for a very long period. North Melbourne did not win more than eight games in a season until 1944 and Hawthorn only once won more than seven until 1954. Between them, Hawthorn and North Melbourne finished in last place fifteen of the twenty-nine years from their admittance until 1953. Although North Melbourne would become the first of the 1925 expansion sides to reach a Grand Final in 1950 , initially it was Footscray that adapted to the VFL with the most ease of the three clubs, and by 1928 were well off the bottom of the ladder. , Between the years of 1927 and 1930, Collingwood became the first and so far, the only, team to win four successive Premierships. The club also finished the 1929 home-and-away season without losing a game, a feat yet to be repeated. This team became known as \"the Machine\" because of the organised and consistent way it played. With Premiership victories in 1935 and 1936, the Collingwood Football Club had already won 11 Premierships, four more than the next most successful club, Fitzroy (7). , In the 1930s, Richmond and South Melbourne rivaled Collingwood as the best team. Melbourne, which had won the Premiership in 1926 but fallen off sharply, developed a powerful attacking side that swept all before it between 1939 and 1941 to win three successive flags. Essendon, after a lean decade in the 1930s, enjoyed a dominant period with nine grand final appearances between 1941 and 1951. , In 1946, the VFL established an Under 19s grade of competition, to run alongside the seniors and reserves. In 1951, the McClelland Trophy was established as a prize for the best performing team across all three grades. In 1952, the VFL hosted 'National Day', when all six matches were played outside of Melbourne. Matches were played at the Sydney Cricket Ground, Brisbane Exhibition Ground , North Hobart Oval , Albury Sports Ground and Victorian country towns Yallourn and Euroa . , In 1959, the VFL planned the first purpose built mega-stadium, VFL Park (later known as Waverley Park), to give it some independence from the Melbourne Cricket Club , which managed the Melbourne Cricket Ground . VFL Park was planned to hold 155,000 spectators, which would have made it one of the largest stadiums in the world – although it would ultimately be built with a capacity of 78,000. Land for the stadium was purchased at Mulgrave, then farmland but predicted to be near the demographic centre of Melbourne's population. , Geelong was the stand out team at the beginning of the 1950s, winning the premiership in 1951 and then setting an enduring record of 23 consecutive wins starting in Round 12, 1952 and ending in Round 13, 1953. This streak included the 1952 premiership. Footscray became the first of the 1925 expansion teams to win the premiership in 1954. , Melbourne became a powerhouse during the 1950s and early 1960s under coach Norm Smith and star player Ron Barassi . The club contested seven consecutive grand finals from 1954 to 1960, winning five premierships, including three in a row from 1955 to 1957. , Television coverage began in 1957, with direct telecasts of the final quarter permitted. At first, several channels competed through broadcasting different games. However, when the VFL found that television was reducing crowds, it decided that no coverage was to be allowed for 1960. In 1961, replays (in Melbourne) were introduced although direct telecasts were rarely permitted in Melbourne (other States and Territories, however, enjoyed live telecasts every Saturday afternoon). , The VFL Premiership Trophy was first awarded in addition to a pennant flag in 1959; essentially the same trophy design has been in use since. , In the 1960s, television began to have a huge impact. Spectators hurried home from games to watch replays and many former players took up positions as commentators on pre-game preview programs and post-game review programs. There were also several attempts at variety programs featuring VFL players, who generally succeeded in demonstrating that their skills were limited to the football ground. , The VFL played the first of a series of exhibition matches in 1962 in an effort to lift the international profile of the league. , Hawthorn won its first premiership in 1961, beating Footscray. Melbourne extended its success from the 1950s by winning the premiership in 1964, but its success ended abruptly when Barassi was recruited by Carlton as captain-coach after the season, followed by Norm Smith being sacked during the 1965 season. Melbourne would not return to the finals for twenty-three years, and (as of 2014) has not yet won another premiership. , St Kilda, which had never won a VFL or VFA premiership in more than 93 years of competition, won its first and, to date, only premiership, in a famous Grand Final victory against Collingwood by one point. , With the number of players recruited from country leagues increasing, the wealthier clubs were gaining an advantage that metropolitan zoning and the Coulter law (salary cap) restricting player payments had prevented in the past. Country zoning was introduced in the late 1960s, and whilst it pushed Essendon and Geelong from the top of the ladder, it created severe inequality during the 1970s and 1980s. Between 1972 and 1987, only six of the league's twelve clubs – Carlton, Collingwood, Essendon, Hawthorn, North Melbourne and Richmond – played in Grand Finals; by comparison, nine different clubs had contested Grand Finals between 1961 and 1967. , The 1970 season saw the opening of VFL Park, with the inaugural match being played between Geelong and Fitzroy, on 18 April 1970. Construction work was carried out at the stadium as the 1970s progressed, culminating in the building of the now heritage listed Sir Kenneth Luke stand. The Queen of Australia , Elizabeth II was a guest at the game and officially opened the stadium to the public. The 1970 Grand Final between traditional rivals Carlton and Collingwood, arguably the league's most famous game, saw Carlton recover from a 44-point deficit at half-time to win the game by ten points, featured a famous spectacular mark by Alex Jesaulenko , and was witnessed by a record crowd of 121,696. , Carlton and Richmond won three premierships each between 1968–1974, facing each other in three Grand Finals. North Melbourne , after struggling for most of its time in the VFL, finally won its first premiership in 1975 , and contesting the Grand Final each year from 1974-1978, winning two ; three of those deciders were against fellow 1925 expansion team Hawthorn, who also won two premierships. Carlton won three premierships in four years from 1979–1982. , Among the notable rule changes made during the decade were: , The 1980s was a period of significant structural change in Australian football around the country. The VFL was the most popular and dominant of the state leagues around the country in terms of overall attendance, interest, and money, and began to look towards expanding its influence directly into other states. The VFL and its top clubs already had the buying power to recruit top players from interstate. As a result of this, rising cost pressures were driving some of Victoria's weaker clubs into dire financial situations. , But in spite of the increasing dominance of Victoria, the country's three top leagues – the VFL, South Australia's SANFL and Western Australia's WAFL , with teams from all three leagues competing in the Night Series , a competition run separate to the league competitions on weekday evenings. , South Melbourne became the first VFL club to relocate interstate, and the club moved to Sydney to become the Sydney Swans in 1982; under the private ownership of wealthy Dr Geoffrey Edelsten during the mid-1980s, Sydney became a successful team on-field. In 1986, the West Australian Football League and Queensland Australian Football League were awarded licences to join the VFL as expansion teams, leading to the establishment of the West Coast Eagles and Brisbane Bears , who both joined the league in 1987. These expansion team licences were awarded on payment of multi-million dollar fees which were not required of the existing VFL clubs. Interstate clubs dropped out of the Night Series , and by 1987 it consisted solely of VFL clubs; it was shifted to become the modern day pre-season competition in 1988. In 1989, financial troubles nearly forced Footscray and Fitzroy to merge, but a fundraising event from Footscray supporters stopped the proposed merger at the eleventh hour. , The 1980s first saw new regular timeslots for VFL matches. VFL matches had previously been played on Saturday afternoons, but Sydney began playing its home matches on Sunday afternoons, and North Melbourne pioneered playing matches on Friday night. These have since become regular timeslots for all teams. , In the late 1980s, the former zoning arrangements which had led to such inequality between the stronger and weaker clubs began to be phased out. The first National Draft was introduced in 1986, and a salary cap was introduced in 1987. Over the following decade, these changes helped to equalise the clubs, minimising the ability for the richer clubs to dominate the league. , In 1984, there was a revival of the International Rules representative series, which had first been played in the 1960s. The matches were played with a hybrid set of rules based on Australian rules football and Gaelic football . It also began to pave the way for Gaelic footballers to convert to Australian football; pioneered by Melbourne and known as the Irish experiment , Irish players Sean Wight and Jim Stynes began their successful VFL/AFL careers in the mid-1980s. Many Irish players have since played professional AFL football. , On-field, the 1980s were dominated by Hawthorn, Essendon and Carlton: Hawthorn contested seven consecutive Grand Finals for four premierships; Carlton contested four Grand Finals for three flags; and Essendon contested three consecutive Grand Finals, all against Hawthorn, winning two, and establishing a bitter rivalry. In the process, Carlton and Essendon both passed Collingwood in terms of number of premierships won; since 1982, Carlton has continuously been the team with most premierships won, holding the position jointly with Essendon for much of that time. The 1989 Grand Final between Hawthorn and Geelong is considered one of the finest Grand Finals, with many strong physical encounters, a joint Grand Final record nine goals by Geelong's Gary Ablett, Sr. , and Geelong coming back from a 36-point deficit at three quarter time to fall six points short of victory. , The league was officially renamed the Australian Football League in 1990 to reflect the new national perspective;  the VFA later took over the Victorian Football League name in 1996. Functionally, the AFL gave up control over its Victorian-based minor grades at the end of 1991 – clubs continued to field reserves teams in the independent Victorian State Football League , while an entirely new under-18s competition (the TAC Cup ) was established with new, zone-based clubs. Without minor grades, the McClelland Trophy was now awarded to the senior minor premiers. , Collingwood won the AFL Premiership in 1990, ending a 32-year premiership drought, which featured a string of near misses known as the Colliwobbles that had seen the club lose eight Grand Finals. , In 1990, the SANFL's most successful club, Port Adelaide , made a bid for an AFL licence. In response, the SANFL established a composite South Australian team called the Adelaide Crows , which was awarded the licence and joined the league in 1991 as the fourth interstate club. The same year saw the West Coast Eagles become the first interstate club reach the Grand Final, losing to Hawthorn; the Eagles would then win the premiership in 1992 and 1994. In 1994, the Fremantle Football Club was formed in Western Australia, and joined in the AFL in 1995, becoming the fifth interstate club. , In 1996, the VFL/AFL celebrated its centenary; the Australian Football Hall of Fame was established and the VFL/AFL Team of the Century was named. However, several Victorian clubs were in severe financial difficulties, most notably Fitzroy and Hawthorn. Hawthorn had proposed to merge with Melbourne to form the Melbourne Hawks , but the merger ultimately fell through and both teams continued as separate entities. For Fitzroy, however, the club was too weak to continue by itself; the club nearly merged with North Melbourne to form the Fitzroy-North Melbourne Kangaroos , but after the other clubs voted against it, the club merged with Brisbane to become the Brisbane Lions .  Fitzroy played its last match at the end of 1996.With the Brisbane-Fitzroy merger, Port Adelaide was awarded an AFL licence, and joined the league in 1997. The AFL rejected bids from Queensland club Southport Sharks and the Tasmanian government to enter teams. , Some of the rule changes of the decade included the introduction of a third field umpire in 1994, a blood rule in 1994, and the introduction of a third (1994) and fourth (1998) interchange player. The International Rules series against the Gaelic Athletic Association was revived again in 1998, and has become a semi-permanent fixture since. The finals series was expanded from five teams to six in 1991, and then to eight teams in 1994. , Through the 1990s, there was a significant trend of Melbourne-based teams abandoning the use of their small (20,000–30,000 capacity) suburban venues for home matches, in favour of the larger MCG and Waverley Park. The 1990s saw the last matches played at Windy Hill (Essendon), Moorabbin Oval (St Kilda), Western Oval (Footscray) and Victoria Park (Collingwood), and saw Princes Park abandoned by its long-term co-tenant Hawthorn. The transition to the use of only two venues in Melbourne was ultimately completed in 2005, when Carlton abandoned the use of Princes Park. , There was no dominant club in the latter part of the 1990s, although North Melbourne was the most successful, winning two premierships from three Grand Finals. Adelaide won two Grand Finals, and Carlton won one Grand Final from two appearances. , In 1999, the league sold Waverley Park stadium and used the funds in a joint venture to begin construction of a brand-new stadium situated at Melbourne's Docklands . Representative state football came to an end, with the last State of Origin match held in 1999. ,  , The AFL logo was again changed in 2000, with a new look intended to coincide with the new millennium. Rivals Collingwood and Carlton played a pre-season match known as the 'Millennium Match' on New Year's Eve 1999. The new Docklands Stadium hosted its first match in Round 1, 2000, between Essendon and Port Adelaide , with Essendon winning by 94 points;  it was the first AFL match to be played under a retractable roof. After Victorian State Football League ceased operation at the end of 1999, the Victorian-based AFL clubs established connections with the Victorian Football League (a rebranding of the former VFA), with clubs either fielding reserves teams in the VFL, or entering into affiliations with existing senior VFL clubs to serve as feeder teams . , The early 2000s were dominated by Essendon, Brisbane and Port Adelaide, who shared the five flags from 2000–2004. Essendon won three consecutive minor premierships between 1999 and 2001, but converted only the 2000 season into a premiership; Essendon's 2000 season set an enduring record, with a win-loss record of 24–1 across the home and away season and finals, the best ever recorded. Brisbane contested four consecutive Grand Finals, winning three of them in 2001–2003 and losing the other to Port Adelaide in 2004; the Power had won three consecutive minor premierships in 2002–2004, but could only capture the premiership in 2004 , doing so at the expense of the Lions, who were attempting to match Collingwood 's record of four premierships in a row set between 1927 and 1930.  The dominance of interstate clubs continued to six consecutive flags, with Sydney and West Coast facing each other in 2005 and 2006 Grand Finals for one flag each, with both matches decided by less than a goal. , The 2002 season saw the Carlton Football Club finish last, becoming the last of the twelve VFL clubs to win its first wooden spoon, before being heavily penalised for cheating the salary cap a few years earlier; the penalties impeded Carlton from rebuilding its playing list in the short term and saw them stay near the bottom of the ladder for the next six years. , A series of new rule changes were introduced for the 2006 season intended to speed up the game, allowing full-backs to kick in more quickly after a behind, and limiting the length of time that a player was allowed to hold the ball after a mark to eight seconds for a mark in general play, and 30 seconds for a set shot (known as the Lloyd rule).  , Several teams established a regular presence in other parts of Australasia during the 21st century, generally by playing between one and four home matches in the alternative location. Among the notable contracts include Hawthorn (Launceston), St Kilda (Launceston and Wellington),  North Melbourne (Gold Coast, Canberra and Hobart), Richmond (Cairns), Port Adelaide (Darwin) and the Western Bulldogs (Darwin and Cairns). , In the late 2000s, the AFL looked to establish a permanent presence on the Gold Coast , which was fast-developing as a major population centre. North Melbourne, who was in financial difficulty and had played a few home games on the Gold Coast in previous years, was offered significant subsidies to relocate to the Gold Coast, but the club declined. The AFL then began work to establish a club on the Gold Coast as a new expansion team; the Gold Coast Suns were established, and joined the AFL in 2011 as the 17th team. The Greater Western Sydney Giants , based in both Western Sydney and Canberra, were then established, and entered the league as the 18th team in 2012. , Early in 2008, a meeting held by the AFL discussed having two new teams enter the AFL competition.  In March 2008, the AFL won the support of the league's 16 club presidents to establish sides on the Gold Coast and in Western Sydney; both teams would enter the competition in 2011 and 2012 respectively. , The AFL has also considered a bid from the Tasmanian government for a licence for a Tasmanian team .  A third team based in Sydney has been suggested.  A third team based in Perth has been suggested.  On 25 April 2013 the Westpac Stadium in Wellington , New Zealand hosted the first ever Australian Football League game played for premiership points outside of Australia . The night game between St Kilda and Sydney was played in front of a crowd of 22,183 on Anzac Day to honour the Anzac bond between the two countries.   At the official pre-match function the Prime Minister of New Zealand John Key used the occasion to raise the prospect of a New Zealand-based AFL team, saying \"Let's get real. We've got to get a New Zealand side in the AFL.\"  , In 2010, a licence was granted to the Greater Western Sydney Giants , a second Sydney-based team based at Homebush in Western Sydney. The team also plays some of its home games in Canberra , A.C.T. . Also in the 2010 season, the AFL experienced the third Grand Final draw in its history when St Kilda drew with Collingwood. The replay was staged 1 week later with Collingwood running out premiers. , In 2011 new club, the Gold Coast Suns entered the league  having been granted a licence in 2009. In the 2011 season Geelong returned to the Grand Final and defeated Collingwood. In 2012 the Greater Western Sydney Giants joined the league and played their first season finishing in last place. Sydney won their 5th premiership defeating Hawthorn, but Hawthorn would redeem themselves one year later by defeating Fremantle to win the 2013 title. This also marked Fremantle's first Grand Final since joining the competition in 1995. , The 2014 season marked Andrew Demetriou's last as CEO of the AFL. He announced his retirement from the position and stepped down in June 2014 being replaced by Gillon McLachlan. In 2014 Gillon McLachlan announced the AFL has an idea for a Tasmanian team to join the AFL, but it would not happen for at least 10 years. The 2014 season also saw Peta Searle become the first woman appointed as a development coach in the AFL when she joined St Kilda.  , , The AFL operates on a single table system, with no divisions, conferences nor promotion and relegation from other leagues. , The league was founded as the Victorian Football League (VFL) in 1897 , consisting of eight teams only based in the Australian state of Victoria . Over the next century, a series of expansions, a relocation, a merger and a club withdrawal saw the leagues teams expand to the 18 teams there are today. , The current 18 teams are based across 5 states of Australia. The majority (10) still remain in Victoria, while the states of New South Wales, Queensland, Western Australia and South Australia have two each. In 1990 the national nature of the competition resulted in the name change to the Australian Football League. Tasmania , Australian Capital Territory , and Northern Territory are the only states/mainland territories not to have AFL clubs. , Since the Australian Football League commenced in 1897 as the Victorian Football League, only one club has left the competition, the Melbourne University Football Club ; it last competed in 1914, and withdrew because, as a strictly amateur club, it became unable to remain competitive in a time when player payments were becoming common;   the club still competes to this day in the Victorian Amateur Football Association . Two other clubs, the Fitzroy Football Club (Fitzroy Lions) and the Brisbane Bears , merged in 1996 to form the Brisbane Lions . , Below are the venues to be used during the 2015 AFL season . , Canberra , ACT , Throughout the history of the VFL/AFL, there have been a total of 42 different grounds used, with 14 used during the 2014 season.  The largest capacity ground in use is the Melbourne Cricket Ground (MCG), which has a capacity of over 100,000 people, and hosts the Grand Final each year.  The MCG is shared by five teams as a home ground, whilst the other grounds used as home venues by multiple teams are Docklands Stadium in Melbourne (five teams), Stadium Australia in Sydney (two teams), Adelaide Oval in Adelaide (two teams), and Subiaco Oval in Perth (two teams). , Prior to the expansion of the competition, most grounds were located in suburban Melbourne, with Princes Park , Victoria Park , the Junction Oval , Waverley Park , and the Lake Oval each having hosted over 700 games.  However, since the introduction of a national competition, each state and territory of Australia has hosted AFL games.  , On 25 April 2013 ( Anzac Day ), a match took place between St Kilda and Sydney at Westpac Stadium in Wellington , New Zealand, being the first AFL match played outside Australia for official premiership points.  At the end of 2013 a new five-year deal was announced that will see St Kilda play a match on Anzac Day at the stadium every year until 2018.  , AFL players are drawn from a number of sources; however, most players enter the league through the AFL draft , held at the end of each season. A small number of players have converted from other sports, or been recruited internationally. Prior to the nationalisation of the competition, a zoning system was in place. At the end of the season, the best 22 players and coach from across the competition are selected in the All-Australian team . , The AFL has tight controls over the player lists of each club. Currently, apart from the recently added expansion clubs who have some additional players, each team can have a senior list of 38 to 40 players plus 4 to 6 rookie players , to a total of 44 players  (following a reduction by two of the number of rookies in 2012) and up to three development rookies (international, alternate talent or New South Wales scholarship players).  Changes to playing lists are permitted only in the off-season: clubs can trade players during a \" trade period \" which follows each season and recruit new players through the three AFL drafts , the national draft, the pre-season draft and the rookie draft, which take place after the trade period. A mid-year draft was conducted between 1990 and 1993.  The national draft is the primary method of recruiting new players and has been used since 1986. The draft order is based on reverse-finishing position from the previous year, but selections can be traded. Free agency player movements have only been permitted since the 2012/13 offseason,  having been rejected by the AFL commission previously.  , A salary cap (known as the Total Player Payments or TPP) is also in place as part of the league's equalisation policy; this is A$9,130,000 for the 2013 season with a salary floor of $8,673,500 except for the Gold Coast , whose salary cap will be A$9,630,000 with a salary floor of $9,171,500, and Greater Western Sydney , whose salary cap is $9,987,000 with a floor of $9,530,500. As part of the AFL's enhanced equalisation policies, in 2014 the league announced an increase of the TPP for the 2015 and 2016 seasons. TPP increases an additional $150,000 per club in 2015 above previously contracted amounts, increasing from $9.92m to $10.07m in 2015 and $10.22m to $10.37m in 2016.  , The salary cap was set at A$1.25 million for 1987–1989 as per VFL agreement, with the salary floor set at 90% of the cap or $1.125 million; the salary floor was increased to 92.5% of the cap in 2001, and 95% of the cap for 2013 due to increased revenues. Both the salary cap and salary floor has increased substantially since the competition was rebranded as the AFL in 1990. , Salaries of draft selections are fixed for two years. Salaries for senior players are not normally released to the public, though the average AFL player salary at the conclusion of the 2012 season was $251,559  and the top few players can expect to earn up to and above $1,000,000 a year.  Upon successfully trading to the Sydney Swans in 2013, marquee player Lance Franklin signed a 9-year contract with the club, reportedly worth over $10 million and resulting in subsequent payments of $1.8 million annually in consecutive seasons.  The Total Player Earnings (TPE) – or total amount of revenue spent on reimbursement of AFL listed players – at the conclusion of the 2012 season was $173.7 million, up by 13 per cent from $153.7 million in 2011.  , The breaches of the salary cap and salary floor regulations outlined by the AFL are: exceeding the TPP; falling below the salary floor; not informing the AFL of payments; late or incorrect lodgement or loss of documents; or engaging in draft tampering. Penalties include fines of up to triple the amount involved ($10,000 for each document late or incorrect lodged or lost), forfeiture of draft picks and/or deduction of premiership points. The most significant breach of the salary cap was that of the Carlton Football Club in the early 2000s . , There were 801 players on AFL club senior, veteran, rookie and international lists in 2011, including players from every state and mainland territory of Australia.  , As of 2014, there are 68 players of Indigenous Australian descent on AFL club lists, comprising approximately 9% of the overall playing population.  , There were 12 players recruited from outside of Australia on AFL lists in 2011, including 10 from Ireland, all converts from Gaelic football drafted as part of the Irish Experiment . The other two players are Seamus McNamara ( Collingwood ) and Mike Pyke ( Sydney ), recruited from the United States and Canada respectively. , There were also another five overseas-born players who emigrated to Australia at an early age on AFL lists.  , An international rookie list and international scholarship list were introduced in 2006. The international rookie list includes up to two players between the ages of 15 and 23 who are not Australian citizens. These players may remain on this list for up to three years before they must be transferred to the senior or rookie list. For the first year, payments made to international-rookie-listed players fall outside the salary cap. The international scholarship list gives AFL clubs the option of recruiting up to eight players from outside Australia (other than Ireland). Irish players are required to either be placed on clubs' senior or rookie lists .  At the beginning of 2011 there were 14 international scholarship players.  , Of the 121 multicultural players, more than half have one parent from Anglophone countries, mainly the United Kingdom , Ireland and New Zealand .  , From 1988 until 2013, the AFL ran a pre-season competition that finished prior to the commencement of the premiership season, which served as both warm-up matches for the season and as a stand-alone competition. It was mostly contested as a four-week knock out tournament , but the format changed after the expansion of the league beyond sixteen clubs in 2011. The competition has frequently been used to trial rule changes. In 2014, the competition format was abandoned, and practice matches are now played under the sponsored name NAB Challenge . , The AFL home-and-away season at present lasts for 23 rounds, starting in late March and ending in early September. As of the 2013 AFL season , each team plays 22 matches, with one bye. Teams receive four premiership points for a win and two premiership points for a draw. Ladder finishing positions are based on the number of premiership points won, and \"percentage\" (calculated as the ratio of points scored to points conceded throughout the season) is used as a tie-breaker when teams finish with equal premiership points. At the end of the home-and-away season, the McClelland Trophy is awarded to the minor premiers . , Some rounds of the season are named as themed rounds, such as Rivalry Round (in which traditional rivals are matched up against each other), Women's Round and Heritage Round (where teams play in old style guernseys ). Some matches are also themed for special events. For example, each year Collingwood play Essendon in the annual ANZAC Day match at the MCG and the game will typically sell out regardless of the positions of the two teams on the ladder due to their strong rivalry and huge followings. Another annual match is the Queen's Birthday game between Melbourne and Collingwood. As of 2006, Richmond and Essendon play in the Dreamtime at the 'G match. There are separate trophies for the matches between several clubs and former rivalries such as the Lake Trophy between St Kilda and the Sydney Swans. , The top eight teams at the end of the AFL Premiership season compete in a four-week finals series throughout September, culminating in a grand final to determine the premiers. The grand final is traditionally played at the Melbourne Cricket Ground on the afternoon of the last Saturday in September. , The winning team receives a silver premiership cup and a navy blue premiership flag – a new one of each is manufactured each year. The flag has been presented since the league began and is traditionally unfurled at the team's first home game of the following season. The trophy was first introduced in 1959 and is manufactured annually by Cash's International at their metalworks in Frankston, Victoria .  Additionally, each player in the grand final-winning team receives a premiership medallion. , The following major individual awards and accolades are presented each season: , Other independent best and fairest awards are presented by different football and media organisations. , To celebrate the 100th season of the AFL, the \"AFL Team of the Century\" was named in 1996. , There is currently no official state representation for AFL players despite the concept being well supported among fans and calls to re-introduce a State of Origin series.   , VFL players first represented the Victoria representative team in 1897 regardless of their state of origin. , Being the dominant league drawing many of the country's best players, the Victoria Australian rules football team (nicknamed the \"Big V\" and composed mostly of VFL players) dominated interstate matches until the introduction of State of Origin selection criteria by the Australian Football Council in 1977, after which Victoria's results with the other main Australian football states became more even. , The AFL Commission assumed control of interstate football in 1993 and co-ordinated an annual State of Origin series typically held during a mid-season bye round. However after the 1999 series, the AFL declared the concept of interstate football \"on hold\" citing club's unwillingness to release star players and a lack of public interest and shifted its focus of representative football to the International Rules Series where it draws a greater television revenue. , The last time AFL players played formal interstate football was in the 1999 State of Origin Series when Victoria inflicted a massive defeat on South Australia in wet conditions in front of a crowd of 26,063. Just 10 years earlier, the same match with a plethora of star players attracted a crowd of 91,960. , A once-off representative match, known as the AFL Hall of Fame Tribute Match was played in 2008 to celebrate the 150th anniversary of the sport. The match was played between a team of players of Victorian origin and a team of players of interstate origin (the \" Dream Team \") , Some past AFL players participate and help promote the E. J. Whitten Legends Game , however this event is not affiliated with or promoted by the AFL. , The International Rules Series is an annual competition played twice every three years between AFL listed players from Australia and Gaelic footballers from Ireland . The series is organised under the auspices of the AFL and the Gaelic Athletic Association . The game itself is a hybrid sport , consisting of rules from both Australian football and Gaelic football. The series provides the only outlet for AFL players to represent their nation. , The AFL Commission is responsible for the administration of the AFL. It was established in December 1985, and then granted almost unilateral administrative control over the league in 1993,  after the club parochialism and self-interest which came with the traditional club delegate based administrative structure threatened to undermine the competition. , The Commission's chairman is Mike Fitzpatrick , a former Subiaco and Carlton player, and the Chief Executive is Gillon McLachlan , who officially took over from Andrew Demetriou on the 4th June, 2014. , The Commission's composition remains almost exclusively Victorian based with one exception, Bob Hammond from South Australia. , In addition to administering the national competition, the AFL is heavily involved in promoting and developing the sport in Australia. It provides funds for local leagues and in conjunction with local clubs, administers the Auskick program for young boys and girls. , The AFL also plays a leading role in developing the game outside Australia, with projects to develop the game at junior level in other countries (e.g. South Africa) and by supporting affiliated competitions around the world (See Australian football around the world ). , The players of the AFL are represented by the AFL Players Association . , The AFL is the best-attended sporting league in Australia ,  and averaged 33,461 people per game over the 2013 season, giving AFL the 4th highest average attendance figures of any professional sport in the world.  According to market research, the AFL is the second-most-watched sporting event in Australia, behind cricket .  Currently, broadcast rights for the AFL are shared between the Seven Network ( free-to-air ), Foxtel and Austar ( pay TV ), and Telstra (internet). At the end of the 2013 season, a record 756,717 people were members of an AFL club.  , The following are the most recent season attendances: , AFL matches are currently broadcast in Australia by the free-to-air Seven Network , subscription television provider Foxtel , and digital content provider Telstra . The 5-year deal, announced in April 2011, covers the 2012-2016 (inclusive) seasons. Telstra won the rights to broadcast one live match per week via IP Television and on its Telstra Mobile service. The deal was confirmed when the Seven Network, Foxtel and Telstra agreed to pay A$1.253 billion to the Australian Football League to broadcast every match of every round and all of the Finals Series across their platforms.  As part of the agreement, Austar broadcasts Foxtel`s AFL coverage in the regional areas of Australia that are not part of Foxtel`s service area. Regional free-to-air broadcasters associated with the Seven Network – Prime7 , GWN7 , Seven Queensland , Southern Cross Television and WIN Television – all show Seven's coverage in their respective areas. , The Seven Network broadcasts four games from every round of the regular premiership season, as well as the AFL Finals Series and the AFL Grand Final . Foxtel broadcasts every match from every round, including simulcasts of all Seven Network games except for the Grand Final (which Seven shows exclusively live). Coverage is also available via Foxtel`s IP television service (Foxtel on T-Box). , The 1957 VFL season was the first broadcast after the commencement of television in Australia (introduced in 1956 to coincide with the Melbourne Olympic Games). During the late 1950s and 1960s, all Melbourne stations ( ABV2 , HSV7 , GTV9 and, after it commenced in 1965, ATV0/ATV10 ) broadcast some games. However, in the late 1950s and early 1960s, the VFL was concerned that direct telecasts may affect attendances and stations were only permitted to telecast a delayed replay of the last quarter of games. In the 1980s, the Seven Network was given exclusive rights to VFL/AFL games. The only year Seven did not telecast games was 1987, when the rights were bought by Broadcom, which on-sold the rights to the Australian Broadcasting Corporation (ABC). The exclusive rights were won back by Seven in 1988. , With the launch of subscription television in Australia, AFL match coverage commenced on cable television. Optus Vision bid for and won exclusive pay TV rights from 1996–2001, screening coverage on its own 24-hour AFL channel, branded Sports AFL in Brisbane Sydney and Melbourne (where available). The Sports AFL channel was later closed due to financial issues and relaunched in March 1999 as C7 Sport by the Seven Network with AFL match coverage also transferred to the new channel. C7 Sport became available in regional areas not in the Foxtel or Optus Vision licence area via Austar soon after the re-launch. The AFL coverage was not available through Foxtel at this time as the Seven Network and Foxtel disagreed on the cost of carrying the C7 channel. These issues regarding C7 and AFL broadcsting rights evolved into a court case between not just the Seven Network and News Limited , but Seven against the owners of the Nine Network and Network Ten in the years that followed. , In late 2000, the Seven Network's main rivals, the Kerry Packer led Nine Network , Network Ten and pay-TV's Foxtel set up a consortium which bid $500 million for the right to broadcast the 2002 – 2006 seasons inclusive. Seven had purchased a guaranteed right to make the last bid in 1995,  but decided not to outbid their rivals.  The games were split between the networks, with Nine screening Friday Night Football and two matches on Sunday, Ten screened a Saturday afternoon and a Saturday night match, with the remaining four matches shown on Foxtel. Foxtel set up its own version of a dedicated AFL-only channel, the Fox Footy Channel , which showed every game on replay during the week as well as many news, talkback and general interest shows related to Australian rules football.  , When the rights were offered again in January 2006 for the 2007 to 2011 seasons, Seven formed an alliance with Ten and used its guaranteed last bid rights to match Nine's offer of $780 million to win back the broadcast rights in what was the biggest sport telecasting deal in Australian history at the time. After lengthy negotiations, Foxtel agreed to be a broadcast partner and now showed four live matches each week, although no longer on a dedicated AFL channel.  Seven took back the Friday night match and only one game on Sunday, while Ten retained showing two matches on Saturdays. Foxtel showed two games on Saturday and two on Sunday, including a late afternoon or twilight game.  , Historically AFL broadcasts in other countries have varied. , In the 1980s, VFL matches were shown in the United States on ESPN for some time. In the early 1990s, Prime Network , an American regional sports network unrelated to the Australian regional television network , aired Seven's weekly highlight show as well as the Grand Final. Some other English speaking countries have shown the game, however it has been since 2008 that channels in other countries began televising matches. From 1998 to 2006 games were broadcast in the United States by the Fox Sports World network.  , In 2007, after the record domestic television rights deal, the AFL secured an additional bonus: greater international television rights and increase exposure to overseas markets, including a five-year deal with Setanta Sports and new deals with other overseas pay-TV networks. The deal ended early in 2009 when Setanta stopped broadcasting into Great Britain. ESPN again took up the contract.  , The following countries are ranked by the approximate extent of their current television coverage (and whether it is free to air): , The AFL has stated that it wishes to showcase the footballing code to other countries such as India , China and South Africa so as to create a global following thus creating more exposure for its sponsors in the increasing Asian and African markets.  On 17 October 2010, AFL clubs Melbourne Demons and Brisbane Lions played an exhibition game in front of almost 10,000 people at the Riverside Sports Center in Shanghai . [ citation needed ] This was the first professional AFL game to be played in China . , The AFL has garnered increased interest in Ireland due to the introduction of the International Rules series played between an AFL picked All Australian Team and Ireland. [ citation needed ] This paved the way for young Irish footballers to be rostered to AFL teams mainly due to the fact that salaries in the AFL are much larger than that of Gaelic Football although most Irish players fail to make the grade into 1st team football.  This also paved the way for extended news coverage and increased broadcasting in the UK and Ireland . [ citation needed ] , The first broadcast of a VFL game was by 3AR in 1923, the year that broadcasting officially commenced in Australia. The first commentator was Wallace (Jumbo) Shallard , a former Geelong player who went on to have a long and respected career in print and broadcast media. The VFL/AFL has been broadcast every year since then by the ABC and (since 1927) by various commercial stations. The saturation period was the early 1960s when seven of the eight extant radio stations ( 3AR , 3UZ , 3DB , 3KZ , 3AW , 3XY and 3AK ) broadcast VFL games each week, as well as broadcasts of Geelong games by local station 3GL . (At this time, the only alternative that radio listeners had to listening to the football on a Saturday afternoon were the classical music and fine arts programs that were broadcast by 3LO ). , Currently, the official radio broadcast partners of the AFL are: , The official internet/mobile broadcast partner of the AFL is Bigpond , part of Telstra . The AFL also provides exclusive broadband content including streaming video for international fans via its website. Bigpond also hosts the official websites of all the 17 AFL clubs excluding Essendon. , The service is also provided to international subscribers. Delayed video is available 12 hours or more after the game. , However, the website is frequently derided by users for its convoluted information architecture and bloated presentation.   , Since 2012, Telstra has broadcast live matches over its Next G mobile network for a pay-per-view or season fee.  , The following are the official naming sponsors of the VFL/AFL competition: , ¹ Note: In 2001 CUB and Coca-Cola were joint sponsors , The official print broadcast partner of the AFL is News Limited . The AFL Record is a match-day magazine published by the AFL and is read by around 225,000 people each week. , The AFL sells memberships that entitle subscribers to reserve seats for matches at Docklands Stadium and Melbourne Cricket Ground in Melbourne. AFL members also receive priority access to finals. Two levels of memberships are now offered, silver and full, with the main difference being that only full members have guaranteed access to Preliminary and Grand Final matches.  , The AFL runs a chain of stores that sell merchandise from all clubs. Merchandise is also available from other retailers. , A modern museum called the Hall of Fame and Sensation opened in Melbourne in 2003 to celebrate the culture of the AFL and to provide a venue for the Australian Football Hall of Fame . The museum, a licensed off-shoot of the AFL, was originally touted for the MCG, but the Hall of Fame failed to get support from the Melbourne Cricket Club. The new QV shopping centre on Swanston Street was then chosen as the location. However, controversy followed the appointment of an administrator as the museum began running at a loss. Many blamed high entry prices, which were subsequently reduced, and the museum remains open to the public. In early 2006 the name was changed to AFL World. It features various honour boards and memorabilia as well as a range of innovative interactive displays designed to immerse visitors in the experience of elite Aussie Rules. It was closed down in 2008. , The following is a list of all the video games from the AFL video game series: , The AFL is the subject of footy tipping and betting competitions around Australia run by individuals, syndicates, workplaces and professional bookmakers . In recent years national website based tipping competitions have started to replace the traditional, but more labour-intensive, office or pub run competitions. , Fantasy football competitions based on actual player statistics (number of kicks, marks, goals etc.) are also very popular on websites and in newspapers. , Lists: , Statistics and Results , Major AFL news Sites "
}
