{
  "category": "afl",
  "article": "The Collingwood Football Club , nicknamed The Magpies or less formally The Pies , is an Australian rules football club which plays in the Australian Football League (AFL). Formed in 1892, the club was named after the inner-Melbourne suburb of Collingwood , and was originally based at Victoria Park in Abbotsford; the club is now based in the nearby Melbourne Sports and Entertainment Precinct in Melbourne , playing its home games at the Melbourne Cricket Ground and with its training and administrative base at Olympic Park Oval and the Westpac Centre . , Collingwood is the most supported club in the AFL,   and has consistently attracted much higher than average crowds to its home games than other clubs in the league,   and had a league record of 71,516 members in the 2011 season. This spike in membership registration can mainly be attributed to the winning of the 2010 AFL Premiership.  This record was again broken in 2013, with club reaching a new high of 80,000 members. Collingwood is regarded as one of Australia's most popular clubs, being the highest attended and most viewed professional sports club in the nation.  , Collingwood's home guernsey consists of black and white stripes, matching the colours of an Australian magpie . Throughout its history, the club has developed rivalries with cross-town Melbourne based clubs Carlton , Richmond and Essendon . , Historically one of the most successful clubs in the league, Collingwood has won 15 VFL/AFL premierships, the third-most of any team. Collingwood has played in a record 43 grand finals (including replays), winning 15, drawing two and losing 26 (also a record). , The club also currently fields a seconds team in the Victorian Football League . , , , The Collingwood Football Club was established on 12 February 1892.   ,  Collingwood played its first game in the Victorian Football Association (VFA) against Carlton on 7 May 1892.  The club won the VFA Premiership in 1896. , In 1897, Collingwood, along with fellow VFA clubs Fitzroy , Melbourne , St Kilda , Carlton , Essendon , South Melbourne and Geelong split from the VFA and formed the Victorian Football League (VFL). Collingwood won its first premiership in 1902 , defeating Essendon by 33 points. , Collingwood was the most successful club of the 1920s and 1930s, appearing in 13 out of a possible 20 Grand Finals during the period. Collingwood were premiers six times during this time, including four consecutive premierships between 1927 and 1930 , a VFL/AFL record, and two consecutive premierships in 1935 and 1936 . The club's coach during this period was Jock McHale , who served as coach from 1912 to 1949. Collingwood also had three Brownlow Medallists during the period, with Syd Coventry winning in 1927 , Albert Collier in 1929 and Harry Collier in 1930 , In the 1950s, rival club Melbourne enjoyed an era of unprecedented success, winning five premierships in six years (the last coming in 1960, and having been runner up in 1954). Collingwood lost two Grand Finals to Melbourne in this decade, but bounced back to win premierships in 1953 and 1958. Collingwood's 1958 premiership is much cherished by the club as it prevented Melbourne from equalling Collingwood's record four premierships in a row. , The 1958 premiership was however to be Collingwood's last for 32 years, as the club was to suffer a string of Grand Final defeats in coming decades. , A string of eight Grand Final losses, often by narrow margins, between 1960 and 1981 gave rise to a perception that the club was prone to \"choking\", a phenomenon wittily dubbed \"Colliwobbles\".    Whether this perception is accurate remains a subject of debate;  however, the club's record in recent years has been much improved, having won two and drawn one of its last six Grand Finals. Lou Richards ceremoniously buried the Colliwobbles at Victoria Park after the club's 1990 premiership.   , The 1990 premiership team, coached by Leigh Matthews and captained by Tony Shaw , had a one-sided grand final win against Essendon , the Magpies recording a 48-point victory and ending a 32-year premiership drought which included eight grand final losses and one draw. , After this, however, the club lapsed into a state of decline; their status as a potential powerhouse at the beginning of the decade was reduced with each passing season and the club ultimately received a second wooden spoon in 1999. Within a few years, with a change of coach, playing list and club president, Collingwood reached and lost consecutive grand finals in a close contest in 2002 and a \"blow out\" in 2003, both to the Brisbane Lions . , Following those Grand Final losses, Collingwood struggled for the next two years, finishing 13th in 2004 and second-last in 2005; the latter meant Collingwood was eligible for a priority pick which the club used to recruit Dale Thomas . Collingwood made a return to the finals in 2006, but were defeated by the Western Bulldogs by 41 points. The 2007 season saw them finish sixth on the ladder at season's conclusion, and in the finals they knocked out the grand finalists of the past two years, Sydney , in the elimination final and then West Coast in an overtime thriller at Subiaco Oval in the semi-final. Having earned a preliminary final against Geelong , the Pies challenged the eventual premiers, only to fall short by five points. , Collingwood finished eighth in 2008 and were assigned an away final against Adelaide at AAMI Stadium . After at one point trailing in the match, the Pies went on to end Adelaide's season and earn a semi-final meeting against St Kilda . Having defeated the Saints in both their regular season meetings, the Pies lost convincingly, ending their 2008 season. The 2009 season saw Collingwood finish inside the top-four for the first time since 2003, but in the qualifying final were beaten by minor premiers St Kilda convincingly. Having won a second chance, the Pies struggled against Adelaide for the second year in a row before John Anthony kicked the match-winning goal with a minute left to send them into another preliminary final meeting with Geelong. But the season ended abruptly for the Magpies, with an 86-point loss to the Cats. , In 2010, Collingwood finished as minor premiers, and after wins in the qualifying and preliminary finals, reached the first Grand Final against St Kilda . The match finished as a draw, forcing the first Grand Final Replay in 33 years. Collingwood won the replay by 56 points. The club won a second consecutive minor premiership in 2011, and qualified for the Grand Final after a three point victory against Hawthorn in the preliminary final. However, Collingwood was then beaten by Geelong by 38 points in the decider, after trailing by seven points at three-quarter time. Star midfielder Dane Swan won the 2011 Brownlow medal with a record 34 votes. , In 2012, Collingwood once again finished in the top-four but in their first final they were convincingly defeated by Hawthorn forcing them to play in the next week against West Coast . They started their game against the Eagles trailing but after half-time they powered through to win by 13 points. The next week they were beaten by eventual premiers Sydney at ANZ Stadium , the first time the Swans had defeated the Magpies since 2005. The 2013 season was a mixed one for Collingwood, losing to Gold Coast and suffering a fifth consecutive loss to Hawthorn in Round 21, before being unceremoniously knocked out of the finals series by Port Adelaide at the MCG in the first week. Coach Nathan Buckley delisted several high profile older players at the end of the season, including Alan Didak , Darren Jolly and Heath Shaw .  , Teams of the Collingwood Football Club have, throughout the club's history, worn guernseys of black and white vertical stripes. The all white jumper, with the three black vertical stripes is the iconic strip that the club is most associated with. The current incarnation of the guernsey is mostly black, with white stripes on the front and lower half of the back, and white numbers. The main clash guernsey is the reverse of this: mostly white, with black stripes and black numbers, worn in away matches against clubs with a predominantly dark guernsey such as Fremantle Football Club and Port Adelaide Football Club . A secondary clash guernsey, introduced in 2011 and used only in matches against North Melbourne , is black with only two white stripes on each side instead of three. , Traditionally, Collingwood has worn a mostly white guernsey with black stripes. The club switched to the mostly black guernsey with white stripes in 2001.  , \"Good Old Collingwood Forever\" is the team song of the Collingwood Football Club. It is sung to the tune of \" Goodbye, Dolly Gray \", a popular Boer War and First World War song. , The current version of the song played at the ground was recorded in 1972 by the Fable Singers.  , Carlton is considered to be the club's most bitter arch-rival (for full details see Carlton–Collingwood AFL rivalry ), with Richmond and Essendon close behind.  The old rivalry with Melbourne has faded in recent decades because Melbourne have not enjoyed on-field success at the same time; this rivalry also remains strong however and is an annual event on the Queens Birthday public holiday. Collingwood's two opponents in the themed Rivalry Rounds staged to date have been Carlton (2005–2006, 2009) and Richmond (2007–2008). In recent times, rivalries have been sparked with the new interstate clubs, including Port Adelaide , and the Brisbane Lions . , The rivalry between Collingwood and Melbourne was at its peak between 1955 and 1964, when the two played off in the grand final on five occasions. This included the 1958 Grand Final where Collingwood’s victory prevented Melbourne from equalling Collingwood’s record of four premierships in succession (1927—1930). , Collingwood's rivalry with Essendon has become more significant since 1995, when the first ANZAC Day clash took place. After the 2015 match, Collingwood have won this contest 12 times and Essendon 8 times, with the first match being drawn. , The rivalry with Port Adelaide stems from the Power being known as the Magpies in their local SANFL competition before switching to the Power when entering the League in 1997. Feelings were heightened when Port midfielder Kane Cornes 'flipped the bird' at Nick Davis following the Power's five point victory over the Magpies at AAMI Stadium in Round 9, 2002, only moments after Anthony Rocca had missed the opportunity to tie the scores. Jarrod Molloy and Brodie Holland remonstrated with Cornes after the match, with a feeling of hostility lingering after the two sides had left the field. Collingwood unexpectedly beat the Power in the Qualifying Final that season, also at AAMI stadium. Collingwood again defeated Port Adelaide in the 2003 Preliminary Final at the MCG. This added to the ‘choking’ phenomenon directed at the Power. The off-field battle over Port's desire to wear its black and white \"prison bar\" guernsey has been a major talking point, especially between 2002 and 2007, which added to the rivalry. A resolution was reached in favour of Collingwood. , The first signs of a Collingwood/Brisbane rivalry originated in 1999, when Brisbane comprehensively beat the Magpies in the last ever AFL match at Victoria Park . In Round 8 2002 Collingwood beat Brisbane by three points in a tense match in front of 46,279 people at Colonial Stadium . This victory over the reigning premier took the Magpies to equal top of the league table (2nd on percentage) with Brisbane. The rivalry grew with the 2002 Grand Final when Brisbane beat Collingwood by nine points. The rivalry grew again in 2003 when the two clubs clashed on four occasions. The Lions defeated the Magpies at The Gabba in Round 4 before thrashing them in Heritage Round— Round 19 at the MCG. Collingwood then defeated Brisbane in the Qualifying Final with Alan Didak ensuring victory late in the final quarter, with two goals from the boundary line. The rivalry peaked in the 2003 Grand Final with Brisbane easily defeating Collingwood to win the premiership.  In the 2004 AFL Grand Final , Brisbane, playing against Port Adelaide, had the chance to equal Collingwood's record of four premierships in a row. This caused many Collingwood fans to temporarily ignore the Port Adelaide rivalry and hope for a Power victory. Former Collingwood captain Mark Williams coached Port Adelaide to a comprehensive victory, fittingly preserving Collingwood's record as well as winning Port's first premiership. The rivalry cooled in the period following Brisbane's loss in the 2004 Grand Final due a sustained period of success at Collingwood and a string of poor seasons at Brisbane, however Dayne Beams recent defection to the Lions has seemingly reignited the rivalry.   , Games between Collingwood and Geelong have become highly anticipated since 2007. In Round 15 Geelong beat Collingwood by 16 points in a high-quality match. In the Preliminary final Collingwood surprised many when they came within 5 points of the eventual premiers. In 2008 Collingwood thrashed Geelong by 86 points—20.14 (134)- 7.6 (48) causing Geelong’s only loss of the year. In 2009, the sides again met in the preliminary final, but despite high hopes the Cats, who would again win the premiership, won by 73 points in front of another massive crowd of 87,258.  In 2010, the two sides emerged as the favourites for the flag and twice met in front of blockbuster crowds at the MCG when they were placed 1st and 2nd on the ladder—with the results evenly split. They again met in a Preliminary final, this time a resounding win to Collingwood by 41 points. In 2011, both teams were undefeated going into their round eight 'blockbuster' at the 'G. Geelong won by three points, after a controversial advantage was not paid to Magpie Scott Pendlebury in the dying minutes. Pendlebury kicked a goal and would have put the Pies in front, but the free kick was contentiously called back and Geelong managed to whisk the ball away. In the round 24 match, Geelong thumped the Magpies by a record margin of 96 points, which was also Collingwood's biggest ever loss at the MCG. The 2011 Grand Final against the Cats concluded with a 38-point loss for the Pies. , Collingwood supporters are often stereotyped as 'bogans', poorly educated and described as being toothless, among other things.  This has caused the supporters of many clubs, especially Melbourne-based ones, to have a disliking for the club,   in addition to the above more specific rivalries, however it could be argued these supporters are continuing the sectarian hatreds that characterised Australian society during Collingwood's main period of success in the 1920s and 30's.  Collingwood supporters have also been involved in many of the most highly publicised incidents of racial vilification in the history of the AFL. A report published by the Australian Human Rights Commission found that racial vilification was prevalent in all crowds and was not confined to any one AFL venue, but also singled out Collingwood's home ground of Victoria Park as the worst for racial abuse of Aboriginal players in the past.  Collingwood spectators' racial taunting of indigenous players Nicky Winmar and Adam Goodes are seen as landmarks in the history of racism in the AFL,  and Michael Long's report of vilification by Collingwood ruckman Damian Monkhorst lead directly to the establishment of the AFL's racial vilification regulations.  Eddie McGuire has been credited with reforming the club culture and harshly dealing with racist remarks by supporters.  ]] , In 2011 Collingwood reached 70,000 members for the first time creating a new AFL record, beating the previous AFL record of 58,249 set by Collingwood in 2010,.   , The club's membership base leads to large crowd pulling power which has caused the AFL to be accused of favouring Collingwood when scheduling to maximise the league's attendance figures.    However the AFL states that this is due to other clubs requesting home games at the MCG against Collingwood. , Collingwood was one of the last clubs to abandon its traditional stadium, the famous inner-city Victoria Park . Collingwood now plays home games at the MCG . It now also has its headquarters situated in the former Glasshouse Entertainment Centre . This building is also shared with the Victorian Institute of Sport (VIS). Due to a sponsorship deal, this facility is known as 'The Westpac Centre'. , Collingwood continues to be financially viable through the loyal support of its huge following and numerous sponsors. After finishing 2nd in 2002 and 2003 the team fell to 13th and 15th (out of 16) in 2004 and 2005 respectively. This trend has plagued the club since the glory days of pre-World War II VFL football. Since 1958, the club has won only two VFL/AFL Premiership (the inaugural AFL Premiership in 1990, and in 2010). Despite this, the club still has won more individual games, more finals and made more grand final appearances than any other club. , On 9 March 2007, former Collingwood and Fitzroy defender Gary Pert was appointed the Magpies' CEO, seven weeks after Greg Swann departed for Carlton. In accepting the key Magpie post, Pert quit as a club director and as managing director of Channel 9 in Melbourne. In a press conference, it was stated that Collingwood has budgeted to turn over about $50 million this year. McGuire hopes the new administration will soon double that figure. \"A finance administration review has come up with how we are going to turn Collingwood in to its next phase of its life\", McGuire said. \"What do we do to make ourselves go from a $45 million a year turnover business to a $100 million turnover business? \"They sound like big figures but in 1999 we turned over $13 million, so that is where we are heading as a football club.\" , The club made an operating profit of $5.23 million for the 2013 season, revenue increased from $2.6 million to more than $75 million.  , The Collingwood guernsey is the most valuable sports sponsorship in Australia.  Collingwood has different guernsey sponsors for home and away matches, generating an estimated $6.3 million worth of media exposure for the primary sponsor and $5.7 million for the secondary sponsor. These sponsorships are ranked first and second in Australia.  High profile sponsors include Emirates , Holden , CGU Insurance and Westpac . , Seniors , Premierships: , Premierships , , Played: 2,452 Won: 1493 Drawn: 26 Lost: 933 (Last updated - End of Round 11, 2015 Season) , Collingwood announced its team of the century on 14 June 1997, celebrating 100 years since the beginning of the VFL . Gavin Brown was added as the fourth interchange player in 2002, when the team was named in 1997 only three interchange players were permitted on a team.  , , This list comprises every captain of the club. This list does not include deputy captains filling in due to an injury to the named captain, but does include captains named after a player retires or steps down during the season. , Head coach , Assistant coaches , , The VFL/AFL operated a reserves competition from 1919–1991, and a de facto AFL reserves competition was run by the Victorian State Football League from 1992–1999. Collingwood fielded a reserves team in both of these competitions, allowing players who were not selected for the senior team to play for Collingwood in the lower grade. After the AFL reserves competition was disbanded at the end of 1999, the club fielded its reserves team in the new Victorian Football League during the 2000 season . , In 2001, Collingwood reserves team was dissolved and the club entered into an affiliation with the VFL's Williamstown Football Club , such that Williamstown served as a feeder team and reserves players for Collingwood played senior football for Williamstown. Collingwood ended its affiliation with Williamstown after the 2007 season. The reserves team was re-established, and has competed in the VFL since 2008.  , The reserves team currently plays at Victoria Park, and uses the AFL team's clash guernsey as its primary guernsey. The Collingwood VFL team is composed of both reserves players from the club's primary and rookie AFL lists, and a separately maintained list of players eligible only for VFL matches. , Instituted in 1981, retrospective awards were dated back to 1955; prior to that, the League awarded the Leading Goalkicker Medal , Leading Goal Kicker Medal Winners , ^ Awarded retrospectively in 2011 "
}
