{
  "category": "afl",
  "article": "The Essendon Football Club , nicknamed The Bombers or colloquially The Dons , is a professional Australian rules football club which plays in the Australian Football League (AFL). Essendon is one of the oldest clubs in the AFL.  Formed in 1871 as a junior club and playing as a senior club since 1878, it is historically associated with the suburb of Essendon in the north-west of Melbourne , Australia . Since 2013, the club has been headquartered at the True Value Solar Centre, Melbourne Airport , and plays its home games at either Docklands Stadium or the Melbourne Cricket Ground ; throughout most of its history the club's home ground and headquarters was Windy Hill , Essendon. , An original club of both the Victorian Football Association and the Victorian Football League (VFL), Essendon is one of Australia's best-known football clubs since the inception of a national Australian rules competition, the AFL, in 1990.  The club says to have over a million supporters Australia wide.  Essendon has won 16 VFL/AFL premierships which, along with Carlton , is the most of any club in the AFL. , , , The club was founded by members of the Royal Agricultural Society, the Melbourne Hunt Club and the Victorian Woolbrokers.  The Essendon Football Club was formed sometime between 1871 and 1873. It was held at a meeting at the home of a well-known brewery family, the McCrackens, whose Ascot Vale property hosted a team of local junior players.  , Robert McCracken, the owner of several city hotels, was the founder and first President of the Essendon club, and his son, Alex , its secretary. Alexander would later become president of the newly formed VFL. Alex’s cousin, Collier, who had already played with Melbourne , was the team’s first captain.  , The club began as a junior club, and its first official match was played against the Carlton second twenty on 7 June 1873,  with Essendon winning by one goal. Essendon played 13 matches in its first season, winning seven, with four draws and losing two. [ citation needed ] The club was one of the inaugural junior members of the Victorian Football Association (VFA) in 1877,  and began competing as a senior club from the 1878 season.  During its early years in the Association, Essendon played its home matches at Flemington Hill, but moved to the East Melbourne Cricket Ground in 1881. , In 1878, Essendon played in the first match on what would be considered by modern standards to be a full-sized field at Flemington Hill. In 1879 Essendon played Melbourne in one of the earliest night matches recorded when the ball was painted white. In 1883 the team played four matches in Adelaide. [ citation needed ] , In 1891 Essendon won their first VFA premiership, which they repeated in 1892, 1893 and 1894. One of the club's greatest players, Albert Thurgood played for the club during this period. [ citation needed ] Essendon was undefeated in the 1893 season. [ citation needed ] , At the end of the 1896 season Essendon along with seven other clubs formed the Victorian Football League . Essendon's first VFL game was in 1897 was against Geelong at Corio Oval in Geelong. Essendon won its first VFL premiership by winning the 1897 VFL finals series . Essendon again won the premiership in 1901 , defeating Collingwood in the Grand Final . The club won successive premierships in 1911 and 1912 over Collingwood and South Melbourne respectively. [ citation needed ] , Having already re-located from its ground at Kent Street, Ascot Vale (\"McCracken's Paddock\") to Flemington Hill, the club was again forced to move in 1881; and, because the City of Essendon mayor of the day considered the Essendon Cricket Ground \"to be suitable only for the gentleman's game of cricket\",  Essendon moved to East Melbourne. [ citation needed ] , The club became known by the nickname \"the Same Old Essendon\", from the title and hook of the principal song performed by a band of supporters which regularly occupied a section of the grandstand at the club's games.  The nickname first appeared in print in the local North Melbourne Advertiser in 1889,  and ended up gaining wide use, often as the diminutive \"Same Olds\". [ citation needed ] , This move away from Essendon, at a time when fans would walk to their local ground, didn't go down too well with many Essendon people; and, as a consequence, a new team and club was formed in 1900, unconnected with the first (although it played in the same colours), that was based at the Essendon Cricket Ground, and playing in the Victorian Football Association . It was known firstly as Essendon Town and, after 1905, as Essendon (although it was often called Essendon A, with the A standing for association).  , After the 1921 season, the East Melbourne Cricket Ground was closed and demolished to expand the Flinders Street Railyard . Having played at the East Melbourne Cricket Ground from 1882 to 1921, and having won four VFA premierships (1891–1894) and four VFL premierships ( 1897 , 1901 , 1911 and 1912 ) whilst there,  Essendon was looking for a new home, and was offered grounds at the current Royal Melbourne Showgrounds , at Victoria Park , at Arden St, North Melbourne , and the Essendon Cricket Ground. The Essendon City Council, offered the (VFL) team the Essendon Cricket Ground, announcing that it would be prepared to spend over ₤12,000 on improvements, including a new grandstand, scoreboard and re-fencing of the oval. , The club's first preference was to move to North Melbourne  – a move which the North Melbourne Football Club (then in the VFA) saw as a grand opportunity to get into the VFL. Most of Essendon's members and players were from the North Melbourne area, and sportswriters believed that Essendon would have been taken over by or rebranded as North Melbourne within only a few years of the move.   However, the VFA, desperate for its own strategic reasons not to lose its use of the North Melbourne Cricket Ground, successfully appealed to the State Government to block Essendon's move to North Melbourne.  With its preferred option off the table, the club returned to Essendon, and the Essendon VFA club disbanded, with most of its players moving to North Melbourne.  , The old \"Same Olds\" nickname fell into disuse, and by 1922 the other nicknames \"Sash Wearers\" and \"Essendonians\" that had been variously used from time to time were also abandoned. The team became universally known as \"the Dons\" (from Essen DON ); it was not until much later, during the War years of the early 1940s, that they became known as \"The Bombers\" — due to Windy Hill’s proximity to the Essendon Aerodrome .  , In the 1922 season , playing in Essendon for the first time in decades, Essendon reached the final four for the first time since 1912, finishing in third place. In the 1923 season the club topped the ladder with 13 wins from 16 games. After a 17 point second semi final loss to South Melbourne defeated Fitzroy (who had beaten South Melbourne) in the challenge final: Essendon 8.15 (63) to Fitzroy 6.10 (46). Amongst Essendon’s best players were half forward flanker George \"Tich\" Shorten , centre half forward Justin McCarthy , centre half back Tom Fitzmaurice , rover Frank Maher and wingman Jack Garden . , This was one of Essendon's most famous sides, dubbed the \"Mosquito Fleet\", due to the number of small, very fast players in the side. Six players were 5'6\" (167 cm) or smaller. , The 1924 season proved to be arguably the strangest year in Essendon's entire history. For the first time since 1897 there was no ultimate match — either \"Challenge Final\" or \"Grand Final\" — to determine the premiers; instead, the top four clubs after the home and away season played a round-robin to determine the premiers. Essendon, having previously defeated both Fitzroy (by 40 points) and South Melbourne (by 33 points), clinched the premiership by means of a 20-point loss to Richmond. With the Tigers having already lost a match to Fitzroy by a substantial margin, the Dons were declared premiers by virtue of their superior percentage, meaning that Essendon again managed to win successive premierships. But the poor crowds for the finals meant this was never attempted again, resulting in Essendon having the unique record of winning the only two premierships without a grand final. [ citation needed ] , Prominent contributors to Essendon's 1924 Premiership success included back pocket Clyde Donaldson , follower Norm Beckton , half back flanker Roy Laing , follower Charlie May and rover Charlie Hardy . [ citation needed ] , The 1924 season was not without controversy, with rumours of numerous players accepting bribes. Regardless of the accuracy of these allegations, the club's image was tarnished, and the side experienced its lowest period during the decade that followed, with poor results on the field and decreased support off it. [ citation needed ] , There was worse to follow, with various Essendon players publicly blaming each other for the poor performance against Richmond, and then, with dissension still rife in the ranks, the side plummeted to an humiliating 28 point loss to VFA premiers Footscray in a special charity match played a week later in front of 46,100 people, in aid of Dame Nellie Melba's Limbless Soldiers' Appeal Fund , purportedly (but not officially) for the championship of Victoria.  , While it is always difficult to assess the damage caused by events such as these, the club's fortunes dipped alarmingly, and persistently. Indeed, after finishing third in the 1926 season , it was to be 14 years before Essendon would even contest a finals series. [ citation needed ] , The 1933 season , was probably the start of the Essendon revival, seeing the debut of the player regarded as one of Essendon's greatest players Dick Reynolds . His impact was immediate. He won his first Brownlow Medal aged 19. His record of three Brownlow victories (1934, 1937, 1938), equalled Haydn Bunton, Sr (1931, 1932, 1935), and later equalled by Bob Skilton (1959, 1963, 1968), and Ian Stewart (1965, 1966, 1971). , Reynolds went on to arguably even greater achievements as a coach, a position to which he was first appointed, jointly with Harry Hunter, in 1939 (this was while Reynolds was still a player). A year later he took the reins on a solo basis and was rewarded with immediate success (at least in terms of expectations at the time which, after so long in the wilderness, were somewhat modest). He was regarded as having a sound tactical knowledge of the game and being an inspirational leader, as he led the side into the finals in 1940 for the first time since 1926, when the side finished 3rd. Melbourne, which defeated Essendon by just 5 points in the preliminary final, later went on to trounce Richmond by 39 points in the grand final. , 1941 brought Essendon's first grand final appearance since 1923, but the side again lowered its colours to Melbourne. A year later war broke out and the competition was considerably weakened, with Geelong being forced to pull out of the competition due to travel restrictions as a result of petrol rationing. Attendances at games also declined dramatically, whilst some clubs had to move from their normal grounds due to them being used for military purposes. Many players were lost to football due to their military service. Nevertheless, Essendon went on to win the 1942 Premiership with Western Australian Wally Buttsworth in irrepressible form at centre half back. Finally, the long awaited premiership was Essendon's after comprehensively outclassing Richmond in the grand final, 19.18 (132) to 11.13 (79). The match was played at Carlton in front of 49,000 spectators. , In any case, there could be no such reservations about Essendon's next premiership, which came just four years later. Prior to that Essendon lost a hard fought grand final to Richmond in 1943 by 5 points, finished 3rd in 1944, and dropped to 8th in 1945. , After WWII, Esssendon enjoyed great success. In the five years immediately after the war, Essendon won 3 premierships (1946, 1949, 1950) and were runners up twice (1947, 1948). In 1946, Essendon were clearly the VFL's supreme force, topping the ladder after the roster games and surviving a drawn second semi final against Collingwood to win through to the grand final a week later with a 10.16 (76) to 8.9 (57). Then, in the grand final against Melbourne, Essendon set a grand final record score of 22.18 (150) to Melbourne 13.9 (87), with 7 goal centre half forward Gordon Lane . Rover Bill Hutchinson, and defenders Wally Buttsworth, Cec Ruddell and Harold Lambert among the best players. , The 1947 Grand Final has to go down in the ledger as 'one of the ones that got away', Essendon losing to Carlton by a single point despite managing 30 scoring shots to 21. As if to prove that lightning does occasionally strike twice, the second of the 'ones that got away' came just a year later, the Dons finishing with a lamentable 7.27, to tie with Melbourne (who managed 10.9) in the 1948 grand final. A week later Essendon waved the premiership good-bye, as Melbourne raced to a 13.11 (89) to 7.8 (50) triumph. The club's Annual Report made an assessment that was at once restrained and, as was soon to emerge, tacitly and uncannily prophetic: , It is very apparent that no team is complete without a spearhead and your committee has high hopes of rectifying that fault this coming season. , The 1949 season heralded the arrival on the VFL scene of John Coleman , arguably the greatest player in Essendon's history, and, in the view of some, the finest player the game has known. In his first ever appearance for the Dons, against Hawthorn in Round 1 1949, he booted 12 of his side's 18 goals to create an opening round record which was to endure for forty five years. More importantly, however, he went on to maintain the same high level of performance throughout the season, kicking precisely 100 goals for the year to become the first player to top the ton since Richmond's Jack Titus in 1940. [ citation needed ] , The Coleman factor was just what Essendon needed to enable them to take that vital final step to premiership glory, but even so it was not until the business end of the season that this became clear. Essendon struggled to make the finals in 4th place, but once there they suddenly ignited to put in one of the most consistently devastating September performances in VFL history. , Collingwood succumbed first as the Dons powered their way to an 82 point first semi final victory, and a fortnight later it was the turn of the North Melbourne Football Club as Essendon won the preliminary final a good deal more comfortably than the ultimate margin of 17 points suggested. In the grand final, Essendon were pitted against Carlton and in a match that was a total travesty as a contest they overwhelmed the Blues to the tune of 73 points, 18.17 (125) to 6.16 (52). Best for the Dons included pacy aboriginal half back flanker Norm McDonald, ruckman Bob McLure, and rovers Bill Hutchinson and Ron McEwin. John Coleman also did well, registering 6 majors. , A year later Essendon were if anything even more dominant, defeating the North Melbourne Football Club in both the second semi final and the grand final to secure consecutive VFL premierships for the third time. Best afield in the grand final in what was officially his swansong as a player was captain-coach Dick Reynolds, who received sterling support from the likes of Norm McDonald, ruckman/back pocket Wally May, back pocket Les Gardiner, and big Bob McLure. , With 'King Richard' still holding court as coach in 1951, albeit now in a non-playing capacity, Essendon seemed on course for a third consecutive flag but a controversial four-week suspension dished out to John Coleman on the eve of the finals effectively put paid to their chances. Coleman was reported for retaliation after twice being struck by his Carlton opponent, Harry Caspar, and without him the Dons were rated a 4 goals poorer team. Nevertheless, they still managed to battle their way to a 6th successive grand final with wins over Footscray by 8 points in the first semi final and Collingwood by 2 points in the preliminary final. , The Dons sustained numerous injuries in the preliminary final and the selectors sprang a surprise on grand final day by naming the officially retired Dick Reynolds as 20th man. 'King Richard' was powerless to prevent the inevitable, although leading at half time, the Geelong kicked five goals to two points in the third quarter to set up victory by 11 points. , Essendon slumped to 8th in 1952 but John Coleman was in irrepressible form managing 103 goals for the year. Hugh Buggy noted in The Argus : \"It was the wettest season for twenty two years and Coleman showed that since the war he was without peer in the art of goal kicking.\" , Two seasons later Coleman's career was ended after he dislocated a knee during the Round 8 clash with the North Melbourne Football Club at Essendon. Aged just twenty five, he had kicked 537 goals in only 98 VFL games in what was generally a fairly low scoring period for the game. His meteoric rise and fall were clearly the stuff of legend, and few if any players, either before or since, have had such an immense impact over so brief a period. , According to Alf Brown, football writer for The Herald : , (Coleman) had all football's gifts. He was courageous, a long, straight kick, he had a shrewd football brain and, above all, he was a spectacular, thrilling mark. , Somewhat more colourful, R.S. Whittington suggested, , \"Had he been a trapeze artist in a strolling circus, Coleman could have dispensed with the trapeze.\" , Without Coleman, Essendon's fortunes plummeted, and there were to be no further premierships in the 1950s. The nearest miss came in 1957 when the Bombers (as they were popularly known by this time) earned premiership favouritism after a superb 16 point second semi final defeat of Melbourne, only to lose by over 10 goals against the same side a fortnight later. , 1959 saw another grand final loss to Melbourne, this time by 37 points, but the fact that the average age of the Essendon side was only 22 was seen as providing considerable cause for optimism. However, it was to take another three years, and a change of coach, before the team's obvious potential was translated into tangible success. [ citation needed ] , John Coleman started his coaching career at Essendon in 1961, thus ending the Dick Reynolds era at the club. In the same year Essendon finished the season mid table and supporters were not expecting too much for the following season. However, the club blitzed the opposition in this year, losing only two matches and finishing top of the table. Both losses were to the previous year's grand finalists. The finals posed no problems for the resurgent Dons, easily accounting for Carlton in the season's climax, winning the 1962 Premiership. This was a remarkable result for Coleman who in his second season of coaching pulled off the ultimate prize in Australian football. As so often is the case after a flag, the following two years were below standard. A further premiership in 1965 (won from 4th position on the ladder), was also unexpected due to periods of poor form during the season. The Bombers were a different club when the finals came around, but some of the credit for the improvement was given to the influence of Brian Sampson and Ted Fordham during the finals. Coleman's time as coach turned out to be much like his playing career: highly successful but cut short when he had to stand down due to health problems in 1967. Only six years later, on the eve of the 1973 season, he would be dead of a heart-attack at just 44 years of age. , Following Coleman's retirement, the club experienced tough times on and off the field. Finals appearances were rare for the side, which was often in contention for the wooden spoon . Essendon did manage to make the 1968 VFL Grand Final , but lost to Carlton by just three points and would not make it back to the big stage for a decade-and-a-half. , During the period from 1968 until 1980, five different coaches were tried, with none lasting longer than four years. Off the field the club went through troubled times as well. In 1970 five players went on strike before the season even began, demanding higher payments. Essendon did make the finals in 1972 and 1973 under the autocratic direction of Des Tuddenham (Collingwood) but they were beaten badly in successive elimination finals by St. Kilda and would not taste finals action again until the very end of the decade. The 70s Essendon sides were involved in many rough and tough encounters under Tuddenham, who himself came to logger heads with Ron Barassi at a quarter time huddle where both coaches exchanged heated words. Essendon had tough, but talented players with the likes of \"Rotten Ronnie\" Ron Andrews and experienced players such as Barry Davis , Ken Fletcher , Geoff Blethyn , Neville Fields and West Australian import Graham Moss . In May 1974, a controversial half time all-in-brawl with Richmond at Windy Hill and a 1975 encounter with Carlton were testimony of the era. Following the Carlton match, the 'Herald' described Windy Hill as \"Boot Hill\", because of the extent of the fights and the high number of reported players (eight in all – four from Carlton and four from Essendon). The peak of these incidents would occur in 1980 with new recruit Phil Carman making headlines for head-butting an umpire. The tribunal suspended him for sixteen weeks, and although most people thought this was a fair (or even lenient) sentence, he took his case to the supreme court, gathering even more unwanted publicity for the club. Despite this, the club had recruited many talented young players in the late 70s who would emerge as club greats. Three of those young players were Simon Madden , Tim Watson and Paul Van Der Haar . Terry Daniher and his brother Neale would come via a trade with South Melbourne , and Roger Merrett joined soon afterwards to form the nucleus of what would become the formidable Essendon sides of the 1980s. This raw but talented group of youngsters took Essendon to an elimination final in 1979 under Barry Davis but were again thrashed in an Elimination Final, this time at the hands of Fitzroy. Davis resigned at the end of the 1980 season after missing out on a finals appearance. , One of the few highlights for Essendon supporters during this time was when Graham Moss won the 1976 Brownlow Medal ; he was the only Bomber to do so in a 40-year span from 1953–1993. Even that was bittersweet as he quit VFL football to move back to his native Western Australia, where Moss finished out his career as a player and coach at Claremont Football Club . In many ways, Moss' career reflects Essendon's mixed fortunes during the decade. , Former Richmond player Kevin Sheedy started as head coach in 1981.  , Essendon reached the Grand Final in 1983, the first time since 1968. Hawthorn won by a then record 83 points.  , In 1984, Essendon won the pre-season competition and completed the regular season on top of the ladder. The club played, and beat, Hawthorn in the 1984 VFL Grand Final to win their 13th premiership—their first since 1965. The teams met again in the 1985 Grand Final , which Essendon also won. At the start of 1986 , Essendon were considered unbackable for three successive flags, but a succession of injuries to key players Paul Van der Haar (only fifteen games from 1986 to 1988), Tim Watson , Darren Williams , Roger Merrett and Simon Madden led the club to win only eight of its last eighteen games in 1986 and only nine games (plus a draw with Geelong ) in 1987.  During this period, the Bombers suffered a humiliation at the hands of Sydney who became the only team ever to kick two hundred points in three quarters.  , In 1988, Essendon made a rebound to sixth place with twelve wins, including a 140-point thrashing of Brisbane where they had a record sixteen individual goalkickers.  In 1989, they rebounded further to second on the ladder with only five losses and thrashed Geelong in the Qualifying Final. However, after a fiery encounter with Hawthorn ended in a convincing defeat, the Bombers were no match for Geelong next week. , In 1990, Essendon were pace-setters almost from the start, but a disruption from the Qualifying Final draw between Collingwood and West Coast was a blow from which they never recovered. The Magpies comprehensively thrashed them in both the second semi final and the grand final. , Following the 1991 season, Essendon moved its home games from its traditional home ground at Windy Hill to the larger and newly renovated MCG . This move generated large increases in game attendance, membership and revenue for the club. The club's training and administrative base remained at Windy Hill until 2013. , Following the retirement of Tim Watson and Simon Madden in the early 1990s, the team was built on new players such as Gavin Wanganeen , Joe Misiti , Mark Mercuri , Michael Long , Dustin Fletcher (son of Ken) and James Hird , who was taken at #79 in the 1992 draft. This side became known as the \"Baby Bombers\", as the core of the side was made up of young players early in their careers. , The team won the 1993 Grand Final against Carlton and that same year, Gavin Wanganeen won the Brownlow Medal , the first awarded to an Essendon player since 1976. Three years later, James Hird was jointly awarded the medal with Michael Voss of Brisbane. , In 2000, Essendon won 20 consecutive matches before they lost to the Western Bulldogs in round 21. The team went on to win their 16th premiership, defeating Melbourne , thereby completing the most dominant single season in AFL/VFL history. The defeat to the Bulldogs was the only defeat for Essendon throughout the entire calendar year (Essendon also won the 2000 pre-season competition).  , Essendon was less successful after 2001. Lucrative contracts to a number of premiership players had caused serious pressure on the club's salary cap, forcing the club to trade several key players. [ citation needed ] Blake Caracella, Chris Heffernan, Justin Blumfield, Gary Moorcroft and Damien Hardwick had all departed by the end of 2002; in 2004 Mark Mercuri , Sean Wellman and Joe Misiti retired. The club remained competitive, however they could progress no further than the second week of the finals each year for the years of 2002, 2003, and 2004. Sheedy signed a new three-year contract at the end of 2004. , In 2005 , Essendon missed the finals for the first time since 1997; and in 2006 , the club suffered its worst season under Sheedy, and its worst for more than 70 years, finishing second-last with only three wins (one of which was against defending premiers Sydney , in which Matthew Lloyd kicked eight goals)  and one draw from twenty-two games. Matthew Lloyd replaced James Hird as captain at the start of the season, but after suffering a season-ending hamstring injury early in the season, David Hille was appointed captain for the remainder of the season. The club improved its on-field position in 2007, but again missed the finals. , Sheedy's contract was not renewed after 2007, ending his 27-year tenure as Essendon coach. Matthew Knights replaced Sheedy as coach, and coached the club for three seasons, reaching the finals once – an eighth place finish in 2009 at the expense of reigning premiers Hawthorn .  On 29 August 2010, shortly after the end of the 2010 home-and-away season, Knights was dismissed as coach. , On 28 September 2010, former captain James Hird was named as Essendon's new coach from 2011 on a four-year deal. Former Geelong dual premiership winning coach and Essendon triple-premiership winning player Mark Thompson later joined Hird on the coaching panel. In his first season, Essendon finished eighth. The club started strongly in 2012, sitting fourth with a 10-3 record at the halfway mark of the season; but the club won only one more match for the season, finishing eleventh to miss the finals. , During 2013, the club was investigated by the AFL and the Australian Sports Anti-Doping Authority (ASADA) over its 2012 player supplements and sports science program , most specifically over allegations into illegal use of peptide supplements. An internal review found it to have \"established a supplements program that was experimental, inappropriate and inadequately vetted and controlled\", and on 27 August 2013 the club was found guilty of bringing the game into disrepute for this reason. Among its penalties, the club was fined A$2 million, stripped of early draft picks in the following two drafts, and forfeited its place in the 2013 finals series (having originally finished seventh on the ladder); Hird was suspended from coaching for twelve months.  Several office-bearers also resigned their posts during the controversy, including chairman David Evans  and CEO Ian Robson.  However, on 31 March, 2015, the AFL anti-doping tribunal ruled they were \"not comfortably satisfied\" that the 34 past and present Essendon players had used any banned substance in relation to the club's 2012 supplements program.  , On May 12, 2015 The World Anti-Doping Agency (WADA) announced an appeal, with the case to be determined at the Court of Arbitration for Sport. , In October 2013, the club moved its training and administrative base to the True Value Solar Centre, a new facility in the suburb of Melbourne Airport which it had developed in conjunction with the Australian Paralympic Committee . Essendon holds a 37-year lease at the facility,  and maintains a lease at Windy Hill to use the venue for home matches for its reserves team in the Victorian Football League , and for a social club and merchandise store on the site.  , Assistant coach Mark Thompson took over as coach for the 2014 season during Hird's suspension,  and he led the club back to the finals for a seventh-place finish. Hird has returned to the position of senior coach for the 2015 and 2016 seasons.  , Essendon's first recorded jumpers were navy blue (The Footballers, edited by Thomas Power, 1875) although the club wore 'red and black caps and hose'. In 1877 The Footballers records the addition of 'a red sash over left shoulder'. This is the first time a red sash as part of the club jumper and by 1878 there are newspaper reports referring to Essendon players as 'the men in the sash'. , Given that blue and navy blue were the most popular colours at the time it is thought that Essendon adopted a red sash in 1877 to distinguish its players from others in similar coloured jumpers. , In 2007, the AFL Commission laid down the requirement that all clubs must produce an alternative jumper for use in matches where jumpers are considered to clash. Since 2012, Essendon's clash guernsey has been predominantly grey, with a red sash fimbriated in black; the grey field contains, in small print, the names of all Essendon premiership players.  , From 2007–2011, the Essendon clash guernsey was the same design as its home guernsey, but with a substantially wider sash such that the guernsey was predominantly red rather than predominantly black. This was changed after 2011 when the AFL deemed that the wider sash did not provide a sufficient contrast.  , Following Adam Ramanauskas ' personal battle with cancer, a \"Clash for Cancer\" match against Melbourne was launched in 2006. This was a joint venture between Essendon and the Cancer Council of Victoria to raise funds for the organisation.  Despite a formal request to the AFL being denied, players wore yellow armbands for the match which resulted in the club being fined $20,000.  In 2007, the AFL agreed to allow yellow armbands to be incorporated into the left sleeve of the jumper.  The 'Clash for Cancer' match against Melbourne has become an annual event, repeated in 2008 and 2009. In 2009, the jumpers were auctioned along with yellow boots worn by some players during the match.  , The club's theme song, \"See the Bombers Fly Up\", was written c. 1959 by Kevin Andrews and is based on the tune of Johnnie Hamp 's 1929 song \" (Keep Your) Sunny Side Up \" at an increased tempo. At the time, \"(Keep Your) Sunny Side Up\" was the theme song for the popular Melbourne-based TV show Sunnyside Up .  The official version of the song was recorded in 1972 by the Fable Singers and is still used today.  , The song, as with all other AFL clubs, is played prior to every match and at the conclusion of matches when the team is victorious. , Songwriter Mike Brady , of \" Up There Cazaly \" fame, penned an updated version of the song in 1999 complete with a new verse arrangement, but it was not well received. However, this version is occasionally played at club functions. , The club's mascot is named Skeeta Reynolds, named after Dick Reynolds. He is a mosquito, created in honour of the team's back-to-back Premierships side in the 1920s known as the Mosquito Fleet. He was first named through a competition run in the Bomber magazine - \"Skeeta\" being the winning entry. This was later changed by the AFL to Skeeta Reynolds. He appears as a red mosquito in an Essendon jumper and wears a red and black scarf. , Notable supporters include Andrew Bogut , Australian basketball player,  and Dante Exum , Australian basketball player.  Steve Irwin was also a supporter.  , Essendon has a four-way rivalry with Carlton , Collingwood and Richmond , being the four biggest and most supported clubs in Victoria. Matches between the clubs are often close regardless of form and ladder positions. If out of the race themselves, all four have the desire to deny the others a finals spot or a premiership. Essendon also has a fierce rivalry with Hawthorn stemming from the 1980s. , The current Chairman is former Toll Holdings managing director Paul Little after David Evans made the decision to leave due to health concerns. David Evans was appointed at the club's Annual General Meeting on 21 December 2009.  He succeeds Ray Horsburgh (Chairman since 2006) who will remain as a board member for the remainder of his term. David is the son of former club chairman Ron Evans (1988–1992). , On 25 August 2008, Samsung was announced as major sponsor of the Essendon Football Club in a three-year deal touted as the biggest individual annual club sponsorship in AFL history .  The deal included Samsung having naming rights on the front and back of the club jumper and signage. Although the amount was only confirmed by the club as a very significant lift from where 3 were , it was estimated to be worth around $7 million in total.  , The club's apparel is currently produced by Adidas .  , See Essendon Football Club honours See W. S. Crichton Medal , 1891 , 1892 , 1893 , 1894 , 1882 , 1884 , 1885 , 1897 , 1901 , 1911 , 1912 , 1923 , 1924 , 1942 , 1946 , 1949 , 1950 , 1962 , 1965 , 1984 , 1985 , 1993 , 2000 , 1898 , 1902 , 1908 , 1941 , 1943 , 1947 , 1948 , 1951 , 1957 , 1959 , 1968 , 1983 , 1990 , 2001 , 1981, 1984, 1990, 1993, 1994, 2000. , 1898, 1911, 1923, 1924, 1942, 1946, 1948, 1950, 1962, 1968, 1984, 1985, 1990, 1993, 1999, 2000, 2001. , Awarded to Minor Premiers since 1991 1951, 1953, 1957, 1968, 1990 (tied) , 1993, 1999, 2000, 2001. , VFA: 1896 ; VFL/AFL: 1943 , 1996 . , 1921, 1941, 1950, 1952, 1968, 1983, 1992, 1999. , 1907, 1918, 1921, 1933 , To celebrate the 125th anniversary of the club, as well as 100 years of the VFL/AFL, Essendon announced its \"Team of the Century\" in 1997.  , 1981-2007, Coached 634 Won 386 Lost 242 Drawn 6 , , In 2002, a club panel chose and ranked the 25 greatest players to have played for Essendon.  , Head coach , Assistant coaches , The Essendon reserves team first competed in the Victorian Football League 's reserves competition when the competition was established in 1919. The team enjoyed success in the form of eight premierships between 1919 and 1999, including the last Victorian State Football League year in 1999. From 2000 until 2002, the club's reserves team competed in the new Victorian Football League competition. , At the end of 2002, the club dissolved its reserves team, and established a reserves affiliation with the Bendigo Football Club in the VFL. The affiliation ran for ten years from 2003 until 2012, allowing reserves players from the Essendon list to play with Bendigo. , The club re-established its reserves team in 2013, seeking greater developmental autonomy, and the reserves team has since competed in the VFL. The team plays its home games at Windy Hill .  The team is made up of AFL senior listed players and VFL contracted players. , a Essendon refused to play the Grand Final in Geelong, so the premiership was awarded to Geelong. "
}
