{
  "category": "afl",
  "article": "The Geelong Football Club , nicknamed The Cats , is a professional Australian rules football club, named after and based in the city of Geelong , playing in the Australian Football League (AFL). The club has been the VFL/AFL premiers nine times, with three in the AFL era (since 1990). Geelong has also won nine McClelland Trophies , a record it shares with Essendon .   , Formed in 1859, Geelong is the second oldest club in the AFL after Melbourne and one of the oldest football clubs in the world.  The club participated in the first football competition in Australia, winning the second season in 1863, and was a foundation club of the Victorian Football Association (VFA) in 1877 and the Victorian Football League (VFL) in 1897.  , An early VFL powerhouse with six premierships up to 1963, Geelong developed a reputation as an under-achieving club. Despite playing in five losing Grand Finals , four between 1989 and 1995, its fans waited 44 years until it won another premiership—an AFL-record 119-point victory in the 2007 AFL Grand Final .    Despite recording the most successful home and away season in the game's history, the club went one win short of back-to-back premierships in losing the 2008 AFL Grand Final to Hawthorn, but won the 2009 Grand Final against St Kilda. This was followed up with another Grand Final victory, in 2011 against Collingwood . With three premierships since the commencement of the AFL in 1990 they are the second most successful side behind Hawthorn who have won four premierships. , The club's home ground is Kardinia Park (currently also known by its sponsorship name \"Simonds Stadium\"). However, the club also hosts home matches at the Melbourne Cricket Ground and Docklands Stadium . The club's traditional guernsey colours are white with navy blue hoops, white shorts and navy and white hooped socks and the team song is \"We Are Geelong\". The club's nickname, the \"Cats\", was first used in 1923 after a run of losses prompted a local cartoonist to suggest that the club needed a black cat to bring it good luck. , , , The Geelong Football Club was formally established at a meeting held in the Victoria Hotel on 18 July 1859.  The club is one of the oldest football clubs in the world; however, many of its official records before 1920 have disappeared.  , Geelong travelled to Melbourne to become the second winner of the Caledonian Challenge Cup in 1863, played under compromise rules. Geelong's George Reynolds Rippon kicked the winning goal to defeat Melbourne to take the cup. The club contested the final in 1867 and 1869. , Tom Wills , one of the founders of Australian football, played exclusively for Geelong from 1865 until his retirement from football in 1874. As Geelong's captain, he pioneered the Australian football tactic of flooding .  , Geelong played most of its early home games at the Argyle Square, situated between Aberdeen Street and Pakington Street. However, in 1881 the club was evicted from the ground by the private owner who ploughed up the paddock because the club had neglected to pay its rent.  , Geelong moved to Corio Oval for the 1878 season – the year the club won its first VFA premiership in only the second VFA season.  , The Geelong Football Club was among the most powerful in the VFA ( Victorian Football Association ), winning seven VFA premierships up to the birth of the VFL ( Victorian Football League ) in 1897.  Geelong was the only non-Melbourne-based team at a time when a trip from Geelong to Melbourne involved quite an arduous journey. Notable was Geelong's success in \"The Match of the Century\" in 1886. This first grand final in the VFA between two previously undefeated teams, Geelong and South Melbourne, stimulated unprecedented public interest. It was alleged that saboteurs attempted to destroy one of the special trains carrying Geelong supporters to the match in South Melbourne. The victorious Geelong team were treated to an impromptu public parade in the enemy territory of South Melbourne. , Geelong helped form the new VFL with other foundation clubs, Carlton, Collingwood, Essendon, Fitzroy, Melbourne, South Melbourne and St Kilda. , For many years the Geelong Football Club were known as the Pivotonians , after the city's nickname 'The Pivot'. Seagulls was also an earlier nickname. The dark blue and white hooped uniform still worn today represents the blue water of Corio Bay and the white seagulls so numerous in the Bay. Geelong was nicknamed the 'Cats' in 1923 after a run of losses prompted a local cartoonist to suggest that the club needed a black cat to bring it good luck. Soon after, during a match a black cat ventured on to the ground. Geelong won that match, breaking the losing streak. Geelong has ever since been known as the Cats. , Despite dominating in the VFA, Geelong found the premiership harder to win in the VFL. In 1897, the inaugural season of the VFL, no grand final was played, but instead a round-robin finals system. Essendon won all three of its games, while Geelong lost to Essendon during this series. As a result, Geelong finished second in the inaugural season, a good start to the new league. , Geelong performed poorly early on in the 1923 season . In the lead-up to the club's Round 9 clash against favourites Carlton, the Herald Sun published a depiction of the match by cartoonist Sam Wells, featuring a black cat wandering onto the field to give Geelong good luck. Credit was given to the cat when Geelong recorded an upset win. Geelong captain Bert Rankin liked the analogy and suggested the club adopt \"the Cats\" nickname, even recruiting key position forward Lloyd Hagger , a talented artist, to design a cat that was made into badges for the players to wear on their lapels.   , Geelong finally won its first VFL premiership in 1925.  , The VFL/AFL's award for the fairest and best player in a season is named after Charles Brownlow , a Geelong and VFL administrator who died in early 1924. The first player to win the award was Geelong's champion, Edward Greeves , in 1924. Greeves attained a second and third place in votes for the award in later seasons, emphasizing his skill and sportsmanship. , Geelong followed up on its 1925 Premiership with wins in 1931 and 1937.  The 1937 Grand Final is widely regarded as a game of the highest quality, remembered for its long and accurate kicking and high marking. During this era the Coulter Law discouraged club administrators from poaching players from each other's clubs. For many footballers who were seldom more than semi-professional sportsmen, match payments supplemented Great Depression -hit wages. , In 1941, the club moved from Corio Oval to the more centrally located Kardinia Park in South Geelong . Geelong experienced a lean period in the 1940s. World War II wartime restrictions prohibited travel in 1942 and 1943 even for the purposes of playing football. Geelong had always been particularly subject to what Geoffrey Blainey , a notable Australian historian, author of A Game of Our Own , and Geelong supporter, termed the \"tyranny of distance\". Despite these handicaps, at war's end the club recruited many players who represented the club during its most successful era in the early 1950s. , In the 1950s, Geelong flourished. Led by Geelong's greatest coach (officially named at Geelong's Team of the Century 2000) Reg Hickey , Geelong won two consecutive premiership flags of 1951 and 1952.  In 1951 the Ford Motor Company signed on as a corporate sponsor of the Geelong Football Club.   This relationship has persisted to the present day. , Geelong won the 1951 Premiership under memorable circumstances. Essendon was favoured to win the third of a hat-trick of premierships. However, in the final round of the home and away season Essendon's champion full forward, John Coleman retaliated against Carlton full back, Harry Caspar and was reported and later suspended for four weeks. He therefore was unable to play in the grand final. Bob Davis acknowledges the possibility that had Coleman played, Essendon may well have won, given that Geelong had no true match for him, as Coleman was simply too skilled. , To celebrate its good fortune, Geelong buried a toy bomber in the Kardinia Park turf. This comical ceremony was inspired by the rumour that Geelong's premiership players of 1937 had buried a magpie in the middle of the ground after their premiership win over Collingwood that year. Players of note in this golden era include Bob Davis, Leo Turner (father of future star, Michael Turner ), Peter Pianto , Fred Flanagan , and Bernie Smith . Bernie Smith's quality was recognised with his win in the 1951 Brownlow Medal . In 1952, Geelong easily defeated Lou Richards ' Collingwood team. To celebrate the win, the next day the players buried another dead magpie in the middle of Kardinia Park. In 1953, Collingwood defeated Geelong in the Grand Final. , In 1956, Geelong recruited Billy Goggin , Geelong's greatest rover, who also coached Geelong in the 1980s. , At the end of 1959, Reg Hickey decided to retire as coach, making way for Bob Davis , a star in the 51–52 Premierships. , Geelong's most notable recruitment coup ever was the transfer of perhaps the greatest ruckman of all time, Graham \"Polly\" Farmer from East Perth. At Geelong's first practice match, a crowd of 20,000 attended just to witness his legendary skills. , In 1962, another of Geelong's star players, Alistair Lord won the Brownlow Medal playing in the centre. His twin, Stewart Lord also played with the club and has been credited as the main reason his brother won the award given their similarities in appearance, both played significant roles in the club's premiership win. High expectations of success were somewhat disappointed in 1962. Graham Farmer injured his knee three times during the season, causing him to miss crucial games. However, as Farmer's and Goggin's partnership developed from 1963 onwards, their teamwork at ruck duels inspired admiration and envy. These two players spearheaded the club's next premiership in 1963.  , In 1963, Geelong played Hawthorn four times. Early in the season the clubs played a draw. However, in the final round of the season, the semi finals and the grand final (the only instance of a team playing three matches in a row against one other team – Hawthorn does not have that claim as it played Melbourne in the intervening Preliminary Final), Geelong defeated John Kennedy's Hawthorn (the Hawks). Captained by Fred Wooller , Geelong clearly distinguished itself as the team of 1963 with an easy 49 point win. A dead hawk joined two magpies and a toy bomber under the Kardinia Park turf.  , Frustratingly for supporters of the Club, 1963 was the last time that Geelong enjoyed premiership success until 2007. , At the beginning of 1964, Geelong recruited John \"Sammy\" Newman as a ruckman from Geelong Grammar School . In an interview with Lou Richards on Channel 7's World of Sport , Bob Davis predicted that Newman would enjoy a stellar career. Sam Newman played 300 games for Geelong and went on to become a prominent, if controversial, media personality. , Geelong played in finals in every year between 1962 and 1969. Graham Farmer succeeded Fred Wooller as captain in 1965, leading the club until the end of 1967. In 1966, the Geelong Board decided to declare the coaching position open. Applications were sought but Bob Davis declined to reapply. The Board chose Peter Pianto as Davis' replacement. Pianto coached Geelong to the 1967 Grand Final. Geelong narrowly lost this match by nine points to Richmond. Graham Farmer played his 101st and final match for Geelong on this day. , The 1970s Geelong Football Club achieved mediocre results. The club fell behind the progressive clubs of the 1970s, notably Carlton , Richmond , Hawthorn and North Melbourne . Unlike these clubs, Geelong recruited poorly and/or could not afford to recruit quality footballers. During the 1970s footballers increasingly came to view the game as a profession rather than a pastime. Richer and more entrepreneurial clubs outbidded clubs like Geelong for talented and dedicated players.  Coaches Graham Farmer and Rodney Olsson failed to develop successful teams. Geelong finished fourth in the 1976 season. The club won its only final of the 1970s by defeating fifth-placed Footscray. Geelong lost to North Melbourne in the second week of the finals. In 1978 Geelong finished fifth, only to lose to Carlton in the first week of the finals. One of the few noteworthy players was Larry Donohue , who in 1976 kicked over 100 goals to lead the VFL goal kicking. 1978 yielded him 95 goals. , During the 1980s Geelong recruited well but underperformed on the field. , In 1980, coached by Billy Goggin , Geelong finished on top of the ladder at the home and away season. Geelong defeated Richmond once during the season but could not do it again in the first week of the finals. Geelong played Collingwood in the Preliminary Final for the right to play Richmond in the Grand Final and lost the match. , In 1981 Geelong's finals campaign inflicted more heartbreak. Geelong beat Collingwood in the Qualifying Final but lost to Carlton in the Second Semi-Final. Geelong were beaten by Collingwood by the narrow margin of seven points when they clashed again in the Preliminary Final. , In 1982 the club collapsed on-field, missing the finals. The board sacked Billy Goggin. Richmond premiership coach Tom Hafey took over in 1983. However, the club did not improve under Hafey. Geelong failed to play in the finals during Hafey's tenure. One bright moment during the Hafey years was the recruitment of former Hawthorn player Gary Ablett from Myrtleford for the 1984 season. In his first season, Ablett won his only Best and Fairest for the club, an early indication of Ablett's football genius. , The most notable incident for the club in 1985 was when Hawthorn legend Leigh Matthews swung his arm at ruck-rover Neville Bruns ' jaw and broke it. The incident received huge media coverage. Matthews was charged by police. Although the law courts did not punish Matthews, the VFL suspended his playing permit for one month. , The club also recruited future champion midfielder and dual Brownlow Medallist, Greg Williams and another future Brownlow Medallist and three-time club champion, Paul Couch . Due to a lack of on-field improvement during his tenure as coach, Tom Hafey was sacked at the end of the 1985 season. Hafey was soon afterwards appointed coach of the Sydney Swans . Three players followed him to Sydney: David Bolton , Bernard Toohey , and Greg Williams . , In 1986, John Devine , a member of the 1963 Premiership team, was appointed as coach. Under Devine, the club recruited Barry Stoneham , Garry Hocking , Mark Bairstow and Billy Brownless . Geelong's recruiters demonstrated that they had adapted to the new system of the player salary cap introduced in 1985 and the AFL Draft introduced in 1986. [ citation needed ] However, the club missed the finals during Devine's tenure. In 1986, as a sign of things to come, Paul Couch won the first of his three club best-and-fairest awards. In 1987 Geelong missed the finals. , In the pre-season of 1988, in a foretaste of approaching frustrations, Geelong contested with Hawthorn for the pre-season cup, the National-Panasonic Cup . Geelong lost by two points despite being in control for much of the match. Geelong underperformed in the main competition, finishing tenth. The board sacked John Devine as coach. , In 1989 Geelong signed North Melbourne champion Malcolm Blight to coach the club. Blight's new approach had mixed results. Geelong once again contested the National-Panasonic pre-season grand final, this time against Melbourne. Once again the Cats lost. , Adapting quickly to Blight's coaching philosophy, Geelong kicked high scores. During the 1989 season, Geelong were the only club to win by 100 points for three weeks in a row, defeating lowly clubs Richmond, St Kilda and the Brisbane Bears . Gavin Exell had a productive season, kicking 61 goals during the home-and-away season, narrowly pipping team-mate Gary Ablett , who kicked 60. , Ablett's notable goalkicking feats of the year included 14 goals against Richmond, 10 against Brisbane and seven against Collingwood (where he gained 38 possessions on the wing in the wet). [ citation needed ] In this match against Collingwood, Gary Ablett also kicked the Goal of the Year . , Geelong finished third at the completion of the home-and-away season and met Essendon in the qualifying finals in the first week. Geelong's lack of finals experience was telling as Essendon ended a three-year losing streak to Geelong, thrashing them by 76 points. Gary Ablett and Shane Hamilton each kicked three goals. , Geelong then met Melbourne in the semifinals. The previous week, Essendon had assigned \"taggers\" to Geelong's midfielders, Paul Couch and Mark Bairstow . This move worked to great effect, nullifying both. Melbourne coach John Northey did the same. However, his move was considered so predictable by Malcolm Blight that he benched both Couch and Bairstow for the first quarter, throwing Melbourne's plans into disarray. The result saw Geelong easily defeat Melbourne by over 10 goals. Gary Ablett kicked seven goals as well as taking one of the marks of the year over Melbourne's Steven Febey . , The preliminary finals saw a rematch between Geelong and Essendon at VFL Park . Early on, it appeared that Essendon would repeat their win of two weeks prior. However, Geelong soon got back on track and began to kick goals. Gary Ablett continued his good form, kicking eight goals and constructing many more. The result saw Geelong cause a 170-point turnaround from a fortnight before, to comprehensively defeat Essendon by 94 points, to go into the club's first grand final since 1967. , The 1989 VFL Grand Final proved to be an epic battle. At the opening bounce, Mark Yeates , retaliating to an incident caused by Dermott Brereton in Round 6, violently bumped Brereton to try and take the match winner out of the game, breaking Brereton's ribs. During this period, Ablett had managed to mark and kick the opening goal of the match. Brereton was ordered off the ground, but refused and instead rested in the pocket. Brereton took a mark shortly after and goaled, leading Hawthorn to a 40-point quarter-time lead. Hawthorn coach Alan Jeans commented at the time that Brereton's courage was \"inspirational\". , Geelong won the second quarter by two points and the third quarter by one point so at three quarter time were still six goals down. The final quarter proved frantic, as Geelong managed to get within six points of the tiring and wounded Hawks, before the siren sounded. Gary Ablett was awarded the Norm Smith Medal for a best on ground performance in kicking nine goals and one behind to equal Collingwood's Gordon Coventry ’s goalkicking record in a grand final. His second quarter goal and third quarter marks were two of his notable highlights of the day. , To cap a remarkable season, Paul Couch won the Brownlow Medal by two votes from Hawthorn 's John Platten . , The decade of the 1990s was another era of disappointed expectations. By the end of the 1990s Geelong Football Club was in crisis, deep in debt and with a depleted player list. , Geelong failed in 1990 to reproduce the exciting brand of attacking football of 1989. Season 1991 started ominously. On the eve of the season, Gary Ablett retired for odd reasons. Nevertheless, Geelong won some games. Ablett returned mid-season to the club. The club finished third at the end of the home and away season. The final against 4th placed St Kilda was a memorable one. Tony Lockett kicked his nine goals for St Kilda by three-quarter time. Billy Brownless, kicked eight goals. The Cats managed to win by seven points. Ablett was suspended for elbowing St Kilda's Nathan Burke , and missed the rest of the season due to suspension. , Over the next two weeks, Geelong met Hawthorn and the West Coast Eagles , both losses for the club. Consistent with the close finish of 1989, Hawthorn won the match by two points. The loss against the Eagles was by fifteen points. , In 1992 Geelong returned to the spectacular form of three seasons previous. Against the Brisbane Bears at Carrara the club kicked a VFL/AFL record score of 37 goals 17 behinds (239 points). This record score still stands.  Gary Ablett Sr. and Billy Brownless both kicked more than 70 goals for the season to form a potent forward-line combination. [ citation needed ] Geelong finished the regular season on top of the ladder, eclipsing their previous record for total points scored in a home-and-away season (2916 in 1989) and increased it to 3057 points.  , After beating Footscray in the qualifying final by 61 points, Geelong lost the 2nd semi final to West Coast Eagles by 38 points, then beat Footscray again in the preliminary final by 64 points. The Cats again squared off against the power of the West Coast Eagles in the Grand Final and got off to a wonderful start, at one stage during the second quarter leading by four goals. However, in the second half West Coast's Peter Matera ran riot, booting five goals and earning himself the Norm Smith Medal as best on ground. The Perth-based West Coast won by 28 points to take the first premiership won by a non-Victorian club. , In 1993 the Geelong once again underachieved as Malcolm Blight experimented with more defensive tactics. For most of the season on-field performances were lacklustre as the players struggled to adapt. It was not until late in the season when Geelong reverted to its all-out attacking style of play. Several experienced players urged Blight to revert to Geelong's customary geisha style of play. Blight agreed and Geelong began to play like champions again. Frustratingly, Geelong narrowly missed the finals on percentage. , In 1993 Blight decided to play Gary Ablett at Full Forward permanently. The move paid handsome dividends, as Ablett reached the second fastest century in VFL/AFL history. Ablett's most notable performances of this year included 11 goals against Melbourne, 14 against Essendon and 10 against the Adelaide Crows – all in losing sides. Tallies of 10 goal against North Melbourne, and 12 against his favourite victim, Richmond, in winning sides. , 1994 proved to be a hard year for the club. The club had a good home-and-away season to finish fourth. Gary Ablett topped the goalkicking for the year easily, kicking 129 goals (including the finals) and winning his second consecutive John Coleman Medal . The club met fifth placed Footscray in the first week of the finals. The match proved a nailbiter, with an after-the-siren kick and goal by Billy Brownless giving the club a five-point win. A week later Geelong had no hope of beating Carlton , who had finished 2nd after the home and away season, given that their three best midfielders; Garry Hocking , Paul Couch and Mark Bairstow were not playing through injury. However, with several young players and second-tier midfielders, along with six goals from Gary Ablett , Geelong defeated Carlton by 33 points. Geelong met North Melbourne in the Preliminary Final in a match which proved even more nailbiting than their match with Footscray 2 weeks prior. North Melbourne started well, but Geelong dominated the second and third quarters to lead by six goals in the third quarter. A fine feat given that Geelong's target all season, Gary Ablett was being beaten by North Melbourne's full back, Mick Martyn . However, North Melbourne came back strongly in the last quarter and took the lead late in the match. However, Geelong scored a behind to level the scores. With 25 seconds left and a boundary throw-in, the ball came to ground and Martyn cleared, only for the ball to be marked by Leigh Colbert . Colbert then kicked long, where ruckman John Barnes dropped the mark, allowing Leigh Tudor , a former North Melbourne player to swoop, and kick the ball over Martyn's head to land in the hand of Gary Ablett . As Ablett walked back to take his kick, the siren went, and Ablett kicked the winning goal, propelling Geelong to its third Grand Final in seven years. , Geelong once again played West Coast for the premiership. Unlike two seasons ago, Geelong proved no match against an Eagles outfit superior to its 1992 premiership team, losing by 80 points. Billy Brownless stood out with a fantastic mark in the second quarter, as well as four goals. Malcolm Blight , dispirited by three Grand Final losses under his tenure, announced his resignation. His assistant Gary Ayres took over the job. Ayres immediately took action, sacking both Steven Hocking (on 199 games) and former captain Mark Bairstow . 1994 saw another best-and-fairest win to Garry Hocking, who also won 20 votes in the Brownlow Medal to finish third to eventual winner Greg Williams on 30 votes and Peter Matera on 28 votes. , 1995 saw the club improve. The club was highly consistent, its biggest losing margin being less than 20 points, and never losing two matches in a row – the only club to do so for the year. The club finished second on the ladder to Carlton. Gary Ablett once again won the Coleman Medal and kicked over 100 goals for the third year in a row. , In the finals the club met 7th placed Footscray and won by 82 points. The club earned a week break and returned for the third weeks clash against Richmond, and won by 78 points and so for the second consecutive season and for the fourth time in seven years, Geelong played for the premiership, this time against Carlton, who had only lost two games for the year. The match was hard to tip, as many saw Geelong a definite chance given that the two sides met once during the year, which saw Carlton win by three points. Geelong was thrashed by 61 points, playing its worst game for the entire season. Gary Ablett played his worst game for years, blanketed by Carlton's Stephen Silvagni . To add insult to injury, former Geelong player Greg Williams , now a superstar at Carlton, was named best on ground with his five goals. A notable rookie of this year would be Brenton Sanderson , who would play over 200 games by the end of career, retiring at the end of 2005, and be recognised with selection into the Geelong Hall of Fame. The Best and Fairest was won by Paul Couch , who narrowly missed out on winning his second Brownlow Medal . , In 1996 the club would experience an unsuccessful year, finishing seventh at the end of the home and away season. Gary Ablett would be suspended for five weeks after round 2, which resulted in a rapid decline in his quality. He would kick his 1000th career goal against Fremantle. The cats would meet eventual premier, North Melbourne in the first week of the finals, which saw North win by over 10 goals. Garry Hocking would once again win the Best and Fairest award, and miss out on the Brownlow Medal by a vote in the process. A notable recruit would be Steven King , standing at over two metres tall. , In 1997 Geelong faced a season with no dependence on ageing superstars, Paul Couch and Gary Ablett . By mid season, Couch would retire on 259 games. Gary Ablett would not play a senior game ever again for the club after injuring his knee in the reserves. The club would start the season well, challenging Carlton to the 1997 Pre-season Premiership, the Ansett Australia Cup. However, identically to 1995, Geelong capitulated, allowing Carlton another piece of silverware. The club finished second on the ladder. The club met North Melbourne in a \"home\" final at the MCG at Night. North Melbourne, on its actual home ground beat Geelong by 18 points. Geelong then travelled to Adelaide and lost the game by eight points after the umpire failed to pay a courageous Leigh Colbert mark late in the game with Geelong narrowly hanging on to a lead, exiting by losing both finals. , 1998 was a season best forgotten. The club finished 12th, its lowest finish for over 40 years. A notable recruit for Geelong came in the form of Matthew Scarlett , son of former player, John. Geelong took full advantage of the Father-Son Rule . This concession allowed sons of ex-players to nominate for their fathers' clubs, thus exempting them from being chosen by any other club in the national draft. , In 1999 the club won five games straight to open the season. However, the club then lost its next 9 to finish the season with 10 wins and tenth position. The roller-coaster season saw coach Gary Ayres quit to take the job at Adelaide, which ironically was available after Malcolm Blight quit, almost identical to when Ayres took over Geelong in 1995. Mark Thompson was appointed coach. At the end of this season, Geelong traded Leigh Colbert for North Melbourne premiership player, Cameron Mooney . , The 2000 season started well, with Geelong winning its first three matches. By the end of the home and away season Geelong finished fifth and met eighth placed Hawthorn in the first finals match ever played at Docklands Stadium, the AFL's state-of-the-art facility. Hawthorn won by nine points. Barry Stoneham announced his retirement after this game, ending a career spanning over 240 games. This was also the year that the club entered a reserves team into the Victorian Football League. , 2001–2003 saw a lean period for the club where finals were not realised for three years – finishing twelfth, ninth and twelfth respectively.  However, during this time the club recruited well. Current players such as Steve Johnson , Gary Ablett, Jr. , Jimmy Bartel , James Kelly and Andrew Mackie were notable recruits. Veteran Brenton Sanderson won the Best and Fairest in 2001, Steven King in 2002 (who was in that year appointed club captain) and Matthew Scarlett in 2003. There was one highlight of this period, with Geelong winning the 2002 VFL premiership against Port Melbourne. , In 2004 Geelong challenged for the pre-season premiership (known as the Wizard Home Loans Cup), where they met St Kilda in the grand final. Geelong led for much of the match, but St Kilda finished strongly to win by 22 points. The season proved fruitful as the club finished fourth at the end of the home and away season. The club met eventual premier, Port Adelaide at AAMI Stadium / Football Park in Adelaide , historically Geelong's worst ground in terms of wins. Port reaffirmed their superiority at the venue to win by 55 points. Geelong soldiered on, however, and met Essendon at the MCG , winning by ten points despite leading by over six goals at three quarter time. Geelong then met Brisbane , the premiers of 2001–2003. The Cats dominated the first half but it was clear the club lacked a target up forward. In the second half, Brisbane took control and steadied enough to win by a small margin of nine points. Post season, Geelong signed Nathan Ablett to play AFL football for Geelong. Another major signing was disgruntled Richmond big-man Brad Ottens , recruited to counter Geelong's lack of forward line height. Cameron Ling capped off a fine season by winning his first Best and Fairest after finishing runner up in the previous two counts. , The club started very well in 2005, before hitting a slump mid-season as injuries took their toll. By the end of the season, Geelong finished sixth and played seventh placed Melbourne. Geelong thrashed Melbourne by 55 points in a match remembered for Steven King 's attempted kick of the ball in mid air, accidentally making contact with Melbourne ruckman Jeff White , smashing his face, which required surgery. The next week the club met Sydney at the Sydney Cricket Ground (SCG) where the Cats led for the majority of the match. A four goal lead at three quarter time in a low scoring match saw Geelong in a strong position. A stunning final term performance by Sydney's Nick Davis that saw him kick four goals including the winning snap three seconds before the siren denied Geelong victory. Sydney later went on to become the 2005 Premiers. This was Brenton Sanderson 's final game. Joel Corey won his first Best and Fairest. , Season 2006 began promisingly, but ended with criticism by club members of the performance of the club. Geelong beat Adelaide to claim the pre-season NAB Cup . Big wins at home against the Brisbane Lions and Kangaroos in the first two rounds fuelled optimism. However, Geelong began to underperform, losing some close encounters and suffering some humiliating defeats. In the final game of the year, the Cats were soundly beaten by Hawthorn for the second time. Geelong finished tenth on the ladder with ten wins and a draw. Responding to member anger, the Board ordered a comprehensive review of all aspects of the administration of the club and of the club's personnel. Coach Mark Thompson was widely perceived to be at risk. However, the review accepted that Thompson should continue as coach. The Board opted for stability over the uncertainty of radical personnel change. Thompson was publicly outraged by the ordeal which he considered poorly handled. [ citation needed ] , It appeared Geelong would repeat the outcome of the previous season after five rounds of the 2007 season, where Geelong was positioned tenth on the ladder with two wins and three losses, with the latest loss being against the Kangaroos at Skilled Stadium. Following this unexpected loss at their home ground, player Paul Chapman publicly criticised the club's culture,  expressing frustration at the lack of team mentality present with many of the players,  and urging the club as a whole to change this underachieving culture for the better.  Chapman's criticisms, which followed a similar assessment from coach Mark Thompson,  led to a group discussion involving all of the club's playing and coaching staff,  and produced frank assessments of both individuals and the club in general.  This session proved to be a catalyst for the club to begin a transformation of the club's culture, and resulted in a 157-point defeat of Richmond, with Geelong's score of 222 points the club's third-highest overall.  This was the beginning of a winning-streak where the club won 15 games in succession before losing to the second-placed Port Adelaide in round 21. Geelong then succeeded in winning their remaining match of the regular season, where they finished three games clear of Port Adelaide in first position on the ladder, earning the club their first McLelland Trophy since 1992, and qualification for the season's finals series . , Geelong proceeded to defeat the Kangaroos and Collingwood in their qualifying and preliminary finals respectively, the latter being a close game with Collingwood threatening victory late in the match. Geelong ultimately won the match by five points. , These two victories ensured Geelong a place in the 2007 AFL Grand Final against Port Adelaide, which Geelong won by a record margin of 119 points. Geelong scored 24 goals and 19 points for a total of 163 points, compared to the six goals and eight points scored by Port Adelaide for a total of 44 points. Steve Johnson was awarded the Norm Smith Medal after being judged the best player in the match, providing Geelong with just their second Norm Smith Medallist . Cameron Mooney scored the highest number of goals with five, and a total of 11 Geelong players scored at least one goal, with five of those players scoring two goals or more. The win was Geelong's first premiership since 1963, and broke the club's 44-season premiership drought. The club had also won the 2007 VFL premiership against Coburg the weekend before. , Geelong changed their name to the Geelong Cats in 2008 and continued to dominate with the club having a regular season record of 21 wins and one loss to become the best-performing team in the home-and-away season since Essendon in 2000. The club's sole loss occurred in Round 9 with an 86-point deficit against Collingwood. Geelong finished the regular season in first position on the ladder, earning the club a second-consecutive McClelland Trophy, its ninth overall. Geelong then proceeded to win its qualifying and preliminary finals in succession, earning a place in the 2008 AFL Grand Final against Hawthorn and the chance for a second-consecutive premiership. However, Geelong failed to capitalise on its performance during the season, losing the grand final by a margin of 26 points. , Geelong's season began strongly in 2009, with the club winning the 2009 NAB Cup and managing a successive run of victories for the opening 13 rounds of the season. The winning streak was broken when Geelong were defeated by St Kilda in Round 14 by six points. Geelong managed to defeat the reigning premiers, Hawthorn, in the two clubs' second meeting of the season in Round 17. The match was notable with Geelong successfully completing a comeback from a 28-point deficit early in the final quarter to record a victory when an after-the-siren kick Jimmy Bartel scored a point and resulted in a win. Despite not placing first on the ladder at any point during the regular season, Geelong managed a regular-season record of 18 wins and four losses, which was the first time a team had won 18 or more matches in the VFL or AFL's regular season for three consecutive seasons.  After qualifying for the 2009 AFL finals series , Geelong proceeded to win its qualifying and preliminary finals in succession, earning a place in the 2009 AFL Grand Final against St Kilda. Geelong were victorious, defeating St Kilda by 12 points. , This victory marked the first time since 1984 that a grand final had been won by a team which had been trailing at all breaks. The Norm Smith Medal was awarded to Paul Chapman, after gathering 26 possessions and scoring three goals, including the goal which effectively won the match for Geelong. , In addition to the premierships and Norm Smith Medallists, this era of success for the Geelong Football Club was capped by supplying Brownlow Medallists (Bartel and Gary Ablett, Jr. in 2007 and 2009 respectively). Between 2007 and 2009, Geelong players received 13 individual selections in All-Australian teams over the three seasons, including a record nine selections in the 2007 team . Other individual successes include Ablett winning the Leigh Matthews Trophy as the AFL Players Association (AFLPA) Most Valuable Player on a record three occasions and for a record three consecutive seasons from 2007 to 2009. , In 2010, Geelong did not reach the grand final. At the start of 2011, Geelong was all but written off, after coach Mark Thompson left at the end of the 2010 season and the move of Gary Ablett Jr to the Gold Coast Suns. Despite an aging player list and a first year coach in Chris Scott, Geelong managed to beat the reigning premiers, Collingwood, in the two home and away matches that they played against each other. Geelong were the only team to beat Collingwood in the 2011 season and finished second on the ladder behind Collingwood. On 1 October 2011, Geelong and Collingwood played at the MCG for the 2011 AFL Grand Final . With the lead changing a number of times during the game, Geelong gained the lead in the third quarter and did not relinquish it for the rest of the game, with Collingwood failing to score a goal in the last quarter. Jimmy Bartel of Geelong was awarded the Norm Smith medal for the best on ground. , The club has also had a team in the Victorian Football League since the 2000 season which has won three VFL premierships: 2002 against Port Melbourne, 2007 against Coburg and 2012 against Port Melbourne. , Note: This list and details are incomplete , Geelong's traditional navy blue and white hooped guernsey has been worn since the club's inception in the mid-1800s. The design is said to represent the white seagulls and blue water of Corio Bay .  , The team have worn various away guernseys since 1998, all featuring the club's logo and traditional colours.  , \"We Are Geelong\" is the song sung after a game won by the Geelong Football Club. It is sung to the tune of \" Toreador \" from Carmen . The lyrics were written by former premiership player John Watts . Only the first verse is used at matches and by the team after a victory. The song currently used by the club was recorded by the Fable Singers in April 1972.  , Head coach , Assistant coaches , , The Geelong reserves team began competing in the VFL Reserves competition with the league's other reserves teams from 1919. From 1919 to 1991 the VFL/AFL operated a reserves competition , and from 1992 to 1999 a de facto AFL reserves competition was run by the Victorian State Football League . The Geelong Football Club fielded a reserves team in both of these competitions, allowing players who were not selected for the senior team to play for Geelong in the lower grade. During that time, the Geelong reserves team won thirteen premierships (1923, 1924, 1930, 1937, 1938, 1948, 1960, 1963, 1964, 1975, 1980, 1981, 1982), the most of any club. , Since the demise of the AFL reserves competition, the Geelong reserves team has competed in the new Victorian Football League , having won three premierships in that time. Unlike all other Victorian AFL clubs, Geelong has never operated in a reserves affiliation with an existing VFL club, having instead operated its stand-alone reserves team continuously. The team is composed of both reserves players from the club's primary and rookie AFL lists, and a separately maintained list of players eligible only for VFL matches. Home games are played at Simonds Stadium , with some played as curtain-raisers to senior AFL matches. , a Essendon refused to play the Grand Final in Geelong, so the premiership was awarded to Geelong. "
}
