{
  "category": "afl",
  "article": "The Hawthorn Football Club , nicknamed The Hawks , is a professional Australian rules football club in the Australian Football League (AFL). The club, founded in 1902, is the youngest of the Victorian -based teams in the AFL and has won twelve VFL/AFL premierships; renowned as the only club having won premierships in each decade of the 1960s, 1970s, 1980s, 1990s, 2000s and 2010s. The team play in brown and gold vertically striped guernseys . The club's Latin motto is spectemur agendo , the English translation being \"By our deeds we shall be known\". , The Hawks' origins are in the inner-eastern Melbourne suburb of Hawthorn and also at Glenferrie Oval , the club's former administrative and training base and social club. Matches, however, have not been played there since 1973. In 2006, Hawthorn's training and administration facilities were relocated to Waverley Park in the middle of the club's major supporter base in Melbourne's outer-eastern region. Since 2007 Hawthorn have played four games a year at their second ground of York Park in Launceston , Tasmania, with the remaining games played at the Melbourne Cricket Ground , the club's current playing home ground . Hawthorn's current Victorian Football League (VFL) affiliate team is the Box Hill Hawks Football Club . , . , The official club history books and many supporters strongly believe that the club's origins date back to its founding in 1873 at a meeting at the Hawthorne Hotel.  , Although a Hawthorn Football Club did indeed form at this time – and the region has since continuously been represented by a football team – it was not the Hawthorn which competes at AFL level today. It is likely that today’s club is actually the third club to carry the name ‘Hawthorn Football Club’. In The Daily Telegraph of 12 May 1883 it is stated that “The Hawthorn Club having disbanded, all engagements for the ensuing season have been cancelled.” In 1889 the Riversdale Football Club (formed in 1880) is reported to have changed its name to the Hawthorn Football Club. This club also ceased in 1890. No Hawthorn club existed from 1890 to 1892. , A new representative club, called the ‘Hawthorn Football Club’, was formed in 1893. It competed in the Victorian Junior Football Association until 1898. Without a ground to play on, however, the club was disbanded in 1899. , In March 1902, Alf Kosky formed a club from the various district clubs under the banner of Hawthorn Football Club to compete in the Metropolitan Junior Football Association.  The club merged with Boroondara (late Waterloo) in 1905 and adopted Boroondara's colours of a black guernsey with red sash but retained the name of Hawthorn. In 1906 Hawthorn merged with successful junior club the Hawthorn Rovers to form the Hawthorn City Football Club as a result of Glenferrie Oval opening. The club was reformed in 1912, changing to a gold guernsey with a blue V. The council then applied to the Victorian Football Association (VFA) for inclusion which was granted in 1914 when Hawthorn replaced the disbanded Melbourne City club. , The first task for the club was to decide on club colours, their jumper of blue and gold was already taken by Williamstown so a change was required. At a Special General Meeting held on 17 February 1914, a Mr J. Brain proposed brown and gold as the new colours and the motion was carried. , The Mayblooms won three games and a draw in their first season in the VFA. The effect of World War I with players enlisting caused the club to finish last in 1915. The VFA then went into recess in 1916 and 1917, and Hawthorn did not compete when resumption occurred in 1918. Upon Hawthorn’s resumption in 1919 it was more competitive winning eight games and finishing sixth out of ten teams. Hawthorn dropped to eighth in 1920 but in 1921 they won seven games and finished sixth. , Bill Walton was appointed captain-coach of Hawthorn in 1922. He was however refused a clearance by Port Melbourne and as a result spent the season playing for them, while coaching Hawthorn during the week. Twice that season, he had the unusual situation of playing a VFA game against the club that he coached. In one of those matches a Port Melbourne teammate had to be restrained from striking Walton over Walton's vocal support for the player's opponent. In 1922 the club missed the finals by percentage and Hawthorn set a new record score in the VFA scoring 30.31.211 to Prahran 6.9.45. In 1923 he was granted his clearance and the club made the finals finishing in fourth place and then losing to Port Melbourne in the first semi-final. 1924 the club finished fifth, missing the finals by four points. , Since 1919 the VFL had nine clubs which caused one team to be idle every Saturday. The VFL was keen to do away with this bye via the admission of a tenth club. In 1924 a group calling itself the Hawthorn Citizens’ League Campaign Committee began gathering support for the football club admittance to the VFL. Other representations came from Brighton, Brunswick, Footscray, North Melbourne, Prahran, Camberwell and Caulfield. , On the night of 9 January 1925 a committee meeting of the VFL, chaired by Reg Hunt of Carlton , decided to expand the competition from nine clubs to twelve. It was decided in the meeting to admit the \"Hawthorn Football Club\", along with Footscray and North Melbourne , all three coming from the Victorian Football Association (VFA). Hunt originally recommended Hawthorn, Footscray and Prahran but eventually North Melbourne was substituted for Prahran because of ground control matters. , The Mayblooms , as they were then known became the perennial whipping boys of the competition. Hawthorn had an almost casual attitude towards playing football and, lying remote from major industrial areas and consequently devoid of the business or political patrons available to Carlton , Richmond and Collingwood ,  were not able to even pay their players the match payment then allowed by the Coulter Law. Despite the presence of a number players of true class such as Bert Hyde , Bert Mills , Stan Spinks , Alec Albiston and Col Austen , Hawthorn never won more than seven games in a season in its first seventeen years in the League. , Roy Cazaly was the non-playing coach of Hawthorn in 1942, he was reported to have given the club its nickname the “Hawks” on the suggestion of one of his daughters. Cazaly thought that it was tougher than their original nickname the “Mayblooms” and 1943 turned out to be the club's best season since joining the VFL in which the club missed the finals only by percentage. However, Hawthorn immediately returned to the bottom of the ladder, consistently competing with St Kilda for the wooden spoon. Between 1944 and 1953 the club finished last or second last in every year but one. , Half back flanker Col Austen tied with South Melbourne ’s Ron Clegg for the 1949 Brownlow Medal but was not awarded it based on the “countback” system in place at that time. The League later changed the system for tied results and, in 1989, he was awarded the medal retrospectively. , 1950 started with the club in turmoil, The club appointed Bob McCaskill as coach and he wanted Kevin Curran to be captain. Outgoing captain-coach Alec Albiston was angry as he was told by a member of the board that he would remain as captain. Brownlow Medallist Col Austen sided with Albiston and a split occurred. The board sided with the new coach and gave Albiston and Austen open clearances. Without the club’s best two players, the team did not win a match in 1950 . New captain Kevin Curran was suspended for striking Austen on the first occasion Hawthorn and Austen’s new club Richmond played. , The club decided to changed its playing jumper to the brown and gold vertical stripes. , Two positives were the arrival of John Kennedy and Roy Simmonds . Over the next ten years, Kennedy would play 169 games for Hawthorn, serving as Captain from 1955 until his retirement in 1959, and winning the club’s Best and Fairest award four times (in 1950, 51, 52 and 54). Simmonds would play 192 games and win the club's Best and Fairest award in 1955. , In 1952 Jack Hale took over as coach, Hale had been Bob McCaskill ’s assistant, but McCaskill’s health was failing and he died in June 1952. Aided by dividends from the VFL’s finals revenue making the club more competitive financially  – despite no Hawthorn team in any grade playing VFL finals to that point  – this proved the decisive step in the movement of Hawthorn away from the bottom of the ladder. He eliminated the casual attitude that prevailed at the club during its first thirty years in the VFL and made the club less accepting of defeat than before. Although Hawthorn finished last in 1953, from the following year improvement was steady. , Hawthorn had their first recruitment coup in 1954 by signing Clayton “Candles” Thompson from South Australia. Thompson was the glamour player from the 1953 National Football Championships, kicking ten goals against Western Australia. Fresh from school, teenagers John Peck , Allan Woodley , Noel Voigt and Brian Kann started at Hawthorn and the club won eight games. Gifted schoolboy from Sandhurst , Graham Arthur , arrived in 1955 and became the second player to win the club’s Best and Fairest in his first year, the other being John Kennedy . Brendan Edwards followed Arthur to Hawthorn in 1956 and, although the seniors showed a slight decline to seven wins and a draw, the reserve grade side gave Hawthorn a first finals appearance in any grade.  , In 1957 the senior team broke through for their first finals appearance, defeating Carlton in the 1st Semi Final long remembered for the freak hailstorm after half-time. It was a surreal look of the MCG covered in golfball size hailstones. They were outclassed by Melbourne in the preliminary final. , After three seasons in mid-table Hawthorn appointed John Kennedy as coach in 1960. Kennedy and 1960 Club Champion Brendan Edwards believed that footballers were not fit enough so a training regime was implemented. John Winneke , Phil Hay , Malcolm Hill , Morton Browne , Ian Mort and Ian Law made their debuts in 1960. Kennedy took the Hawks further than ever before in 1961, winning their first premiership by defeating Footscray . Brendan Edwards was acknowledged as the star of this win. , However, Hawthorn fell back in 1962, winning only five games and finishing in ninth position on the ladder as the club’s modest support base and lack of wealthy supporters limited its ability to compete for the growing number of country recruits joining the VFL.  In 1963 the club finished on top of the ladder only to lose the grand final to Geelong by 49 points. Kennedy accepted a position as Principal of Stawell High School so Graham Arthur became captain-coach in 1964. The Hawks lost the penultimate game to Melbourne and dropped to fifth – had they won they would have finished on top of the ladder. They fell to be last in 1965 with only four wins, and rebuilt the team for the rest of the 1960s. 1966 saw the debut of Peter Crimmins , Des Meagher , Michael Porter and Ray Wilson . , John Kennedy return to coach from 1967. Don Scott , Ian Bremner and Geoff Angus were local recruits. The club convinced Peter Hudson to joining them in 1967 and immediately became the competition’s leading full-forward. In 1968 he kicked 125 goals, the first centurion since John Coleman, and again in 1969 with 120 goals. Despite this, Hawthorn still failed to make the finals, but the acquisition of the powerful Mornington Peninsula recruiting zone gave the club a huge boost in its quest for success and permitted the club a much more powerful list than ever before. In 1968, Kevin Heath and Norm Bussell become members of the senior team and in 1969 two teenagers, Peter Knights and Leigh Matthews , were recruited. , Hawthorn started the 1970s missing the finals even though Peter Hudson kicked a home-and-away record of 146 goals in 1970. The team’s spine was strengthened with the arrival of full back Kelvin Moore and centre half-forward Alan Martello . , In 1971 the Hawks finished on top of the ladder, the first time since 1963, Peter Hudson equalled Bob Pratt 's record of 150 goals in a season and Leigh Matthews won his first of eight club championships. Matthews gained notoriety by shirt fronting Barry Cable in an Interstate Game in Perth. , The 1971 Grand Final was between Hawthorn coached by Hawthorn legend John Kennedy ) and St Kilda coached by Allan Jeans (who would later move to Hawthorn and enjoy success as the Hawks coach in the 1980s). The match was played before 118,192 people at the MCG on a cool and wet Melbourne day. Hawthorn went into the match without inspirational centre half back Peter Knights who had suffered a severe knee injury two weeks earlier. It was a hard and tough game was played out with the Saints leading the Hawks by 20 points going into the last quarter. Hawks 5.7 (37) to the Saints 8.9 (57). For the Saints however, as coach Allan Jeans was to comment, “The season was just 25 minutes too long”. “Kennedy’s Commandos” (the term given to the team after the coach’s tough physical training program and loudly proclaimed in the huge banners that swept around the MCG (now sadly replaced by advertising signs) came into force. The Hawks moved Peter Hudson out to centre half-forward and Bob Keddie into the goal square. The Hawks slammed on seven goals to three in that final quarter, with Keddie kicking four, to run out winners (12.10.82) to the Saints (11.9.75). The final term saw ten goals being scored. , A skinny lad from Berwick made his debut in 1972. Michael Tuck played the first of a record 426 games after Hawthorn lost champion full forward Peter Hudson to a knee injury in the first game of the year. Hudson had kicked 8 goals before being injured before half-time. John Hendrie whose grandfather played in Hawthorn's the first VFL game played the first of 197 games for the club. , During the 1970s a strong rivalry grew with North Melbourne and they met in three grand finals with the Hawks prevailing twice. The 1976 Grand Final team was inspired by the illness of former Captain Peter Crimmins who died 3 days after the victory from cancer, and by the humiliating defeat of the 1975 Grand Final loss to the North Melbourne Kangaroos. The Hawks greats such as the prolific goal-kicker Michael Moncrieff , rover Leigh Matthews , ruck rover Michael Tuck , ruckman Don Scott , full back Kelvin Moore and centre half-back Peter Knights played through this era. The Hawthorn North Melbourne clash was a close encounter, but injuries to champions such as Keith Greig and Brent Crosswell made North’s chances of winning difficult. However, when Hawthorn looked threatened, they replied quickly and kept their lead intact. The forward line won the day and as a result it was not surprising that John Hendrie was voted best on ground by radio and newspapers of the day. , After the disappointment of losing to North Melbourne in the 1977 Preliminary Final, the Hawks were back to play in the 1978 Grand Final , again against North Melbourne. It was the third time in four seasons that these two sides were to meet in a grand final. North Melbourne were competing in their fifth successive grand final and were the reigning premiers. At half-time North Melbourne led by four points but Hawthorn finished victors by three goals thanks largely to a strong third quarter which saw them kick 7.6. The turning point occurred when two North players spoiled each other in the goalsquare at the 6-minute mark, when a mark and a goal could have put them 17 points up. The Hawks went on to dominate play after this incident and never looked back. , Their greatest era was undoubtedly the 1980s, where the team won four premierships and played in the grand final seven years in succession, including three in a row against arch-enemy Essendon . The decade started poorly, with Hawthorn failing to finish in the top five (as it was then known) and seen by most critics as a spent force. Coach David Parkin left and agreed to coach Carlton and captain Don Scott would shortly retire after playing his 300th game. In a surprise appointment Hawthorn persuaded former St Kilda premiership coach Allan Jeans to coach the team. Jeans had not coached in the VFL for five years. , 1982 would mark the start of Hawthorn being in the finals for 13 years in a row. Hawthorn returned to finals football in 1982, finishing second after the home and away season, Hawthorn fans saw Subiaco champion Gary Buckenara for the first time and also a cameo appearance of Gary Ablett in a Hawthorn jumper and Dermott Brereton who was a skinny kid from Frankston made his debut in the semi final against North Melbourne and kicked five goals. Hawthorn lost the Preliminary Final to Carlton by 31 points. , The first of four premierships for the decade was in the 1983 Grand Final , with Hawthorn 20.20 (140) defeating Essendon 8.9 (57) This was at that time a record margin in a grand final; signifying the juggernaut that Hawthorn was to become during the 1980s. Hawthorn competed in the next two grand finals against rival Essendon, losing the 1984 Grand Final due to Essendon’s famous final quarter charge, and losing the 1985 Grand Final by a far greater margin; souring the final game of club legend Leigh Matthews. Playing alongside him was young Jason Dunstall , from Coorparoo , Queensland, he was recruited after winning the QAFL goalkicking in 1984. , Their second premiership came the following year in the 1986 Grand Final , with Hawthorn 16.14 (110) defeating Carlton 9.14 (68) convincingly, with Gary Ayres winning his first of two Norm Smith Medals. 1987 saw Hawthorn finish second to a superior Carlton team. The fact that Hawthorn even made it to the grand final is still the centre of some controversy; with Gary Buckenara’a after the siren kick in the 1987 Preliminary Final breaking the hearts of tens of thousands of Melbourne supporters. , Ill health to coach Allan Jeans meant that Football Operations Manager Alan Joyce took the coaching position for 1988. The Hawks lost only 3 games for the year; Jason Dunstall kicked 132 goals and the team would win the 1988 Premiership 22.20 (152) against Melbourne 6.20 (56); a then record margin in a Grand Final of 96 points. Gary Ayres won his second Norm Smith Medal. , The 1989 season was viewed as one of the most spectacular VFL/AFL seasons to date; with Dunstall again kicking a century of goals, the resurgence of Geelong and dominating play of Geelong great Gary Ablett Sr. , and the greatest grand final of the modern era occurring in this year. , The Hawks defeated Geelong in the 1989 Grand Final. The match is now legendary for its amazing toughness, physicality, skill, massive scoring and tension. The Hawks jumped out to an enormous lead as Geelong attempted to unsettle the Hawks through rough physical play. However the physical toll on the Hawks began to show as the match wore on; with John Platten being concussed, Robert DiPierdomenico puncturing his lung, Dermott Brereton breaking his ribs and Michael Tuck splitting the webbing on his hand.  By midway through the final quarter the Cats were charging; with Hawthorn desperately trying to hold off the Cats’ avalanche of goals while containing the brilliance of Ablett who ended the match with a grand final record of 9 goals. Hawthorn’s experience and determination allowed them to hold off Geelong just long enough, scraping through to victory by one goal.  , Other clubs have had success since but none have matched the sustained dominance of the Hawks in the late 1980s, having played in a record seven successive grand finals. Leading players of the 1980s included Dermott Brereton , Gary Ayres, Chris Mew , Michael Tuck , Jason Dunstall , Gary Buckenara , John Platten and Chris Langford . , The Hawks ended their era of dominance which included eight grand final appearances in nine seasons (1983–1991). Injuries to key personnel hampered Hawthorns 1990 campaign. Jason Dunstall and Dermott Brereton both missed many games, others like Robert DiPierdomenico carried injuries into the finals. The Hawks bowed out in the Elimination Final to Melbourne. Alan Joyce replaced Allan Jeans as coach for the 1991 season and the Hawks subsequently won the pre-season cup. The club recruited skillful South Australian Darren Jarman and with improvement from young players, such as Paul Hudson , Ben Allan and Stephen Lawrence the team made the 1991 Grand Final . , Grand Final Day 1991 was an historic occasion. It was the only grand final played at Waverley Park and featured the first ever appearance by a non-Victorian team. West Coast had dominated the home and away season but Hawthorn, written off by many early in the season, won the match. West Coast began the match kicking with the aid of a strong wind blowing down to the main scoreboard end and kicked the opening four goals. However, from that point the Hawks began to gain the ascendancy and, if not for inaccuracy in front of goal in the second term, they would have had a significant half-time lead. Having maintained the half-time margin, against the wind, in the third term, the Hawks scored 8.4 (52) to 1.3 (9) in the final quarter, to win a fifth premiership in nine seasons. A feature of the Hawks’ performance was that its two best players—Paul Dear and Stephen Lawrence—were from the team’s younger brigade. It was Michael Tuck ’s last game and he bowed out with the League record for games (426), finals (39), grand finals (11) and premierships (7). At the end of 1991, Hawthorn selected a young Shane Crawford with pick 13 in the National Draft, who eventually became the only surviving link between this era of success and its next triumph 17 seasons later. During the 1992 summer, the Hawthorn players’ T-shirts had \"Too old. Too slow. Too good\" written on them.  , After having shared Princes Park with Carlton as a home venue since 1974, Hawthorn began to move its home games to Waverley Park in Mulgrave in Melbourne’s south-east in 1990. The club played five home games at Waverley Park and the balance at Princes Park in each of 1990 and 1991, and played all home games at Waverley Park from 1992.  To further strengthen their links with the area a second social club was established nearby at the Waverley Gardens shopping centre. The club, which operates as a gaming venue, has also been a lucrative source of revenue for the club. , The end of the 1993 season saw the first cracks in the Family Club facade; coach Alan Joyce was replaced by Peter Knights and club legends Gary Ayres and Dermott Brereton departed. Chris Mew injured his achilles tendon and retired. Behind the scenes the Hawthorn board began to spend large amounts of money that the club didn't have, board members flew first class to games interstate and $1 million was spent renovating club offices by a company owned by the then club president. Despite a decade of onfield success, the club failed to attract supporters who would become long term backers for the club. Loss of key players continued, Ben Allan was offered the captaincy of the new Fremantle Dockers and left at the end of 1994, as did Andrew Gowers , who went to Brisbane . , After a promising start in 1995 the Hawks lost their last seven games to finish fifteenth and missed the finals for the first time since 1981. The board sacked the coaching staff and appointed Ken Judge who was an assistant to David Parkin at Carlton. Club Champion Darren Jarman told the club he wanted to return to Adelaide. , Falling on-field and off-field fortune saw the club almost merge with Melbourne in 1996. The resulting club was to be known as the \" Melbourne Hawks \" – a fusion with the Melbourne nickname of \"Demons\". A groundswell of support led by former champion Don Scott scuttled the proposal, with Hawthorn members voting strongly against it. Melbourne members supported the merger by a small margin. The failure of the merger led to the resignation of the board and its replacement, led by businessman Ian Dicker. , After fighting off the merger the new board launched the “Proud, Passionate and Paid Up” campaign in a bid to get more members. 27,450 memberships were bought by supporters, more than doubling the memberships from the previous year. Even in the successful years of the 1980s the club struggled to get 10,000 members. The team won the 1999 pre-season competition but missed out on the finals of the premiership season. Ken Judge resigned at the end of 1999 to accept the coaching job at West Coast Eagles . , Peter Schwab was appointed coach of the Hawks for the 2000 season and the team played a more attacking style than the “accountable football” discipline of Ken Judge. The Hawks reached the semi-finals before losing to the reigning premiers, the North Melbourne Football Club . The team made steady progress all over the field. Daniel Chick and Nick Holland were the joint winners of the Peter Crimmins Medal. Chance Bateman became the second Indigenous Australian to play for Hawthorn. , In 2001 the Hawks again enjoyed a successful year, but it was to be their last for several seasons. The Hawks won eight games straight at the start of the season and, despite faltering late in the home-and-away season, had a close win in a semi-final against Port Adelaide and made it to the preliminary finals in when they narrowly lost to Essendon . In the off-season, Hawthorn traded Trent Croad and Luke McPharlin for the Number 1 draft pick, Luke Hodge , No. 20 (Daniel Elstone) and No. 36 ( Sam Mitchell ). Croad would, ironically, return to Hawthorn two years later. , The Hawks missed the finals altogether in 2002, finishing tenth, which was considered a very disappointing result for the club. Shane Crawford won the Peter Crimmins Medal after another strong season. Players that made their debuts that year, Luke Hodge , Sam Mitchell , Campbell Brown , Robert Campbell and Mark Williams would all play in the 2008 premiership side. In the off-season, the Hawks again proved to be big players and gained the services of St Kilda ruckman Peter Everitt . , After a poor start to the 2003 season, the Hawks went on to finish the second half of the year strongly and finished in ninth position, narrowly missing the finals. Sam Mitchell shone for the Hawks and won the AFL Rising Star award. This form had punters excited and the team were early favourites for a top four finish the next year. Shane Crawford once again won the Peter Crimmins Medal and also came second in the Brownlow Medal by a single vote. , During the 2004 pre-season Hawthorn coach Peter Schwab declared that the Hawks would “win the premiership” although this statement would be followed by a horrific season for Hawthorn as the Hawks managed just four wins and eighteen losses. The club imploded, and by mid-season coach Peter Schwab was sacked, and Captain Shane Crawford broke his arm, and eventually relinquished the captaincy. Following the collapse of the club on the field, many players either left or were sacked from the club. Nathan Thompson left the club citing a fresh start following his admission that he suffered from depression. Rayden Tallis , Mark Graham , Kris Barlow and Lance Picioane were also released from the club. More than 700 games of experience left the club following the season. , Main articles = Hawthorn Football Club seasons 2007 , 2008 , 2009 , 2010 , 2011 , 2012 , 2013 and 2014 , Alastair Clarkson was appointed to his first senior AFL coaching role at the Hawthorn Football Club for the 2005 season, when the Hawks embarked to rebuild the team. Clarkson was prepared to delist older players and instill a youth policy. Club veterans Rayden Tallis , Mark Graham , Kris Barlow , Luke McCabe and Lance Picioane left the club while Nathan Thompson was trade to North Melbourne . The Hawks took Jarryd Roughead , Lance Franklin , Jordan Lewis at picks 2, 5 and 7 respectively in the AFL Draft . With Clarkson at the helm, the Hawks made solid progress, and instituted a culture of discipline at the club. The Hawks won only five games and by playing a high-possession game plan and finished in 14th position. Hawks fans saw a somewhat successful introduction to the AFL for players Franklin, Roughead and Lewis all of whom won Rising Star Nominations. Shane Crawford also had a return to form after a terrible 2004 when he broke his arm, and finished 3rd in the Peter Crimmins Medal tally. , Former number one draft pick Luke Hodge had a breakthrough season in 2005, winning the Peter Crimmins Medal , All-Australian jumper and coming equal 4th in the Brownlow Medal (15 votes) from half-back. Peter Everitt and Trent Croad were also named in the All-Australian team. After 2005, another round of culling and the club bid farewell to Angelo Lekkas , Nick Holland . Hawthorn recruited Xavier Ellis (pick 3), Beau Dowler (pick 6), Grant Birchall (pick 14), Max Bailey (pick 18) and Beau Muston (pick 22) all early in the draft; two of those selections were received by trading 2001 All-Australian full-back Jonathan Hay to North Melbourne and Nathan Lonie to Port Adelaide . , After numerous years of planning, the club relocated its administrative headquarters from Glenferrie Oval to a state-of-the-art redeveloped facility at Waverley Park in the early stages of 2006. Glenferrie Oval was to remain the spiritual home of the club. , In 2006, Clarkson showed innovation by restructuring the forwards into a system that came known as “Buddy’s box”. Starting the season 4–1 after the first five rounds, the Hawks faltered and lost twelve of the next thirteen games to fall to 5–13. The team won the final four matches to finish eleventh. Hawthorn’s progress up the ladder, developing youth, and attacking style of play saw coach Alastair Clarkson rewarded with a new 2-year contract after the mid-season break. , At the end of the 2006 season, the Hawks increased their commitment to the Tasmanian market – where they had developed a large support base – with four games to be played at Aurora Stadium in Launceston each year, and with the Tasmanian Government becoming an official sponsor of the club, in one of the biggest sponsorship deals in Australian sporting history,  worth $15–20 million. , Clarkson brought to the club delisted footballers Brent Guerra and Stephen Gilham who he knew from his time at Port Adelaide . The Hawks continued to improve in 2007, winning 13 games and finishing fifth on the Premiership table. This took them into the finals, where they defeated Adelaide in the Elimination Final, in which Lance Franklin kicked his seventh goal seconds from the final siren, before being eliminated in the Semi Final against North Melbourne . The club recorded its 11th consecutive year-end profit at the close of the 2007 season, a record A$ 3.6 million. , On Draft day 2007 Clarkson went against his own policy when he recruited recently retired Stuart Dew and youngster Cyril Rioli . Clarkson also introduced a new style of play that became known as the \"Clarkson Cluster\". , Throughout the 2008 AFL season , Hawthorn played a brand of football which became described as \"unsociable\" – a rough, physical style of play which conceded a lot of free kicks, but regardless asserted a physical dominance for the club.  Hawthorn finished second on the home-and-away ladder with a record of 17–5, and progressed to the Grand Final to defeat Geelong 18.7 (115) to 11.23 (89), who had lost only one match during the season.  Hawthorn would go on to lose its next eleven encounters with Geelong, allegedly caused by the \" Kennett curse \". Lance Franklin won the Coleman Medal with 102 goals, becoming the first player for more than a decade to score 100 goals within the home-and-away season. , The 2008 Grand Final would become the last game for Trent Croad and Shane Crawford in their AFL careers – Crawford retired after the season, with 305 games service, and Croad suffered a foot injury during the Grand Final which kept him out of the following season, ultimately leading to his retirement. After the 2008 premiership, opposition teams worked hard at picking the \"Clarkson cluster\" apart, masked by injuries to key players the Hawks slipped down the ladder to finished ninth in 2009. The Hawks premiership defence ended with them missing the finals altogether. , A poor start to 2010 when the club lost six out its first seven games the team finally abandoned the cluster for a more precision kicking style. The change resulted in eleven wins, only three losses and a draw followed, and it was enough for them to make the finals, finishing seventh and drawing an away final against the Fremantle Dockers in Perth, which they lost by 30 points. , Aided by recruiting established players to cover weaknesses the club climbed its way back up the ladder. Shaun Burgoyne and Josh Gibson arrived in 2010, David Hale in 2011, Jack Gunston in 2012 and Brian Lake in 2013 helped Clarkson again guided the Hawks to a premiership win, this time over the Fremantle in the 2013 AFL Grand Final . , In 2011, Hawthorn finished the home and away season with a record of 18–4, finishing third. It lost to Collingwood by three points in a preliminary final. In a reasonably unheralded season Hawthorn won 18 games. Lance Franklin won the Coleman Medal and an All Australian guernsey; Josh Gibson, Sam Mitchell and Grant Birchall were also nominated for All Australian positions. , In 2012, Hawthorn finished on top of the home and away season ladder with a record of 17–5, finishing as minor premiers for the first time since 1989 . They defeated Collingwood and Adelaide by 38 and 5 points respectively to advance to their second Grand Final in five years, however, despite leading by two goals midway through the final term they were defeated by the Sydney Swans by 10 points. , In 2013, Hawthorn again finished as minor premiers after a home and away season record of 19–3. During the season Jarryd Roughead won the John Coleman Medal for the first time. The club also traded for Brian Lake , an experienced defender from the Western Bulldogs. Lake went on to win the Norm Smith Medal for his efforts in the Grand Final . Hawthorn defeated the Fremantle Dockers by 15 points to claim their 11th premiership after a tough and scrappy game. Team mates joining Lake as premiership players who began their careers at other clubs were Jonathan Simpkin , Jack Gunston (runner-up in Norm Smith voting with his 4 goals), David Hale , Shaun Burgoyne , Josh Gibson and Brent Guerra . , In 2014 the club was able to overcome adversity to win their twelfth premiership. Former leading goalkicker Lance Franklin left the club as a free agent soon after the 2013 premiership, linking up with the Sydney Swans on a multi-million dollar contract over nine years, new recruit Dayle Garlett retired before the start of the season, and coach Alastair Clarkson missed a month due to illness (during which Brendon Bolton acted as caretaker coach for five matches). The 2014 premiership saw Will and Chris Langford become the first father/son premiership players at the club since Peter Hudson (1971) and his son Paul (1991) (Chris' teammate John Kennedy Jr played in four premierships, whilst his father John Kennedy, Sr. coached the club to three flags.). , Includes the Peter Crimmins Medal (Best and Fairest) winners.  , When Hawthorn entered the VFL in 1925 their nickname was known as The Mayblooms . The maybloom was a flower that was profuse in the Hawthorn suburban area. In Round 2, 1943 when Hawthorn played Essendon , the match report in the Sporting Globe newspaper announced that prior to the start of the game at Glenferrie, Roy Cazaly , Hawthorn’s coach told the players that in future they would be known as the Hawks instead of the Mayblooms. Cazaly said I expect players to live up to the name being ready to fight hard and carry the ball away with pace and dash to the goal.  , The Hawthorn FC has had four VFL/AFL endorsed logos in its entirety. The first (1977), a flying Hawk, was an adaptation of a pre-existing unofficial logo that appeared on the club's official documentation throughout the 1960s and 1970s. The Hawks's Mascot Manor representative and club mascot is Hudson \"Hawka\" Knights, a caricature of a hawk dressed the same way as the Hawthorn players and slightly depicting club champion Dermott Brereton . , The Hawthorn colours are Brown & Gold vertical stripes. Hawthorn has worn this design since 1950. The current major sponsors of the team are Tasmania , iiNet , Bupa and Adidas . The standard home guernsey is used in all home and away games in Victoria, Sydney and Tasmania while the away guernsey is used in every away game in Adelaide, Perth and Brisbane. , The club's colours and designs have changed a few times during their history. From 1902 to 1904 they wore a blue guernsey with red shoulders and a red stripe down the front of the guernsey along with blue and white hooped socks. After they merged with Boroondara in 1905 they changed to a black guernsey with a red sash with black and red hooped socks. After the club had struggled for a few years it was decided to reform it and for seasons 1912–13 and they wore a yellow guernsey with a blue V. Upon entering the VFA they had to change their colours again as Williamstown already had that combination and adopted the colours brown and gold which have since remained to this day although the design has changed a few times, the main ones being: , The Hawthorn club song is entitled We're a Happy Team at Hawthorn , and is sung to the tune of The Yankee Doodle Boy which was written by George M. Cohen for his 1904 musical Little Johnny Jones . In the musical Johnny Jones is a patriotic US jockey competing in England. , The song gained prominence when it was featured in the wartime 1942 musical Yankee Doodle Dandy starring James Cagney as George M Cohen performing the part of Johnny Jones on stage! , The song was adapted with new Hawthorn lyrics by Chick Lander in 1956. , The closure of Waverley Park in 1999 was a setback as Hawthorn could no longer play home games in the south-east region where they have developed a large support base. Home games were moved to the Melbourne Cricket Ground . Their relationship with the south-east was rekindled in 2006, when the Hawks returned to Waverley as a training and administration centre. The oval and a section of the Sir Kenneth Luke stand have been retained by developer Mirvac as part of their redevelopment of the Waverley site as a housing estate, largely as a result of a Victorian government commitment to keep football there. Mirvac leases the facility to Hawthorn for a peppercorn rent, until the club takes ownership of the facility within the next 20 years. Hawthorn will maintain their association with Glenferrie, by housing several coteries and conducting social activities at the club's spiritual home. , On 30 September 2008, the Hawthorn Football Club relationship with Glenferrie Oval was rekindled when the club hosted a Supporters Day at the club's spiritual home celebrating the club's 10th premiership, attended by an estimated 20,000 fans. On the 29 September 2013, the Hawthorn Football Club shared the spoils with their supporters again at Glenferrie Oval, celebrating the club's 11th premiership with more than 22,000 fans in attendance. , In August 2005, former Victorian State Premier Jeff Kennett , a long time Hawthorn supporter and former number one membership ticket holder, was appointed to the board of the club with the intention of standing for president at the next coming Annual General Meeting . His rise to presidency was confirmed when on 14 December 2005, he was ushered in as president of the Hawthorn Football Club unopposed to the audience of a packed Hawthorn Town Hall. , Since 2001 Hawthorn has successfully cultivated a following in Tasmania, where the membership base has increased from 1,000 to more than 9,000. Since 2006, Hawthorn has increased its presence in the state as part of an agreement with the tourism component of the Tasmanian government, whereby they are contracted to play four games in the state and the Tasmanian Government will be the major sponsor for the club. This relationship was renewed for a further period for five years (2012–16) in November 2011. Subject to AFL consent Hawthorn has offered to play an additional home game in Tasmania as part of the new deal, provided the number of rounds in the home/away season is increased by the AFL to accommodate an 18 team competition.  , At their 2007 Annual General Meeting, Hawthorn embarked on a 5-year business plan titled \"five2fifty\", the core idea being that in the next five years the club will target to win 2 premierships and have fifty thousand members. As part of the plan, the football club wants to be seen as the most professional club in the AFL, and places great emphasis on the welfare of the people associated with the club.  , Following the completion of 'five2fifty' business plan in 2012, Hawthorn released a new business plan; 'All for One'. Striving for 80,000 plus members and investing a further $35m into capital investment projects in and around Waverley Park; the Hawks have set themselves an objective to become 'the destination club'; targeting successive top 4 finishes over the 2013-2017 period. Central to successfully achieving its commercial objectives, the Hawks have identified the importance of solidifying its status as a major MCG tenant as crucial to growing its membership and crowd support.  , In 2009 Hawthorn launched a community-based program called 'HANZ-UP! AFL Program' in New Zealand. The Hawks announced they had entered the New Zealand market, with an initial three-year deal with an option to extend the partnership until the end of 2018. , Hawthorn has joined with AFLNZ to promote HANZ-UP! through programs such as KiwiKick (a New Zealand version of Auskick), the Hawks Cup (a year-9 and year-10 schools competition) and the Trent Croad Scholarship Scheme (AFL international scholarships). Annual skills clinics will also be held throughout New Zealand featuring Hawthorn players. KiwiKick will see all participants receiving kits branded with the Hawks and HANZ-UP! logos, while Hawks Cup players will be given exclusive Hawthorn merchandise.  , The Hawthorn Football Club financial year ends on 31 October each year. , Hawthorn boasts a huge support base throughout Australia, particularly in Victoria and Tasmania. In a survey appearing in the 9/7/2008 edition of the Herald Sun, 11% of respondents barracked for Hawthorn, behind only Collingwood (14%), Essendon (12%) and Carlton (12%). As an MCG tenant, Hawthorn is among the top 5 crowd drawing clubs in the league, averaging crowds of more than 50,000 to their MCG home games since 2008.  Since 1997, Hawthorn has drawn the 5th largest crowds to home and away matches, drawing more than 36,000 per game across all home and away games. , Notable supporters include former Victorian Premier and former club President Jeff Kennett , cricketers Ian Healy , Mark Taylor , Terry Alderman and Damien Fleming , champion tennis players Pat Cash , Mark Philippoussis & Jarmila Gajdošová , Melbourne Storm captain Cameron Smith ,  Australian Olympic Rower James Tomkins , basketball legend Andrew Gaze , media personalities Stephen Quartermain , Helen Kapalos , Anthony Lehmann , the late Graeme \"Shirley\" Strachan and television host Shura Taft .  , Most of this widespread support can be accredited to the club's success in the 1970s and 1980s as the club successfully nurtured talent in its home ‘zones’ – primarily in the South and East of Victoria, as well as recruiting interstate talent from all over Australia. As a result, the club has a very widespread membership with 7,000 Tasmanian members, 3,000 WA members and 3,000 QLD and NSW members complementing the club's 45,000 Victorian members. In 2007 Hawthorn stated its ambitions were to grow their membership to beyond 50,000 by 2011 which was achieved in 2009. By 2012, Hawthorn became just the second club to grow membership beyond 60,000 setting a goal of reaching 80,000 plus members by 2017. , In 2008 the Hawthorn Football Club drew 1,164,396 to all 25 completed games, a club record and 7th largest aggregate attendance for any club, of all time. In May 2009, the Hawthorn Football Club boasted the largest membership in the AFL, becoming the first Victorian club to break the 51,000 barrier for membership. In all, Hawthorn has drawn more than 1,000,000 fans to AFL matches in 5 seasons - 2008 and 2011–2014. , Hawthorn's official membership figures 1925-1983  (* indicates official figure was an estimate) , The table below also contains crowd figures along with club membership numbers from 1984. Total attendance includes finals matches. , – ¹ as of 16 June 2015 , Head coach , Assistant coaches , , On 6 March 2011, at its annual Family Day, club representatives announced that as of the 2011 season the No. 1 guernsey would be officially retired as a player number and instead presented as a tribute to the fans. Max Bailey , who was the last player to wear #1, made the announcement by saying, \"..the fans are number 1.\" , He then presented the cheersquad with a giant Hawthorn guernsey displaying \"1\" on its back. The oversized guernsey will be on display at selected home games. , Legend: Finals , Wooden spoon , , The following is a list of coaches of the Hawthorn Football Club. , Legend: P = Played, W = Won, L = Lost, D = Drew, W% = Win percentage , The following is a list of Presidents of the Hawthorn Football Club. , Hawthorn's \"Best & Fairest Award\" is called the Peter Crimmins Medal in honour of former Hawthorn captain Peter Crimmins who played as a rover during 1966–1975 and led the side in 1974–75. He died of cancer just days after the club's 1976 premiership win. , The match committee now awards the votes. The player with the maximum number of votes at the conclusion of the season is awarded the medal. (See Season Summaries for the complete list of winners.) , Note: Before 2002, this was the VFL/AFL Players Association Most Valuable Player award. In 2005, all winners of this honour prior to 2002 were retrospectively awarded the Leigh Matthews Trophy. , During the history of the Hawthorn Football Club, the club has had four mainstay home grounds (Glenferrie Oval, Princes Park, Waverley Park and the Melbourne Cricket Ground). Prior to adopting Glenferrie Oval as the club's traditional home the club had a nomadic history, playing home games at whatever the most suitable obtainable ground was for that season. Their first home ground, the Hawthorn C.G. (West Hawthorn Reserve) was abandoned after the first season due to conditions imposed by the Hawthorn Cricket Club and they played at John Wren's Richmond Racecourse in 1903 (which was off Bridge Road between Stawell Street and Westbank Terrace – where Tudor Street and 5 no through streets are now located) and moved to the Richmond Cricket Ground in 1904. Their merger with Boroondara in 1905 had them move to Boroondara's ground, which at the time was the East Melbourne Cricket Ground. Hawthorn dropped their colours of blue and red (similar to Melbourne's guernsey at the time) and adopted Boroondara's colours, which was a black guernsey with red sash but retained the name Hawthorn FC. When the Hawthorn council opened the Hawthorn City Sports Ground (Glenferrie Oval) in October 1905 they endeavored to get a senior club to represent the district to be the main tenant during the next football season. The Hawthorn FC, competing in the Metropolitan Junior Football Association (now known as the VAFA), and Hawthorn Rovers (a popular club in the Eastern Suburbs Association) merged to form the Hawthorn City Football Club and made Glenferrie their home ground (the word City was later dropped and the club was just known as the Hawthorn Football Club when it entered the VFA in 1914) . , Between 1906 and 1973, home games were played at the club's traditional home, Glenferrie Oval, in the heart of the affluent suburb. The state of Glenferrie Oval and its location, close by the Glenferrie train station on the Melbourne East route, was a central reason why the club was firstly accepted into the VFA in 1914, and then the VFL in 1925. The club's onfield results had not reached any great heights in those early days but both the VFA and VFL had recognised the importance for representation in the suburbs east of the Yarra River. Glenferrie Oval was pivotal in these advancements of the Hawthorn Football Club as it was considered the most suitable at the time. , In 1914, when Hawthorn entered the VFA, the council was required to build a new dressing shed to meet the standards of the VFA competition. These dressing sheds were erected in the north-west corner of the ground, where the Tuck Stand now resides, and were later moved to the Rathmines Road Reserve in Hawthorn where it still exists today. In 1922 the ground was widened by 30 yards and lengthened westward by 50 yards - taking in the previous outer reserve ground - to the dimensions that remain today. The 1922 ground improvements also resulted in Glenferrie Oval's first main stand, which was a wooden structure to be known as the Kennon-Owen Stand, and had been purchased from the East Melbourne Cricket Ground in late 1921 when that ground was closed due to expansion of the Jolimont railyards. The Kennon-Owen Stand was located where the Victorian Weightlifting Building is now situated. Glenferrie Oval is universally known for its famous art-deco Grandstand, built in 1937 and later named the Michael Tuck stand after the club great, and housed the new changerooms and administration of the club. It is now heritage protected as one of the most significant buildings of the era. The Kennon-Owen Stand was replaced by the Dr A S Ferguson Stand, a new brick stand opened in 1966 which was 185 feet long and could seat 1450, with 400 undercover. It was later to be home of the Past Players Association and the original Museum. The northern part of the Ferguson stand was demolished to make way for the Victorian Weightlifting Building. In 1963 the large scoreboard was erected at the eastern end of the ground. After the club won the 1961 premiership it was decided to buy some houses on the other side of Linda Crescent to build the Social Club which opened in 1962. The ground was relatively small by VFL standards, but the intimate nature of the ground (with the grandstands and train line surrounding the ground) made for a terrific atmosphere. , The club ceased playing VFL matches at the ground in 1973 to cater for the club's growing crowds and demands of VFL football. From 1974–2006, the club used the ground as a home and administration base, conducting training sessions and running a social club, across on Linda Crescent, before moving the administrative base to Waverley Park in 2007. The club used Glenferrie Oval for its post-premiership celebrations in 2008, attracting more than 20,000 fans. , The decision to move away from Glenferrie Oval and subsequent move to Princes Park , was a difficult transition, alienating many supporters. Prior to moving to Princes Park, the club pushed to build a stadium in Box Hill and mooted a move to the MCG (1964) both were rejected. The move to Princes Park – the traditional home of the Carlton Football Club, coincided with the club's golden era, hoisting the '76, '78, '83, '86, '88, '89 and '91 premiership flags at the ground. Combined with Carlton's '79, '81, '82 and '87 flags, Princes Park became a hub of success throughout the 1970s and 1980s. , Whilst the club had immense success at the ground, the ground wasn't a favourite with the majority of the Hawthorn membership. Located in Melbourne's Northern suburbs, the traditional home of the Carlton Football Club – one of the traditional powerhouses of the VFL, the move away from the club's heartland caused many Hawks supporters to turn their back on the club. , Recognising this, as early as the mid-1980s the Hawthorn administration pushed to relocate from Princes Park to Waverley Park, however due to the nature of long term terms of tenancy at Princes Park and ruthlessness of the Carlton Football Club for Hawthorn to abide by this contract, a move away from Princes Park before the end of the long term agreement would result in financial ruin for the club. , In 1990, with the backing of the AFL, Hawthorn set the wheels in motion for a move to VFL Park, playing a series of home games at Waverley Park – located 20 km east of the Melbourne CBD and location of Hawthorn's 1991 Premiership success. Whilst the move to Waverley was met with a drop in on-field success, symbolising the birth of the barren period for the club on the field leading up until 2008, the club successfully harboured large increases in attendances and membership at the ground. , As a result of the AFL closing the venue and subsequently selling the property to Mirvac to finance the Docklands stadia, the club had the opportunity to move home games to either the lavish new Docklands precinct (alongside Essendon, St Kilda, Western Bulldogs and North Melbourne) or join traditional tenants Melbourne and Richmond as well as Collingwood at the MCG. Highlighting the potential to push attendances and membership beyond 50,000, the club decided to push for a relocation to the MCG in line with the 'Family Club' mantra. , In January 2006, in the club's centennial year at Glenferrie Oval, the club's administration, museum and player base relocated to Waverley Park. , On 13 March 2000, Hawthorn played its first home game as an MCG tenant against Collingwood, becoming one of four tenant clubs to play at the ground. Until 2008 the shift from to the MCG has been met with a barren period on the field for the Hawks, having played in five out of nine non-finals seasons at the ground. , Since 2000, Hawthorn has played between seven to nine home games at the MCG, with secondary home games being played at Docklands Stadium and York Park in Tasmania. In 2008, Hawthorn played seven home games at the MCG, drawing 369,614 (52,802) to seven games and a total of 773,089 (59,468) to 13 games at the venue for the year.  , Since 2001, Hawthorn's has played \"secondary\" home games at York Park (currently also known by the sponsorship name of Aurora Stadium) in Tasmania. The Hawks have a very successful record at the ground, losing only two games played there since 2010.  As a result of the agreement with the Tasmanian government, thousands of Melbourne-based Hawthorn supporters have travelled to Tasmania to watch the Hawks play, increasing activity within the local Launceston economy. By the same token, Hawthorn has successfully increased its following in the state, with an estimated 25% of young Tasmanian supporters now barracking for their \"local\" team.  , Hawthorn fielded a reserves team in the VFL/AFL reserves competition, and its successor, the Victorian State Football League , from 1925 until 1999. During that time, the club won four reserves premierships: in 1958, 1959, 1972 and 1985. , Since 2000, after the VSFL ceased competition, Hawthorn has been affiliated with the Box Hill Football Club in the Victorian Football League . Under the affiliaton, Hawthorn players who are not selected in the AFL can play alongside Box Hill senior players in the VFL competition. The clubs have a strong affiliation, with Box Hill changing its club nickname from Mustangs to Hawks when the sides affiliated. Box Hill has won two premierships, in 2001 and 2013, during the period of the clubs' affiliation. , The reserve grade won the club's first flag after holding onto a winning lead by defeating Collingwood by four points. After an even first quarter the Hawks kicked four unanswered goals to lead by 26 points at half time. Collingwood lifted after the break keeping the Hawks to a goal in the third and only a point in the final quarter. Playing better football in wet conditions, Collingwood managed to narrow the gap but inaccurate kicking they failed by four points. Gary Young kicked four goals while Elward kicked two. , In 1959 Hawthorn Reserves went back to back winning their second premiership after defeating Fitzroy by 31 points. The Hawks opened up a 38-point half time lead by kicking six goals in the second quarter. The hawks extended their lead to 44 points at the last break before playing it safe and coasting to a 31-point win. Elward and Peter Hay kicked 3 goals for the winners and Dineen, Howell and Ritchie were amongst their best players , In a team that contained four of the previous years senior premiership players, Geoff Angus , Ken Beck , Michael Porter and Ray Wilson . Up and coming future club champions Michael Moncrieff , Michael Tuck , Kelvin Matthews and Alan Goad were instrumental in the match. The Hawks led all day before Melbourne hit the front with two minutes to go, a late goal to Fitzgerald won the game. , In 1985, Hawthorn Reserves contained future premiership players in James Morrissey , Greg Dear , Peter Curran , Chris Wittman and Paul Abbott . Hawthorn veterans, Peter Knights , Gary Buckenara , Rodney Eade and Colin Robertson and in his only year at the club Steve Malaxos . Buckenara kicked 8 goals. , Hawthorn fielded a side in the VFL Under 19 competition. The Under 19s played in two grand finals, losing the first in 1969 to Richmond but in 1972 won against North Melbourne. The team included Bernie Jones , Ron Beattie , Michael Zemski and Ian Scrimshaw. , "
}
