{
  "category": "afl",
  "article": "The Melbourne Football Club , nicknamed the Demons , is an Australian rules football club, playing in the Australian Football League (AFL). It is named after and based in the city of Melbourne , Victoria , and plays its home games at the Melbourne Cricket Ground . , Melbourne is the world's oldest professional club of any football code. The club's origins can be traced to an 1858 letter in which Tom Wills , captain of the Victoria cricket team , calls for the formation of a \"foot-ball club\" with the need of a \"code of laws\". An informal Melbourne team played that winter and was officially formed in May 1859 when Wills and three other members codified \"The Rules of the Melbourne Football Club\" —the basis of Australian rules football. The club was a dominant force in the earliest Australian rules football competition, the Challenge Cup , and was also a foundation member of the Victorian Football Association (VFA) in 1877 and the Victorian Football League (VFL) in 1897, which later became the national Australian Football League (AFL). Melbourne has won 12 VFL/AFL premierships, the latest in 1964 . , The club celebrated its 150th anniversary in 2008 by naming 150 Heroes , as well creating a birthday logo which appears on its official guernsey. , The football club has been a sporting section of the Melbourne Cricket Club (MCC) since 2009, having previously been associated with the MCC between 1889 and 1980.  , , , The seeds of the Melbourne Football Club were established in 1858 with meetings involving influential cricketer Tom Wills , Scotch College headmaster Thomas H. Smith and Melbourne Cricket Club member and publican Jerry Bryant, a personal friend of Wills. A letter Wills wrote that year was the catalyst in the push to establish football teams with a \" code of laws \". Melbourne, as an entity, was founded in 1858, however, did not begin playing until the following year, and had a link to the Melbourne Cricket Club through some of its players playing for the cricket club. , On 14 May 1859, the Melbourne Football Club was founded. During a couple of meetings held on 17 and 21 May,  the first set of rules for the game of Australian rules football were written. Those in attendance included Tom Wills , William Hammersley , J. B. Thompson and Thomas H. Smith . , The first mention of a football game played by the club is between Melbourne and South Yarra in July 1859, with Hammersley as inaugural captain.  , In 1861, Melbourne participated in the Caledonian Society's Games, but lost the trophy to the Melbourne University Football Club . The club pushed for its rules to be the accepted rules, however many of the early suburban matches were played under compromised rules decided between the captains of the competing clubs. , Although some Melbourne players and officials were associated with the cricket club, the football club was not initially allowed to use the Melbourne Cricket Ground , so it used a nearby field at Yarra Park as its home ground instead. , By 1866 several other clubs had also adopted an updated version of Melbourne's rules (which were drafted by H.C.A. Harrison ). , During the 1870s, Melbourne fielded teams in the Seven Twenties and South Yarra Cup competitions. , After a visit to England by one of the club's officials, the colours of red and green were officially adopted by the club. Shortly following, the club began wearing a predominately red strip and became informally known by supporters as the \"Redlegs\". , The name \"Redlegs\" was coined after a Melbourne official returned from a trip to England with one set of red and another of blue woollen socks. Melbourne wore the red set while the blue set were, allegedly, given to the Carlton Football Club . This may be the source of Carlton's nickname, 'The Blueboys'. , In 1877, the club became a foundation member of the Victorian Football Association (VFA). During the same year the club took part in the first interstate football match involving a South Australian side, Victorian , defeating the home side 1-0.  During this time, the club was known as the \" Fuchsias \". Melbourne never won a VFA premiership, although they were consistently one of the stronger teams in the competition, finishing runner-up four times, to Carlton in 1877 (the inaugural year of the VFA), to Geelong in 1878 and twice to Essendon in 1893 and 1894. , In 1889, the MFC was reincorporated into the MCC, and for many years the two organisations remained unhappily linked. The MFC's close association with the MCC allowed it to claim the MCG as its home ground and gave it access to a wealthy membership base, but Melbourne's reputation as an \"establishment\" club was not always an advantage. MCC members have the automatic right to attend all events at the ground, including MFC football games. This meant many potential members had a reduced incentive to join the football club, and Melbourne's membership remained one of the lowest in the competition. , In 1897, the MFC was part of the breakaway Victorian Football League , and has been a part of the competition ever since. The team became known as the \"Redlegs\". This nickname is still used by some members and supporter groups within the club. , In 1900 Melbourne won its first VFL premiership, defeating Fitzroy . Melbourne's greatest player of these early years of the VFL was Ivor Warne-Smith , who in 1926 won the club's first Brownlow Medal , the League's annual award for the fairest and best player. In that year Melbourne won its second flag. Warne-Smith went on to win a second Brownlow in 1928. , Frank 'Checker' Hughes became Melbourne's coach in 1933, and under his leadership the club entered a golden age. He was the driving force behind changing the club's nickname from the Fuchsias to the Demons.  , In 1939, 1940 and 1941 Melbourne won its third, fourth and fifth flags. In 1946 Don Cordner became the second Demon to win the Brownlow. In 1947 Fred Fanning kicked a record 18 goals in the last game of the season. The following season Melbourne played the first ever drawn Grand Final, against Essendon , and went on to win the premiership the following week. , Norm Smith became Melbourne's coach in 1952, and the following season Ron Barassi played his first game. These two were to take Melbourne to new heights in the coming years. The Demons made the Grand Final in 1954, losing to Footscray , won the flag in 1955, 1956 and 1957, lost to Collingwood in 1958, and then won again in 1959 and 1960 with Smith as Coach and Barassi as Captain. , 1964 Melbourne won its 12th flag , defeating Collingwood, at the end of the season, Barassi left the club to become captain-coach of Carlton . The following season Norm Smith was sacked after a dispute with the club. Although he was soon reinstated, things were never the same again for the Demons. The club appeared in Grand Finals from 1954–1960 and every Finals' Series from 1954–1964. , After the 1954 Grand Final loss to Footscray, no team was able to score 100 points against the club until Collingwood in round 5 1963. The next team was Geelong with 110 in round 1 1964. The 1965 season started with eight wins but only two wins from the next 10 games saw the end of the era. They would have to wait until 1987 for Melbourne to make the finals again. , Poor recruiting zones and management meant that Melbourne, under coaches John Beckwith (1968–70), Ian Ridley (1971–73), Bob Skilton (1974–77), Dennis Jones (1978) and Carl Ditterich (1979–80), languished at the bottom of the League ladder throughout the 1970s. However, in 1971 the club started the season at the top and maintained that position until it lost to Collingwood in round 6. Melbourne was still in second place at the start of the second half of the season but within five weeks was out of the top four and finished with only two more wins and a draw. , In 1976, Melbourne missed what looked to be an almost certain finals appearance. In the final round they only needed to beat bottom side Collingwood and Footscray one place ahead needed to beat top side Carlton. They beat Collingwood at Victoria Park but an unexpected drawn game between Footscray and Carlton saw them miss fifth position. Had Footscray lost the game, Melbourne's superior percentage would have led them to a fifth spot finish. , Melbourne collected Wooden spoons in 1974 and 1978. , In 1980, the MFC finally legally separated from the MCC, becoming a public company, in an effort to attract more members and improve the club's finances. The season produced one less win than 1979 (five) but the club finished higher – ninth. It became evident that drastic action was needed for a club that had missed 16 finals series in a row the return of former star Ron Barassi was seen as the cure. When Barassi left in 1965 it was felt that he would eventually return and his arrival caused much excitement and an expectation of immediate success. , In 1981, under the chairmanship of Sir Billy Snedden , Barassi returned to Melbourne as coach and immediately appointed Robert Flower as captain. In Barassi's first year the team finished last, but this was attributed to working out who the willing players were and the club won some powerful victories in the next three seasons. There was a distinct revival during the middle of the 1984 season. The club had lost 6 of its first 7 games but won its next 6, two by large margins. After a powerful win against reigning premiers Hawthorn in round 13, elevating the club to 4th place on the ladder, Barassi's five-year plan seemed close to fruition. However, a loss the following week to eventual premiers Essendon seemed to demoralize the club and they only won two more games. , Even though during his era Brian Wilson won the Brownlow in 1982, and Peter Moore won it in 1984, Barassi's coaching was not directly able to get the club back into premiership contention, although his coaching may have set a precedent for the success that occurred 2 years after his departure. , In 1987, Melbourne made the finals under John Northey (for the first time since 1964), losing the Preliminary Final to Hawthorn on the last kick of the game after the final siren. It was also the last game played by the team captain Robert Flower . In 1988 the Demons did even better, reaching the Grand Final , only to be defeated, again, by Hawthorn. , From 1987 to 1991, Melbourne had five positive win-loss differentials in successive seasons which the club had not been able to achieve since the 1954–65 era. Thereafter things went downhill for Northey, although Jim Stynes won the Brownlow in 1991. In 1992, the club finished 11th, and Northey was replaced by Neil Balme as coach. Balme coached Melbourne into the finals in 1994, but a last game loss to Brisbane saw them drop out of the top-eight in 1995, and the club lingered at or near the bottom of the ladder for most of the 1996 season. , By 1996, the club was also in dire financial straits. The board, headed by past player Ian Ridley decided on the desperate step of a merger with Hawthorn. In the ensuing weeks, a passionate debate was fought between pro and anti-merger supporters. In the first few days of this debate, lifelong supporters Mark and Anthony Jenkins met with coterie member George Zagon to form the Demon Alternative – an anti-merger group that was to significantly impact on the plans of the incumbent board. The Demon Alternative recruited members from a wide range of areas but the two most recognised were former player and politician Brian Dixon and Rabbi Joseph Gutnick . The group quickly organised itself into a credible option for Melbourne supporters; however given the support of the AFL and other factors, when the merger issue was put to a vote, a majority of Melbourne members supported the board. In a meeting on the opposite side of town, Hawthorn members rejected their board's proposal and eventually the merger was defeated. , In the aftermath of the merger meetings, Ridley focused on a compromise with the Demons Alternative to ensure that Melbourne could continue as a viable business. His board co-opted Gutnick and Mark Jenkins onto the board and a truce of sorts was struck between all parties. In the months following the 1996 merger vote, the businessman and Joseph Gutnick became president. He put $3 million of his own money into the club, and sacked Balme as coach midway through the 1997 season. In 1998, under new coach Neale Daniher , the club spent most of the season in the top eight and beat the eventual premiers Adelaide in the Qualifying Final. Melbourne also eliminated St Kilda , but lost to North Melbourne in the Preliminary Final. In 1999 Melbourne finished in the bottom three. , In 2000 Daniher took Melbourne to the Grand Final, but the Demons were convincingly beaten by a rampaging Essendon. The members had expected a new era of success, but in 2001 it was same old story: Melbourne finished 11th. In 2002, although Melbourne again made the finals, Gutnick was voted out by the members. , In 2003, Melbourne plunged into a new crisis, winning only five games for the year and posting a $1 million loss. President Gabriel Szondy resigned and it seemed that Daniher's tenure as coach was under threat. But, continuing the recent trend, in 2004, Melbourne climbed the ladder again, winning 14 games and leading the competition, albeit for one round only, in Round 18; from there, the club lost five matches in a row, including the elimination final, to finish seventh. During the 2004 post-season, the Demons tragically lost defender Troy Broadbridge in the 2004 Boxing Day tsunami , when he was swept off Phi Phi island in Thailand . He was walking along the beach with his wife Trisha when the tsunami struck. His body was found on 3 January 2005, and brought home. A funeral was held on 20 January 2005 in recognition to the No. 20 guernsey he wore during his playing days. During the 2005 off-season, the whole team travelled to the island in which Broadbridge was killed to build a new school for those struck by the tsunami. The No.20 jumper was then rested for two years. , Melbourne started 2005 strongly, being second after Round 12, however losing momentum by Round 19 appeared unlikely to play finals, then wins against Western Bulldogs, Geelong at Geelong (where Melbourne had not won since the late 1980s), and Essendon in Round 22, placed the club seventh and a finals berth, only to lose the Elimination Final to Geelong by 55 points. , In 2006, after a slow start, Melbourne again finished the season in seventh position. After defeating St Kilda in the first Elimination Final by 18 points the season ended the following week when Fremantle beat the Demons by 28 points. Melbourne's coach Neale Daniher had become the second longest-serving coach of Melbourne, and the longest-surviving in the entire history of the VFL/AFL not to have coached a premiership side. , Season 2007 was a poor one for Melbourne. After losing their first nine games through a combination of injury and poor form, they finally broke through with wins against Adelaide and Collingwood . But, following a loss to Richmond the next week, Daniher resigned by the club, and Mark Riley was appointed as caretaker coach. The resignation of Daniher caused significant tension at the club. It was an unpopular move with the leadership group, and captain David Neitz expressed his dissatisfaction over the decision. Winning three of their remaining nine games, Melbourne avoided the wooden spoon and finished 14th. , Dean Bailey was appointed as coach for the 2008 season , but success did not follow, as Melbourne lost their first six matches, before breaking through with a record comeback win in round seven against Fremantle. They showed signs of improvement, putting up a good fight in round nine against top-of-the-ladder team Hawthorn, who were undefeated at the time. Melbourne had to wait until Round 14 for the second win. After good performances against Collingwood, Richmond, and Sydney in the preceding weeks, the Demons defeated Brisbane by a solitary point in the two team's first encounter at the MCG in nine years. , Off field, the club remained in serious turmoil. In the first sign of troubles in February 2008, CEO Steve Harris resigned. Paul Gardner addressed the media in response to comments from the club's auditors spelling disaster for the club. Gardner reiterated that the club had posted a $97,000 profit at the end of 2007.  Harris was replaced by the high profile former Wimbledon tennis champion Paul McNamee .  Despite celebrating the club's birthday with an official mid-season function at Crown Casino ,  shortly afterward chairman Paul Gardner resigned, handing the presidency to former club champion Jim Stynes who inherited a $4.5 million debt, which media pundits suggested would cripple the club.  Hawthorn 's president Jeff Kennett caused controversy with remarks about relocating the Demons to the Gold Coast ,  something which Stynes spoke against. AFL CEO Andrew Demetriou dispelled the notion that the club's future was in doubt, but admitted that Stynes' board faced a huge challenge.  Demons legend, games and goalkicking record holder, David Neitz, announced his immediate retirement due to injury on 19 May.  , Stynes wasted no time attempting to change the club's direction and eliminate debt, introducing a drive called \"Debt Demolition\", beginning with a call for members to sign-up.  Under Stynes' direction, the new board sacked Paul McNamee after just four months. During McNamee's tenure, he had drawn criticisms for holidaying in Wimbledon to compete in a legends match and after his sacking an attempt to lure Brisbane Lions star Jonathan Brown was also revealed.  A 5 August fundraiser raised $1.3 million. The club raised well over $3 million.  Despite the reduced debt, in November new club CEO Cameron Schwab declared that it required urgent AFL assistance to continue, requesting additional funding to its special annual distribution. In December, a fallout in negotiations between the Melbourne Cricket Club resulted in the MCC not committing an expected $2 million to the club and Schwab declared that the club's immediate future was in doubt.  , This doubt was quickly put to bed when the AFL and MCC finalised negotioations. The AFL committed $1million to the club in 2009, with the MCC matching the AFL contribution.  , By the midpoint of the 2009 season, things had improved both on and off field for Melbourne. They had secured a record number of members, re-merged with the MCC, knocked-off more debt and were starting to show some fight on field. Players such as Liam Jurrah had begun to emerge as top young talents and were catching the eye of the footballing public. However, on the eve of the Round 14 clash against West Coast, influential president Jim Stynes announced that he had cancer, this evoked a very emotional response from the footballing public and the club lifted from three embarrassing defeats the weeks before to convincingly beat West Coast in front of a passionate MCG crowd. At the end of the season, Melbourne finished 16th on the ladder and for a second year in a row won no more than four games which granted them a Priority Pick in the National Draft . Melbourne therefore had picks 1 and 2 in the draft to build on their young talent. At the end of the season fan favourites Russell Robertson , Matthew Whelan and Paul Wheatley announced that they would no longer be playing for Melbourne in 2010 and beyond. During September 2009, midfielder Brock McLean asked to be a traded and a deal involving Carlton's pick 11 in the National Draft was agreed to.  , After losing their first game against Hawthorn by 50 points and a narrow defeat to Collingwood, Melbourne strung together three consecutive wins against Adelaide, Richmond and Brisbane, making it the first time they have won three games in a row since 2006. Their 50-point win over the previously undefeated and top-of-the-table Brisbane Lions , was the upset of the round, along with Port Adelaide's shock win against St Kilda. It was the Demons' victory over Brisbane that started their freefall, winning only three more games for the season. However, losses to North Melbourne, Western Bulldogs and the poorly performing West Coast seemed to end the Dees finals dream. However, the Demons made a comeback when they narrowly defeated Port Adelaide by one point, at a home game in Darwin . Though subsequent losses to Geelong and Carlton lowered the Demons spirits, they fought a hard battle against arch-enemy Collingwood and came out with a draw. Despite showing great resilience against Collingwood, the Demons were handed two further blows with losses to Adelaide and St Kilda. The following round saw a match-up with Essendon that would decide either team's fate. Though both teams fought hard, the Demons came out on top by 19 points, keeping their finals dreams alive and moving above Essendon on the ladder. The Demons then travelled to Perth, where after a poor start, they fought back, but fell away to lose by 11 points to finals aspirant Fremantle. The next week they faced Sydney at the MCG, for the first time since 2006. Melbourne defeated Sydney by 73 points, thereby inflicting the worst loss Sydney has ever had, under premiership winning coach, Paul Roos . This was followed up with a 10-point win over the Brisbane Lions at the Gabba where the Demons had not won since 2006. The Demons finished the 2010 season in 12th position with eight and a half wins (more than double their win tallies from 2008 and 2009 combined); that could have easily been eleven if not for close results against 2010 Premiers Collingwood during the course of the year (a one-point loss in round 2 and a draw in round 12) and the Western Bulldogs (a four-point loss in round seven). , On 5 August, the club announced that Jim Stynes ' goal of wiping out the club's debt that had plagued them for so long had finally been achieved.  The event also saw Melbourne unveil its proposed new logo, which incorporates a trident, the Southern Cross , as well as the inaugural rules of Australian rules football .  , Melbourne's 2011 season started with a dramatic draw against Sydney , tying 11.18.(84) apiece after Melbourne captain Brad Green had soccered through a goal with four minutes remaining, only to see their short lead disappear by the final siren. Melbourne, heading into the match, had not won its season opening match since 2005, nor did Sydney. Round 2 saw Melbourne lose dramatically to Hawthorn by 45 points after leading by 19 at halftime. Their next two matches leading into the round 5 bye saw them defeat Brisbane by 11 points and the Gold Coast by 90 points. , However, in an eventful twist to their season, the Demons only recorded four wins between the bye in Round 5 and the second bye in Round 16, that being a record 96-point thrashing of Adelaide at the MCG in Round 7 and a convincing 33-point win over top eight side Essendon in Round 11, a record 89-point thrashing of Fremantle in Round 13, and a 27-point victory over Richmond in Round 14. , In Round 19 the Demons suffered the second-heaviest defeat in AFL/VFL history – a 186-point humiliation at the hands of Geelong . Twenty-four hours later, the Melbourne Football Club called an urgent board meeting after which coach Dean Bailey was sacked with five games remaining in the 2011 season. He left the club with only 22 wins from 83 games – a winning percentage of just over 25%, however, he was credited for rebuilding the club following the retirements of David Neitz , Adem Yze and Russell Robertson early in Bailey's coaching career. Demons assistant coach and former player Todd Viney was appointed caretaker coach for the remainder of the season, achieving 1 win the five games he coached. On 17 September 2011, Mark Neeld was appointed as senior coach for a three-year term.  , On 13 April 2012, It was announced that Webjet would take over the sponsorship of Melbourne Football Club after the controversial comments by former Melbourne sponsor, Ben Pollis, of Energy Watch.  On the field, the Demons had a poor start to the season, losing the first nine matches of the season before finally winning in Round 10, upsetting then top-placed Essendon by six points. , Despite the off-season acquisitions of several players, such as Shannon Byrnes , Tom Gillies , Chris Dawes , David Rodan and Jack Viney , the Demons underachieved in the first half of the 2013 season, managing just one win in their first 11 games. As the result of this poor start to the season, during the Demons' mid-season bye on 17 June 2013, Mark Neeld was sacked as head coach. His sacking came within weeks of the departures of senior Demons' staff members Cameron Schwab and Don McLardy . Neeld left the Demons with just five wins in 33 games coached, for a winning percentage of just 15%. Demons' senior assistant coach, Neil Craig , was appointed as the caretaker coach for the remainder of the season. Following a disastrous season finish of 17th on the ladder with two wins, on 6 September the club announced that Sydney premiership coach Paul Roos had signed a two-year deal to coach the Demons, with the option of a third year. , Paul Roos's first year in his tenure as Demon's head coach saw an improvement from their 2013 season, with the Demons doubling their win tally and their points tally, in addition to increasing their percentage and reducing the number of points conceded by the team. However, the Demons finished the season in 17th place for the second consecutive season. , On 31 July 2012, the AFL's Integrity Officer, Brett Clothier, announced a full investigation into Melbourne's 2009 season regarding allegations that the Demons had \"tanked\" (set out to lose) games during the season to secure a priority draft-pick that year, available to clubs winning fewer than five games. Although the press had published such allegations previously,  the investigation was prompted by specific statements from former player Brock McLean during a TV interview earlier in July 2012.  Melbourne club officials, led by board chairman Don McLardy, vigorously denied the tanking allegations. The investigation lasted 203 days and Clothier interviewed over 50 people associated with the club. The AFL released its findings on 19 February 2013. Clothier effectively cleared Melbourne of tanking, stating \"there was no directive from the board and executive of the Melbourne Football Club to deliberately lose matches and that the club, coach and players did not deliberately set out to lose matches.\" However, the investigation did establish a 'secret' meeting, known as \"The Vault\", had taken place during 2009 at which club football manager Chris Connolly impressed upon then-coach Dean Bailey the desirability of procuring a priority draft pick. The AFL fined Melbourne $500,000 and suspended Connolly for one year from involvement in Melbourne's training and match-day duties and Bailey (subsequently an assistant coach of Adelaide ) for 16 weeks from coaching duties, on the basis they had contravened rule 1.6 by \"acting in a manner prejudicial to the interests of the AFL.\" Neither Melbourne, Connolly or Bailey contested these penalties.  , The former club mascot was Ronald Deeman, or also known as Ruckle. He carried a trident , had devil horns and a pointed devil tail. , The current club mascots are Chuckie and Checkers, named after legendary coach \"Checker\" Hughes. They are manned by the brothers Newmarch. , The official Melbourne Football Club song is called \"It's a Grand Old Flag\" (sung to the tune of \" You're a Grand Old Flag \"). The club resurrected the original second verse in February 2011 for the 2011 season.  , Melbourne has traditionally had one of the smallest supporter bases of the Victorian teams (along with North Melbourne and the Western Bulldogs) but have improved their membership and attendances steadily since the failed Hawthorn merger in 1996, building a membership base of over 30,000 since 2009. In 2011 they set a membership record of 36,937. , * as at 22 June 2015 , The Melbourne Football Club Team of the Century was announced on 24 June 2000 at Crown Casino . The selectors were Percy Beames (former player and journalist), Lynda Carroll (club historian), Bill Guest (MFC Director), Greg Hobbs (journalist), John Mitchell (former MFC and MCC President), Linda Pearce (journalist), Dudley Phillips (supporter), Stephen Phillips (media consultant) and Mike Sheahan (journalist), with CEO John Anderson as non-voting chairman.  , Melbourne FC announced its \"150 Heroes\" to celebrate its 150th birthday at Crown Casino on 7 June 2008. Each player, or their closest relative, were presented with an official 150 heroes medallion. The criteria for inclusion was games played (minimum of 100), best-and-fairest awards , premierships, Brownlow Medals , contribution to the club and State representation. Those who died in the war were judged based on their achievements before their death. The heroes named were: , Jim Abernethy , Frank Adams , Bill Allen , Stan Alves , Syd Anderson , Tony Anderson , Lance Arnold , Ron Baggott , Garry Baker , Harold Ball , Ron Barassi , Percy Beames , John Beckwith , George Bickford , Ray Biffin , Barry Bourke , Harry Brereton , Cameron Bruce , Keith Carroll , Geoff Case , Albert Chadwick , Noel Clarke , Geoff Collins , Jack Collins , Chris Connolly , Bob Corbett , Denis Cordner , Don Cordner , Ted Cordner , Vin Coutie , Harry Coy , Jim Davidson , Frank Davis , Ross Dillon , Carl Ditterich , Brian Dixon , Len Dockett , Adrian Dullard , Hugh Dunbar , Richie Emselle , Fred Fanning , Jeff Farmer , Matthew Febey , Steven Febey , Dick Fenton-Smith , Rowley Fischer , Robert Flower , Laurie Fowler , Maurice Gibb , Peter Giles , Terry Gleeson , Brad Green , Rod Grinter , George Haines , Gary Hardeman , Henry Harrison , Gerard Healy , Greg Healy , Dick Hingston , Paul Hopgood , Danny Hughes , Anthony Ingerson , Eddie Jackson , Alan Johnson , Bob B. Johnson , Tassie Johnson , Trevor Johnson , Travis Johnstone , Gordon Jones , Les Jones , Bryan Kenneally , Allan La Fontaine , Clyde Laidlaw , Frank Langley , Jack Leith , Andrew Leoncelli , Charlie Lilley , Wally Lock , Harry Long , John Lord , Andy Lovell , Brett Lovett , Glenn Lovett , Garry Lyon , Hassa Mann , George Margitich , Peter Marquis , Bernie Massey , Anthony McDonald , James McDonald , Fred McGinis , Shane McGrath , Bob McKenzie , Col McLean , Ian McLean , Noel McMahen , Ken Melville , Laurie Mithen , Peter Moore , Jack Mueller , David Neitz , Stephen Newport , Jack O'Keefe , Andrew Obst , Gordon Ogden , Greg Parke , Joe Pearce , Jack Purse , Ian Ridley , Guy Rigoni , Frank Roberts , Russell Robertson , Alby Rodda , Brian Roet , Peter Rohde , Alan Rowarth , David Schwarz , Norm Smith , Steven Smith , Earl Spalding , Stuart Spencer , Charlie Streeter , Steven Stretch , Jim Stynes , Tony Sullivan , Dick Taylor , Ted Thomas , Ian Thorogood , Stephen Tingay , John Townsend , Keith Truscott , Geoff Tunbridge , Bill Tymms , Barrie Vagg , Francis Vine , Todd Viney , Ivor Warne-Smith , Ray Wartman , Athol Webb , Greg Wells , Jeff White , Sean Wight , Don Williams , Brian Wilson , Stan Wittman , Shane Woewodin , Graeme Yeats , Charlie Young , Adem Yze , Head coach , Assistant coaches , , The honour board is listed from the first VFL/AFL season and includes the following individual awards: "
}
