{
  "category": "afl",
  "article": "(Victory demands dedication) , Champions of Australia (1): 1975 , The North Melbourne Football Club , nicknamed The Kangaroos or less formally The Roos , is the fourth oldest Australian rules football club in the Australian Football League (AFL) and is one of the oldest sporting clubs in Australia and the world. It is based at the Arden Street Oval in the inner Melbourne suburb of North Melbourne , but plays its home matches at the nearby Docklands Stadium . , The club's mascot is a grey or red kangaroo , and its use dates from the middle of the 20th century. The club is also unofficially known as \"The Shinboners\", a term which dates back to its 19th-century abattoir-worker origins. The club's motto is Victoria amat curam , Latin for \"Victory Demands Dedication\". , , , North Melbourne Football Club originated in the year 1869, when a football team was formed for local cricketers desiring to keep fit over the winter months. One thought is that the club was connected to the St Mary's Church of England Cricket Club, now the St Mary's Anglican Church North Melbourne, whose colours – blue and white – are reflected in the North Melbourne's colours today.  The association between the St Mary's Church of England Cricket Club and the establishment of the North Melbourne Football Club is believed to have been an informal gathering to play some competitive sport. Information on the club's first ever match is limited, but it is known that it took place in Royal Park , which also served as the club's home ground until 1882. The ball used in the match was purchased by a local resident called Tom Jacks, who sold some roofing iron to pay for it. [ citation needed ] James Henry Gardiner is considered the founder of the club. He continued an active role with North Melbourne until his death in 1921. [ citation needed ] , Regular premiership matches of Australian Football commenced in Victoria in 1870. Although North Melbourne was a part of this, it was classed as a \"junior club\". The Australasian noted them as being \"one of the best of many junior clubs\". [ citation needed ] , The club continued to develop, graduating to senior ranks in 1874 finishing 4th. Along with the promotion, the club adopted its first uniform of blue and white horizontal stripes. [ citation needed ] , In 1876 North Melbourne amalgamated with Albert-park to form \"North Melbourne Cum Albert Park\", but by 1877 the local community had raised sufficient funds to reestablish the club, under the new name of \"Hotham\". [ citation needed ] , Football took a giant step forward in 1877, with the formation of Victoria's first colonial football league, the VFA. Hotham were prime movers in establishing this league and were afforded a place in light of their previous contributions to Australian Football. [ citation needed ] , The 1880s marked the emergence of the modern identity we now associate with North today. In 1882, the club amalgamated with the Hotham Cricket Club and moved into the North Melbourne Recreation Reserve (Arden St Oval), which remains the home of the club today. The joint venture was aimed at affecting improvements at the Hotham Cricket Ground, which was the name of the Reserve at the time. Four years later the club adopted the traditional uniform of blue and white vertical stripes at the insistence of the VFA, who wanted a visible contrast between Geelong's and Hotham's uniforms. The third significant development occurred in 1888 with the club returning to its original name of the North Melbourne Football Club. This followed the name of the local area reverting from Hotham to North Melbourne. , The 1880s saw the club develop a penchant for inter-colonial travel with trips to Tasmania (1881/1887) and South Australia (1889). Hotham also found itself well represented at the first ever inter-colonial representative game in 1879 with four players from the club gaining selection for Victoria. , The VFA grew to 13 senior clubs in the 1890s. Led by Geelong and Essendon, the largest clubs of the VFA formed their own break away league, the Victorian Football League (VFL), in 1896. Despite finishing 6th in 1896, North Melbourne was not invited to the breakaway competition. The main reasons for being excluded were: , North continued on in the depleted VFA, emerging as a powerhouse, finishing 2nd in 1897, 1898 and 1899. In 1903, after 34 years of competing, the club won its first premiership, defeating Richmond in the final. The club became back to back premiers in 1904 after Richmond forfeited the grand final due to the appointment of an umpire whose performance when the two teams met earlier in the year was severely criticised by Richmond players and officials.  , North merged with fellow VFA football club West Melbourne in 1907, which at the time had lost its home ground. The joint venture saw a chance of promotion, and the club applied for admission to the more prestigious VFL in 1908, but Richmond and University were admitted instead. North was kicked out of the VFA during the 1907/08 offseason as a result of applying to join the VFL,  before the local community reestablished the North Melbourne Football Club under a new committee, successfully enabling the club to play in the VFA in the 1908 season.  , The reformation of the Club necessitated a massive clean out of the team, leaving only two players remaining from the previous season. The 1910 season was marked by one of the most sensational transfers in Victorian football history, when Andy Curran masterminded the clearance of Carlton's famed \"Big Four\" of 'Mallee' Johnson, Fred Jinks , Charlie Hammond and Frank 'Silver' Caine to North Melbourne. These signings secured the Northerners' third premiership in 1910. , The 1912 finals series was one of the most amazing ever, with the semi-final having to be played three times, after North and Brunswick drew twice. North was eventually victorious and moved on to the final, but lost the game by a mere four points with the last kick of the day. , The next few years were punctuated by \"The Invincibles\". In the Northerners' most illustrious period ever, the club went undefeated from 1914 to 1919, collecting premierships in 1914, 1915 and 1918 – the league was in recess in 1916 and 1917 due to World War I . As well as this, the club won the championship in both 1915 and 1918 for finishing on top of the ladder, and accounted for VFL side St Kilda comfortably. During this period the club won 58 consecutive matches including 49 successive premiership matches, a record that has remained unmatched in Association or League history since. , Despite being rejected from the VFL in both 1896 and 1907, North persisted in trying to gain admission into the League. On 30 June 1921, North told its players it would disband and try to gain entry to the VFL by the ‘back-door’. Essendon League Football Club had lost its playing ground at East Melbourne and had decided to acquire the North Melbourne Recreation Reserve as a new playing ground. North accepted their proposal in the idea that the clubs would amalgamate. All of North's players were urged to join the Essendon League Club to help facilitate the amalgamation. The amalgamation was foiled when some members of the VFA launched a successful legal challenge.  As a result the Essendon League Club moved instead to the Essendon Oval, replacing the ground's original occupants, Essendon Association . , North was now without a playing team and the Essendon Association Club was now without a ground, so as a matter of convenience the two clubs amalgamated so they could compete in the 1922 season. As it had after the merger with West Melbourne, North once again managed to avert its destruction. , After three attempts, 29 years of waiting and numerous other applications to enter the VFL, finally North was rewarded for its persistence with admittance to the League in 1925, along with Footscray and Hawthorn . Even then, the opportunity was almost lost as the League delegates debated into the early hours of the morning on which clubs should be invited to join the intake. It was only after much deliberation that North Melbourne's name was eventually substituted for Prahran's making North \"the lucky side\" of the invitees that included Footscray and Hawthorn. North Melbourne was forced to change its uniform to avoid a clash when it joined the VFL. , North Melbourne were cellar dwellers for its first twenty-five years of VFL membership and struggled to win matches in the superior VFL competition, but by the late 1940s had developed a strong list and significant supporter base. In 1949 North secured the VFL Minor Premiership, finishing top of the ladder at the end of the home-and-away season with 14 wins and 5 losses. They failed to make the Grand Final that year (eventually won by Essendon ), but in 1950 they did reach the final, defeated by a more efficient Essendon. It was in this year that the club adopted the \"Kangaroos\" mascot.  , In February 1965, North Melbourne moved its playing and training base from the Arden Street Oval to Coburg Oval , signing a seven year lease with the City of Coburg  after initially negotiating long-term leases for up to 40 years.  The club came to an arrangement to merge with the VFA's Coburg Football Club , whom it was displacing from the ground;  fourteen Coburg committeemen joined the North Melbourne committee, but the merger was never completed after Coburg established a rival committee which remained loyal to the VFA.  The lease at Coburg lasted only eight months; the Coburg council was hesitant to build a new grandstand without the security of a long-term lease, and neither party made the returns they expected, so it was terminated by mutual agreement in September 1965 and North Melbourne returned to the Arden Street Oval.   , Onfield, the 1950s and 1960s were lean years for North Melbourne, though the club did secure two consecutive Night Premierships in 1965 and 1966. Allen Aylett was a brilliant player in the late 1950s and early 1960s (and captain between 1961 and 1964), as was Noel Teasdale , who lost the Brownlow Medal on a countback in 1965 (he was later awarded a retrospective medal when the counting system was amended). , In the late 1960s, under the leadership of Allen Aylett , North Melbourne began its climb to supremacy. As part of a major recruitment drive North secured the services of several big name stars including Barry Davis from Essendon and Doug Wade ( Geelong ), John Rantall (South Melbourne), Barry Cable ( Perth ). In a major coup, the great Ron Barassi was appointed coach in 1973. Barrassi reversed the club's playing fortunes, taking an unremarkable team that was once regarded as the traditional cellar dwellers of the competition, through a golden era of success that transformed North into one of the powerhouses of the VFL. Barassi took North to a Grand Final (defeated by Richmond ) in 1974 and brought success in his 1975 and 1977 seasons. North made five consecutive Grand Finals from 1974–1978)  :209 and defeated Norwood in the 1975 national championship to be declared Champions of Australia . , In 1973 and 1974, North's wingman Keith Greig won consecutive Brownlow Medals ; forward Malcolm Blight then won the award in 1978. Doug Wade won the Coleman medal in 1974 with his 103 goals for the season. , Barassi remained team coach until 1980, but only a Night Premiership in that year was to result from his last years at Arden Street . North then entered another period of decline, though Malcolm Blight kicked 103 goals to take out the Coleman medal in 1982, and another Brownlow win came through the talented Ross Glendinning in 1983. In that year, North Melbourne won a third Minor Premiership with 16 wins and 6 losses for the season, but failed to make the Grand Final. , The capable coaching of John Kennedy aside, the 1980s and early 1990s were lean years for the Kangaroos. However, the rebuilding of the club was taking place. The Krakouer brothers (Jim and Phil) brought a spark into the side and lifted many hopes for North supporters and the excitement to the general football public. The innovative idea of night games was instigated by the club and meeting the challenges, the club survived. One major highlight was the recruitment of forward John Longmire in 1989, who topped the club goalkicking over five consecutive seasons (1990–1994) and won the Coleman medal in 1990 with 98 goals. At the beginning of the 1993 season, in a dramatic and controversial move, the board of the club sacked coach and long-time player Wayne Schimmelbusch , and appointed Denis Pagan in his place. Results were immediate, as North reached the finals for the first time in nearly a decade. , Pagan was instrumental in appointing young centre half-forward Wayne Carey as the club's youngest-ever captain. Carey had been recruited at the same time as Longmire , but taken longer to develop as a player. Over the next nine seasons, Carey came to be regarded as the standout player in the league, and was known as 'the King'. , North Melbourne became a powerhouse through the 1990s under Pagan and Carey, and finished in the top four from 1994 until 2000. After being eliminated in the preliminary finals in 1994 and 1995, North went on to defeat the Sydney Swans in the 1996 Grand Final to take out the club's third premiership, and the gold centenary AFL cup; Glenn Archer won the Norm Smith Medal . The club was again eliminated in the preliminary final in 1997. In 1998, as the club won both the pre-season Ansett Cup and topped the ladder with 16 wins and 6 losses, but went on to lose the 1998 Grand Final to Adelaide , not helped by an inaccurate goalkicking performance of 8.22 (70) to Adelaide's 15.15 (105). In 1999, the Kangaroos finished in second position on the ladder, and went on to defeat Carlton in the Grand Final, winning the club's fourth VFL/AFL premiership; former Sydney midfielder Shannon Grant taking out the Norm Smith Medal . The club was eliminated in the preliminary finals in 2000 against Melbourne. , In 1996, the club was in advanced talks with the Fitzroy Football Club , which was in a terminal financial condition, to a merger between the two clubs; however, Fitzroy ultimately merged with the Brisbane Bears instead. , Seeking new markets and greater financial security in an increasingly corporatized AFL environment, the title \"North Melbourne\" was officially dropped from the logo in 1999, from which time the team played only as the \"Kangaroos\". During the successful 1999 season, North Melbourne played home games in Sydney with a view of becoming a second team in New South Wales ; however, the experiment was not successful, with crowds averaging only 12,000. , The 21st century did not begin well for North Melbourne. Its decade-long onfield potency was in decline, questions were raised about its financial position and long-term sustainability. Furthermore, three of the people most important to the club's success in the 1990s left the club under acrimonious circumstances: CEO Greg Miller left the club, captain Wayne Carey left prior to the 2002 season following an extramarital affair with the wife of team-mate and vice captain Anthony Stevens , coach Denis Pagan was lured to Carlton at the end of 2002. Pagan was replaced by 1996 premiership player Dean Laidley , who had previously been an Assistant Coach at Collingwood from 1999 until the end of season 2002. , On a post-season holiday, several players were caught in the 2002 Bali bombing terrorist attack. Defender and sometime forward Jason McCartney suffered severe burns in the incident. He memorably played one final game for the club, on 6 June 2003 against Richmond , and he set up the winning goal with seconds remaining. He retired immediately after the game. , Onfield, the club reached the elimination finals in 2002 and 2005, but otherwise failed to reach the finals from 2001 until 2006. After two seasons of finals, North Melbourne dropped to 13th in 2009, and coach Dean Laidley, was replaced by ex-Brisbane Lions premiership player and Collingwood assistant coach Brad Scott . A $15M redevelopment of the Arden Street, which had started in 2006, was completed in 2009, giving the club top-class training facilities. North Melbourne struggled in its first two years under Scott, finishing 9th in both 2010 and 2011. In 2012, the club returned to the finals for the first time since 2008, finishing the season in 8th place but would go down to the West Coast Eagles by 96 points in the elimination final. In 2012, the club began a three-year deal to play two games each year at Blundstone Arena in Hobart, Tasmania . The club finished 10th in 2013 in a season full of close losses. Nick Dal Santo signed with the club at the end of the 2013 season as a restricted free agent. , In 2014, North Melbourne finished 6th at the end of the home and away season and reached 40,000 members for the first time in the club's history.  In September, North Melbourne went on to defeat Essendon by 12 points in the 2nd Elimination Final, only taking the lead in the last quarter. The following week, North Melbourne beat Geelong in the 2nd Semi Final by 6 points advancing them through to their first Preliminary Final since 2007. They lost to Sydney by 71 points. , The club was widely known as the 'Shinboners' for much of their early history. The origins of this nickname are unknown but it may have had something to do with the club's reputation for targeting the shinbones of opposition players, or to do with local butchers who showed their support for North by dressing up beef leg-bones in the club colours. By 1926, the club was known as the 'Blue Birds' but this nickname did not last. It was Phonse Tobin, North president from 1953–56, who oversaw the club adopting the Kangaroos emblem in 1954; Tobin found the image of a shinbone unsavoury and wanted the club to have a mascot it could show with pride. In selecting a new name, he wanted something characteristically Australian and got inspiration from a giant Kangaroo he saw on display outside a city store. , The official name of the club is North Melbourne, but the club has gone under several other aliases over the years. The club was originally founded as the 'North Melbourne Football Club', but changed to 'North Melbourne cum Albert Park' after merging with Albert Park in 1876. Following the reformation of the club in 1877, it was known as the 'Hotham Football Club' but later retook the name 'North Melbourne' in 1888. In 1998 the club proposed changing its name to the 'Northern Kangaroos', but it was rejected by the AFL. Between 1999 and 2007, the club traded without much success as 'The Kangaroos' in a bid to increase its appeal nationally; this decision was reversed at the end of 2007, and the club has once again reverted to the name 'North Melbourne'. , North Melbourne's guernsey since entering the VFL in 1925 has consisted of white and royal blue vertical stripes. The guernsey is predominantly white. , The current clash guernsey is a reversed version of the home strip, with blue stripes where the white stripes traditionally are placed and vice versa; as such, the clash strip is predominantly royal blue, rather than predominantly white, creating a much darker design. , \"Join in the Chorus\" is the official anthem of the North Melbourne Football Club. It is sung to the tune of a Scottish folk song \"A Wee Deoch an Doris\", from around 1911.  , The famed song is generally sung, in accordance to common football tradition, after a victory. It is also played before every match. , \"Join in the Chorus\" is believed to be the oldest club anthem of any AFL club, and has been associated with North from its early VFA days. The preamble of the song originates from a score of a Theatre Musical called 'Australia: Heart to Heart and Hand to Hand\" written by Toso Taylor in the 1890s in pre-federation Australia.  The second verse is unknown in origin and was presumably added later by members of the North Melbourne Football Club when the song was chosen as the club theme. The chorus was appropriated from a song written and performed by Scottish musician Harry Lauder . The recording currently used by the club was performed by the Fable Singers in April 1972 and only includes the choruses.  , The song has a strong Victorian heritage, and has been traditionally sung by the Victorian State Football and Victorian Cricket teams respectively. The lyrics have occasionally been changed, including updating the year in the song ( e.g. North Melbourne will be premiers in 1993 ), or to remove the words \"North Melbourne\" during the period when the club was competing as 'Kangaroos'. , For the 2015 premiership season, You Am I lead singer Tim Rogers , a fan of North Melbourne, announced he will assist in an updated version of the club song including the 2 versus. This version is only played at North home games as they run out onto the ground. , The term \"Shinboner spirit\" is often used to refer to camaraderie and determination of players or members of the North Melbourne Football Club. The term persists to the modern day, despite North Melbourne having switched its official nickname from Shinboners to Kangaroos in the 1950s. , Because it relates to the club's original nickname, Shinboner spirit is often associated with the complete history of the club. In 2005, to celebrate the club's 80th anniversary of senior competition in the VFL and the thirtieth anniversary of the first VFL premiership, the Kangaroos held a \"Shinboner Spirit\" gala event, attended by almost the entire surviving playing list. In the awards ceremony, the key Shinboners of the past eighty years were acknowledged, and Glenn Archer was named the \"Shinboner of the Century\". , The North Melbourne Football Club is non a profit organisation limited by guarantee. Members of the club serve as the guarantees of capital, and have full voting rights at AGMs to elect directors to the club's board. , The club's board compromises nine directors with each director serving a 3-year term before their position is put up for re-election at an AGM. Only one-third of the board is contested at each AGM due to the rolling structure of the terms of the directors. This structure safeguards the entire board from being ousted at a single AGM, and has made North Melbourne immune to a lot of the in house fighting witnessed at other AFL football clubs. The board governs the club as well as selecting a chairman to head the club through a majority vote of directors. , North Melbourne is unique in its structure, because from 1986 to 2006 the club was privately owned and limited by shares. The club was floated in 1986 through a membership vote led by then chairman Bob Ansett. At the meeting, members were encouraged to buy into the club by purchasing shares. The float ended up raising over $3 million and helped to keep the club solvent through the next decade. , In 1991, the John Elliott -led Carlton Football Club attempted a hostile take over North Melbourne by purchasing a large parcel of shares formerly owned by Bob Ansett. The Blues acquired 20 per cent of the capital but that stake was eventually bought back by John Magowan, the former head of Merrill Lynch Australia, in 2001. The resulting melodrama saw the formation of B-Class shareholders who had the effective power of veto over any attempt to merge or relocate the club. , Further takeover attempts were made in the first decade of the 21st century by the Southport Sharks . Then chairman Allan Aylett knocked back a proposal from the Sharks that would have seen them gain a majority stake in the club in exchange for an injection of capital. In early 2006, another proposal from Sharks to underwrite Kangaroos games on the Gold Coast, in exchange for a slice of the shareholder structure at the club was knocked back after AFL intervention. , Due to an Australian Tax Office ruling in 2006, the club proposed a shareholder restructure that would have seen the B Class shareholders power reduced significantly and some voting rights returned to members. This was done to avoid extraordinary taxes being placed on the club, but the move was blocked in December by Bob Ansett and his proxies who feared that the restructure would make the club vulnerable to further takeover bids. , On 28 February 2007, another meeting was called to resolve the shareholder issue, and a motion was passed that would return see some voting rights return to members and stop any future tax increments. , In April 2007 it was revealed the AFL was attempting to buy out the shareholders of the club in a bid to gain full ownership, and force a relocation of the club to the Gold Coast. , During October 2007, a group called We Are North Melbourne emerged and launched a public campaign, calling for ordinary members to be given the final say on the relocation issue. While the group became synonymous with the push to keep the club in Melbourne, its first priority was to see the club's shareholder structure wound-up and control returned to ordinary members. , North Melbourne reverted to public company in November 2008. A moratorium was passed at an extraordinary general meeting that will allow James Brayshaw's board to serve unopposed until 2010, so as to allow his ticket the maximum time to enact their policies to make the North Melbourne Football Club financially viable. , In 2014 The North Melbourne Football club achieved a record membership of 40,092 members including 4,145 from Tasmania. The figure is a 78% increase since 2007 when the club faced possible relocation. , In 1985, North Melbourne pioneered the concept of playing football on Friday nights. Since then, North Melbourne has played the most Friday night games of any AFL club. [ citation needed ] , Friday night matches later became the most lucrative timeslot for televised games, and North Melbourne's relatively low supporter base resulted in less Friday night matches. Between 2010 and 2014, North Melbourne had hosted an annual Friday night match against Carlton in recognition of its pioneering role in the concept.  , North Melbourne has a strong history of supporting Aboriginal footballers and fostering Aboriginal talent in the VFL and AFL. The first indigenous footballer to play for the club was Percy Johnson in the 1950s, and was followed by other fan favorites like Bertie Johnson, Barry Cable and the Krakouer brothers in the following decades.  , The following is a list of Indigenous footballers to have played senior football at the club:   , †: Aboriginality uncertain , The following footballers who were killed in action during the World Wars played senior football for North Melbourne. , Essendon (main) – North and Essendon have a chequered history that dates back to the late 19th century; firstly in 1896, Essendon had North excluded from the VFL because both clubs drew supporters from the same area. North supporters have long been bitter with Essendon for excluding them from the VFL, and have blamed that for their small supporter base in comparison to Essendon's. North's first VFL Grand Final was against Essendon in 1950 . The rivalry was reignited in the 90s; in 1998, following comments by Essendon coach labelling Kangaroos executives Greg Miller and Mark Dawson \"marshmallows\", a reference to their softness, North supporters threw marshmallows at Sheedy after the opening Qualifying Final.  , Hawthorn – North and Hawthorn have a fierce rivalry that dates back to the 1970s when they played off against each other in three Grand Finals in the space of four years. From 1974 to 1978 the two clubs played against each other in ten finals, and took each other on for the Australian Championship in Adelaide in 1976. During the 1980s Hawthorn dominated North, and during the 90s the results were reversed with North dominating Hawthorn. , Collingwood – North and Collingwood have a small kind of rivalry between them. As they drew in the 1977 Grand Final , which North went on to win in the replay by 27 points.  , Carlton – Although not known for their on-field rivalry, North Melbourne and Carlton have endured a tumultuous off-field relationship. In 1965, North Melbourne moved to the Coburg City Oval , which Carlton opposed as an invasion of its own territory: Coburg was located within Carlton's recruiting zone, and was home to about of quarter of Carlton's members at the time.  Later, after North Melbourne was listed on the stock market in 1987, Carlton bought 20% of the shares to become part-owner of the rival club. In 1988 there was a merger proposal put to North Melbourne, that was rejected.  , Port Adelaide - Port Adelaide often refer to North Melbourne as the \"bogey side\"   and as of 2014, North lead 21-8.  Their most recent was in round 3 2014, where North came from behind to win by 7 points. This was Port's only loss in the first 12 rounds of 2014 . , Port Adelaide lost their first finals appearance to North Melbourne in 1999 in the qualifying final, and in Port's premiership year of 2004 , North beat Port by 92 points, however, Port beat North Melbourne in the 2007 Preliminary Final by 87 points. , At a special function in August 2001 the North Melbourne Team of the Century was announced. There was no minimum number of games set for selection. Wayne Carey was named as captain and Denis Pagan as coach. The selection panel was Geoff Poulter (journalist), Father Gerard Dowling (club historian), Keith McKenzie (former coach), Lloyd Holyoak (former president), Max Ritchie (former player and chairman of selectors) and Greg Miller (chief executive). , , On 18 March 2005, the North Melbourne football club held a special gala dinner entitled the \"North Story\" to celebrate the 80th anniversary of North's admission to the VFL, and the 30th anniversary of the club's first VFL premiership. Over 3500 people attended the historic event held at the Royal Exhibition Building , including almost all surviving North Melbourne players. Glenn Archer was voted the Shinboner of the Century by his peers as the player who most represents the 'Shinboner Spirit'. The following players were voted 'Shinboners' of their era: , Head coach , Assistant coaches , , "
}
