{
  "category": "afl",
  "article": "The Port Adelaide Football Club is a professional Australian rules football club based in Alberton , South Australia, which plays in the Australian Football League (AFL) (in which they are known as the Power ) and the South Australian National Football League (SANFL) (in which they are known as the Magpies ).  Port Adelaide is the older of the two clubs in South Australia playing in the AFL and the 5th oldest club playing in the Australian Football League . Since the club's first game on May 24, 1870, it has won 36 SANFL premierships, including six in a row. The club also won the Champions of Australia competition on a record four occasions.   , From its foundation in 1870 to 1996, the Port Adelaide Football Club competed in the SANFL as the Magpies. In 1997, the club joined the Australian Football League—the only pre-existing non-Victorian club to have done so. On entry, Port Adelaide adopted a new nickname, \"The Power\", along with the colour teal. Since joining the AFL, Port Adelaide have added the 2004 AFL Grand Final to their premiership wins. , , , The Port Adelaide Football Club was established on 12 May 1870 as part of a joint Australian football and cricket club with the first training session taking place two days later.  It played its first match against a team called the \"Young Australians\" on 24 May 1870 at Buck's Flat, a property owned by club president John Hart in Glanville . Football in South Australia at this stage was yet to be organised by a single body and as a result there were several sets of rules in use across the state. The last game of the club's first season was played in front of a crowd of 600 people with The Port Artillery Band playing live music throughout the October afternoon and John Wald the only player to score a major.  , Port Adelaide played approximately 44 games at Glanville Hall Estate between 1870 and 1879 with 16 SAFA premiership matches during the first three years of the organised state competition. The largest attendance at the ground was approximately 1,000 spectators who witnessed the home side lose to Norwood by 2 goals.  , In 1877 Port Adelaide joined seven other local clubs and formed the South Australian Football Association , the first organisation of its type in Australia.  It competed its first few seasons wearing a rose pink outfit with white knickerbockers.  In 1878 the club hosted its first game against the recently established Norwood Football Club with the visitors winning 1-0. A rivalry between these clubs would soon develop into one of the fiercest in Australian sport .  , In 1880, the club moved from Glanville Hall Estate to Alberton Oval which, except for the 1975 and 1976 seasons, has been its base ever since. For the first time in 1881 the club played an interstate club, which was the Carlton Football Club , at Adelaide Oval. Later in that year the club also traveled to Victoria and played its first game outside South Australian boarders against Sale Football Club .  During Round 4 of the 1882 SAFA season Port Adelaide overcame Norwood for the first time after nine previous attempts winning by 1 goal at Adelaide Oval . In 1884 Port Adelaide would win its first SAFA premiership bringing to an end Norwood's run of six consecutive premierships. , On 25 May 1885 Port Adelaide played two of its first ever games at the MCG against the South Melbourne and Melbourne Football Club losing to the home sides by 10 behinds and three goals respectively.  Immense interest led into the 1887 Round 8 meeting between Port Adelaide and Norwood as to the previous two matches between the clubs had ended in draws. Norwood won the match in front of a then-record 11,000 spectators at Adelaide Oval .  During 1889 the club played against the Richmond Football Club at Punt Road Oval , with the Port Adelaide side prevailing by one goal.  The 1889 SAFA season ended with Port Adelaide and Norwood level at the top of the premiership ladder, leading to the staging of a championship decider. This would be the first Grand Final in one of the premier Australian football leagues. Norwood went on to defeat Port Adelaide in the 1889 SAFA Grand Final by two goals in front of 11,000 at Adelaide Oval . , Port Adelaide won its second SAFA premiership in 1890 and would go on to be crowned \" Champions of Australia \" for the first time after defeating VFA premiers South Melbourne . During the 1890s Australia was affected by a severe depression and many of Port Adelaide's working class players were forced to move interstate to find work. This translated into poor results on the field. In 1896, with the club in crisis after finishing the season last, the club committee met with the aim of revitalising the club. Australian football historian John Devaney summarised the means by which the club pursued this goal as \"the conscious and deliberate cultivation by both the committee and the team's on field leaders of a revitalised club spirit, whereby playing for Port Adelaide became a genuine source of pride\".  It had immediate results and in 1897 Port Adelaide won a third premiership finishing the season with a record of 14-2-1 with a scoring record two and a half times its conceded total. This is one of only four occurrences since 1877 that the team that finished last won a premiership the following year. To top off the 1897 season for the club, Stan Malin won Port Adelaide's first Magarey Medal in 1899. , The club had various nicknames during the 19th century including the Cockledivers, the Seaside Men, the Seasiders and the Magentas. In 1900, Port finished bottom in the six-team competition, which it has not done in any senior league since. Port Adelaide's champion players from this era include Harold Phillips , Ken and John McKenzie, Archibald Hosie , Charlie Fry and Stan Malin .  , In 1902, Port Adelaide took the field in black and white guernseys for the first time after it was having trouble finding appropriate and affordable dyes that would last for its blue and magenta guernseys.  , Port Adelaide was now being referred to as \"the Magpies\" and would have instant success in the black and white wharf pylon guernsey defeating North Adelaide by 28 points at Alberton Oval in its new guise. However the first year in the new guernsey would also be a controversial year for the club. After finishing the 1902 SAFA season a game clear on top of the ladder with a scoring ratio of approximately 2-1, the club found itself disqualified during the finals by the SAFL after a game schedlued between the club and South Adelaide was abandoned after a dispute regarding the use of Mr Kneebone as an umpire, who was not certified by the football association at the beginning of the year as an umpire. Port Adelaide considered that Mr Kneebone would not be impartial and refused to play.  The 1902 SAFA premiership would subsequently be awarded to North Adelaide after they defeated South Adelaide in the Grand Final a week later.  Port Adelaide offered to play North Adelaide in a premiership deciding match, but the association refused.  This point in time marked the beginning of a halcyon era for the club participating in 12 Grand Final appearances in the next 13 seasons setting the foundations for the club to win 31 premierships in the newly adopted black and white wharf pylon guernsey over a period of 92 years until its entrance into the AFL in 1997. , The first premiership after the dispute came the following year when Port Adelaide defeated South Adelaide 6.6 (42) to 5.5 (35) in the 1903 SAFA Challenge Final. A further premiership came in 1906 when Port defeated North Adelaide 8.12 (60) to 5.9 (39) in the year's Grand Final. During the early stages of the 1907 season, Port Adelaide travelled to Sydney to play a combination of the cities best players. The game was marketed as 'Port Adelaide vs. Sydney' with the harbour city side taking the honours 8.9 (57) to 5.14 (44).  Port Adelaide won the SAFL premiership in 1910 defeating Sturt 8.12 (60) to 5.11 (41) in the Grand Final. The club would go on to defeat Collingwood for the 1910 Championship of Australia title. , The East Fremantle Football Club had toured South Australia in 1909 and embarrassed Port Adelaide 12.13 (85) to 8.16 (64) in what was the two clubs' first encounter. During the 1910 post season, seeking revenge, Port Adelaide travelled to Western Australia and evened the ledger scoring 6.10 (46) to beat East Fremantle's 5.4 (34). To conclude this trip Port Adelaide played a combination of some of the Western Australian Football League 's best players and achieved a remarkable victory scoring 6.17 (53) to 6.12 (48), with Sampson Hosking named best on ground.  Along with beating the premiers from South Australia, Victoria and Western Australia in 1910, Port Adelaide also invited North Broken Hill, the premier team of New South Wales, to a game at Adelaide Oval. Port Would win this game 14.20 (104) to 5.5 (35).  , The following two seasons for Port Adelaide would be frustrating dropping only one game during the 1911 minor round and going undefeated the following year in 1912 only to be knocked out of contention by West Adelaide both times, the second of these encounters in front of a pre war South Australian record crowd of 28,500. During the 1912 preseason, Port Adelaide travelled to Tasmania and took on a combination of players from various Tasmanian Football League sides. The game would prove to be very competitive with Port Adelaide defeating the TFL combination 7.13 (55) to 6.6 (42).  , During the 1913 preseason, Port Adelaide travelled back to Western Australia to play East Fremantle again with the local side winning for a second time 6.6 (42) to 4.12 (36). Despite this inauspicious preseason the club would break through in 1913, dropping only two games during the minor round and eventually defeating North Adelaide 7.12 (54) to 5.10 (40) for the SAFL premiership and Fitzroy 13.16 (94) to 4.7 (31) for the 1913 Championship of Australia . , The 1914 season is widely regarded as the club's best season with Port Adelaide achieving the distinction of going through the entire year without losing a single match. It is won its fourteen SAFL games by an average margin of 49 points. The 1914 SAFL Grand Final is notable as Port Adelaide held North Adelaide to a single goal for the match 13.15 (93) to 1.8 (14), a feat that would be repeated in 1989. The club would then meet VFL premiers Carlton on Adelaide Oval , defeating the V ictorian club 9.16 (70) to 5.6 (36) to claim a record fourth Championship of Australia title . At the end of 1914 season the SAFL put together a combined team from the six other SAFL clubs to play Port Adelaide to no avail with the now dubbed \"Invincibles\" winning 14.14 (98) to South Australia's 5.10 (40). , Champion players of this era included Frank Hansen , Harold Oliver , Angelo Congear and Sampson Hosking . The latter three of those player mentioned have the unique distinction of playing in three Championships of Australia together as well all taking part in South Australia's first victorious Australian National Football Carnival in 1911 .  , The onset of World War I was causing players to start taking up arms in 1915 and forced the SAFL to be suspended for three years bringing an abrupt halt to Port Adelaide's dominance. , During World War I the club lost three players—William Boon, Joseph Watson and Albert Chaplin—to the war. A scaled-back competition referred to as the 'Patriotic League' was organised during wartime in which Port Adelaide won the 1916 and 1917 instalments. After World War I, Harold Oliver , arguably the state's best player, was close to retiring from league football playing only 1 game in 1919 and 8 in 1920. However keen supporters of the Port Adelaide Football Club hoping to replicate the club's pre-war success raised funds and bought him a motorbike so he could commute from Berri where he eventually settled on his own block as a fruit grower for the 1921 season.  During the 1921 season Oliver captained the club to the 1921 SAFL premiership, winning his fourth in the process. In 1922 after playing only 5 league matches for the season his football career came to an end due to commitments regarding his farm at Berri and disputes regarding game compensation. His contract termination meant he was paid ₤76 of ₤100 pounds for the season making him one the highest-paid footballers of the era.  Shortly afterwards,most of Port Adelaide's champion players from before the war started to retire from the league football and the clubs performances subsequently declined.  , In 1926 Port Adelaide captain Clifford Keal began a tradition that has continued to this day by wearing the number one. In 1928, John Eden became Port Adelaide's first Indigenous player at league level. John's brother Drozena would debut the following year and would eventually become vice captain of the club.  As was the case in the 1890s, the depression of the early 1930s hit the club hard with players moving interstate to secure employment.  , However, by the late 1930s, the economy and Port Adelaide's form both recovered and after two narrow grand final losses in 1934 and 1935 the club won premierships in 1936, 1937 and 1939. During the 1939 preseason, Port Adelaide sent a team over to Perth for a third time, to play a combination of the Goldfield League and WAFL.  Port Adelaide would falter to both combinations. The 1939 SANFL season was notable as it was the club's last pre-war premiership. During the year Bob Quinn , in his third year as a player for the club, coached the team its Grand Final victory over neighbours West Torrens . Shortly after the victory during a work day, as so many other young men were doing, Bob Quinn quietly left work during a lunch-break to enlisted for military service.  Many other Port Adelaide players also enlisted for service during this time. In 1941 Port Adelaide suffered its first player casualties from war since World War I with Lloyd Rudd and Jack Wade both killed on the Allies' front in France. Four more players would be killed through the war: Maxwell Carmichael, George Quinn, Christopher Johnston and Halcombe Brock.   , Just as had happened in 1914, the SANFL was hit hard by player losses in World War II. Due to a lack of players the league's eight teams were reduced to four with Port Adelaide merging with nearby West Torrens Football Club from 1942 to 1944. The joint club would play in all three Grand Finals during this period, winning the 1942 instalment but losing the 1943 and 1944 editions to the Norwood-North Adelaide combination. Normal competition resumed in 1945 and after finishing his military service Haydn Bunton Sr. , now a triple Brownlow and Sandover medallist, joined the club for his final season.  However, despite this addition Port Adelaide was unable to regain its pre-war success and played in only one grand final for the rest of the 1940s. , At the end of the 1949 SANFL season , having missed two finals series in a row, the Port Adelaide Football Club had become desperate to improve its on-field performances. The club's committee subsequently sought out a coach that could win the club its next premiership. , Eventually a decision was made which would influence the next 50 years of the Port Adelaide Football Club with Foster Neil Williams , a brilliant rover from West Adelaide , being appointed captain-coach of the club. Williams brought to the club a new coaching style based on success at any cost which was succinctly encapsulated in the legendary club creed he eventually wrote in 1962. During his second season as coach in 1951, Williams led Port to their first official premiership (excluding World War II competition) for 9 seasons, defeating North Adelaide by 11 points. At the end of the 1951 season the VFL premiers Geelong visited South Australia to play the local premiers Port Adelaide on Adelaide Oval . Geelong won the match 8.14 (62) to 6.18 (54) in front of 25,000 people.  The following year Port Adelaide would finish the 1952 SANFL home and away season in second spot, two points behind eventual premier North Adelaide. Their season would come to an end after being knocked out of the finals by rival Norwood during a preliminary final at Adelaide Oval. Port Adelaide would make the Grand Final again in 1953 against local rivals West Torrens in what would be the Eagles last appearance before merging with Woodville. West Torrens would disappoint Port Adelaide, winning the 1953 premiership by 7 points. Port Adelaide's run of disappointment from the 1952 and 1953 seasons would prove to be short lived with the club subsequently going on to win a national record six Grand Finals in a row from 1954 to 1959. The club had a win-loss-draw record of 105-16-1 (86%) over the six-year period. , Williams left as coach in 1958 to take a break from the game. Geof Motley took over the captain-coaching role at the club to win the 1959 premiership, a national record sixth consecutive Grand Final victory. Port Adelaide's hope of winning 7 consecutive premierships would be brought to an end by Norwood during the 1960 SANFL preliminary final, with the redlegs prevailing by 27 points. For the following two seasons Port Adelaide would finish third. , Fos Williams returned in 1962 and Port Adelaide won three of the next four premierships taking his personal tally to nine and the clubs record to 10 of the last 15 premierships. The 1965 premiership, the last that Williams coached, was played in front of 62,543 people, the largest ever crowd at Adelaide Oval . In that game Port Adelaide defeat Sturt 12.8 (80) to 12.5 (77). After the 1965 SANFL Grand Final , Port Adelaide would be particularly frustrated by the dominance of Sturt , which won seven premierships over this period under the leadership of Jack Oatey . In all, despite playing in 6 of the next 10 grand finals, Port Adelaide would fail to win a premiership until 1977. Champion players introduced in this era include John Cahill , Peter Woite , Dave Boyd , Geof Motley and Russell Ebert .  , One of Port Adelaide's finest players during the Fos Williams era was John Cahill . He eventually became William's protégé and ultimately took over as coach in 1974. Cahill coached in the Williams style and was, if anything, even more aggressive. In 1975 an off-field dispute between the Port Adelaide City Council and the SANFL over the use of Alberton Oval forced Port Adelaide to move its home matches to Adelaide Oval for two seasons. In 1976 Port Adelaide completely dominated the minor round, winning 17 of the 21 matches. Cahill would subsequently take Port Adelaide to its first Grand Final under his leadership against Sturt with an official attendance of 66,897, a record which still stands for the SANFL. The actual crowd was estimated at 80,000, much bigger than the official figure as the SANFL ran out of tickets early and were forced to shut the gates 90 minutes before the bounce as people were being crushed on entry.  The police were subsequently forced to allow spectators to sit along the fence.  Despite being labelled \"too old and too slow\" by commentators, Sturt overwhelmed Port Adelaide to win by 41 points. The State Government enforced tighter regulations on the SANFL after this game to ensure crowd safety. In 1977 the council dispute regarding Alberton Oval was eventually resolved with the club moving back to its home ground. The 1977 premiership was notable as it broke an 11-year drought, the longest since Port Adelaide began competing in an organised football competition. A side story to the 1977 premiership was Randall Gerlach, the clubs leading goal kicker the year prior, who made the decision to play throughout 1977 against his doctors advice regarding a chronic kidney condition that would prematurely end his career at age 24. Gerlach played his 100th game during the year and played in the 1977 Grand Final but his kidneys would shut down and cause him to endure dialysis and kidney transplants.  The club would go on to win four of the next five seasons from 1977 to 1981. , The 1980 SANFL season was Port Adelaide's most dominant since 1914 . The club won the Stanley H. Lewis Memorial Trophy as the best club in all SANFL divisions with both its League and reserve sides winning their respective premierships and all levels of the club playing finals. Russell Ebert won his record 4th Magarey Medal . Tim Evans set the league goal kicking record of 146 goals in a season. The club provided seven players to the state league team ( Ebert , Evans , Cunningham , Phillips , Williams , Giles and Faletic ). The club set a new record for most points scored during the whole season at 3,421 whilst also having the best defence conceding only 1,851 points for an end of season percentage of 184.82%. Overall Port Adelaide lost 2 games from 24 for the year. , During the 1981 preseason, Port Adelaide, reigning SANFL premiers invited reigning VFL premiers Richmond to a game at Alberton Oval to which they accepted. Although the game was nothing more than an exhibition match both teams fielded very strong teams. The match proved to be a thriller with Richmond holding off a late Port Adelaide charge to win by a single point, 14.13 (97) to 13.20 (98).  Port Adelaide would go on to defeat the local Glenelg Tigers by 51 points for the 1981 SANFL premiership.  The following year Port Adelaide would lose to Glenelg by 1 point in the SANFL preliminary final in what would be John Cahill's last game coaching the club until 1988. , In 1983 Russell Ebert took on the coaching role at Port Adelaide when Cahill left Port Adelaide to coach Collingwood for two seasons. This period saw Port Adelaide's form drop failing to reach the grand final. The period was also marked by the rise of the VFL as the premier football competition in the country. Many SANFL players were moving to the VFL for the larger salaries on offer. , In 1982 the SANFL approached the VFL in regards to entering a composite side in their league, an action also taken by East Perth and the Norwood Football Club . These approaches were ignored by the VFL at the time.  The Port Adelaide Football Club's annual report from late 1982 showed that the failure of these attempts significantly impacted the club's understanding of its future.  From this point in time onwards Port Adelaide restructured the club in regards to economics, public relations and on-field performance for an attempt to enter the league in 1990. There was genuine feeling that failure to do this would result in the club ceasing to exist in the future.  , John Cahill returned as coach at the end of the 1987 SANFL season. , Talk of a side from South Australia entering the VFL was fast tracked in 1987 when a team from Western Australia, the West Coast Eagles , and a team from Brisbane , the Brisbane Bears joined the VFL. This left South Australia as the only mainland state in Australia without a team in an increasingly national competition. During the 1988 season, one of Fos Williams sons, Anthony, was tragically killed in a building accident. The following day the club played against Norwood and managed to overcome an early deficit to win the emotional charged game. The club would go on to win the 1988 premiership. , In 1989 seven out of ten SANFL clubs were recording losses and the combined income of the SANFL and WAFL had dropped to 40% of that of the VFL .  During early 1990 the SANFL decided to wait three years before making any further decision in regards to fielding a South Australian side in the VFL until it could be done without negatively affecting football within the state. Frustrated with lack of progress, Port Adelaide were having secret negotiations in the town of Quorn for entry in 1991.  From these discussions Port Adelaide Football Club accepted an invitation from the VFL to join what had now become the AFL. The AFL signed a Heads of Agreement with the club in expectation that Port would enter the competition in 1991, meaning the Port Adelaide Football Club would field two teams, one in the AFL and one in the SANFL. During the 1990 preseason Port Adelaide played a practice match against the Geelong Cats at Football Park in front of 35,000 spectators with Gary Ablett Snr and Gavin Wanganeen prominent. , When knowledge of Port Adelaide Football Club 's negotiations to gain an AFL licence were made public, the rest of the SANFL and many other people across the state saw it as an act of treachery. SANFL clubs urged Justice Olssen to make an injunction against the bid, which he agreed to.  The AFL suggested to the SANFL that if they didn't want Port Adelaide to join the AFL, they could put forward a counter bid to enter a composite South Australian side into the AFL. After legal action from all parties, the AFL finally agreed to accept the SANFL's bid and the Adelaide Football Club was born.  , The fallout from the failed bid resulted in some calling for Port Adelaide to be expelled from the SANFL.  However, Port Adelaide continued to compete and continued to dominate. Port Adelaide followed its triple triumphs from 1988 to 1990 with a premiership in 1992 and three in a row again from 1994 to 1996. When the Adelaide Crows entered the AFL, SANFL attendances dropped by 14% however Port Adelaide attendances increased by 13%.  Vocal supporters for Port Adelaide's AFL bid included Kevin Sheedy , Tom Hafey , Ron Barassi and David Parkin .  In 1994, the AFL announced it would award a second AFL licence to a South Australian club. Adelaide's Channel 7 broadcaster ran a phone poll asking whether Port Adelaide should get the second licence with 74% of the 6000 respondents saying 'yes'.  Present at the 1994 SANFL Grand Final was AFL CEO Ross Oakley and Alan Schwab who bore witness to the clubs come from behind win against the Woodville-West Torrens Eagles .  , During December 1994 Max Basher announced that Port Adelaide had won the tender for the second South Australian AFL licence.  However a licence did not guarantee entry and although a target year of 1996 was set, this was reliant upon an existing AFL club folding or merging with another. In 1996, the cash-strapped Fitzroy announced it would merge with the Brisbane Bears to form the Brisbane Lions . A spot had finally opened and it was announced that in 1997, one year later than expected, Port Adelaide would enter the AFL. , Once an entry date had been confirmed, the Port Adelaide Football Club set about forming a side fit for competition in the AFL. It was announced that existing Port Adelaide coach, John Cahill would make the transition to the AFL and Stephen Williams would take over the SANFL coaching role. Cahill then set about forming a group which would form the inaugural squad. Brownlow Medallist and 1990 Port Adelaide premiership player, Gavin Wanganeen was poached from Essendon and made captain of a team made up of six existing Port Adelaide players, two from the Adelaide Crows, seven players from other SANFL clubs and 14 recruits from interstate. , Star players for Port Adelaide during its pursuit of an AFL licence include among others Greg Phillips , Scott Hodges , Darren Smith , Tim Ginever , Stephen Williams , Mark Williams , Darryl Borlase , George Fiacchi , Roger Delaney and Bruce Abernethy .  , Port Adelaide in SANFL , On 29 March 1997, Port Adelaide played its first AFL premiership match against Collingwood at the MCG, suffering a 79-point defeat. Port won its first game in Round 3 against Geelong , and defeated cross town rivals and eventual premiers Adelaide by 11 points in the first Showdown in Round 4. At the conclusion of Round 17, the side sat fifth – only one win and percentage off the top spot in what was an unusually close season – but it fell out of the finals after recording only a draw from its final five games. Port Adelaide was widely tipped to take the wooden spoon at the start of the season [ citation needed ] , but defied the critics to finish 9th, missing the finals on percentage behind Brisbane. The 1998 season was looking very similar to the previous year as they hovered around ninth position for most of the year and looked like a threat for finals after Round 14; but they lost six of their last eight games to finish in 10th place, with a record of 9 wins, 12 losses and 1 draw. , In 1999 Mark Williams took over as coach of Port Adelaide. In only its third season the club played in the pre-season grand final against Hawthorn at Waverley Park . Port Adelaide lost 5.6 (36) to 12.11 (83). The season wasn't looking very promising and by Round 12 they had dropped down to a low of fourteenth. But they put together a five-game win streak from Round 13 through to Round 17 to eventually finish seventh and earn them a spot in the finals for the first time in the club's history. They were eliminated by eventual premier, North Melbourne, by 44 points in the Qualifying Final. The side fell away in 2000, winning only one of its first twelve games before ultimately finishing 14th with a record of 7–14–1. , Port Adelaide had a very successful 2001 season , starting with a maiden pre-season competition victory, defeating the Brisbane Lions 17.9 (111) to 3.8 (26) to become the first non-Melbourne based club to win the competition. Port Adelaide finished their 2001 home and away season in third place with 16 wins and six losses. The club travelled to Brisbane for the Qualifying Final, losing by 32 points, then lost its home Semi Final against sixth-placed Hawthorn to be eliminated: Port had led Hawthorn by 17 points going into the last quarter, but Hawthorn came back and Port lost by three points. , Port Adelaide started 2002 strongly, winning the pre-season competition for the second time in a row, defeating Richmond by 9 points. The side built on its success and won its first minor premiership with an 18–4 record. However, they could not convert this form into a Grand Final berth losing to the eventual premiers, the Brisbane Lions, by 56 points in the preliminary final. Port Adelaide continued its minor round dominance in 2003 and again finished top to claim the minor premiership; however like the previous year, Port Adelaide was eliminated in the preliminary finals, losing to Collingwood by 44 points. , Port Adelaide opened the 2004 season well with four straight wins, but then won only four of its next eight games, dropping to as low as fifth on the premiership table, three games below ladder leaders St Kilda . From Rounds 12–17, Port Adelaide turned their fortunes around and had six consecutive wins, and with five rounds remaining were equal top of the ladder with Brisbane , St Kilda and Melbourne . , After losing in Round 18 against Essendon, Port Adelaide won its remaining four games – including wins against minor premiership contender Melbourne and cross town rivals Adelaide to claim the minor premiership for the third consecutive year. Port Adelaide easily won its qualifying final against Geelong , earning a home preliminary final. Port Adelaide made it through to its first AFL grand final after defeating St Kilda in a thrilling preliminary final by just six points in front of over 46,000 people at home, with Gavin Wanganeen kicking the winning goal with about a minute to go. , The following, Port Adelaide faced a highly fancied Brisbane side attempting to win a record-equalling fourth straight AFL premiership. Only one point separated the sides at half time, however late in the third quarter Port Adelaide took the ascendency to lead by 17 points at three-quarter time, and dominated the final term to win by 40 points : 17.11 (113) to 10.13 (73). Byron Pickett was awarded with the Norm Smith Medal after being judged the best player in the match, tallying 20 disposals and kicking three goals. , After 2004, Port Adelaide struggled to maintain its form and endured a disappointing 2005. After a slow start to the season, they finished eighth on the ladder, and defeated the Kangaroos by 87 points in the elimination final. In the semi-final, Port faced the highly fancied minor premiers Adelaide in what was dubbed \"The Ultimate Showdown\" – the first occasion when the two cross-town rivals had met in a finals series. The result was 83 point loss for Port. The club missed the finals in 2006, winning eight games; young player Danyle Pearce won the AFL Rising Star award. , Port Adelaide made a strong recovery in 2007, and with strong performances from midfielders Shaun Burgoyne and Chad Cornes and strong debut seasons from Justin Westhoff , Robert Gray and Travis Boak , Port Adelaide finished the minor round second on the ladder with 15-7 record. , Port Adelaide started their finals campaign against the West Coast Eagles at AAMI Stadium and won a tight contest by three points: Port Adelaide 9.14 (68) d. West Coast 9.11 (65). That win gave Port the bye, and they easily defeated the Kangaroos in the preliminary final to win by 87 points: Port 20.13 (133) d. North Melbourne 5.16 (46). This win delivered Port its second Grand Final berth in four years. However, in the grand final they were defeated by Geelong by an AFL record margin of 119 points, 24.19 (163) to Port Adelaide's 6.8 (44) in a crowd of 97,302. , The 2008 season was disappointing one for a Port Adelaide side keen to build on its 2007 grand final appearance, dropping to 13th on the ladder and out of the finals. In 2009, Domenic Cassisi took on Port Adelaide's captaincy,  generated controversy due to coach Mark Williams originally wanting Shaun Burgoyne or Chad Cornes to be captain, which was overruled by Port Adelaide's administration board.  , During the 2009 pre-season Port Adelaide announced that they had requested an immediate seven-figure sum from the AFL in a bid to ease its financial crisis. Port Adelaide had accumulated a consolidated debt totaling $5.1 million and was unable to pay its players; they had lost $1.4 million the season before, and had their average home crowds drop to little more than 23,000.  However the financial assistance was denied by the league, with AFL chief executive Andrew Demetriou saying that they would have to undergo an intensive application process and work with the SANFL , who owned Port Adelaide's AFL licence.  On 20 May, Port were handed $2.5 million in debt relief by the SANFL, and on 15 June were handed a $1 million grant by the AFL commission.   By the end of the season the financial situation had reached the point where either the Port Adelaide Magpies (also suffering from crippling debt) or Port Adelaide could be forced to fold. The SANFL had announced it could support one club but not both. Plans for a merger of the two clubs to keep Port Adelaide in both the AFL and SANFL were rejected by the SANFL. The club's financial prospects were given a major boost in December 2009 when Premier Mike Rann announced a $450 million government commitment to redevelop Adelaide Oval, to enable AFL Football and home games for both Port and the Crows to be played in the city centre.  Amidst these off-field struggles, the club finished 10th in 2009. , The 2010 season started well for the club with it winning five of its first seven games. However, after that, Port Adelaide went on a club record nine-game losing streak. On 9 July 2010, Mark Williams stepped down as senior coach with a final game against Collingwood at Football Park, marking the end of the Williams era for the club. , Matthew Primus took over as caretaker coach for Port Adelaide after Mark Williams stood down and shortly after assistant coach Dean Laidley rejected the offer.  In Showdown 29, Port Adelaide ended its nine-game losing streak with a 19-point win over their crosstown rivals, the Adelaide Crows . The club finished the season with five wins from its last seven games under Primus, to finish tenth. Port Adelaide's administration board had started the search for a new coach and it was widely believed that Port Adelaide would appoint someone who had never been associated with the club before;  but, on 9 September, Matthew Primus was appointed as the senior coach of the club for the next three years. The club also saw the retirement of 2004 premiership players Josh Carr and Warren Tredrea . , In May 2011 the SANFL sought to take control of Port Adelaide. Despite the SANFL underwriting $5 million of Port's debt in 2010, the takeover failed when the SANFL was unable to get a line of credit to cover Port Adelaide's future debts. On 1 June it was announced that the AFL would underwrite $1.25 million in debt to protect its $1.25 billion television rights. AFL Chief executive Andrew Demetriou , offered $9 million over the next three years to help the club, ahead of the move to the Adelaide Oval , which resulted in the resignation of the Chief Executive, Mark Haysman, who was replaced by Keith Thomas , and three board members. The AFL gave the money to the SANFL with strict conditions that they give Port Adelaide three million dollars a year, for three years.  , Statistically, 2011 was Port Adelaide's worst season in 141 years, finishing 16th with only three wins from 22 games, ahead of only the Gold Coast Suns in their inaugural AFL season. Rounds 20 and 21 saw the club lose to Collingwood and Hawthorn by record margins of 138 and 165 respectively. The 2012 season was little better, and the club finished 14th with a record of 5–16–1; and a loss against the new expansion team Greater Western Sydney resulted in senior coach Matthew Primus 's contract being cut to the year's end, with Primus deciding to step down immediately. Assistant coach, Garry Hocking , took over for the remaining games four games, with his best result a draw in the final round against Richmond . , On 9 September 2012, Port Adelaide player John McCarthy died on an end of season trip in Las Vegas after falling from a ledge of The Flamingo Hotel.  Thousands of tributes and messages came from the general public, AFL supporters, players and other clubs. The Adelaide Football Club and Collingwood Football Club both wore black armbands for their semi-final matches and a minute's silence was observed at both games. , The 2013 season saw many significant changes in a new era for Port Adelaide. On 8 October 2012, Ken Hinkley was announced as the new senior coach of the club. This marked the first time that the club had appointed someone not associated with the club before since Fos Williams in 1950. Port Adelaide also had major changes within its administrative positions with television personality David Koch being named as the chairman of the club and numerous board members being replaced. The 2013 preseason also saw Travis Boak succeed Domenic Cassisi as the captain of the club.  For the first time in the club's history, Port Adelaide achieved 40,000 members in 2013. , Port Adelaide won its first five games, but then lost its next five games. Port then returned to form with upset wins against Sydney and Collingwood . Port recorded a famous Showdown win in Round 19, coming from 20 points down with six minutes to go to win by 4 points. The club finished the home and away season 7th on the ladder, making it the first time that they had qualified for the finals since 2007. Port travelled to Melbourne to play Collingwood at the MCG in an Elimination final where they won by 24 points; they then lost to Geelong by 16 points the following week. , The 2014 season saw both Port Adelaide and Adelaide move their home ground from Football Park to the redeveloped Adelaide Oval . Building on its 2013 success and its move to the more central venue, off-field Port Adelaide signed up a record 55,715 members for the 2014 season, and averaged 44,429 at home games, a 65% increase from the previous year. On-field, Port Adelaide had its best ever first half to an AFL season, sitting first with ten wins from eleven matches. They then won only four of their remaining eleven matches to finish 5th on the ladder. They hosted Richmond in the elimination final, kicking the first seven goals of the game and leading by as much as 87 points before recording a 57-point victory. They faced Fremantle in the semi-final, and after trailing by 24 points at half time, Port kicked 12 goals to 5 in the second half to win by 22 points. Their 2014 season ended with a three-point loss to Hawthorn in the preliminary final. , Port Adelaide's 2015 pre-season began with Essendon ruckman Paddy Ryder requesting a trade to Port Adelaide.  On the final day of trade week, Ryder was traded to the club boosting its ruck stocks.  For the second consecutive season, Port Adelaide had lost another assistant coach to a senior coaching position at another club, this time Phil Walsh , who became the coach of the Adelaide Crows from 2015. Walsh was replaced by Michael Voss , a former premiership player and former senior coach of the Brisbane Lions .  , David Koch's appointment to chairman was a key part of the club's improved off-field position. , 2014 was the first time since 1976 that the club played all its home games at Adelaide Oval . , Robbie Gray won the AFL Coaches' Association Player of the Year in 2014. , When the Port Adelaide Football Club entered the AFL, a new state league team was created to fill the void left by the club. The new club was now called the Port Adelaide Magpies Football Club as opposed to the original counterpart, the Port Adelaide Football Club, playing in the national competition.  , The new Port Adelaide Magpies won the 1998 and 1999 SANFL premierships. , On 20 August 2010, the \"One Port Adelaide Football Club\" movement was launched by a former player, Tim Ginever , in a bid to merge the Port Adelaide Football Club and the Port Adelaide Magpies Football Club, in the SANFL competition, as one club. The movement created a website for people to sign so that the Power and the Magpies might become one club. The website claimed that it needed at least 50,000 people to sign up for the Power and the Magpies to merge. On 15 November 2010, all nine SANFL clubs came together for a meeting to decide if the merger would go ahead. The meeting decided that the off-field merger between the two clubs would proceed.   , On 10 September 2013, Port Adelaide and the SANFL agreed to a model to allow all its AFL -listed players (not selected to play for Port Adelaide in the AFL) to play for the Magpies in the SANFL League competition (the Adelaide Crows will also have a reserves team playing in the SANFL from 2014). On October 4, 2013, Port Adelaide's AFL assistant coach Garry Hocking was announced as the SANFL senior coach of the reserves side.  For the 2014 season, the Port Magpies won the minor premiership by winning 12 games and placing top of the ladder. After defeating the South Adelaide by 20 points in the second semi-final, they reached their first SANFL Grand Final since 1999, where they lost to the Norwood Football Club by 4 points. , From 2015 onward, the club would lose its recruiting zones and no longer field sides in the Under 18s, 16s, 15s, 14s and 13s SANFL competition. In turn, Port Adelaide will operate an Academy team composed of 18 to 22 year old's.  , This was a controversial decision amongst local supporters but the structure ensured that talented local juniors can still play for the club through the academy. The restructure is expected to benefit local clubs such as Port District, North Haven and Portland with juniors being re-absorbed by these grassroots teams. , Due to the fact that Collingwood , an existing VFL/AFL club, was already using the Magpie emblem and Magpies' nickname, Port Adelaide was requested by the VFL to simply find a new nickname and logo to avoid a clash.  However, after the unsuccessful 1990 bid, Collingwood successfully lobbied the AFL to force Port Adelaide to change not only its logo and nickname but also its guernsey and colours. In 1995, a new guernsey was created with the look unveiled made up of black, white, silver and teal which represents the water of the Port River . The logo consisted of three strips reflecting the colours. , Controversy concerning the AFL's refusal to permit Port Adelaide to wear its traditional black-and-white \"prison bar\" guernsey in the competitions heritage-themed rounds came to head 2007 . Earlier in that year, Port Adelaide chief executive John James said the club was waiting for confirmation from the AFL that it could wear its 1970s prison bar guernsey for a match against the Western Bulldogs . He said Port was also looking for confirmation it would be able to continue to honour its heritage in any future heritage rounds. Port Adelaide decided not to participate in the 2006 heritage round when the AFL did not approve the club's 1980s-style black-and-white guernsey for its 80s themed heritage round. Collingwood club president Eddie McGuire has been a vocal opponent of Port Adelaide wearing the prison bar guernsey, claiming that Collingwood has an exclusive right to wear black and white in the AFL, even in the heritage round. , John James stated that Port Adelaide possibly received more correspondence from its supporters about the heritage guernsey than about any other issue and that the club would \"continue to fight for its heritage and what is right\".  On 14 May 2007 the AFL and Port Adelaide reached an agreement whereby the club could wear its prison bar guernsey in the heritage round this season, with the proviso that in future seasons its players can only wear it in home heritage round games and provided that such a game is not against Collingwood.  No heritage rounds have been held since this agreement was reached. , On 17 July 2009, Port Adelaide unveiled a special one-off Power guernsey, now known as the \"Back in Black\" guernsey, which was designed by a 7-year-old student from Ardtornish Primary school. The guernsey has a predominantly black design with a white and teal \"V\" and a prominent Power logo. On 28 October 2009, Port Adelaide received AFL approval to wear the jumper in premiership matches. , Main Guernsey , Clash Guernsey , Traditional Guernsey , Before the bounce at Port Adelaide's Adelaide Oval home games the fans hold up their scarves and sing to Australian band INXS 's song Never Tear Us Apart . It is a reference to the various and unique difficulties the club faced when trying to enter the AFL . , The AFL side's victory song is \"Power to Win\", written for the club by Quentin Eyers and Les Kaczmarek . , The SANFL side's victory song is \"Cheer, Cheer the Black and the White\", to the tune of Notre Dame Victory March . , At Port Adelaide home games the fans hold up scarves before the bounce whilst singing Never Tear Us Apart by Australian band INXS . , On 15 May 1880, Port Adelaide played its first match at Alberton Oval. In 1881 the decision was made by the club to start leasing the oval from the Port Adelaide Council for the sum of 10 shillings a year. , The ground has played host to a number of memorable matches in its time and in 1977 a record crowd of 22,738 attended. , Situated at the eastern end of the suburb of Alberton in Adelaide, the playing surface is surrounded by the Allan Scott Power Headquarters, the Robert B. Quinn MM Stand, the Fos Williams Family Stand, the Port Adelaide Bowling Club and the N.L. Williams Scoreboard. , As well as the facilities facing the oval, along Queen Street there is The Port Club and The Port Store.  , Glanville Hall Estate , Alberton Oval , Football Park , Adelaide Oval , Adelaide Crows ( Showdown ) - Early during 1990 the SANFL had decided to wait three years before making any further decision regarding entering a team into the national competition. Frustrated with lack of progress, Port Adelaide began having secret negotiations with the AFL in the town of Quorn for entry a 1991 entrance into the competition. [5] When knowledge of Port Adelaide's negotiations to gain an AFL licence were made public, the rest of the SANFL and many other people across the state saw it as an act of treachery. SANFL clubs urged Justice Olssen to make an injunction against the bid, which he agreed to. [4] The SANFL out of legal necessity promptly created a composite team to beat Port Adelaide's bid. The Adelaide Football Club gained what was very close to being Port Adelaide's licence to the AFL and began playing in 1991. , Collingwood Magpies - The rivalry with the Collingwood Football Club stems entirely from the controversy surrounding Port Adelaide's identity upon entering the AFL, sharing both the Magpie moniker and black and white colours with Collingwood before 1997. Whenever Port Adelaide tries to wear its fabled Prison Bar guernsey that won the club 33 premierships and 3 national titles, the Collingwood administration, particularly Eddie McGuire , try and prevent it occurring. The rivalry extends on field with Port Adelaide having defeated Collingwood to win the 1910 Championship of Australia along with knocking the club out of the 2013 AFL finals series , whilst Collingwood defeated Port Adelaide in the 2002 and 2003 AFL finals series , knocking the club out in the second instance. , Norwood Redlegs ( Port Adelaide-Norwood SANFL rivalry ) - The rivalry between Norwood and Port Adelaide is arguably the oldest in Australian Football. The two clubs began playing each other in 1878, the year Norwood was formed, and currently share between themselves half of all the SAFA/SAFL/SANFL premierships awarded. Along with being the two traditional powerhouse clubs of South Australian football, there is a geographic and economic split between the two teams. Norwood is located on the wealthier eastern side of the city whereas Port Adelaide is located in the western suburbs of Greater Adelaide. Over 400 matches have been played between the two clubs, including 50 finals matches and 17 Grand Finals. Matches against Norwood still attract large crowds with 38,644 attending the 2014 SANFL Grand Final . , Brisbane Lions - The rivalry with Brisbane stems from a string of classic matches during the early 2000's when both clubs were dominant teams in the AFL. Port Adelaide ended Brisbane's attempt at winning four consecutive AFL premierships in the 2004 AFL Grand Final . , North Melbourne Kangaroos - Port Adelaide's traditional bogey side wins two out of every three matches between the clubs despite Port Adelaide having a greater win percentage compared to North Melbourne during its time in the league. North Melbourne also leased Port Adelaide legend Russell Ebert during the 1979 football season, however he would return at seasons end. , Sturt Double Blues - Sturt brought to an end Port Adelaide's first halcyon era in the 1915 SAFL Grand Final after Port went the previous year undefeated whilst claiming national honours . During the mid 1960s and early 1970s Sturt with Jack Oatey at the helm would frustrate Port Adelaide and Fos Williams who had recently won 9 of the last 12 premierships. Sturt would trump Port Adelaide in the 1966 , 1967 and 1968 SANFL grand finals in front of large crowds at Adelaide Oval. Sturt also managed a significant upset in the 1976 SANFL Grand Final beating the favourites in Port with a state record 66,897 ticketed spectators (police quoted 80,000) watching at Football Park. , The creed was written and spoken for the first time in 1962 by Port Adelaide great Fos Williams  , \"We, the Players and Management of the Port Adelaide Football Club, accept the heritage which players and administrators have passed down to us; in doing so we do not intend to rest in idleness but shall strive with all our power to further this Club's unexcelled achievements. To do this we believe there is a great merit and noble achievements in winning a premiership. , To be successful, each of us must be active, aggressive and devoted to this cause. We agree that success is well within our reach and have confidence that each member of both the team and management will suffer personal sacrifices for the common end. , Also we know that, should we after striving to our utmost and giving our everything, still not be successful, our efforts will become a further part of this Club's enviable tradition. , Finally, we concede that there can be honour in defeat, but to each of us, honourable defeat of our Club and guernsey can only come after human endeavour on the playing field is completely exhausted.\" , Head coach , Assistant coaches , , Head coach , Assistant coaches , Port Adelaide has many supporter groups, with every state or territory containing at least one supporter group. In addition, many country towns within South Australia have their own supporter group, many of which travel to both home and away games. [ citation needed ] , *As of 7/6/2015  , W-L-D , 1 Matthew Primus only managed to play one game in 2004, which was Round 3, leaving Warren Tredrea to captain the club from Round 1 to 2 and Round 4 to the Grand Final. , 2 Matthew Primus took over as caretaker coach for the rest of the 2010 season after Mark Williams stepped down after Round 16. , 3 Garry Hocking took over as caretaker coach for the rest of the 2012 season after Matthew Primus stepped down after Round 19. , The Port Adelaide Football Club's history was celebrated on 20 February 1998, when the inaugural 18 members were inducted into the Hall of Fame. Since then there have been two further inductions, one on 5 April 2002, with a further eight members joining the Hall of Fame, and then a further three on 9 May 2003. , Harold Phillips , Angelo Congear , Leslie Dayman , Sampson Hosking , Harold Oliver , Gavin Wanganeen , Warren Tredrea , In June 2001, Port Adelaide announced its \"Greatest Team\" from 1870 to 2000. All 22 members of the team played significant parts in ensuring the club's rise from the SANFL to the AFL in 1997 – and the demand of the SA Football Commission that a Magpies team be kept in the South Australian National Football League (SANFL). There are 201 premiership medals held by the 22 players in the Greatest Team; 532 State games; 16 Magarey Medal and a long list of accolades and achievements. , † denotes killed in action or died while serving , The Magarey Medal is an Australian rules football award, given annually since 1898 to the fairest and most brilliant player in the Home and Away season of the South Australian National Football League (SANFL) as adjudged by the field umpires. The award was created by William Ashley Magarey , then chairman of the league. The following list is players who won the Magarey Medal playing for Port Adelaide in the SANFL. , Post AFL entry , The AFL Coaches Association Champion Player of the Year award is voted on a week to week basis of each round by Senior Coaches on a 5,4,3,2,1 basis. Each Senior Coach votes on their match only and any player suspensions are disregarded. , In every round an Australian Football League rising star nomination is given to a standout young player. To be eligible for the award, a player must be under 21 on 1 January of that year, have played 10 or fewer senior games before the beginning of the season, and not have been suspended during the season. At the end of the season, nine AFL personalities (typically administrators and All-Australian team selectors) vote for five of the twenty-two rising star nominees, with their top selections earning five votes, their second selection earning four votes, etc. The player who receives the most votes is the winner. , The Norm Smith Medal is the award given in the AFL Grand Final to the player adjudged by an independent panel of experts to have been the best player in the match. , The Jack Oatey Medal is the award given in the SANFL Grand Final to the player adjudged by the umpires to have been the best player in the match. , Post AFL entry , Sporting Life magazine invented the concept of an All-Australian Team in 1947. A squad was selected from players in various leagues in October each year by a panel chosen by the magazine. It provided an unofficial All-Australian team for the late 1940s and early 1950s. , The All-Australian Team is an all star team of Australian rules footballers, selected by a panel at the end of each season. It represents a complete team, including interchange players and a coach, of the best performed during an interstate Carnival or series of matches (1953-1988), or during the season (1991–present). , After the club's first season in the AFL the club's Best and Fairest award was named after 10 time premiership coach John Cahill . , The Fos Williams Medal is named in honour of former legendary player and coach Fos Williams and is awarded to the player's choice for the club's Best Team Man. , The Gavin Wanganeen Medal is an award to Port Adelaide's best player under the age of 21. The award, struck in 2006, is named after Gavin Wanganeen , a former champion with both Port Adelaide and Essendon who, by the age of 21, had won a SANFL premiership with Port Adelaide, an AFL premiership with Essendon, a Brownlow Medal and two All Australian awards. , The Coaches' Award replaced the Most Improved and Best First Year awards in 2011. This reward is selected by the entire Port Adelaide coaching committee and is bestowed to reward the Port Adelaide player who best exhibits the team behaviours of selflessness, humility and reliability. , The award, named in honour of the late John McCarthy , recognises outstanding service to the community when representing the club and is decided by the leadership group and coaches. , Most games played , Most games coached , Most premierships as player , Most premierships as coach , Most goals for Port Adelaide , Most goals in a match , Most goals in a season , Where the term \"Combined\" is used it refers to the premier Port Adelaide Football Club team at that time. Therefore, it includes the SANFL team from 1877 to 1996 and the AFL team from 1997 to present. , Overall Win/Loss record , *as of 13/6/2015 , Overall Win/Loss record at grounds , AFL , SANFL , *as of 5/4/2015 , Best league record against another club , Over 10 league matches against a current club. , *as of 5/4/2015 , Worst league record against another club , Over 10 league matches against a current club. , *as of 21/4/2015 , Highest score , Lowest score , Greatest Winning Margin , Greatest losing margin , Most Wins in a season , Least losses in a season , Largest Home Attendances , Largest away attendances , Largest finals attendances , Longest undefeated run , Longest losing run "
}
