{
  "category": "afl",
  "article": "The Richmond Football Club , nicknamed The Tigers , is an Australian rules football club which competes in the Australian Football League (AFL). , Since joining the competition in 1908 , Richmond has won ten premierships, the most recent victory being in 1980 . This currently sees the club ranked sixth in terms of premierships won. , In recent times, unstable administration on and off the field has troubled Richmond, none more so than in 1990 when a large debt almost forced the club to fold. Richmond has since regained a strong financial position, but this has not translated to any significant success on field, with the team only reaching the finals four times since (in 1995 , 2001 , 2013 and 2014 ) and failing to win a match in the latter two appearances with elimination final exits. , Since the club's inception in 1885, it has been based at the Punt Road Oval , formerly known as the Richmond Cricket Ground , a few hundred metres to the east of the Melbourne Cricket Ground (MCG). The Tigers have played their home games at the MCG since 1965. The club's training and administration headquarters are at the Punt Road Oval and from 2011 is called the ME Bank Centre.  , Based in a traditionally working-class area, Richmond has long-standing rivalries with cross town Melbourne based clubs, Collingwood , Carlton and Essendon . , Many notable players have represented Richmond over the years. Some of these players have been recognised as being among Australian rules football's greatest players. Such players include Jack Dyer , Kevin Bartlett , Royce Hart , Francis Bourke , Ian Stewart , Matthew Richardson and Jack Titus . , , , A team of footballers playing as Richmond is mentioned by the newspapers in the first years of Australian football , circa 1860.  Tom Wills , one of the game's founders, was the club's inaugural secretary and captain,  and Wills' cousin H. C. A. Harrison captained Richmond briefly in the early 1860s before moving to Geelong .  This loosely organised group has no continuity to the present club. A number of teams formed in the Richmond area during the game's rapid expansion of the 1870s and early 1880s.  However, all played at a junior level and it was considered an anomaly that Richmond, one of Melbourne's biggest locales, did not boast a senior team. The wait ended when the Richmond Football Club was officially formed at the Royal Hotel in Richmond on 20 February 1885.  A successful application for immediate admission to the Victorian Football Association (VFA) followed. The club shared the Punt Road Oval with the Richmond Cricket Club , one of the strongest cricket clubs in Australia which had been playing on the ground since 1856.  , At first the team wore a blue uniform. One of the most important features of a nineteenth-century footballer's uniform was his headgear, and Richmond opted for yellow and black striped caps, the same as the cricket club. After a couple of years, yellow and black stripes replaced blue as the colours of the team's guernseys. The team was variously called the \"Richmondites\", the \"Wasps\" or, most commonly, the \"Tigers\". , During the late 1880s, the VFA expanded rapidly. A booming economy and large numbers of immigrants made Melbourne the largest city in the Australian colonies. The city was mad with football and many clubs tried to get admission to the VFA. Richmond struggled to make an impression and after a promising season in 1888 (when they finished fifth with eleven wins), the club slipped backwards. In an amateur sport, the strongest teams were luring the best talent with undisclosed payments to players and were not keen to schedule matches against teams with poor followings (such as Richmond) that could not generate much gate money. , As the local economy slipped into severe depression in the early 1890s and the crowds began to dwindle, a number of strong teams began to agitate for a reform of the competition. Richmond were not considered part of this elite group, who usually voted together as a block at VFA meetings. A lack of commitment and focused effort was holding the Tigers back. In 1896, Richmond walked off the field in a match with South Melbourne at half time when they were a long way behind on a very wet day to protest the umpiring. Later in the season, the Tigers had their score annulled against Essendon when it was discovered that they had too many men on the ground. In the closing three weeks of the season, Richmond's gate takings amounted to just five pounds. , Richmond finished the season last of the 13 clubs. In October 1896, the cabal of six strong clubs broke with the association to form the Victorian Football League (VFL) and invited two other clubs to join them: Carlton and St Kilda . Richmond's struggles during the season had not helped when the invitations to the new competition were being considered. Richmond's performances did not immediately improve in the emaciated VFA until the turn of the century. , The Tigers were boosted by a significant country recruit in 1901. George \"Mallee\" Johnson was an instant sensation and the first true star player at the club. Richmond leapt to third place and then in 1902, with Johnson dominating the ruck, Richmond entered the closing weeks of the season neck and neck with Port Melbourne at the head of the ladder. Just when a play-off between the clubs to decide the premiership looked certain, Port Melbourne faltered against Williamstown to hand Richmond its first flag. , Having missed a potential bonanza from a premiership play-off, the VFA decided to emulate the VFL and introduce a finals series in 1903, a fateful decision for the Tigers. After recruiting the competition's leading goalkicker, Jack Hutchinson , and finishing the season as minor premier , Richmond lost both finals and were runner-up . The following season, the club became embroiled in a feud with umpire Allen, whom the Tigers accused of failing to curb field invasions or the illegal tactics of arch-rival North Melbourne . , When the two clubs were scheduled to meet in the 1904 VFA Grand Final , Richmond announced that they wouldn't play with Allen as umpire. The VFA called Richmond's bluff, and appointed Allen as umpire for the match, meaning that the Grand Final was scratched and North Melbourne won the premiership on forfeit. Richmond were now openly at odds with the VFA and matters failed to improve in the next few years. , The club was campaigning against violence (both on-field and among the crowd), ungentlemanly conduct and poor sportsmanship, issues that plagued the VFA to a far greater extent than the rival VFL. Richmond cultivated links with some VFL clubs by playing practice matches against them. Richmond knew that they were a major asset to the VFA. They had built up a large following and played on one of the best grounds in the competition, where they remained unbeaten for five consecutive seasons. In 1905, Richmond confirmed their status with a second premiership, this time overcoming bitter rivals North Melbourne , \"Mallee\" Johnson had moved to Carlton, but youngster Charlie Ricketts dominated the season and won plaudits among the pressmen, who voted him the best player in the VFA. , However, Ricketts was also lost to the VFL and injury hit the club hard. In 1906–07, the Tigers played finals without looking likely to win the flag. The club earned a rebuke from the VFA for scheduling a practice match against Geelong before the 1907 season. Richmond went ahead with the commitment and earned further censure. Later in the year it became clear that the VFL wanted to expand its competition and Richmond won a place ahead of North Melbourne, which had been strengthened by an amalgamation with the bankrupt West Melbourne as part of their bid. Richmond were granted admission along with the now defunct University Football Club . , The first few seasons in the VFL were less than spectacular. Although the club turned up some star players, it let a lot of talent leave and the administration was unstable after George Bennett 's death at the end of the 1908 season. In 1916, the side played in the finals for the first time, however, with World War I having reduced the competition to just four clubs, finals qualification was automatic. , Finally, in 1919, Richmond made their first Grand Final appearance, losing to Collingwood . Richmond stoked a rivalry with Collingwood by recruiting their former skipper Dan Minogue as playing coach and gained vengeance by beating Collingwood in the 1920 VFL Grand Final to secure a first flag in the big league. This was followed by an even better performance the next year. The only club that continued to beat Richmond on a regular basis was Carlton. Finishing minor premier with only one loss for the season in 1921, Carlton were the hottest premiership favourite, yet Richmond managed to beat them in two classic finals matches played over successive weeks to go back-to-back. , The rest of the decade saw four more Grand Final appearances, all of which would end in frustration. From 1927 to 1929 Richmond became the first club in the VFL to lose three consecutive Grand Finals, all of which were to neighbouring arch rivals, Collingwood. , The next VFL flag came in 1932, with Richmond's triumph over Carlton in a tough encounter which saw Richmond wingman Alan Geddes play the second half with a broken jaw. Another premiership came in 1934, this time against South Melbourne's famed \"Foreign Legion\", avenging Richmond's loss in the 1933 VFL Grand Final . , Prior to the commencement of the 1940 season, internal problems were brewing between the key personalities at the club. Some felt that the uneven performance of the team was due to Percy Bentley 's coaching methods, and that he should be replaced. Jack Dyer walked out on the club and threatened to play in the VFA after his father, a committeeman who was involved with the anti-Bentley faction, lost his position at the board elections. Finally, the matter was resolved and Bentley kept his job, while Dyer returned to training on the eve of the season. The problems appeared to have been solved when Richmond won the semi-final against Melbourne to go straight into the 1940 VFL Grand Final . However, Melbourne reversed this result with a crushing win to pinch the premiership. Richmond had been out-thought by their old mentor Frank 'Checker' Hughes , who had assigned a tagger to negate Dyer. Dyer was furious that Bentley had done nothing to prevent his opponent taking him out of the game. The Richmond committee agreed with this assessment, so when Bentley (after retiring as a player) attempted to negotiate a higher fee to continue his coaching tenure, he was rebuffed. Incensed, Bentley quit Punt Road and moved to Carlton as coach, adding further spice to an already fierce rivalry between the two clubs. , Despite the tribulations created by the Second World War, Richmond was able to maintain a commendable level of consistency on the field. The club had quite a lot of players in reserved occupations who remained at home, while the administration became adept at securing star players who were temporarily in Melbourne on war service. [ citation needed ] [ examples needed ] Dyer was a fearsome presence in his role as playing coach, but he was unable to improve Richmond's ability to win finals matches. A loss in the 1942 VFL Grand Final to Essendon (after starting as favourite) meant that over the previous 18 years, Richmond had won two flags but been runner-up eight times. Jack Titus set a still unbeaten record of playing in six losing Grand Final teams. In 1943, Richmond broke through to beat Essendon in a thrilling Grand Final by five points, a win that the club dedicated to ex-player Bill Cosgrove, an RAF pilot who had been killed in action a few weeks before the match. But another Grand Final loss followed in 1944 , when Dyer's team failed against Fitzroy on a very hot day. , In the immediate post-war era, despite an influx of excellent new players, Richmond struggled to make the four, appearing in the finals only once, in 1947. Dyer continued on as coach for three years after his playing retirement at the end of 1949, but was asked to retire by the committee who felt the club needed a shake up. Under a succession of coaches in the 1950s, With the demands of potential players increasing with each passing year, the club refused to allocate sufficient funds to recruit and they failed to replace star players as they retired. When stalwarts such as Des Rowe and dual- Brownlow Medallist Roy Wright left, the team slumped dramatically and finished with a wooden spoon in 1960. , 1966 heralded the start of the Tom Hafey era. Hafey, a former player of the club, was appointed coach and lead the club to winning four premierships under his leadership. They won the 1967 flag in a thrilling encounter with Geelong, ending a 24-year premiership drought. In 1969, it became two in three years as Richmond, who had finished fourth on the ladder, beat the much fancied Carlton in the 1969 VFL Grand Final by 25 points. , Richmond were dominant in 1972 and were hot favourites in the 1972 VFL Grand Final against Carlton. However, Carlton stunned Richmond in a game of ridiculous high scoring. Even Richmond equalled the then record highest score in a Grand Final of 22.18 (150), but Carlton beat it with 28.9 (177). Richmond got their revenge in an intensely physical clash in the 1973 VFL Grand Final and went back-to-back in 1974 with a strong win against a resurgent North Melbourne. , Richmond won its last premiership with a then record-breaking margin of 81 points over arch-rivals Collingwood in 1980 . After reaching and losing the 1982 VFL Grand Final , it has been a rocky road for Richmond who have struggled to come to grips with the rules and regulations of a modernised VFL, including the draft and salary cap . The successes of the early 1980s were bought at high financial cost through expensive recruiting, and were followed by severe cut backs that saw several top players depart. , Still smarting from the loss of star players to Collingwood, Richmond set themselves for war with Collingwood in 1984 by signing three of their players: John Annear , Craig Stewart and Phil Walsh . Not only were there big contracts and transfer fees to pay, but the costs of an expensive court action as well. , Richmond also signed a number of mediocre players on big contracts, and the club's financial situation took a battering. With the team failing to improve, a challenge to the committee was brewing and Richmond's traditional political stability threatened. The rebel group, organised by long-time servant Bill Durham, convinced former player and coach Barry Richardson to be leader. An election in late 1984 failed to clarify the situation. , Ian Wilson held on to the presidency into the new year. When the one hundredth birthday of the club arrived in February 1985, there was too much dissension to mark the moment fittingly. Eventually, Wilson handed over to Richardson, who had selected his former premiership teammate Paul Sproule to return from Tasmania and take over the coaching position on a guaranteed contract. , As the season progressed with Richmond still struggling, Sproule came under pressure. Richardson guaranteed his position, but at the end of the year, the committee overruled Richardson and sacked Sproule. Incensed, Richardson walked out of Punt Road, which was in turmoil again. Desperately, Richmond turned back to Tony Jewell , who was appointed coach for a second time, the only man in the club's history to get a second go at the job. Jewell later commented on the destruction wrought on the club during his four-year absence: \"the supporters were gone, the members were gone, the money was gone, ... a real shame.\" , With the competition set to expand, Richmond made a number of misguided moves in 1986. To fill the vacancy left by Richardson, Richmond wooed high-flying West Australian entrepreneur Alan Bond to become president. Bond came with an agenda to raise money for the club by listing on the stockmarket and relocating to Brisbane . When the latter plan was revealed in the media, a furious reaction from supporters and high profile club personalities buried the proposal almost immediately. Early in 1987, Bond's tenure at the club ended in farce when he resigned without presiding over a single game. The off-field confusion was reflected in the players' performance as Richmond slumped to only its second wooden spoon in 70 years. , Although the new president, ex-captain Neville Crowe , had stabilised the club and scored a coup by persuading club legend Kevin Bartlett to coach, The club managed to stay solvent by cutting expenses to the bone and paying only two-thirds of the allowable salary cap. But there was no money for recruiting to improve an impoverished playing list. The club struggled to come to terms with the draft after its inception in 1986, and made a number of poor choices—notably, the number one pick in 1987 was used on a player who had only two games with Richmond. , Finally, with the economy in serious recession and interest rates touching seventeen per cent, Richmond's creditors came knocking. At one point, an attempt was made to seize the club's 1973 and 1974 premiership trophies as securities for unpaid debts, an embarrassing situation. For a number of years, the exact amount that the club owed was not publicly known. After Bartlett came Allan Jeans, who then passed the job to ex-Richmond premiership player John Northey for 1993. Northey returned the team to the simple long-kicking style of the halcyon days under the legendary Tom Hafey. Along with some draft concessions granted by the AFL, Northey's efforts gradually improved Richmond. The team fumbled an opportunity to make the 1994 finals, then opened 1995 with its best start to a season in 75 years and eventually made it to the preliminary final. With a talented playing list and a strong administration led by Leon Daphne (Richmond's first president from the corporate world, the Alan Bond farce aside), Richmond looked set to become regular finalists again. , During 1992 the Richmond Football Club logo was redesigned by Rob Perry (see external links), while he was working as an art director at the advertising agency George Patterson Bates in Melbourne. The illustration of the tiger was done by Lex Bell, the in-house illustrator of the agency. , The anticipated success failed to materialise, partly because Richmond allowed the coaching position to again become unstable. With over a year still to run on his contract, John Northey demanded a contract extension that the club refused. This was because of a rumour that some people with an association with the club were pursuing Essendon coach and former Richmond premiership player Kevin Sheedy . So Northey walked out on Richmond and accepted a longer-term contract to coach the Brisbane Bears . Richmond, caught short, appointed the Bears' ex-coach Robert Walls for 1996. After several humiliating thrashings in 1997, Robert Walls became the first Richmond coach to be sacked mid-season. After two-and-a-half seasons under Jeff Gieschen , the club appointed ex-St Kilda captain Danny Frawley . After a Preliminary Final appearance in Frawley's second season, Richmond overestimated the strength of the list and settled for trading for established players rather than drafting youth. Over the next three seasons, the team managed just 18 wins. The administration continued to support Frawley and ensured that he would see out his contract, a far cry from the way many of his predecessors were treated. However, midway through the 2004 season (a season in which Richmond only managed 4 wins, and lost their last 14 H&A matches), Frawley announced he would be relinquishing his role as Richmond coach at seasons' end. , The 2005 pre-season began with renewed optimism at the club, with No. 1 draft pick Brett Deledio being touted as a future star and leader. However, the Tigers' first match of the season (against Geelong ), quickly dashed that hope, as they were thrashed by 62 points. However, this loss would spark a change in the Tigers, and in the next 8 weeks of the season, they would go on to win 7 matches (the one exception being a 68-point loss at the hands of St. Kilda in Round 5). This included wins over the then-reigning premiers, Port Adelaide , and over then-runners up, the Brisbane Lions . Sitting pretty at 7 wins and 2 losses, and 3rd on the ladder, the impossible prospect of finals football loomed large. However, in the Round 10 match against Melbourne , star player Nathan Brown suffered a horrible leg injury, that would sideline him for the rest of the season. They went on to lose the match by 57 points, and would only register 3 more wins for the season (one of those was against eventual premiers the Sydney Swans by one point, who had a one-point win against Collingwood the round before), eventually finishing 12th. , 2006, a year which many experts predicted continued improvement for the Tigers, saw them lose their first H&A match by 115 points, against the Western Bulldogs , after which followed losses to St Kilda and West Coast . By the end of Round 3, things were looking grim for the Tigers once again. However, just as they did in 2005, the Tigers would respond to their poor start by winning 8 of their next 11 matches, and by the end of Round 14, the Tigers were in the Top 8 by a game and percentage. However, their spot in the Top 8 would be short lived, as 4 straight losses between Rounds 15 and 18 would effectively end their finals chances. They finished the 2006 season in 9th place, with 11 wins and 11 losses. , After promising seasons in 2005 and 2006, it was expected that the Tigers would take the next step in 2007, and play finals football. After massive hype in the off-season, the Tigers had a terrible start to the 2007 season, losing their first 9 matches (this included suffering their biggest ever defeat, at the hands of eventual premiers Geelong , by a whopping 157 points). Their first premiership points came in a draw against the Brisbane Lions in Round 10, and their first win of the season didn't come until Round 12 against fellow straggler Melbourne . After Round 18 of the season, the Tigers had registered a mere 1 win, 1 draw, and 16 losses, and were looking like recording their worst ever recorded season. However, late-season victories over old rivals Collingwood in Round 19, and Essendon in Round 21, saved them from this fate. They would eventually finish the year as wooden-spooners, with 3 wins, 1 draw, and 18 losses. , After the end of the 2007 season , Richmond elected to delist Patrick Bowden , Brent Hartigan , Andrew Krakouer and Carl Peterson . These four joined another four players in leaving Punt Road—veteran Darren Gaspar , Kent Kingsley , Trent Knobel and Ray Hall . While these players left the club Jake King and Angus Graham were elevated off the rookie list. , During the trade period the Tigers obtained Bulldog midfielder Jordan McMahon along with Eagle forward Mitch Morton . , Next up came the 2007 AFL Draft , in which the Tigers recruited highly rated midfielder Trent Cotchin with their first pick (No. 2 overall), backman Alex Rance (pick No. 18 overall) and ruckman Dean Putt (pick No. 51 overall). Then, in the pre-season draft, they elected to pick David Gourdis with the number one pick. The Tigers also picked Clayton Collard , Jarrod Silvester , Tristan Cartledge and Cameron Howat for the rookie list. Cam Howat had previously been on the rookie list but was delisted then picked up again. , The Tigers had kept a low profile going into their Round 1 clash against Carlton . Many people predicted that Carlton would run all over Richmond because Carlton had received Chris Judd during the trade period. The Tigers trailed by as much as 25 points during the second quarter but they came back, led by Matthew Richardson kicking five goals. The Tigers ended up winning 17.7 (109) to Carlton 11.13 (79) in front of a crowd of 72,552 at the MCG . , From Rounds 2 to 11 however, the Tigers would only register two more wins (and a controversial draw against the Western Bulldogs ). After Round 11's completion they sat in 12th place with three wins, one draw and seven losses. While many people wrote the Tigers of 2008 off at this point, they defied the odds and went on to win eight of their last 11 matches to finish off the 2008 season strongly, recording 11 wins, one draw and 10 losses. However, this would not be enough to get them into finals football, as they finished two premiership points short (and percentage) of 8th placed Collingwood , who finished with 12 wins and 10 losses. , At the start of 2009, Richmond was said to be rising as a team, and they would be in the eight . [ citation needed ] They had recruited former Brownlow Medallist Ben Cousins , and they had rising stars in Brett Deledio and Trent Cotchin . However, the club was beaten by 83 points in Round 1 by Carlton, and did not register a win until Round 5, against North Melbourne . With a record of 2–9 after eleven weeks, Terry Wallace stepped down as coach, having announced his intention during the previous week. Jade Rawlings was announced as caretaker senior coach; he adopted a youth policy for the remainder of the year, which saw experienced players Joel Bowden and Matthew Richardson retire by the end of the year. Rawlings led Richmond to three wins and a draw from eleven games. Richmond finished fifteenth with a record of 5–16–1. On 25 August, Damien Hardwick was appointed to be the senior coach from 2010. , As Jade Rawlings and Craig McRae and Brian Royal left the Tigers assistant coaching panel, Brendon Lade and Justin Leppitsch were appointed as assistant coaches, leaving only Wayne Campbell as a previous Richmond assistant coach. Brendon Gale was also appointed CEO of the Tigers. , Richmond was not expected to be competitive in 2010, with many commentators predicting the team would win no more than four games. From the 2009 AFL Draft , the Tigers drafted seven new players, which included midfielder Dustin Martin . At the 2010 Pre-season Draft, Richmond recruited young key defender Dylan Grimes , brother of Melbourne defender Jack Grimes . , Damien Hardwick selected a young team at the start of the season, with four debutants, and very few [ quantify ] players over 25 in the Round 1 loss against Carlton . Richmond was winless after nine games, before a scrappy win over Port Adelaide in Round 10. This was the start of a turnaround in Richmond's form, with the team winning six out of eight games, to sit with a record of 6–12 after eighteen rounds. After losing the final four matches, Richmond finished fifteenth out of sixteen with a record of 6–16. Young key forward Jack Riewoldt finished the season with 78 goals, to win the Coleman Medal . , Very early in the season, Richmond were criticised for \"partying too much\" in the wake of its winless start to the season; after the Round 3 loss to the Sydney Swans , Richmond players were reported to be at the bar drinking and acting in a disorderly manner.  , Richmond continued to show improvement to finish 12th out of 17 teams in 2011 with eight wins including a strong win over Port Adelaide in Alice Springs mid-season. , Jack Riewoldt again led the goalkicking with 62 majors, down on his previous year's tally of 78. Young midfielder Trent Cotchin won his first Jack Dyer Medal with 236 votes.  Cotchin also polled the most votes of any Richmond player in the 2011 Brownlow Medal count with 15 votes. Dustin Martin was next best, polling 12 votes.  , Richmond's 2012 season did not see an improvement from the previous three years, as they lost 6 games by 12 points or less and finished 12th for the second year running. They were the first team to be beaten by the Gold Coast in the season, having led by ten points with less than a minute remaining, the Tigers produced what former Sydney Swans coach Paul Roos labelled \"the worst 47 seconds in footy\" to lose by two points.  They did, however, defeat both of the eventual grand finalists Hawthorn and Sydney during the season, the only team to do so the entire year. , 2013 saw the Tigers produce their best season in twelve years, with the club qualifying for its first finals series since 2001 and just its third since 1982.   They were also one of only two teams to defeat the eventual premiers, Hawthorn , during the season. Richmond, however, were defeated by Carlton in the first elimination final, 18.8 (116) to 14.12 (96), and bowed out of the finals series. The crowd of 94,690 is the largest week-one final crowd since the AFL changed from a final four in 1972.  , Also in 2013, Peggy O'Neal , an American-born lawyer, became the first woman in the Australian Football League to hold the position of club president when she was chosen as the president of the Richmond Football Club.  , After finally breaking their finals drought the previous year, many believed the tigers would build on this success in 2014 and push for a top-four berth. Any hope of this happening all but disappeared when the Tigers fell to a record of 3-10 after Round 14. Despite this, a victory in round 15 initiated a nine match winning sequence to slip them in to eighth position on the ladder and claim consecutive finals appearances for the first time since 1975. A 57-point loss in their elimination final against Port Adelaide, ended their finals campaign abruptly in the first week of finals, for the second year in a row.  , Initially, Richmond saw itself as a gentlemanly and sportsman-like club; it even went to the extent of sacking a player who used poor language. During the early 1900s, the club used the press as a forum to publicise a campaign against violence in the game, which earned the derision of some rival clubs. This image followed the club into the VFL in 1908 and during the First World War the club emphasised the number of men associated with the club who had enlisted and served overseas. But the club's actions in 1916, when it voted with three other clubs seen as representative of the working class ( Collingwood , Fitzroy and Carlton ) to continue playing football, left no doubt as to which side of the class divide that the Tigers belonged. The club's self-consciously non-confrontational image can be partly attributed to two of long serving presidents— George Bennett (1887–1908) and Frank Tudor (1909–1918). Both were Richmond men and respected parliamentarians who took the view that how the game was played was more important than whether the game was won. , After World War I, the club's attitude hardened as they attempted to match it with the then power clubs Collingwood and Carlton. Eventually, the Tigers became more prosaic in their approach to recruiting and training. , The Hafey era transformed Richmond into one of the most feared combinations in the then VFL. The club's football administrator, Graham Richmond, drove the \"win at all costs\" mentality across the whole club, making Richmond a formidable force, winning five premierships from 1967 to 1980. , Since the Tigers' last grand final appearance in 1982, the club has appeared in four finals series(1995, 2001, 2013, 2014). Board and coaching instability during the 1980s and 1990s distracted the club and forced its focus away from becoming an onfield force. , The club's current home jumper is black, which features a yellow sash running from the top left of the jumper to the bottom right. In its first season, Richmond wore a blue jumper with a thin yellow-and-black sash running from right to left. In 2007, the club introduced a clash jumper to avoid a jumper clash with rival AFL team Essendon. It is similar to the current home jumper, but features a yellow collar, yellow side panels and a large white number box on the back of the guernsey. Since the 2014 season, the club guernsey's have been manufactured by sportswear company BLK  and features logos of its major sponsors Bingle and Jeep . , Jack Malcolmson is credited with writing the words to the song in 1962, adapting them to the tune of \"Row, Row, Row\" ( Monaco / Jerome ), a show tune from the Ziegfeld Follies of 1912 . Richmond were using words sung to the tune of Waltzing Matilda at the time and approached Malcolmson, a cabaret singer who was performing regularly at the Richmond Football Club Social Club, to write the lyrics. The current version of the song used by the club is a 1972 recording performed by the Fable Singers.  , Richmond's club mascot is called Tiger \"Stripes\" Dyer, named after AFL legend Jack \"Captain Blood\" Dyer . , The club's home ground is the Melbourne Cricket Ground (MCG) where the team plays most of their home matches in the regular season. , The MCG has a capacity of 100,000 and the club usually draws large attendances against Victorian clubs, particularly rivals such as Essendon , Collingwood and Carlton . , Richmond train at their home ground, the Punt Road Oval , which is located a few hundred metres from the MCG. , Club administration since 1908  , Richmond has an enormous support and is known for its dedicated fan-base, including its personal cheer squad who attended both home and away matches, for the club. Membership record for the club hit 69,000 in 2015 making it one of the most supported clubs in the Australian Football League . , The building of the fan base was a slow process for Richmond. In the 1890s, the club never sold more than three hundred season's tickets, but the following was built up with success in the VFA and membership numbered about 2,000 at the time of admission to the VFL in 1908. Between the wars, the club captured the imagination of the residents of Richmond . The successful Tigers were a positive motif for the oppressed working class community which suffered deprivation during the Great Depression . At this time, the Richmond community was almost half Catholic, and this demographic was reflected in the club amongst the players and officials. , As Melbourne dramatically spread out in the post-war years, so too did the Richmond supporters. Many were now concentrated in the eastern suburbs, which eventually formed the club's metropolitan recruiting zone. Indeed, at one point during the early development of the Waverley Park ground, the Tigers considered making the stadium its home for this reason. Following the barren period of the 1950s, Richmond was able to tap into the large number of fans by moving home matches to the MCG and almost doubled attendance figures. The Tigers maintained this advantage over the other clubs until the mid-1980s, when poor administration led to a downturn in every area of the club. As the club struggled for funds, the membership plummeted from over 10,000 to under 3,000. , The greatest display of loyalty from the fans occurred during 1990. Threatened by liquidation, the supporters rallied to pay off the multi-million dollar debt via the \" Save Our Skins \" campaign.  In 2011, the club launched the Fighting Tiger Fund to reduce the club's debt and to allow it to increase spending on the football department in order to be more competitive on field.  , In 2013, the club launched the The Roar is Back membership promotion aiming at signing up 60,000 members in a season for the first time ever. Following a successful campaign, on 24 June 2013, Richmond chief executive Brendon Gale confirmed that membership had passed 60,000.   The club created a limited edition commemorative Sherrin football to celebrate the achievement and it was distributed free to families at the 'Thank you for 60,000 members BBQ/Training Morning' at Punt Road Oval on 29 June 2013. The official membership total for 2013 was 60,321.  , For statistical purposes 30 June is the cut-off date for membership numbers although it does continue to sell memberships. In 2013, after 30 June the club commenced bundling 2013 and 2014 membership years into a special \"Sign up as a member for 2014 and get the rest of 2013 free!\" offer.  The 2014 membership total of 66,122  gave Richmond the 3rd biggest membership base in the AFL behind Collingwood and Hawthorn (80,793 and 68,650 respectively). This record was again broken in 2015 with the club signing up 69,005 members, still ranking 3rd in total membership numbers. , The Official Richmond Cheer Squad is an organised group of passionate supporters who attend every Richmond game whether in Melbourne or interstate. There are also supporter groups located in each state of Australia.  , In 1998, Richmond announced its Team of the 20th Century. The selection of the 22 players shows an even spread of champions from all the eras of the club: Thorp from the club's first premiership wins of 1920–21; McCormack, Strang, Titus and Dyer from the inter-war years; Rowe, Morris and Wright from the battling era after the war; Richardson and Knights from recent times. But the great days from the late 1960s to the early 1980s provide the bulk of the side: Sheedy, Green, Keane, Bourke, Barrot, Clay, Hart, Dean and Bartlett who made up the core of Tom Hafey's teams, and later success stories Weightman and Raines. Ian Stewart, named on the bench, created a record as the only man to win selection in a team of the century at two clubs—he was named in the centre of St Kilda's team as well. Richmond has four players denoted below with an asterisk who are also members of AFL Team of the Century . This is the second-most of any club. , Played 248 Won 173 Lost 73 Drawn 2 , [1] , As legends of the game: , As players of the game: , As coaches of the game: , The club's hall of fame was created in 2002 with 23 inductees. Below is a list, separated into categories, of members and the year they were inducted. So far, five Richmond \" Immortals \" have been named, the first of whom was Jack Dyer , the year before his death in 2003. Dyer was followed by Kevin Bartlett , Tom Hafey , Francis Bourke and Royce Hart . , [2] , During the centenary season the tigers announced their 100 Tiger Treasures consisting of 10 awards, each with 10 nominees given by the Richmond Football Club in 2008 to celebrate their centenary year of competition in the VFL/AFL . The awards were mostly given to players but also club moments and campaigns. On Saturday, 28 June Richmond held a centenary celebration at Punt Road Oval before the centenary game at the MCG against arch rivials Carlton later that day. , \"Put his unique stamp on the 1980 finals series , kicking 21 goals as a half-forward in Richmond's three appearances, including a Grand Final-equalling bag of seven in the Grand Final massacre of the Magpies , which earned him the Norm Smith Medal for being best afield.\" , \"Thrilled Tiger fans for a decade with his match-winning exploits at centre half-forward. His dominance up forward was a major factor in the Club's run of four premierships from 1967–74. He was an extraordinary mark, a deadeye shot for goal, very courageous and, when the ball hit the ground, he swooped on it like a rover.\" , \"No player in the history of the game epitomises his club more than the man known as 'Captain Blood'. He struck fear into the hearts and minds of all opposition players during the 1930s and 40s. Was renowned for his bone-jarring shirtfronts, which left many an opponent bloodied, battered and bruised. He bled for the Tigers and expected his teammates to do likewise.\" , \"On 15 August 1990, Richmond announced that it needed to raise $1 million by 31 October that year, or it would cease to exist. The Save Our Skins campaign was immediately established to keep the Tigers alive. With Club president Neville Crowe as the figurehead, the SOS campaign did exactly what it set out to achieve, raising the necessary funds to stave off the threat of extinction.\" , \"Graeme Richmond filled a variety of important roles at Tigerland over more than 30 years of devoted service. He was a shrewd, ruthless administrator, who never wasted an opportunity that could benefit his beloved Tigers. His strength lay in his relentless persuasiveness—he was a masterly recruiter and negotiator. And, as a speaker, arguably there have been none finer in league football history.\" , \"Bourke collided with teammate Stephen Mount in a tense Round 21, 1980 clash with North Melbourne at Arden Street and had trouble seeing because of the blood streaming down his face. He was subsequently moved from full-back to the opposite end of the ground, where he immediately made his presence felt, taking a diving chest mark and slotting through a crucial goal.\" , \"Richmond, under coach Tommy Hafey , finished the 1967 home-and-away season on top. The Tigers disposed of Carlton by 40 points in the second-semi, then faced up to a star-studded Geelong combination in the Grand Final . At the end of a spectacular contest, Richmond had broken a 24-year premiership drought. Barrot , Brown , Hart , Dean and Bartlett starred, while unsung hero Ronaldson kicked three vital goals.\" , \"The superstar full-forward was a noted high-flyer during his 200-game career at Tigerland, but the mark he took against Hawthorn at the MCG in 1979 was, almost literally, out of this world. 'Roachy' actually rose so high over a huge nest of Hawk players, he ended up making it a chest mark!\" , \"The little Tiger excitement machine decided to take off on a bit of a trot during the team's final home-and-away match of the 1990 season , against Sydney at the SCG . After gathering the ball deep in defence, 'Mitch' took one bounce, then another, and then five more (seven in total), before calmly drilling home an incredibly inspirational goal.\" , \"On 18 May 1974, all hell broke loose at half-time of Richmond's clash with Essendon at Windy Hill as the players were leaving the field . . . A massive brawl erupted, involving players and officials of both clubs. Following a league investigation, several players and officials received suspensions, the heaviest being for Graeme Richmond , who was rubbed out until 31 December and also fined $2000.\" , As of 4 December 2014: , Head coach , Assistant coaches , First Awarded 1924 , First Awarded 1897 , * Michael Roach was the first winner of the Coleman Medal in 1981. Retrospective awards were dated back to 1955. Prior to 1955 the Leading Goalkicker Medal was awarded. , First Awarded 1993 , First Awarded 1979 , Awarded 1937 to 1988 , Commenced 1953 , Commenced 1998 , Richmond has had a reserves team participate in various competitions since the early 20th century. The reserves competition for the then-Victorian Football League (now trading as the Australian Football League ) began in 1919 and the Richmond reserves recorded its first premiership in 1929. In the following 68 years, Richmond went on to win a further eight premierships in reserve-grade football.  The Richmond reserves participated in the VFL/AFL reserves, then the Victorian State Football League up to the 1999 season, then in the new Victorian Football League competition in 2000 . , In 2001, the Richmond reserves team was dissolved and the club entered a reserves affiliation with the Coburg Football Club in the VFL, using the latter as a feeder team. This arrangement lasted from 2001 until 2013.  Richmond ended the affiliation at the end of 2013, seeking to re-establish a more direct developmental structure by operating a stand-alone reserves team.  The reformed Richmond reserves team has played in the VFL since 2014, playing most its home games at the Punt Road Oval , with many as curtain raisers to the club's senior home and away games at the nearby Melbourne Cricket Ground .  "
}
