{
  "category": "afl",
  "article": "The St Kilda Football Club , nicknamed The Saints , is an Australian rules football club based in Melbourne , Victoria , Australia . The club plays in the Australian Football League , the sport's premier league. , The club's name originates from the bayside Melbourne suburb of St Kilda in which the club was established in 1873. , St Kilda were a foundation team of the Victorian Football Association (VFA) in 1877 and later, in 1897, became a foundation team in the Victorian Football League (VFL), which was renamed the Australian Football League (AFL) prior to the start of the 1990 season.  , St Kilda have only won a single premiership to date, a famous one-point win in the 1966 VFL Grand Final .  St Kilda have most recently won the minor premiership of the 2009 AFL season  and were 2009 and 2010 grand finalists. , St Kilda developed a reputation as perennial underachievers,  much of this attributed to their record of finishing last more often than any other club in the league (27 times),  as well as having the third lowest all-time win percentage of any team still playing in the league.  , , , The St Kilda Football Club was formed on 2 April 1873,  containing many elements of the previous South Yarra Football Club which had disbanded a year earlier. Soon after a decision was made to amalgamate St Kilda FC with nearby Prahran Football Club. St Kilda retained their colours, name and ground, as well as picking up a number of Prahran players.  St Kilda competed as a senior club in the VFA from 1877 to 1879, 1881–1882 and 1886–1896 before moving into the breakaway competition – The Victorian Football League – from 1897 onwards.  , St Kilda were one of the eight clubs that took part in the inaugural VFL season in 1897. They made their debut in an away game against Collingwood on 8 May 1897, which they lost 2.4. (16) to 5.11. (41). , The club's home ground in the new league was the Junction Oval ( until 1964 ) in the suburb of St Kilda in Melbourne and the club's first home game was against Fitzroy . The score was St Kilda 3.8. (26) to 10.6. (66). , St Kilda's early years in the VFL were not successful and, in 1899, they had the lowest score ever recorded in a VFL/AFL match, one point against Geelong (who scored 162).  , In 1902, Charlie Baker became the first St Kilda player to be the league's leading goalkicker in a home and away season with 30 goals. , Six successive wins at the start of the 1907 season saw St Kilda make the finals for the first time, qualifying third with nine wins and eight losses. , St Kilda were beaten by Carlton in their first VFL final by 56 points. They qualified in third position again in 1908 and were once again eliminated by Carlton in the semi-finals, this time by 58 points. , The 1913 season saw major improvement in which the team qualified fourth, but were eventually beaten in the 1913 grand final by Fitzroy. At the time a challenge system was in place, which allowed the team that qualified in first position as minor premiers to challenge any team that won through to be the top ranked team in the finals series if it was not the minor premiers. St Kilda won its semi-final against South Melbourne and then defeated Fitzroy two weeks later 10.10. (70) to 6.9. (45) in what was a match between the two teams that won the semi-finals. Fitzroy as minor premiers were allowed to challenge St Kilda – the number one ranked team in the finals series at that point – and the two teams played again the following week in the grand final which Fitzroy won 7.14.(56) to 5.13.(43). , Due to World War I the St Kilda Football Club was in recess in 1916 and 1917 but resumed in 1918 and fared well, making the finals in fourth position but were eliminated by Collingwood in a semi final by nine points, 58 to 49. , Colin Watson became the first St Kilda player to win the league's highest individual award, the Brownlow Medal . , The following years saw St Kilda establish itself as a more consistently competitive club. They made the finals in 1929 and were eliminated once again by Carlton , 12.9 (81) to 11.7, (73) in the semi-finals. , In 1936, Bill Mohr became the second St Kilda player to be the league's leading goalkicker in a home and away season. , Bill Mohr kicked 101 goals in 1936 and was the first St Kilda player to kick 100 goals or more in a season. , The mid-1930s saw the club consistently vying for finals berths, finally making it in 1939 by qualifying fourth after a record run of eight consecutive victories and an overall record of 13 wins and five losses.  The team had its first finals win since 1913, against Richmond , but were eliminated in the 1939 finals series by Collingwood in the preliminary final. , St Kilda won three of the first four games early in the 1940 season and were on top of the ladder after Round 4 before finishing second last. Although there were some prominent players like Harold Bray , Keith Drinan , Peter Bennett and later Neil Roberts , St Kilda were rarely competitive in the 1940s. The 1950 season saw St Kilda win the first five games before fading to finish with eight wins and a draw in ninth place. In 1955, after one of the club's worst seasons, Alan Killigrew was appointed coach. His first action was one of the largest clean-outs of players in the history of any VFL club. It is believed that only 17 players from 1955 played for St Kilda again in 1956, with 11 new players appearing in the club's opening match of 1956. , In 1956 Bill Young became the third St Kilda player to be the league's leading goalkicker in a home and away season with 56 goals. , In 1957, Brian Gleeson became the second St Kilda player to win the league's highest individual award, the Brownlow Medal. , In 1958, Neil Roberts became the third St Kilda player to win the Brownlow Medal. , Also in 1958 St Kilda won the Consolation Night Series competition , a competition that was played between clubs that had failed to qualify for the premiership season finals series. St Kilda defeated Carlton 16.13 (109) to 15.11 (101) in the final. , In 1959, Verdun Howell became the fourth St Kilda player to win the Brownlow Medal. , Howell tied with Bob Skilton in the 1959 Brownlow Medal count. At the time Skilton was awarded the medal on count-back. The league later decided to award a Brownlow Medal to any player who was eligible to win who tied on the same number of votes as a winner who won on count-back – with Verdun Howell receiving a Brownlow retrospectively. , In 1961, after finishing sixth in 1960, Allan Jeans was appointed coach. St Kilda qualified for the final four for the first time since 1939, qualifying third with eleven wins and seven losses. However, with fullback Verdun Howell unfit, the club lost to Footscray in the first semi-final. The club finished ninth in 1962 with nine wins and nine losses. , In 1964, St Kilda were defeated in the final of the Consolation Night Series competition by Footscray 11.12 (78) to 11.7 (73). , St Kilda had a convincing sequence of six consecutive wins in the last six rounds of the 1963 season to qualify in fourth position with 13 wins (52 premiership points), two premiership points behind minor premiers Hawthorn . The club lost to Melbourne in the semi-finals. , By the late 1950s, the St Kilda Football Club was seeking to move its playing base away from the Junction Oval , frustrated by disputes and relationships with the St Kilda Cricket Club . In 1959, the club made enquiries about a 50-year lease to play at and develop Elsternwick Park in the neighbouring suburb of Elsternwick , but no deal was signed.  In March 1964, the club arranged a deal to move its training and administrative base to the large Moorabbin Oval in Linton St, Moorabbin , approximately 10 km south-east of St Kilda, starting from the 1965 season .  The club signed a 75-year lease in August 1964 for controlling occupancy of the venue, and established a social club on the site.  The move cost the local Moorabbin Football Club its place in the Victorian Football Association .  , St Kilda's final home game for premiership points at the Junction Oval was the Round 18 match on 22 August 1964 against Geelong , which St Kilda won 12.18 (90) to 11.12 (78) in front of a crowd of 37,100.  Its first home game at Moorabbin was a 6-point win over Collingwood 8.12 (60) d. 8.6 (54) in front of a crowd of 51,370, which is still the ground record for Moorabbin Oval.  , St Kilda finished the home and away season a game clear on top with 14 wins and 4 losses, qualifying for a finals series in first position as minor premiers for the first time in the club's history. , St Kilda defeated Collingwood in the second semi-final to progress into the grand final. The club finished second in the 1965 premiership season after being beaten by Essendon 14.21 (105) to 9.16 (70) in the 1965 VFL Grand Final . , Ian Stewart became the fifth St Kilda player to win the Brownlow Medal. Stewart tied on votes with Noel Teasdale of North Melbourne and was awarded the 1965 Brownlow on a count-back. , 1966 saw St Kilda qualify for finals series in consecutive years for the first time since 1907–08. 14 wins and 4 losses in the home and away rounds qualified the club for the finals in second place. , Ian Stewart was the first St Kilda player in history to become a dual Brownlow Medalist after winning the 1966 Brownlow Medal with 21 votes. The second consecutive year he won the league's highest individual award and the sixth Brownlow Medal won by a St Kilda player. , St Kilda were defeated by Collingwood in the second semi-final 15. 9. (99) to 13. 11. (89). The club progressed to the 1966 Grand Final after defeating Essendon in the preliminary final 15. 4. (94) to 7. 10. (52). , St Kilda went on to defeat Collingwood in the 1966 VFL Grand Final 10.14 (74) to 10.13 (73), winning the club's first ever premiership. , in 1967, Ross Smith became the sixth player St Kilda player to win Brownlow Medal. This was also the third consecutive year that a St Kilda player had won the Brownlow Medal and the second time in the club's history that they had Brownlow Medalists in three consecutive years. , The 1968 season saw St Kilda qualify fourth with 14 wins, 5 losses and a draw. St Kilda were eliminated by Geelong in the first semi-final. , A seventh place home and away season finish in 1969 was followed by another finals appearance in 1970 , when St Kilda qualified in third place with 14 wins and 8 losses. St Kilda defeated South Melbourne in the first semifinal and went on to be eliminated by eventual premiers Carlton in the preliminary final. , St Kilda qualified for the finals series in second place in 1971 at the end of the home and away season with 16 wins. St Kilda was defeated by Hawthorn by two points in the second semifinal, defeated Richmond in the preliminary final and was defeated in the 1971 VFL Grand Final by Hawthorn. , The club qualified for the finals series again in 1972 in fourth with 14 wins and 8 losses. St Kilda defeated Essendon in the elimination final and Collingwood in the first semifinal before being eliminated in the preliminary final by Carlton. , 1973 saw the club qualify for a record fourth consecutive finals series in fifth place with 12 wins. St Kilda defeated Essendon in the elimination final before being eliminated in the semifinals by Richmond. , 1974 saw the Saints decline to the lower half of the ladder for the first time since the 1950s, finishing tenth with seven wins. The club failed to build on competitive seasons in 1975 and 1976 . Allan Jeans coaching career at St Kilda ended at the end of the 1976 season after 16 seasons. , 1978 began and ended strongly, but a mid-season slump saw the club narrowly miss the finals. 1979 began well with a win over Hawthorn before a run of defeats and finishing a clear last. Continuing financial pressures and defeats saw the club remain in the bottom three for every season from 1979 to 1986. , In 1987 , with Tony Lockett at full forward, St Kilda moved out of the bottom three for the first time since 1982 with nine wins. Tony Lockett won the Coleman Medal for leading goalkicker in the home and away season, the fourth St Kilda player to win the league's leading goalkicker award. Lockett became the second St Kilda player to kick more than 100 goals in a season (117). , Lockett also became the seventh St Kilda player to win the Brownlow Medal . He remains the only person in league history to win both the league's best and fairest Brownlow Medal and the league's leading goalkicker Coleman Medal award in the same season. Lockett also won St Kilda's best and fairest award, now called the Trevor Barker Award , and the Leigh Matthews Trophy (players association most valuable player) in the same year. He is the only person in league history to win the Brownlow, Coleman, club best and fairest and Leigh Matthews Trophy in the same year in 1987. , The league was officially renamed the Australian Football League prior to the start of the 1990 premiership season. , A competitive 1991 AFL season saw St Kilda qualify for a finals series for the first time since 1973, qualifying fourth at the end of the home and away rounds. St Kilda were defeated by Geelong in the elimination final. , Tony Lockett won the Coleman Medal for leading goalkicker in the home and away season in 1991, the first St Kilda player to win the league's leading goalkicker twice. , Lockett's 118 goals in 1991 was the third year a St Kilda player had kicked more than 100 goals in a season. , In a competitive 1992 season , St Kilda again qualified for the finals series, qualifying sixth at the end of the home and away rounds. Tony Lockett's 132 goals in 1992 was the fourth year a St Kilda player kicked more than 100 goals in a season. , St Kilda won its first finals series match since 1973, over Collingwood, before being by eliminated from the 1992 finals series by Footscray in the semi-finals. , The AFL embarked on a strategy of grounds rationalisation in the early 1990s and, with Moorabbin Oval's facilities ageing, St Kilda opted to take a deal to move home games to Waverley Park from 1993. The club voted in favour of the move in a weighted vote of members and shareholders by a margin of 8750 to 6555 in July 1992. The club received $430,000 upfront and $120,000 per year for three years from the AFL's grounds rationalisation funds, which helped to clear some of the club's debt.  St Kilda's final home game for premiership points at Moorabbin Oval was the Round 20 match on 1 August 1992, an 18 point win over the Fitzroy Lions in front of 27,736.  St Kilda Football Club retained Moorabbin Oval as a training, administration and entertainment venue. , St Kilda won the 1996 Ansett Australia Cup competition, the pre-season cup. The team had wins over Hawthorn in the round of 16, Adelaide in the quarter finals, West Coast in the semi-finals and defeated Carlton in the final 20.10 (130) to 10.12 (72) in front of 66,888 people at Waverley Park. , Nicky Winmar became the first St Kilda player to win the Michael Tuck Medal for best player on the ground in the 1996 Ansett Australia Cup Final.   , In the 1997 season , St Kilda qualified for the finals series in first position at the end of the home and away rounds with 15 wins and 7 losses, winning a second minor premiership and the first McClelland Trophy in the club's history. , Robert Harvey became the eighth St Kilda player to win the Brownlow Medal . , St Kilda defeated Brisbane in the qualifying finals and North Melbourne in the preliminary finals to move through to the grand final. St Kilda finished second after being beaten in the 1997 AFL Grand Final by Adelaide. , Prior to the start of the 1998 season , St Kilda progressed to the 1998 Ansett Australia Cup final in which they were defeated by North Melbourne. , St Kilda made their best start to a season since 1972 by winning five out of six matches by Round 6. At the half-way mark of the 1998 season, St Kilda had jumped to top spot on the ladder in Round 14 with eleven wins and three losses after defeating the Western Bulldogs in a top of the ladder clash at Waverley Park and were tipped as warm favourites for the premiership. However, the team's performance dramatically faded after going from second place in Round 17 to sixth at the home and away games conclusion in Round 22. During this period St Kilda defeated Geelong in Round 16 and West Coast in Round 21. After qualifying for the finals in consecutive seasons, St Kilda were defeated narrowly by Sydney in the qualifying finals and then eliminated comprehensively by Melbourne in the semi-finals. Consolation for the team's performance that year was Robert Harvey becoming the second St Kilda player in history to become a dual Brownlow Medalist after winning the 1998 Brownlow Medal with 32 votes, the highest ever votes at the time. He would also be the second St Kilda player to win consecutive Brownlow Medals and the tenth St Kilda Brownlow Medalist. , St Kilda made a good start to the 1999 premiership season after progressing to the top four in Round 10. Their form, however, then faded and by the season's end conclusion they would finish 10th on the ladder. St Kilda's final home game for premiership points at Waverley Park was the Round 20 match on 14 August 1999, a 25 point loss to North Melbourne which ended their chance at a third consecutive finals campaign in a row since 1997.  , In 2000, St Kilda moved to a new playing home at Docklands Stadium (currently known by its sponsorship name as Etihad Stadium) whilst maintaining the club's training and administration headquarters at Moorabbin. , The Saints struggled in the early part of this decade, winning only two matches and drawing one to finish with the wooden spoon in 2000 . They did not fare well in 2001 or 2002 either, finishing second-last in both seasons; the time spent at the bottom allowed St Kilda to recruit players such as Justin Koschitzke , Nick Riewoldt , Nick Dal Santo and Brendon Goddard , who were mainstays of the team over the following decade. The 2003 season saw a much improved Saints outfit, finishing 11th at the season's end. They scored a notable five-point victory over the eventual three-time premiers Brisbane in Round 11.  , 2004 began with the club winning the 2004 Wizard Home Loans Cup . St Kilda had wins over Adelaide in the round of 16,  Richmond in the quarter-finals,  Essendon in the semi-finals  and defeating Geelong in the final – 1.14.5 (98) to 1.10.7 (76) – in front of 50,533 people at Docklands Stadium.  , Robert Harvey became the second St Kilda player to win the Michael Tuck Medal after being judged best player on the ground in the 2004 Wizard Home Loans Cup Final.   , The 2004 AFL season saw the team win a then club record of 10 consecutive matches from round 1 to round 10. A consistent and competitive season saw St Kilda qualify third at the end of the home and away rounds and qualify for the finals series with 16 wins and 6 losses. , Fraser Gehrig won the Coleman Medal for leading goalkicker in the home and away season, the fifth St Kilda player to win the league's leading goalkicker award. His tally of 103 goals in 2004 (including finals matches) was the fifth year a St Kilda player had kicked more than 100 goals in a season. , St Kilda were defeated by Brisbane in the qualifying finals,  defeated Sydney in the semi-finals  and were eliminated by the eventual premiers, Port Adelaide , in the preliminary final.  , In a consistent and competitive 2005 AFL season , the Saints finished the home and away rounds in the top four in fourth position, qualifying for the finals series with 14 wins and 8 losses. , Fraser Gehrig won the Coleman Medal for leading goalkicker in the home and away season, the second St Kilda player to win the league's leading goalkicker award twice and the first have consecutive wins.  , St Kilda defeated the 2005 minor premiers, Adelaide, in a qualifying final in Adelaide. They were eliminated by the eventual premiers, Sydney, in the preliminary finals two weeks later. , A competitive 2006 AFL season with 14 wins and 8 losses saw the club finish in sixth position at the end of the home and away rounds and qualify for a third successive finals series. St Kilda were eliminated by Melbourne in the elimination finals.  , In Round 7, against Geelong at Docklands Stadium, Robert Harvey broke the all-time games record for St Kilda (until then held by Nathan Burke) when he played in his 324th premiership season match. , On 11 October 2006, Ross Lyon was appointed as the new head coach for the Saints, replacing Grant Thomas .  , 2008 began with the Saints winning the 2008 National Australia Bank Cup . The team had wins over Richmond in the round of 16,  Geelong in the quarter-finals,  Essendon in the semi-finals  and won the final against the Adelaide Crows by 5 points at Football Park (AAMI Stadium) in Adelaide 69 to 64.  , Jason Gram became the third St Kilda player to win the Michael Tuck Medal after being judged best player on the ground in the 2008 NAB Cup Final.   , In a competitive 2008 AFL season St Kilda again qualified for the finals series, a 108 point win over Essendon in the final home and away round saw the club take fourth position for the finals series with 13 wins.  St Kilda were defeated by Geelong in the qualifying finals,  defeated Collingwood in the semi-finals  and were eliminated by the eventual premiers, Hawthorn, in the preliminary final.  , St Kilda were eliminated from the 2009 NAB Cup by Brisbane in the opening round.  , St Kilda won the first 19 games of the 2009 season, breaking the club record of 10 successive wins which was set in the first 10 games of the 2004 season. The winning streak was brought to end by Essendon in Round 20 when they defeated the Saints by two points. An after-the-siren shot at goal which would have won the game for St Kilda was missed by Nick Riewoldt .  , In Round 14, on 5 July, St Kilda played the premiership favourites Geelong, a club they had not beaten since 2006. Both teams were undefeated prior to the round 14 clash. St Kilda defeated Geelong by six points.  The game broke many records including highest ever crowd for an AFL match at Docklands Stadium (54,444)  as well as the latest round in a season that two undefeated teams had met (the previous record was in Round 8, 1991 when West Coast played Essendon after being unbeaten). The game was sold out two weeks in advance,  causing a change in timeslot (moving from 2.10pm to 3.10pm) so that the Seven Network could broadcast the game live in Victoria.  , St Kilda went on to qualify for the 2009 AFL finals series in first position, winning a third minor premiership and second McClelland Trophy with 20 wins and 2 losses – the best home and away record in the club's history and one of the most dominant home and away seasons ever in AFL history.  , St Kilda defeated Collingwood in the qualifying finals  and went on to qualify for the 2009 AFL Grand Final by defeating the Western Bulldogs in the preliminary final.  They did not win the 2009 AFL premiership in the grand final, however, a match in which the most dominant team of the season played against the most dominant teams of the past two seasons, Geelong. St Kilda were defeated by Geelong in the grand final by 12 points.  , Ross Lyon signed a three-year extension to his coaching contract until the end of the 2012 season.  , St Kilda reached the final of the 2010 NAB Cup competition with wins over Collingwood in the first round,  Sydney in the quarter finals  and Fremantle in the semi-finals.  St Kilda were defeated by the Western Bulldogs in the NAB Cup final 16.8 104 to 9.10 64.  Stephen Milne produced three goal of the year nominations, in Rounds 5, 11, 13. , The Saints qualified for the 2010 AFL finals in third position with a home and away record of 15 wins, one draw and six losses, the fourth best home and away season record in the club's history. , St Kilda defeated Geelong in the AFL 2nd Qualifying Final at the MCG by four points – 12.11 (83) to 11.13 (79)  – to record the club's first ever finals match win over Geelong. St Kilda then defeated the Western Bulldogs by 24 points in the 2nd Preliminary Final – 13.10 (88) to 8.16 (64) to qualify for their second consecutive grand final.  , In the 2010 AFL Grand Final on 25 September, the Saints played against the Collingwood Football Club, with the match ending in a draw – 10.8. (68) to 9.14. (68).  This was the third drawn grand final in league history and had an attendance of 100,016.  Lenny Hayes won the Norm Smith Medal for the player judged the best on ground in the match.  , In the Grand Final replay, on 2 October at the MCG , Collingwood won by 56 points.  , In December 2010, the club received the keys to their new additional training and administration property in the City of Frankston at Seaford  – currently known by its sponsorship name of the Linen House Centre – after its construction was completed at a cost of approximately $9.5 million. As a consequence of the new additional facility being completed – and a cash operating profit after depreciation of $1.69 million in 2010 – the Saints announced a record net profit of $7.467 million for season 2010.  , The Saints achieved a new record membership for a season (over 40,000 for the first time), new record home total attendance of 418,098, new record home average attendance for a season, new record total attendance for all matches in a season of 1,151,816 – and averaged 76,628 for all matches at the MCG in 2010 – more than any other team. , St Kilda reached the semi finals of the restructured 2011 NAB Cup competition with a win over Brisbane and a draw with Essendon in the pool games in Round 1   then a win over Geelong in the quarter finals  before losing to Essendon in the semi-finals.  , The Saints opened their 2011 premiership campaign on 25 March 2011, losing to the Geelong Cats by one point.  , St Kilda qualified for the 2011 AFL finals series – for a club record equalling fourth successive season – with a win over North Melbourne at Docklands Stadium by 65 points in Round 23 of the 2011 AFL Premiership Season .  , St Kilda played in an elimination final in Week 1 of the finals against Sydney at Docklands Stadium, losing by 25 points.  After the elimination final, coach Ross Lyon left the club, despite one year remaining on his contract, to join Fremantle .  Former Sydney, Fremantle and West Coast player and Collingwood assistant coach Scott Watters was announced as Lyon's replacement in October 2011.  , Under their new coach the Saints started the year with some improvement on 2011, winning three of their first five games, including a 92-point win against the Gold Coast Suns.  They finished with 12 wins from 22 games and finished ninth on the ladder, just missing out on the finals for the first time since 2007. , 2013 marked a historic moment for the St Kilda Football Club and the AFL with the first home and away season match outside of Australia. The match was held in Wellington, New Zealand on 25 April ( Anzac Day ), the day each year on which both Australia and New Zealand commemorate the soldiers from both countries who have fought in conflicts around the world. , The match began in the early evening and was held at Westpac Trust Stadium with the Saints hosting the Sydney Swans. The match was played in frigid and slippery conditions. The Saints lost the match by 16 points. , In Round 23, St Kilda hosted Fremantle in what would be the last game for three 200 game players, Stephen Milne , Jason Blake and Justin Koschitzke . The Saints won by 71 points. , St Kilda won five matches for the year and finished 16th on the ladder. On 1 November, senior coach Scott Watters was sacked. On 14 November, former Port Adelaide director of coaching Alan Richardson was announced as new senior coach for the next three years. In the off-season, the Saints trading negotiations resulted in the arrival of Shane Savage , Luke Delaney , Josh Bruce and Billy Longer , while also picking up draft picks 3, 18 and 19, which were used to take Jack Billings , Luke Dunstan and Blake Acres respectively. , St Kilda began 2014 under new coach Richardson with a 17-point win over favourites Melbourne. They followed this with a win over the GWS Giants to start the season 2-0 for the first time since 2010. After a close loss to West Coast and a heavy defeat to Adelaide, the Saints managed to upset top eight favourites Essendon by 16 points. Following this, the Saints lost the next 11 games, including losses by over 80 points to Hawthorn, Collingwood, Geelong and Carlton. On 15 July, Lenny Hayes announced his retirement at the end of the 2014 season. The following weekend, the Saints beat Fremantle by 58 points at Etihad Stadium in the upset of the season. The Saints then lost the remaining five games to end the season with 4 wins and 18 losses as well as their first wooden spoon since 2000. , The original colours of the St Kilda Football Club are red, white and black. In the club's early years, from 1873 to 1896, the players wore a thinly striped red, white and black jumper; the stripes were later widened. In 1915, St Kilda changed its colours to red, yellow and black, because red, white and black were the national colours of the German Empire during the First World War . These colours were long associated with republicanism in Germany and were later revived as the flag of the inter war Weimar Republic and later the post WWII German Federal Republic. , In 1923 the club returned to using the club's original colours of red, white and black. The club crest first appeared on the jumper in approximately 1933. In 1953 the Saints' jumper took the look of the three stripes; red, white and black which have been used up until today, except for a period from 1997 to 2001 in which a stylised jumper based on the club crest was worn.  , 1873–1896 , 1915–1918 , 1919–1922 , 1923–1952 , 1953–1959 , 1997–2001 , 2002–2010 , 2011- , The St Kilda jumper is three vertical stripes of red, white and black on the front with the club crest. The back is black with white numbers. The current jumper sponsor is Dare Iced Coffee, whose logo appears on the front of the uniform. LEDified appears on the back. The clash jumper is very distinct from the home jumper, bearing red, white and black vertical stripes with a white back, with sponsor positions reversed. , The club has used many logos since it was formed in 1873 for promotional and merchandise purposes. The league did not use official club logos until approximately the 1970s. Prior to the 1970s logos were generally created by clubs and in some cases outside companies for sales of merchandise but were in no way official ( or registered trademarks in some cases ). In the past all the club logos were printed in the same basic design frame ( in the form of a badge or shield shape ) and had each clubs individual colours, name and design in them. St Kilda used several different logos, including some featuring the stick figure in the 1980s and 1990s. Shortly after the league officially changed its name to the AFL prior to the start of the 1990 premiership season, the club used a logo with a red white and black vertically striped design with the goal and behind posts on it, with a stick figure attempting a mark on it with a halo above its head, with the league logo and the club crest on top of either behind post. , A logo change before the start of the 1995 season saw the club make the decision to use the official club crest - which has been on the club jumper since it was first designed in the 1930s and was already an officially registered trade mark of the club - as the club's official logo in the league. The crest is an iconic feature of the club's jumper - a well-known and recognisable symbol of the club. The crest also includes the club's motto, Fortius Quo Fidelius , which is usually translated as \"Strength through loyalty\". As with the nickname \"Saints\" the club crest has no religious associations. , The club song is based on the music of the song \"When The Saints Go Marching In\".  The official club song, \"When The Saints Go Marching In\", was recorded in 1972 by the Fable Singers and released as a single. The song was recorded will all copyright and royalty agreements in place and the AFL has permission to broadcast it publicly at each St Kilda match.  , Until 1964, when St Kilda played at the Junction Oval, the club song at every match was an adaptation of \"I Do Like To Be Beside The Seaside\". When the club moved to Moorabbin Oval a popular chant called \"We are the Saints\" was sung by supporters. In the late 1960s \"When The Saints Go Marching In\" eventually became established as the club song. The tune is used by permission under licence. , The club's training and administration base remained at Moorabbin Oval after home games ceased being played there. The club's final home game for premiership points at Moorabbin Oval was in Round 20, 1992. , Moorabbin Oval was extensively renovated to provide training, administration and entertainment facilities within the Huggins Stand and a heritage museum. Moorabbin Oval remains part of the club's training, administration and entertainment base. The G.G. Huggins Stand has three internal floors that contain player rooms, a fully equipped player gymnasium, football department meeting rooms, administration offices, a membership department, gaming room and bar, the Trevor Barker Room (a function room with a bar), club shop, trophy and memorabilia display areas and other facilities. , In 2010 construction was completed on a new additional training and administration property at Seaford in the City Of Frankston, approximately 21 kilometres from Moorabbin Oval. The new facilities were completed a cost of approximately 9.5 million dollars and was named the Linen House Centre under a naming rights sponsorship deal. , Grand Finals (7) , Finalists (26) , Head coach , Assistant coaches , An individual player award under various headings such as \"champion player\" and later \"best and fairest\" has been made since about 1914. In the late 1990s the club named the award the Trevor Barker Award to honour the name and memory of Trevor Barker , a former St Kilda player and reserves coach.  , The person who has won the most St Kilda best and fairest awards: , The Brownlow Medal is awarded to the \" best and fairest \" player in the Australian Football League (AFL) during the regular season (i.e., not including finals matches) as determined by votes cast by the officiating umpires after each game. It is the most prestigious award for individual players in the AFL. It is also widely acknowledged as the highest individual honour in the sport of Australian rules football . , Since 1992, the Michael Tuck Medal has been awarded to the player adjudged best on ground during the AFL Cup Final held before the Premiership season begins each year. Three St Kilda Football Club players have won it. , The Leigh Matthews Trophy is awarded by the AFL Players Association to the player voted the most valuable during the year, the award has been given out ever since Leigh Matthews first won it in 1982. , The Coleman Medal is awarded to the leading goal scorer in the league in the home and away season. Prior to 1955 the league's leading goal scorer was awarded the Leading Goalkicker Medal . , The AFL Rising Star award is given to a young player considered to have significantly improved during the year. Every round, an Australian Football League rising star nomination is given to a standout young player. To be eligible for the award, a player must be under 21 on 1 January of that year, have played 10 or fewer senior games before the beginning of the season, and not have been suspended during the season. , The Australian Football Hall of Fame was established in 1996, the centenary year of the Australian Football League , to help recognise the contributions made to the sport of Australian rules football by players, umpires, media personalities, coaches and administrators.  As of 2015, the following sixteen former players and coaches who served at least part of their career at St Kilda have been inducted into the AFL's Hall of Fame , with five players elevated to the top status of 'Legend', reserved for approximately 10% of the total Hall of Fame. , St Kilda Football Club's Hall of Fame was established in 2003. , Club identities, past or present, are selected and inducted into the club's hall of fame by a St Kilda Football Club Hall of Fame committee.  , At each gala event, at least one inductee is selected to be elevated to club legend status. , St Kilda's most recent Hall of Fame induction was held in the Palladium at Crown Casino in Melbourne on 24 July 2010 with three new inductees added.  , The St Kilda Football Club Hall of Fame committee for 2010 featured Ross Smith, Greg Westaway, John Beveridge, Russell Holmesby, Neil Roberts, Allan Jeans and Danny Frawley. , Previous inductions were held in 2003, 2007 and 2008, with 13 identities inducted in 2003, 12 in 2007 and 12 in 2008. , 2003 Inductees , 2007 Inductees , , 2008 Inductees , 2010 Inductees , At a special function in 2003 the St Kilda Football Club Team of the Century  was announced. Darrel Baldock, who captained the 1966 grand final team, was named as captain and Allan Jeans, who coached St Kilda for a record 17 years, was named as coach. Ian Stewart was also named a member of the AFL Team of the Century . , , Actor Eric Bana , music business identity Ian \"Molly\" Meldrum and cricketer Shane Warne are prominent supporters of the club.  , St Kilda's official membership figures 1984-2013  , St Kilda operated its own reserves team from 1919 to 2000. From 1919 to 1991 the VFL/AFL operated a reserves competition and, from 1992 to 1999, a de facto AFL reserves competition was run by the Victorian State Football League . St Kilda fielded a reserves team in both of these competitions, allowing players who were not selected for the senior team to play for St Kilda in the lower grade. During that time, the St Kilda reserves team won three premierships (1942, 1943 and 1961). Following the demise of the AFL reserves competition, the St Kilda reserves team competed in the new Victorian Football League in the 2000 season before the team was dissolved at the end of the year. , In 2001, St Kilda entered a reserves affiliation with existing VFL club Springvale (which moved to Cranbourne and was renamed Casey in 2006). Under the affiliation, reserves players for St Kilda played VFL football with Springvale/Casey. The affiliation ended after the 2008 season  and St Kilda then entered an equivalent affiliation with Sandringham which it still maintains as of the 2015 season.  , St Kilda plans to end its affiliation with Sandringham and re-establish its own reserves team in the VFL in the near future, currently expected to be from the 2017 season after a redevelopment of Moorabbin Oval is completed.  , "
}
