{
  "category": "cycling",
  "article": "  , Adrien Niyonshuti (born 2 January 1987 in Eastern Province , Rwanda ) is a professional bicycle racer for South African UCI Continental team MTN-Qhubeka .  Although he survived, six of Niyonshuti's brothers were killed in the Rwandan Genocide of 1994.  Niyonshuti began riding a bicycle given to him by his uncle as a teenager, when he came to the attention of former professional cyclist Jonathan Boyer in 2006 during the first Wooden Bike Classic. After riding for the Rwanda national cycling team, Niyonshuti secured a professional contract with Team MTN Cycling , beginning in the 2009 professional season. , , , Niyonshuti began amateur cycling at the age of 16 in his native Rwanda. In 2006, he came to the attention of a former professional cyclist, Jonathan Boyer. The first American cyclist to compete in the Tour de France , Boyer was working in Rwanda on a project to import cargo bicycles for coffee farmers. Boyer also assumed the role of coach for the Rwandan national cycling team, and recruited Niyonshuti to race.  Niyonshuti had good initial results in local races such as the Tour of Rwanda , in which he finished in the top ten five years in a row and won in 2006 and 2008.  , In 2008, Niyonshuti attended the Africa Continental Centre Training Camp in South Africa, where he was offered a contract by Douglas Ryder , the directeur sportif of UCI Continental Team MTN Energade.   He started his first UCI European road race in August 2009 with his participation in the 2009 Tour of Ireland , becoming the first Rwandan cyclist to ride in the European professional peloton .  Niyonshuti qualified to represent Rwanda in the cross-country mountain bike race during the 2012 Summer Olympics in London .  , After the 2012 London Olympic Games Niyonshuti immediately felt he wanted to offer the chance for young people in his country to experience the power of cycling, to instill hope and to pass on its positive values to future generations. , The Adrien Niyonshuti Cycling Academy  idea was born and the first location chosen was his home town of Rwamagana. Along with support from the Rwandan Cycling Federation, Team Rwanda and the Rising from Ashes Foundation the academy was officially launched in the August 2013. , The initial 2014 program will focus on building the Academy in Rwamagana with a view to opening up two new Rwandan centres in 2015. The presence of a professional team documenting and continuously assessing performance via tangible results the Academy will have gained the tools and experience to expand outside the borders of Rwanda. "
}
