{
  "category": "cycling",
  "article": "Axel Merckx (born 8 August 1972 in Uccle ), is a Belgian former professional road bicycle racer . In his professional career that began in 1993 and ended in 2007, he won an Olympic bronze medal and competed in eight Tours de France, finishing as the highest-placed Belgian rider six times. He is the son of professional cyclist and five-time Tour de France champion Eddy Merckx . , , , Axel Merckx became a professional cyclist in 1993. He had several strong years of racing, including winning the Belgian national championship in 2000. Axel Merckx repeatedly vowed to make his mark by accomplishing feats his father Eddy never managed - including a Tour de France stage win at the top of Alpe d'Huez and a win in the Paris–Tours World Cup race - but did not make good on these promises. , Merckx won the bronze medal in the road race during the 2004 Games in Athens . In the final kilometre, he moved off the bunch with a canny move. , During the 2006 Tour Merckx announced that he signed a new contract for one extra season with Phonak, (to be renamed iShares). He stated that this would be his last season as a professional road bicycle racer. However, after Phonak announced that it would stop sponsoring the cycling team, Merckx signed a contract with T-Mobile Team, the same team where he started his professional career. Merckx announced his retirement from professional cycling at the end of the 2007 Tour de France .  He cycled, and won, his last race in Lommel , Belgium in early August 2007.  , His name was on the list of doping tests published by the French Senate in 24 July 2013 that were collected during the 1998 Tour de France and found suspicious for EPO when retested in 2004.  , Merckx currently serves as the Owner and Directeur sportif for the Axeon Cycling Team .  , Merckx married Canadian triathlete Jodi Cross in 1997, and currently resides in Kelowna, British Columbia . He has two children, Axana and Athina Grace (born 30 June 2005). , Because his father Eddy Merckx has been made a baron in Belgium (as personal title, but his nobility is hereditary), Axel Merckx also belongs to the nobility. As such, he is officially referred to as Jonkheer Axel Merckx.    The honorific Jonkheer is comparable to the British honorific \"The Honourable\", when the untitled person is the son or daughter of a baronet, earl or viscount. , Axel Merckx created the Granfondo Axel Merckx National Series, with its inaugural event being the Granfondo Axel Merckx Okanagan on 10 July 2011 in Penticton, British Columbia . Axel's father Eddy rode in the inaugural event. "
}
