{
  "category": "cycling",
  "article": "  , Sir Christopher Andrew \"Chris\" Hoy , MBE (born 23 March 1976) is a British racing driver and former track cyclist who represented Great Britain at the Olympics and World Championships and Scotland at the Commonwealth Games . , Hoy is an eleven-time world champion and six-time Olympic champion. With a total of seven Olympic medals, six gold and one silver, Hoy is the most decorated Olympic cyclist of all time. , With his three gold medals in 2008 Summer Olympics , Hoy became Scotland's most successful Olympian, the first British athlete to win three gold medals in a single Olympic Games since Henry Taylor in 1908 , and the most successful Olympic cyclist of all time. After winning a further two gold medals (in the keirin and team sprint ) at the 2012 Summer Olympics , Hoy has won more Olympic gold medals (six), and total medals (seven, tied with fellow cyclist Sir Bradley Wiggins ) than any other British athlete. , , , Hoy grew up in the suburb of Murrayfield , in the south of Edinburgh , Scotland , and was educated at George Watson's College , a prestigious Edinburgh private school,  followed by the University of St Andrews in 1996. He subsequently transferred to the University of Edinburgh , from which he graduated B.Sc. (Hons.) in Applied Sports Science in 1999.  , Hoy was inspired to cycle at age six by the 1982 film E.T. the Extra-Terrestrial .  Before track cycling, Hoy raced BMX between the ages of 7 and 14 and was ranked second in Britain, fifth in Europe, and ninth in the world. He received sponsorship from Slazenger and Kwik-Fit , and was competing in Europe and the U.S. He first became aware of track cycling when he watched TV coverage of Scottish sprinter Eddie Alexander winning a bronze medal at the 1986 Commonwealth Games in Edinburgh.  Hoy also rowed for the Scottish junior team, coming second in the 1993 British championship with Grant Florence in the coxless pairs. He played rugby as part of his school's team.  , Hoy joined his first cycling club, Dunedin C.C., in 1990 aged 14, and began concentrating on track cycling in 1993, when he joined the City of Edinburgh Racing Club .  , Hoy won silver in Berlin , at the 1999 UCI Track Cycling World Championships in the team sprint, riding as the third man. Regular team mates in the team sprint over the years have included Craig Maclean , Ross Edgar , Jamie Staff , Jason Queally , Matthew Crampton and Jason Kenny . , Following Jason Queally's Gold Medal in the Kilo TT, Chris joined with him and Craig MacLean to win his first Olympic Medal, a Silver in the Team Sprint or \"Olympic Sprint\" as it was then called. They were beaten by an excellent French team but the two medals won for GB was the start of the renaissance on British Cycling which has lead on to remarkable results over his career. , Chris arrived in Athens in the form of his life. His main event was the Kilo Time Trial and the race produced what is probably the best ever Kilo competition. He was ranked No 1 and was last man off. The sea level World Record was broken four times as he sat in the track centre waiting for his start. He had been involved in an accident in the athlete's village just a few days prior to competition where he came off his bike in front of a village bus, narrowly avoiding serious injury. As he came out of the starting gate, his scarred arms and legs showed how close he was to not competing. The previous rider was the great Arnaud Tournant who set the fastest ever sea-level kilo. Chris came next and, cheered on by thousands of loyal British fans, he bettered the time on each lap, setting a new sea-level World and Olympic Record of 1.00.733. This was the first of his Olympic Gold medals and added to the Silver, won in the Team Sprint in Sydney in 2000. , Following the decision to remove the Kilo from the Olympic programme after the 2004 games, Hoy sought to develop in other events.  The first of these was the keirin . This event involves between six and eight riders following a small motorbike (the Derny ) around the 250m track for 5.5 laps, as the bike slowly builds up the speed. The bike pulls off with 2.5 laps to go and the riders race for the line. Hoy had previously competed at the keirin in various events but one of his first major successes was at the Manchester round of the World Cup Classics Series in 2007, shortly before the World Championships, where he also won, ahead of his team mate Ross Edgar . [ citation needed ] , This showed that Hoy was developing from just a pure power sprinter, in events like the Kilo and Team Sprint, into also being one of the best in the world at more tactical sprinting events such as the keirin  and the individual sprint. , On 12 May 2007, Hoy attempted the world record for the kilometre. He fell 0.005 seconds short, clocking 58.880. He set a record for the 500m flying start at 24.758 seconds, over a second less than the 25.850 set by Arnaud Duble. Hoy set the sea-level kilometre record of 1 minute 0.711 seconds by winning the Olympics in Athens in 2004. The outright record of 58.875 seconds is held by Arnaud Tournant (France), set during 2001 at altitude in La Paz , Bolivia, where Hoy also attempted to break the record. At the time, only 3 sub-60sec kilos had ever been ridden; Hoy recorded two of these over two days in La Paz.  , Hoy's main achievement is his development in the individual sprint event considered to be the blue riband event of track cycling.  Kilo riders like Hoy have historically not fared as well at this event, as they were less experienced in the tactical elements required for the sprint. Previously, Hoy had competed in the sprint at various World Cup events and Revolution meetings in Manchester, but it was not one of his main events and he did not compete in it at the World Championships or the Olympics. In the semi finals Hoy defeated Italian veteran Roberto Chiappa 2–0, to set up a meeting in the final against France's Kevin Sireau. Sireau was the World Cup Classics points winner for the season and had defeated Hoy 2–0 in their previous meeting only a few weeks earlier. However with the vocal Manchester crowd behind him Hoy was not to be denied victory and he completed the win 2–0, the first British man to win the sprint title in 52 years since Reg Harris.  , Hoy became the first British Olympian for 100 years to claim three golds at one games at the 2008 Summer Olympics in Beijing . This came when he won the men's keirin, the men's team sprint and also the men's individual sprint.  , The three man team sprint squad included Hoy, Jason Kenny and Jamie Staff . Kenny replaced Ross Edgar just before the games. They defeated the French by a clear margin, despite the French team's previous dominance of the event. , The keirin was Hoy's second gold medal of the 2008 games, when he came home clear winner ahead of team mate Edgar. , Hoy reached the final round of the individual sprint without a glitch, setting the Olympic record in qualification along the way. In the final his opponent turned out to be his young team mate, Jason Kenny. Kenny was a junior world champion who had achieved a number of high placings. Hoy used his greater experience to defeat Kenny, completing his hat trick of Olympic titles. , Hoy did not race at the first major event of the 2009/10 season, the World Cup Classics Event in Manchester on 4 October – 2 November. He instead made an appearance to sign autographs and commentate with the BBC . He made his return to racing in the UK at the Revolution 22 event in Manchester in December. He received a standing ovation from the Manchester faithful at the start of the event when he was introduced to the crowd.  At this event Hoy won both the Sprint and Keirin competitions, defeating likes of Jason Kenny , Jamie Staff , Ross Edgar , Matthew Crampton and Teun Mulder along the way. Hoy competed in the World Cup Classics series' final event in Copenhagen , Denmark in February, helping his team to a gold medal in the team sprint event. However, he crashed out during the men's Keirin final and was forced to miss the final day of competition, including the men's sprint. Although at first, his injury seemed minor, he returned to Manchester where, following a scan, he was diagnosed with a serious de-gloving injury which finished his season and kept him off his bike for almost 3 months.  He was unable to compete as planned at the Revolution 24 event in Manchester the following weekend, he did however make an appearance at the event. He has had to pull out of the World Championships in Poland at the end of March, where he would have attempted to defend 2 World titles, because of the hip injury.  , Hoy started the 09/10 track season at the National Cycling Centre, Manchester, at the British National Championships where he took only his second (and third) ever individual national titles. He took gold medals in the Keirin, Sprint and was part of the Team Sprint Team representing team SKY along with Jamie Staff and Jason Kenny. Two weeks later, he raced in round one of the UCI World Cup at the same venue and took gold in the Mens Keirin. He then went into day 2 of the competition and took gold in the sprint event, beating fellow Brit Matthew Crampton in the final 2–0. A third World Cup gold came in the Team Sprint on the Sunday. Having ridden and won 12 events over the weekend, he withdrew from the International Japanese Keirin which was consequently won by team mate Matt Crampton. At the 2010 UCI World Championships, Hoy was beaten in the quarter final of the men's sprint event by his German opponent, Robert Förstemann , who won after making an attack from the start line. He was part of the GB men's team sprint that took the bronze. In the Keirin event, Hoy won the gold medal, despite crashing in the heats, to take his tenth world title.  , Hoy lost in the first round of the men's sprint at the European Championships to Ireland's Felix English. At the Manchester World Cup event in February 2011, Hoy lost in the semi-finals to Jason Kenny .  Hoy took the match sprint title at the British National Championships in October 2011.  , At the 2012 World Cup event held in the new London Velodrome, Hoy won three medals. He won gold in the keirin and bronze in the team sprint, before winning gold in the Men's Sprint, losing just one race in four rounds.  , Hoy was an ambassador for the 2012 Summer Olympics in London. Hoy led Team GB out as the team's flag carrier at the opening ceremony at the London 2012 Olympic Games .  He then went on to win gold in the team sprint with Jason Kenny and Philip Hindes , setting a new world record in the velodrome  and becoming Team GB 's joint gold record holder with Sir Steve Redgrave 's tally of five gold medals with a total of six medals (5 gold, 1 silver).  , On 7 August 2012 Hoy won gold in the Keirin to overtake Sir Steve Redgrave and become the most successful British olympian ever, winning a total of 6 gold medals. This also made him the joint holder of most medals won by any British athlete in the Olympic Games with fellow cyclist Bradley Wiggins .  , Hoy's interest in motorsport competition led him to contest the inaugural season of the Radical Sportscars SR1 Cup, scooping his first motorsport podium at Snetterton in the same season. Hoy has since contested selected rounds of the Radical SR3 Challenge and Radical European Masters in Radical's SR3 RS and SR8 RX open sportscars. On 8 April 2014 it was announced  that Hoy will be joining the British GT championship driving a Nissan GT-R Nismo GT3 with a view to competing in the 24 Hours of Le Mans in 2016. Hoy took his first victory in international competition at the opening round of the 2015 European Le Mans Series at Silverstone where he drove a Ginetta -Nissan to a class win alongside team-mate Charlie Robertson.  , On 18 April 2013 Hoy announced his retirement from competitive cycling. He said he was very proud to have taken part in the transformation of the sport.  , After announcing his retirement on the 22 April 2013, Hoy accepted the appointment of ambassador to the Royal Air Force Air Cadets and will assume the rank of Honorary Group Captain RAFVR (T). Hoy responded by saying: \"I am thrilled to be invited to be an ambassador for the Air Cadets organisation. I am really impressed by the wide range of activities on offer to the cadets and by the commitment of the adult volunteers who support these young people in achieving their potential and becoming good citizens.\" In November 2014, he stepped down as ambassador and handed over to Carol Vorderman . , In 2013 Hoy was appointed as an ambassador for UNICEF UK , having been an International Inspiration ambassador for UNICEF since 2009.  , Hoy unveiled the brand which bears his name in November 2012, three months after winning the double Olympic gold in London. The debut range included three road bikes and four city bikes, as well as a track bike.  It has later been extended by several other designs, including bicycles for children.  , Hoy is married to Sarra Kemp, a lawyer from Edinburgh. They were married on 17 April 2010 at St Giles' Cathedral , Edinburgh.  On 25 June 2014 he announced that he and his wife were expecting their first child and that the timing couldn't be better. Their son, Callum David Robert Hoy, was born 11 weeks prematurely on 15 October 2014. , Hoy was a prominent supporter of the \"No\" campaign in the build-up to the Scottish Independence Referendum in 2014, and in an interview he stated that \"independence would be a disaster for Scotland, and Scottish sport in particular\" , Hoy supports Heart of Midlothian Football Club . , ( key ) (Races in bold indicate pole position) (Races in italics indicate fastest lap) , * Season in progress. "
}
