{
  "category": "cycling",
  "article": "Donald Robinson (b. June 17, 1983, in Napa, California ,  U.S. ) is an American professional \"New/Current School\" Bicycle Motocross (BMX) racer whose prime competitive years are from 1999 to the present. His moniker is \"dR\", his initials. The use of the lowercase \"d\" for his given name is perhaps related to his relatively diminutive physical size. A past nickname, \"Scrawny\", was definitely linked to his small stature, since even when very young he was the smallest child in his age group. It was given to him by Bruce Minton.  Like BMX predecessors Mike Miranda and Eric Rupe , Robinson is a devout Christian.   He admitted in late 2013 to suffering at least 25 concussions over the course of his career. In the same interview, he advocated for better concussion protocol at the lower levels of BMX racing. Robinson joined the board of directors of concussion-education collaborative The Knockout Project in January of 2013.  , On June 25, 2008, Robinson was chosen by Mike King , team coach of the 2008 USA BMX Olympic Team, to represent the USA along with teammates Jill Kintner , Mike Day , and Kyle Bennett in BMX racing competition at the 2008 Summer Olympic Games in Beijing, China . His Olympic dream was realized at least in part when he came in third at the Summer Olympics winning a Bronze Medal executing a maneuver that saw Sifiso Nhlapo take out nearly half the field. Since it was the sport's debut and the men's final was run after the women's, he became the third American and the sixth person overall to win an Olympic Medal in BMX Racing. Jill Kintner won the Bronze medal ; Mike Day won the Silver medal . Kyle Bennett finished sixth in his semi-final and as a result did not qualify for the finals. , , , Note: Professional firsts are on the national level unless otherwise indicated. , Note: This listing denotes only the racer's primary sponsors. At any given time a racer could have numerous ever-changing co-sponsors. Primary sponsorships can be verified by BMX press coverage and sponsors' advertisements at the time in question. When possible exact dates are given. , Note: Listed are district, state/provincial/department, regional, national, and international titles in italics . Only sanctioning bodies that existed during the racer's career(s) are listed. Depending on point totals of individual racers, winners of Grand Nationals do not necessarily win national titles. Series and one-off championships are also listed in block. , National Bicycle League (NBL) , American Bicycle Association (ABA) , Fédération Internationale Amateur de Cyclisme (FIAC)* , International Bicycle Motocross Federation (IBMXF)* , Union Cycliste Internationale (UCI)* , * See Professional section. , USA Cycling , Note: USA Cycling's BMX program did not exist prior to 2007. , National Bicycle League (NBL) , American Bicycle Association (ABA) , International Bicycle Motocross Federation (IBMXF)* , Fédération Internationale Amateur de Cyclisme (FIAC)* , Union Cycliste Internationale (UCI)* , *Note: Beginning in 1991 the IBMXF and FIAC had been holding joint world championship events as a transitional phase in merging, which began in earnest in 1993. Beginning with the 1996 season, the IBMXF and FIAC completed the merger, and both ceased to exist as independent entities, being integrated into the UCI. Beginning with the 1997 world championships held in Brighton, England, the UCI would officially hold and sanction BMX World Championships and inherited all precedents, records, streaks, etc. from both the IBMXF and FIAC. , USA Cycling , †This is USA Cycling's inaugural national title award as a sanctioning body in the discipline of Bicycle Motocross. Robinson won the Elite Men's title on June 9, 2007, in Waterford Oaks, Michigan . Krystal Hime won for Elite women.  This Championship was held under UCI rules and skill classifications as opposed to the UCI affiliated and USA Cycling owned NBL.  , International Olympic Committee (IOC) , Independent Pro Series Championships and Invitational Races , ¥This race is a tribute to the memory of the late Mario Soto held every year in his home town of Bogotá, Colombia , and is called International BMX Championships “Summer Festival”. It is a professionals-only invitational race in which top pros are invited to participate. The first of these annual two-day events was held in 2003. , Robinson wed girlfriend Tiffany Lei Glenn is a ceremony in Napa, Calif., on November 14, 2009. In addition to BMX racing, Robinson has aspirations to be a Broadway theater actor/dancer/singer. He sang in his middle school choir. He went on \"tour\" with his now-wife performing at schools and fairgrounds.  , Note: Only magazines that were in publication at the time of the racer's career(s) are listed unless specifically noted. , Bicycle Motocross Action & Go: , BMX Plus!: , Snap BMX Magazine & Transworld BMX: , Twenty BMX: , Moto Mag: , BMX World: , Bicycles Today & BMX Today (The official NBL membership publication under two names): , ABA Action, American BMXer, BMXer (The official ABA membership publication under three names): "
}
