{
  "category": "cycling",
  "article": "Grand Tours , Stage races , One-day races and Classics , Jan Ullrich ( German pronunciation: [ˈjan ˈʊlrɪç] ); born 2 December 1973) is a German former professional road bicycle racer . Ullrich won a gold and a silver in the 2000 Summer Olympics in Sydney . He won the 1999 Vuelta a España and the HEW Cyclassics in front of a home crowd in Hamburg in 1997. He had podium finishes in the hilly classic Clásica de San Sebastián . His victorious ride in the 1997 Tour de France led to a bicycle boom in Germany. He retired in February 2007. , In 2006, Ullrich was barred from the Tour de France amid speculation of having doped . In February 2012, Ullrich was found guilty of a doping offence by the Court of Arbitration for Sport. He was retroactively banned from 22 August 2011, and all results gained since May 2005 were removed from his Palmarès.   He admitted to blood doping in 2013. , , , Ullrich won his first bicycle race at the age of nine. He was educated in the sports training system of the German Democratic Republic attending the KJS sports school in Berlin in 1986. In 1988, he was champion of the German Democratic Republic . The school closed two years after the fall of the Berlin wall in 1989. He, his trainer Peter Sager, and teammates joined an amateur club in Hamburg until 1994. In 1991, he was 5th in the amateur cyclo-cross world championships.  , In 1993, aged 19, at the Hamburg club, Ullrich won the Cycling World Amateur Road Championship in Oslo , as Lance Armstrong won the professional championship. , In 1994 Ullrich turned professional for the Telekom team under Walter Godefroot . He finished third behind Chris Boardman and Andrea Chiurato in the world time trial championship in Sicily .  , Ullrich was inconspicuous in his first 18 months as a professional. In 1995 he became national time trial champion. He also achieved top ten placings on stages of the 1995 Tour de Suisse . At 21 he wanted to start the 1995 Tour de France but Godefroot thought it was early. Instead he went to the small German stage race, the Hofbrau Cup, where he ended 3rd. Ullrich started the Vuelta later that year only to abandon on stage 12. , Ullrich gave up a place in the 1996 German Olympic team to ride his first Tour. He finished the prologue 33 seconds down. He stayed within the top 20 until the mountains on stage 7 when Miguel Indurain cracked. Ullrich finished 30 seconds back, 22 behind his teammate Bjarne Riis while Indurain finished four minutes down. On the following stage, he finished in the same group as Indurain 40 seconds behind Riis. On stage 9, Riis rode into the yellow jersey while Ullrich finished 44 seconds back and also into 5th place overall 1-minute 38 seconds from Riis. , Over the final mountains, Ullrich rode into second place behind Riis, but he conceded time on each mountain stage, eventually being nearly four minutes behind Riis. He won the final individual time trial and secured his first Tour stage win. He cut 2 minutes 18 seconds into Riis's lead . This led Indurain to comment that Ullrich would win the Tour some day, adding that it was a remarkable victory considering that Ullrich had been helping Riis. Ullrich dismissed suggestions he would have done better if he had not had to help Riis, saying Riis had inspired the team.  Jan finished his first tour in second place at 1-minute 41 seconds from his teammate Bjarne Riis . , Ullrich had 2 wins before the 1997 Tour; a stage in the Tour de Suisse and the national Road Race championship a week before the tour. He became favorite in the 1997 Tour de France . He started strongly, finishing second in the prologue behind Chris Boardman . On stage 9, the first mountain stage which was won by Laurent Brochard , Ullrich worked for Riis. Only on the last ascent when Richard Virenque attacked did Ullrich react. Riis struggled to keep up and finished 30 seconds behind Virenque, Marco Pantani and Ullrich. On stage 10 from Luchon to Andorra Arcalis , with Riis again falling back, Ullrich dropped back to the teamcar to ask permission to attack. He returned to the lead group and pushed up the climb leaving Pantani and Virenque. He finished a minute ahead  which earned his first yellow jersey . L'Équipe , greeted Ullrich with Voilà le Patron (\"Here is the boss\"). Ullrich won the Stage 12 time trial with three minutes between himself and the second placed rider, Virenque, who had started three minutes in front of him. , Marco Pantani attacked on the stage to the Alpe d'Huez . Ullrich, who was nine minutes ahead of Pantani overall, limited his losses to 47 seconds.  Pantani attacked again on the Morzine stage and won, while Ullrich again limited his losses. In the final time trial, won by Abraham Olano , Ullrich extended his lead over Virenque and the following day became the first German to win the Tour de France . At 23, Ullrich was the fourth youngest winner of the Tour since 1947. Two weeks later, he won the Hews Cycling Classic in Hamburg. A further two weeks later Ullrich was beaten by Davide Rebellin in a sprint in the GP Suisse. He was chosen \"sports person of the year\" in Germany in 1997. , Ullrich was defending champion in 1998. He took the yellow jersey on stage 7, a time trial, over 58 km of undulating roads. However, on stage 15 Marco Pantani blew the Tour apart with a victory which began on the Galibier. Ullrich was without support when Pantani attacked. Pantani topped the Galibier alone. It was misty and the roads were wet. The descent was dangerous and Pantani increased his lead. By the bottom of the final climb, Les Deux Alpes, Pantani had nearly four minutes. Telekom brought Udo Bölts and then Riis to pace Ullrich. Pantani was race leader as he crossed the line. Ullrich finished almost nine minutes back, dropping to fourth position, six minutes behind Pantani.  , Ullrich attacked on stage 16 on the Col de la Madeleine. Only Pantani could match him. Ullrich did all the work. Over the top, they started to work together. Ullrich won a photo-finish sprint and moved into third. He won the final stage, a 20 km time trial, and moved into second. , The Tour of 1998 was haunted by doping affairs, giving it the nickname \"Tour de Dopage\". , In the following year during the inaugural Deutschland Tour , Ullrich fell after getting entangled with Udo Bölts during stage 3. He had a knee injury and could not ride the 1999 Tour, which ended in the first of seven victories for Lance Armstrong . Ullrich set his targets on the world time trial championship in October by riding the Vuelta. , On the first mountain stage, Ullrich narrowly won against the defending Vuelta a España champion Abraham Olano of Team ONCE in a group sprint that included Frank Vandenbroucke , Roberto Heras and Davide Rebellin . Olano took the leader's golden jersey with Ullrich second. Olano won the following stage, a time trial, with almost one minute over Ullrich and increased his lead in stage 8. On stage 11, Ullrich gained 30 seconds back on Olano. Ullrich took the lead on stage 12 won by Igor González de Galdeano , Olano faltered due to a broken rib and finished seven minutes behind Ullrich. He later abandoned the race. , Gonzales de Galdeano had moved into second overall and became a threat to Ullrich. On stage 18 Banesto and other Spanish teams tried to crack Ullrich, who struggled on the final climb but recovered to limit his losses to González. In the final time trial, Ullrich won by almost three minutes and built his overall lead to four minutes on González. Ullrich won his second major Tour. Several weeks later he became world time trial champion over Sweden's Michael Andersson and Briton Chris Boardman . , The 2000 Tour de France brought Ullrich, Marco Pantani and Armstrong against each other for the first time. Armstrong proved too strong and won then and again in 2001. Ullrich crashed in 2001 and Armstrong waited for him to return to his bike.  Ullrich cited his failure to defeat Armstrong as why he fell into depression next year. , Ullrich rode well in the 2000 Summer Olympics in Sydney, Australia. After establishing a three-man break with Telekom teammates Andreas Klöden and Alexandre Vinokourov , Ullrich won the gold with Vinokourov second and Klöden rounding out the all-Telekom podium. He won the silver in the time-trial, losing by only seven seconds to Viatcheslav Ekimov but beating Armstrong soundly into third. , In May 2002, Ullrich had his driver's license revoked after a drunk driving incident.  After a positive blood sample for amphetamine in June 2002,  Ullrich's contract with Team Telekom was ended, and he was banned for six months. He said he had taken ecstasy with amphetamine.  He had not been racing since January due to a knee injury,  and the German Cycling Federation 's disciplinary committee agreed that he was not attempting to use the drug for performance enhancement , so he was given a minimum suspension.  , In January 2003, Ullrich and his advisor Rudy Pevenage joined Team Coast ,  but Coast pulled out after financial problems and Team Bianchi replaced it. Ullrich returned to racing in March 2003 . , The 2003 Tour de France was the first for many years that Ullrich had not been considered a favorite. In the first week, Ullrich became sick and almost retired. He lost a minute and a half on Armstrong in the Alps. Ullrich fought back in the time trial. Armstrong had trouble with the heat and lost one and a half minutes to Ullrich. Ullrich was within a minute of Armstrong in the classification. The next day, he closed the gap by another 19 seconds in the first mountain stage. Two days later Ullrich rode away from Armstrong on the Tourmalet but Armstrong caught up. Half way into the next climb, Luz Ardiden, Armstrong's handlebar got caught in a spectator's yellow musette waving in the air and he fell. Ullrich waited for Armstrong to recover, returning the courteous display by Armstrong 2 years previously.    Armstrong then caught the group and attacked shortly afterwards. , Ullrich lost 40 seconds in the final kilometers, but the final time trial would be decisive. In it, Ullrich crashed and saw a stage and Tour victory disappear. He finished second, by 71 seconds. , Germany made Ullrich sportsman of the year. [ clarification needed ] Commenting on Ullrich's wait for Armstrong to recover, Dan Boyle, of the Institute for International Sport said \"It was an act that will live with him forever, cynics will say he lost money, but it was a highly commendable thing that he did.\"  , For 2004 Ullrich returned to Team Telekom, now named T-Mobile . He won the Tour de Suisse . In the Tour de France, he finished fourth, 8:50 behind Armstrong, his first finish lower than second. Klöden finished second and Ivan Basso third. , For 2005, Ullrich again captained T-Mobile. He maintained a low profile for the early season, surfacing in the 2005 Tour de Suisse , which he finished third behind Aitor González and Michael Rogers . , The day before the 2005 Tour de France, Ullrich was training when his team car stopped unexpectedly. Ullrich hit the back window, ending up in the back seat of the car. Less than 24 hours later Ullrich was passed by Armstrong in the time trial. Ullrich fell again in the mountains, bruising his ribs. He could not keep up with Armstrong or Ivan Basso . Ullrich began focusing on finishing ahead of Michael Rasmussen for a podium position. He rode a good second time trial, beating all but Armstrong. Rasmussen had several crashes and bike changes, which gave Ullrich a podium place in the Tour. , Armstrong retired after the Tour in 2005. Ullrich decided to ride one or two more years.  Early reports said Ullrich was in better shape than previous years and could be ready for his second victory in the Tour. Ullrich finished 115th in the Tour de Romandie on 30 April. However, he injured his knee in the off-season, which could have limited his performance in the 2006 Tour, had he participated (see below). , In May, riding the Giro d'Italia to prepare for the Tour, Ullrich targeted the stage 11 50 km time trial, and won by 28 seconds over Ivan Basso , who beat Marco Pinotti by another 33 seconds. Only five riders finished within two minutes of Ullrich. , Ullrich dropped out of the Giro during stage 19, with back pain. Rudy Pevenage said the problem was not bad but that Ullrich wanted to avoid Tour de France problems.  , Ullrich won the Tour de Suisse for a second time, winning the final time trial and jumping from third to first. , During the 2006 Giro d'Italia , Ullrich was mentioned in a doping scandal, Operación Puerto .  Ullrich denied the rumors. However on 30 June 2006, one day before the Tour, he was suspended from participating.  Ivan Basso and other riders were also excluded. On 20 July 2006, Ullrich was fired from T-Mobile. General manager Olaf Ludwig announced the news during the 18th stage of the Tour between Morzine and Macon. Ullrich said his dismissal was 'unacceptable.' , On 3 August 2006, doping expert Werner Franke claimed Ullrich purchased about €35,000 worth of doping products a year based on documents uncovered in the Operación Puerto doping case .  A German court imposed a gag order on Franke after it found there was not enough evidence to link Ullrich to doping.  On 14 September 2006, officials raided Ullrich's house and collected DNA material while Ullrich was honeymooning with his new wife Sara. On 4 April 2007, Ullrich's DNA sample, had \"without a doubt\" matched nine bags of blood taken from Eufemiano Fuentes ' office.  , On 18 October 2006, Ullrich laid off his personal physiotherapist Birgit Krohme. Speculation rose that this was a sign that Ullrich had given up hope of returning to racing. Ullrich denied these rumors. One day later, Ullrich canceled his licence of the Swiss Cycling Federation, and was looking for a different federation for a licence of 2007.  Ullrich claimed that the Swiss Cycling Federation had to stop their doping investigation, but the Swiss federation continued the investigation.  On 25 October 2006, a document from the Spanish court on Ullrich's website stated that no charges would be filed. , On Monday, 26 February 2007, Ullrich retired. At the press conference in Hamburg he said, \"Today, I'm ending my career as a professional cyclist. I never once cheated as a cyclist.\" He said he would be an advisor to Team Volksbank .  , The IOC has investigated if Ullrich should be stripped from his golden medal won at the 2000 Olympic Games, which was possible because there was an eight-year deadline for investigations, and the investigation started after seven years.  It was decided that there was no solid evidence against Ullrich, and that Ullrich could keep his medal.  , In 2008, the German investigation was closed after a settlement, which in German law means Ullrich was found not guilty. The Swiss investigation was still ongoing at that time,  but they closed the case in February 2010, because Ullrich was no longer member of the Swiss Cycling Federation, and so they had no jurisdiction after he retired.  The UCI appealed that decision at the Court of Arbitration for Sport (CAS).  , In 2010, with the doping allegations still ongoing, Ullrich was diagnosed with burn-out, and avoided public appearances for a few months.  When Lance Armstrong announced his comeback as a professional cyclist, Ullrich made clear that he was not going to do the same.  , In February 2012, Ullrich was found guilty of a doping offence by the CAS. He was retroactively banned from 22 August 2011, and all results gained since May 2005 were removed from his Palmares.   Ullrich published a statement on his website, that said he would not appeal the decision. He admitted that he had had contact with Fuentes, which he considered a mistake that he now regrets.  , In June 2013, Ulrich went on record stating that he'd \"always said that Lance wouldn’t get out of it. He made too many enemies.\" Later that month, he admitted that he doped with the help of Spanish doctor Eufemiano Fuentes.  His name was on the list of doping tests published by the French Senate in 24 July 2013 that were collected during the 1998 Tour de France and found positive for EPO when retested in 2004.  , On August 1, 2013, Ullrich suggested that Lance Armstrong's seven stripped Tour de France titles should be reinstated, because of the prevalence of doping during that era. \"I would give Armstrong the Tour victories back...That’s how it was back then. It doesn't help anyone to draw a line through the winners’ list\", Ullrich told Sport Bild magazine.  , Armstrong had won the Tour de France a record seven times, consecutively, between 1999 and 2005. He was officially stripped of the titles in October 2012,  and admitted to doping in an interview with Oprah Winfrey in January 2013.  , On 17 January 2013—the day Armstrong admitted to doping in his seven Tour wins—he was stripped of his 3rd place finish at the 2000 Sydney Olympics men's time trial race . On 13 September 2013, Armstrong said that he had sent back the bronze medal to the International Olympic Committee .  The next month, on 2 October, the IOC confirmed that it had received the medal.  , At the same Olympics, Ullrich finished 1st in the men's road race and 2nd in the men's time trial race. Unlike Armstrong, he said that he refused to return his medals if he was stripped of his finishes. \"These medals belong to me\" he said in an interview with Sky Sports . \"Almost everyone at the time was taking performance-enhancing substances. I didn’t take anything that was not taken by the others. It would only have been cheating for me if I had gotten an advantage which was not the case. I just wanted to ensure I had an equal opportunity.\"  , Ullrich hasn't been stripped of his finishes yet. , In May 2006 Ullrich launched Jan Ullrich Collection bicycles,  which he helped to develop. , The three models take their names from Ullrich's career: the entry-level Campione model (at around €1,300) with an aluminum frame, which relates to his Amateur World Championships victory in Oslo 1993, the mid-level Olymp model (at around €1,700) with a carbon-fiber frame, relating to his Sydney Olympics success in 2000 and the top-level Grand-Tour model (at around €2,700), also featuring a carbon-fiber frame, superior quality materials and custom measures. , The bicycles are built in a partnership with German builders Ghost Bikes.  , Ullrich lived in Merdingen , Germany, from 1994 to 2002 with his partner Gaby Weiss, with whom he had a daughter, Sarah Maria, on 1 July 2003. They moved to Scherzingen , municipality of Münsterlingen , Switzerland, in 2002. Since separating in 2005, said to be because Weiss's reluctance to be in the limelight conflicted with Ullrich's celebrity life, Ullrich has continued to live in Scherzingen. Weiss returned with Sarah to Merdingen. In September 2006 Ullrich married Sara Steinhauser, sister of his former teammate and training partner, Tobias Steinhauser . Their first child, Max, was born five weeks prematurely on 7 August 2007. Their second son, Benno, was born on 25 January 2011. Their third son, Toni, was born on 31 October 2012. , Media related to Jan Ullrich at Wikimedia Commons "
}
