{
  "category": "cycling",
  "article": "Jeremy Powers (born June 29, 1983 in Niantic, Connecticut ) is an American professional racing cyclist who has won over 60 UCI victories, three USA Cyclocross national championships and the top-ranked American rider in the world. , Jeremy’s love of cycling was apparent from an early age. Jeremy loved to tear around the house on his BMX bike, and it wasn’t long before he started turning heads at local mountain bike races. He soon found his way to the Team Devo junior mountain bike program, and with their support he won his first major race in 2000, the Junior Mountain Bike World Cup in Napa Valley. , Powers was introduced to cyclocross early in his cycling career as a way to stay fit at the end of the mountain bike season. It was the only time of the year when roadies and mountain bikers would converge in once place, and test each other’s skills and fitness. In his native New England, cyclocross has been a regular part of each season for decades, and Jeremy excelled at the short, fast, technical races. Powers discovered that the frenetic pace and camaraderie of cyclocross suited his high energy and outgoing personality. , , , Powers achieved one of his most significant victories very early in his career, when he won the 2001 Mountain Bike World Cup Cross Country event in the Junior division in Napa Valley, California. Powers continued to race competitively in the Junior and Senior divisions of Mountain Biking before turning his eyes to the road full-time in 2004. Powers has a number of strong results on the road to his name. A pair of top five time trial results in the 2006 Vuelta de Bisbie  propelled him to a sixth place overall finish. Powers rode to prominence on the final stage of the 2008 Tour of Missouri,  making half of the day's breakaway that was narrowly captured at the end of the stage. , In September 2010, Powers won his first career stage race, winning Vermont's Green Mountain Stage Race by over two minutes ahead of UnitedHealthcare's Tim Johnson , Powers' Cannondale prepared by Cyclocrossworld.com teammate, and Trek-Livestrong 's Gavin Mannion. , Powers had a very successful 2011 road season with the Jelly Belly-Kenda team, participating in both of the United States' major tours – the Amgen Tour of California and the USA Pro Cycling Challenge . At the USA Pro Cycling Challenge, Powers got into the day's main break in stage 2,  eventually won by George Hincapie . , Powers began his Cyclocross career racing in New England with the Northampton Cycling Club. Following his move to Jelly Belly in 2004, Powers made the decision to race an entire cyclocross campaign in Europe.  In the 2004 season, his last as a U23 rider, Powers returned briefly to the United States for the national championships, where he earned a silver medal. Powers returned to Europe to race full-time in 2005, his first year as an elite, again returning to the America to race the national championships. , In 2006, Powers returned to full-time racing in the United States. Powers' full-time racing in Europe had prepared him well for racing in America, and he started to achieve good results in American competitions. Powers had podiums at two US Gran Prix of Cyclocross events, the Xilinx Cup  and the Stumptown Cup.  Powers also had some good results in his home region of New England, finishing on three podiums and finishing 4th in the Verge New England Cyclocross Championship Series. , In 2007, Powers joined Canadian Cyclocross Champion Lyne Bessette on the Cyclocrossworld.com cyclocross team and continued his improvement. Powers took his first USGP victory, the Derby City Cup  in Louisville, Kentucky, as well as wins at three Verge NECCS events. , 2008 was Powers' first year with the Cannondale prepared by Cyclocrossworld.com team, and his first year teamed up with Tim Johnson . While Powers missed out on wins in the USGP series, he did stand on the podium at four of their events, and won the first race of the inaugural North American Cyclocross Trophy Series – Star Crossed  in Redmond, Washington. Powers won six races in 2008, including his first back-to-back-to-back wins at the UCI3 Festival in Cincinnati, Ohio.    , Powers' career was truly in the ascendency in 2009, his second year with the Cannondale-Cyclocrossworld.com program. Powers accounted for nine of the team's 22 UCI victories in the 2009 cyclocross season, winning the first and last stops in the U.S. Gran Prix of Cyclocross series – the Planet Bike Cup  in Sun Prairie, Wisconsin and the Stanley Portland Cup  in Portland, Oregon. Powers finished up the season ranked second in the North American Cyclocross Trophy standings, behind teammate Tim Johnson, after winning day two of the Toronto International Cyclocross  and finishing on the podium at a further seven races. Thanks to his consistency and some big wins, Powers finished up the 2009 season as the #1 ranked rider on USA Cycling's Cyclocross Rankings. , Powers' 2010 cyclocross season was full of even more firsts. Powers continued his career progression, winning 10 UCI races in the United States, and secured victories in both the US Gran Prix of Cyclocross series and the North American Cyclocross Trophy Series, the first time this had ever happened. In the NACT series, Powers won four events, including a wire-to-wire victory at the first day of the Gran Prix of Gloucester  to take home his first ever elite series title. , In the USGP, Powers won the series, his first ever victory in the USGP at any level, in highly dramatic fashion. Powers trailed Johnson by 16 points entering the series final weekend in Portland, Oregon, but pulled even with his teammate following his win on the first day of the Stanley Portland Cup.  With the title on the line, Powers proceeded to outsprint Johnson on the second day to win his first ever series title.  , At the U.S. National Championships, Powers was part of the leading duo, when he was the victim of an untimely crash that saw him drop from the race lead to his eventual finishing spot of third.  Despite the disappointment, Powers rebounded to finish 16th at the World Championships in St. Wendel in January, his best-ever finish as an elite rider.  Powers again finished the season ranked #1 on the USA Cycling Cyclocross Rankings and finished 15th on the season's final UCI rankings.  , 2011 was Powers' first season with the Rapha-Focus professional cyclocross team. Powers joined Chris Jones , Zach McDonald and, later, Julie Krasniak to create one of the most successful teams of the season in American cyclocross. The biggest of Powers' 11 UCI wins was his first ever U.S. Cyclocross National Championship, which he won by 17 seconds over former national Champion Ryan Trebon .  , In the US Gran Prix of Cyclocross, Powers completed consecutive overall victories, winning the series' final five races, and standing on all but one of the series' podiums. At the Deschutes Brewery Cup  in Bend, Oregon, Powers finally got his first victory on a course where he had had some bad luck in the past. 2011 saw Powers stand on 18 UCI podiums in the United States, making it onto all but two of the races that he entered. Internationally, Powers had his best ever finish at a UCI World Cup when he finished 10th at the World Cup in Plzeň, Czech Republic.  Powers was named Velonews 's 2011 North American Cyclocross Rider of the Year.  , 2012 started very successfully, as Powers won his first Cyclocross National Championship at Madison, Wisconsin.  , . Jeremy posted 14 UCI wins in 2012, winning another US Gran Prix of Cyclocross series and capped his US campaign with another CrossVegas win. , Powers also found success in Europe, posting a 7th in the 1st World Cup and finish the season ranked 12th in the World. , Powers posted 12 UCI wins in 2013 finishing the season ranked 11th in the world. On US soil, Powers once again was the USA Cycling PROCX Series Winner. , Powers won his second Cyclocross National Championship at Boulder, Colorado.  Powers posted 13 UCI wins finishing the year ranked 15th in the world. , Powers won his third Cyclocross National Championship at Austin, Texas.  Powers had his best European campaign to date finshing the year ranked 9th in the world. , In 2010, Jeremy created Behind the Barriers - a web-based video series chronicling the ‘day-in-the-life’ of a pro cyclocross racer. In its first year, the series captured the attention of +80,000 unique viewers. Today, Behind the Barriers TV has evolved into the preeminent American cyclocross media company and digital network with more than +370,000 unique visitors from 179 countries. , Developed with his longtime friends, Alec Donahue and Mukunda Feldman, the JAM Fund was created to enrich the lives of young cyclists from the New England cycling community. The JAM Fund strives to develop young cyclists in all aspects of their lives both on the bike and off. The JAM Fund raises money through many different avenues and then issues grants to riders under 25 who’ve applied to the program and have displayed commitment and enthusiasm to cycling. Over time, JAM transitions those young cyclists into a fully supported cyclocross program where the riders further develop and hone their skills as racers and people. In 2012, JAM Fund sent its first rider to a professional team when Jeremy Durrin was asked to join the Optum Professional Cycling and in 2013 JAM sent Steven Hyde to the newly formed Astellas Professional Cycling team. "
}
