{
  "category": "cycling",
  "article": "Jonathan Vaughters (born June 10, 1973) is an American former professional racing cyclist and current manager of the Cannondale-Garmin professional cycling team. , , , Vaughters started competitive cycling in the 1980s, racing in the Red Zinger Mini Classics youth cycling series in Colorado. He was considered to be a natural climber, and was soon noticed. In 1993, he was second in the Tour of Venezuela, in which he participated with the U.S. amateur team. He was recruited for the next season by the professional team Santa Clara, led by José Luis Nunes, a Catholic member of Opus Dei. Despite the fears of his parents, he left for Europe in order to start his professional career. According to Vaughters, Santa Clara was a very conservative team with hostile management who even made his bike \"disappear\" in order to discourage him from continuing. [ citation needed ] , In 1997 he moved to John Wordin's Comptel Data team, entering races he described as \"A thousands times easier than being in Europe.\" He had a successful season becoming US National Time Trial Champion, and was 3rd in the National Road Race. His successes led to him signing for U.S. Postal Service cycling team . He won the time trial of the Dauphine Libere and finished 2nd overall to Alexandre Vinokourov after losing the general classification leadership on the final stage. He then went on to win the Route du Sud in preparation for the Tour de France as part of Lance Armstrong 's team that went on to Armstrong's first win . In that Tour, he earned the nickname \"El Gato\" (The Cat in Spanish), having landed on his feet after being thrown headfirst over his handlebars in the first stage. In the second stage, he cut his chin in a crash, and had to abandon the race. This started his reputation as a somewhat innocent victim in a long series of ill-timed crashes, with an uncanny knack for being in the wrong place at the wrong time. , In 2000, Vaughters joined the French team Crédit Agricole . In the early part of the season he was third in the Tour Méditerranéen, sixth in Paris-Nice and the Critérium International. In June, he was fifth in the Criterium du Dauphine Libere, after placing fourth in the stage of the Mont Ventoux. In July, he participated in the Tour de France and abandoned during the tenth stage after a fall on the descent of the Col de Marie-Blanque. In 2001, he won the time trial in the Dauphine Libere, and the Duo Normand with teammate Jens Voigt . During the Tour de France, he was part of the winning team in the team time trial. He was again forced to retire from the Tour however, Suffering from a wasp sting above his right eye during the 14th stage, and it is prohibited by the Union Cycliste international to use cortizone for the treatment of any wounds. In 2002, he participated in his fourth and final Tour de France as a rider, but failed again to reach the end of the race. He abandoned at the eleventh stage after falling in the descent of the Col d'Aubisque . Following the abandonment, he requested and received the termination of its contract with the Credit Agricole team which was due to run until the end of 2003. He retired from racing, citing a desire to spend more time with his family. , After returning to America he signed in 2003 for the U.S. team Prime Alliance 2003. He ended his career as a cyclist at the end of that year. , Vaughters was a specialist climber and was touted as a Stage race specialist. He won the Mont Ventoux stage of the Critérium du Dauphiné Libéré in 1999 and 2001, and held the record for the fastest ascent until it was broken by Iban Mayo in 2004. , Vaughters also holds the Cycle To The Sun record time of 2:38 set in 1993 for climbing Haleakala volcano on Maui, Hawaii .  The record however has been unofficially beaten by Ryder Hesjedal in 2010, who climbed the volcano in 2:32.  , During 2003 Vaughters launched the new 5280/Subaru junior team originally based in Colorado. Recruitment was done by Vaughters and Prime Alliance director Roy Knickman with Colby Pearce as the head Sporting Director. In 2004, Vaughters took effective management of the team and in 2005 it was split between the 5280 junior team and the continental team TIAA-CREF. , In early 2005 Vaughters met Doug Ellis at the launch party for the new season. A computer engineer specializing in financial management software, Ellis was a huge fan of cycling since the 1980s. From 2006, the team became the property of sports management Slipstream Sports, chaired by Doug Ellis with a view to creating an American Pro-Tour team by 2009. In 2007, with the absence of a title sponsor the team operated under the name Slipstream, and later Slipstream Sports – powered by Chipotle. A professional continental team in 2007 and a ProTour team in 2009 they participated for the first time in the Tour de France and Giro d'Italia in 2008. In February 2009, Jonathan Vaughters was elected president of the International Association of Professional Cycling Groups (AIGCP). Vaughters' Garmin-Cervélo squad took the top position in the team classification in the 2011 Tour de France . , In August 2012 Vaughters published an opinion column in ' The New York Times ' entitled 'How to Get Doping Out of Sports' in which he stated his opposition to doping and expressed his regret over taking drugs during his cycling career.  "
}
