{
  "category": "cycling",
  "article": "Grand Tours , Stage races , Single-day races and Classics , Mark Renshaw (born 22 October 1982) is an Australian racing cyclist with UCI ProTeam Etixx-Quick Step .  His most notable wins are the general classification of the 2011 Tour of Qatar ,  and the one-day race Clásica de Almería in 2013.  From 2009 to 2011, while at Team Columbia-High Road , and since 2014, Renshaw has been known as the main lead-out man for fellow sprinter Mark Cavendish .  , , , Renshaw, who was born in Bathurst , New South Wales , began his career as a track cyclist riding for the Bathurst Cycle Club. Being coached at club level by Mark Windsor,  he showed early promise, and went on to be selected for the Western Region Academy of Sport (where Windsor remained his coach). At the Under 17s level, in the 1998 Australian Track Championships, he won gold in the Teams Pursuit (Australian Record), Scratch Race, Time Trial, and Individual Pursuit (Australian Record), and silver in the Flying 200m Time Trial. , As a first-year under 19 rider, Renshaw continued to achieve strong results on the velodrome. His results included 3rd in the time trial (behind eventual World Champion Ben Kersten and World Championship Bronze Medalist Jobie Dajka), 4th in the Individual Pursuit, 5th in the Flying 200m Time Trial, 3rd in the Sprint (again behind Dajka and Kersten who were both again top 3 in the World Championships), 1st in the Teams Pursuit (with NSW); and 1st in the Olympic Sprint (again with NSW).  Renshaw was then selected to compete for Australia in the Junior World Track Championships, where he became a World Champion, alongside Jobie Dajka and Ben Kersten, in the Olympic Sprint. , As a second-year Under 19 rider, Renshaw had a very successful national track championship, mirroring that of his earlier success as a second year Under 17 rider. He was 1st in the Olympic Sprint, 1st in the Time Trial, 2nd in the Individual Pursuit, 1st in the Team Pursuit, 4th in the Keirin and 1st in the Scratch Race.  Again Renshaw was chosen to compete in the Junior World Championships. In these Championships, Renshaw added individual World Championship success to his Team's success from the previous season, returning to Australia a champion in the 1000m Time Trial, as well as defending his team's crown in the Olympic Sprint, and thus becoming a Triple World Junior Champion. , As a senior Renshaw began to concentrate more on an endurance programme, in the hope of becoming a professional road cyclist. However in 2001, as a first year senior, he won the Overall Track World Cup in his pet event as a junior, the 1 km Time Trial. It was a transition season however, and by season's end his focus had switched to longer events. , He was an Australian Institute of Sport scholarship holder for the 2004 Athens Summer Olympic Games.  , 2002 was a breakthrough year for Renshaw as an endurance track cyclist. Throughout the year he placed consistently in the Points Race, Madison and Teams Pursuit. And went on to be part of the Australian Team Pursuit team that broke the World Record at the Manchester Commonwealth Games (along with Graeme Brown, Peter Dawson and Luke Roberts). He was also later part of the Australian senior World Championship-winning Team Pursuit team. , In 2002 Renshaw's road career also began to take off when he was selected in the Brad McGee-organized NSWIS-FDJeux Development squad. Because of Renshaw's involvement in this squad he was soon riding in France with amateur squad SCO Dijon, which opened the door for him to join the senior FDJeux.com squad in 2004.  , Renshaw returned to the track in 2004, and in the World Championships competed in the Madison, Points Race and Teams Pursuit. Renshaw crashed out in the Points race, and finished 4th in the Madison. The Australian Team Pursuit team went on to win Gold. After having raced all of the World Cup rounds in the Madison event, and in the process qualifying Australia for the Olympic spot, Renshaw was selected to ride the Points Race and the Madison at the Games. However, there was controversy when in the lead up to the event, Australian selectors chose experienced road rider, Stuart O'Grady to partner Graeme Brown over Renshaw in the madison event.  Renshaw still competed in the Points Race, where he placed 6th. , Renshaw stayed with FDJeux.com for two seasons, before he moved to Credit Agricole, with the main aim of using his track bike handling experience to ride as lead-out for Thor Hushovd . Renshaw showed strong early season form, taking out the Geelong Bay Series Criterium for the second consecutive year. This led to him racing as Credit Agricole's main sprinter in the early events (with Hushovd's season yet to commence), where he picked up his first Pro-Tour victory in the first stage of his 'local' Pro-Tour event, the Tour Down Under. Renshaw went on to lead the General Classification of the Tour Down Under, until the penultimate Willunga Hill stage, where his lack of climbing ability meant he lost considerable time and the race lead to future team mate Andre Greipel .  , It was during his time with Credit Agricole that Renshaw made his Tour de France debut in 2008, after missing the 2007 race through illness. In the 2008 race, Renshaw received great praise for his role in Thor Hushovd's win on Stage 2 of the race.  , After the Credit Agricole team folded at the end of 2008, Renshaw was hired for team Columbia-High Road. His primary responsibility in major races was as lead-out rider for sprinter Mark Cavendish .  After his first season with Columbia in 2009, Renshaw received praise from commentators and fellow riders alike for his part in Cavendish's hugely successful Tour and season in general, and was now commonly referred to as \"the World's best lead-out man\".   Renshaw's individual highlight of the 2009 season was possibly his second placed finish on the final stage of the Tour de France, after a lead-out that also gave Cavendish the victory. , After a successful first season as leadout man for Mark Cavendish , with Team Columbia-High Road in 2009, Renshaw was primed for a big season in 2010. His planned season schedule was to ride the Tour Down Under, the Tour de France and then the World Championships – being held for the first time 'at home' for Renshaw, in Australia. These plans soon changed when he was diagnosed with Epstein-Barr virus in the pre-season which put his whole season behind. Renshaw missed his home tour, the Tour Down Under , and didn't return to Europe and serious training until February. This, coincidentally, roughly matched a delayed start to Cavendish's season (due to a tooth infection), and also meant that Renshaw should be peaking later for his goal of the World Championships late in the year. Renshaw's season goals remained the World Championships, the Tour de France — as leadout man for Cavendish, as well as the Tour of California , where he would again be riding for Cavendish. , During the sprint finish of stage 11 in the Tour de France , while leading out Cavendish, Renshaw was disqualified and removed from the race for head-butting Garmin-Transitions ' leadout man, Julian Dean and unfair blocking of Tyler Farrar by forcing him into the barries.  After the race, Tour technical director Jean-Francois Pescheux explained, \"Renshaw is out. We watched the film once and it was blatant. He head-butted Dean like in a keirin race...This is a bike race, not a gladiator’s arena. Everybody could have ended up on their backs.\" [ citation needed ] The punishment was unprecedented, the last time someone was removed from the race for a non-doping related offence was Tom Steels in 1997, for throwing his water bottle at a competitor during the sprint finish — an offence rated much more severe and unsportsman-like.  Four times Green Jersey winner, Sean Kelly (disregarding obvious Renshaw's unfair blocking of Tyler Farrar by forcing him into the barries) disagreed \"When you consider the first movement from Dean, who was moving from right to left, the head butting was normal...\".  , Mark had a successful 2011 season, winning stage 4 and then the General Classification of the Tour of Qatar  – beating notable sprinters Tom Boonen , Daniele Bennati and Heinrich Haussler .  Then he went on to reaffirm his reputation as the World's best lead-out man at the Tour de France  – helping Mark Cavendish to five stage wins and the Green Jersey. However Mark's season ended in disappointment when he was controversially overlooked for the Australian World Championships team – in what was deemed a sprinter friendly circuit.   It was claimed by Renshaw and others in the media that this may have been because he hadn't signed for new Australian Pro-Team GreenEdge.  Renshaw responded by placing second – after leading out teammate Cavendish – in the first two stages of the Tour of Britain, before going on to win Stage 5 himself. , Mark signed with the Dutch Rabobank squad before the start of the 2012 season, taking the chance to race for himself rather than continuing to lead-out Cavendish.  After hearing the news, Cavendish claimed that no one could do the same job Renshaw had done for him the previous three years, reiterating the point that he believed Renshaw to be the best in the world at leading out a sprinter.  , Renshaw won stage 4 of the Tour of Turkey . The mass sprint was an extremely close affair with Renshaw taking the win over fellow Australian Matthew Goss . The narrow margin was impossible to distinguish with the naked eye, even on the photo-finish.  , Renshaw withdrew from the Tour de France on Stage 12 in the mountains with approximately 72 km to go, after succumbing to injuries from four separate falls earlier in the Tour. , In 2013, his team's name changed to Blanco Pro Cycling ,  as Rabobank decided to withdraw their cycling sponsorship.  In February at the Clásica de Almería , Renshaw benefited from a good lead-out and bagged his first win of the season.  In April, Renshaw crashed heavily in the final stretch of the Tour of Turkey 's second stage while he was the second man on the road, causing a mass pile-up. He fractured his collarbone, suffered a concussion and lost a tooth in the accident.  , On 10 July, it was announced that Renshaw would join Omega Pharma-Quick Step for the 2014 season,  joining former HTC-Highroad team-mate Mark Cavendish at the squad. , In September, as his leader Cavendish did not feel on form after multiple crashes, Renshaw took sprinting duties at the Tour of Britain and prevailed in the mass gallop of Stage 2.  , Renshaw has Dutch grandparents who emigrated to Australia after the Second World War. In November 2009, Mark announced his engagement to longtime partner Kristina Harris. They married in a private ceremony in Mudgee, NSW in November 2010. "
}
