{
  "category": "cycling",
  "article": "Tour de France , Richard Virenque [ n 1 ] (born 19 November 1969) is a retired French professional road racing cyclist . He was one of the most popular French riders with fans  for his boyish personality and his long, lone attacks. [ n 2 ] He was a climber, winning the King of the Mountains competition of the Tour de France a record seven times. He is best remembered as the central figure in a widespread doping scandal in 1998, and his being regularly displayed as a moronic rubber puppet with hypodermics in his head on the satirical television programme, Les Guignols de l'info . , Virenque finished twice on the podium in the Tour de France (third in 1996 and second in 1997) and won several stages, among them Mont Ventoux in 2002. He is the 18th rider in the Tour to have won stages over 10 years apart. [ n 3 ] , , , Virenque, his parents, his brother Lionel and sister Nathalie lived in the Iseba district of Casablanca. The family was affluent, employing both a gardener and a nurse.  His mother described Richard as a gentle, kind boy, full of life, who enjoyed helping her in the garden. His idol was Michael Jackson .  His father, Jacques, ran a tire company. As a child, Virenque began cycling by riding round the garden of the family's house. \"It wasn't much of a bike,\" he said. \"It had no mudguards, no brakes, and I had to scrape my foot along the ground to stop.\"  Virenque often skipped school to fish on the beach.  He told a court during the Festina doping inquiry (see below): , The family moved to La Londe-les-Maures , near the Côte d'Azur , in 1979 when he was nine. There his father failed to find the same sort of job and relations between his parents suffered.  Jacques and Bérangère Virenque [ n 4 ] divorced soon afterwards and Virenque said he was devastated. , He couldn't stand being in school any longer than he had to, he said, and he left to work as a plumber. , Cycle-racing did not immediately inspire Virenque. His brother, Lionel, cycled, read specialist magazines and watched the Tour de France on television. , He rode for the Vélo Club Hyèrois from the age of 13 where, encouraged by his grandfather,  he took out his first licence with the Fédération Française de Cyclisme   He said he knew he could climb well from the start. , His first win was in a race round the town at La Valette-du-Var , when he and another rider, Pascale Ranucci, lapped the field.  He then did his national service in the army battalion at Joinville in Paris  to which talented sportsmen were often sent. [ n 6 ] He spent his last period as an amateur with the ASPTT [ n 7 ] in Paris. , In 1990 he came eighth in the world championship road race at Utsunomiya, Tochigi in Japan , riding une course d'enfer [ n 8 ] to impress Marc Braillon, the head of the professional team, RMO, said Pascal Lino .  \"I was riding like a kamikaze. I rode out of my skin,\" Virenque said.  It worked: Braillon offered him a contract.  , He turned professional for RMO in January 1991.   Lino said: , When I saw him arrive in the team, I soon understood. He was scared of nothing and he mouthed off at the slightest thing. From his first races, it was a festival, particularly at the Tour Med... We were riding at 60kmh and he attacked and held the peloton in respect for two kilometres. On the other hand, he was less impressive in the team time-trials.\"  , Virenque rode his first Tour de France in 1992 as a replacement for another team member, Jean-Philippe Dojwa.  He was earning 15,000 francs a month.  He said he dreamed only of \"being able to follow the best in the mountains, riders like Claudio Chiappucci , Indurain , LeMond , Thierry Claveyrolat .\"  On the third day he took the maillot jaune of leadership after a long breakaway with two other riders on the col de Marie-Blanque in the Pyrenees . He held it for a day,  losing it next day to his team-mate Pascal Lino , who led for the next two weeks.  Virenque finished second in the climbers' competition.  , He said of his talent in the mountains: , Virenque was sought by several teams after his first Tour and Cyrille Guimard said at the world championship at Benidorm that he had arranged for him to join his Castorama team, where he would replace Laurent Fignon .  But the announcement was premature and Virenque joined another French team, Festina. He stayed there until the team dissolved in the wake of a doping scandal in 1998 (see below). , Virenque first wore the yellow jersey of the Tour de France in 1992 and for the last time in 2003. In 2003 he won the stage to Morzine and wore the jersey on the climb of Alpe d'Huez . He recalled: , Virenque was a talented climber but a modest time-triallist . He was coached for time-trials by Jeannie Longo and her husband.  , In 1998 the Festina cycling team was disgraced by a doping scandal (see Doping at the Tour de France ) after a soigneur , Willy Voet , was found when crossing from Belgium to France to have drugs used for doping.   They were, said John Lichfield, the Paris correspondent of The Independent in Britain: \"235 doses of erythropoietin (EPO), an artificial hormone which boosts the red cells (and therefore endurance) but can thicken the blood to fatal levels if not controlled properly. They also found 82 doses of a muscle-strengthening hormone called Sauratropine,; 60 doses of Pantestone, a derivative of testosterone, which boosts body strength but can cause cancer; and sundry pain-deadening corticoids and energy-fuelling amphetamines.\"  Bruno Roussel, Virenque's directeur sportif , told L'Équipe that Virenque responded to the news by saying: , Virenque's teammates, Christophe Moreau , Laurent Brochard and Armin Meier, admitted taking EPO after being arrested during the Tour  and were disqualified.  Virenque maintained his innocence. , \"I am the best climber in the world and he [Virenque, just] wears the polkadot jersey.\" , While his former team-mates were served six-month suspensions and returned to racing in spring 1999,  Virenque changed teams to Polti in January 1999  and prepared for the 1999 Tour by riding the Giro d'Italia , in which he won a stage. Another Italian, his team-mate Enrico Cassani, said Virenque was referred to in Italy as \"the shit\".  He said: \"When he arrived, we were originally against him. Then, very quickly, we saw he knew how to live and to joke and we respected him. He proved he had some character, some personality.\"  , A few weeks later Virenque's name emerged in an inquiry into Bernard Sainz , the so-called Dr Mabuse of cycling who was later jailed for practising as an unqualified doctor.  Franco Polti, the head of Virenque's team, fined him 30 million lire.  , Race director Jean-Marie Leblanc banned Virenque from the 1999 Tour de France but was obliged to accept him after a ruling by the Union Cycliste Internationale .  Lichfield wrote in The Independent : , \"The sport of road-race cycling (and it may not be the only one) is like an alcoholic, refusing to accept that it has a problem, as long as it drinks in secrecy. That fact was shamefully proved once again this week when the sport's governing body — the International Cycling Union (UCI) - forced the 1999 Tour to accept Richard Virenque... The baby-faced Virenque faces possible criminal charges of drug-taking and drug-trafficking. Despite his denials, French judicial investigators say they have documentary evidence that he has been doping himself for years. The Tour said last month that he was 'not welcome.' The UCI insisted on Tuesday that he must ride. The Tour gave way. So much for ethical purity.\"  , Cycling Weekly in Britain called it \"a major blow\" to the Tour's organisers.  Leblanc said he hoped Virenque would not win.  [ n 9 ] , Virenque rode, at his team's request, on a bicycle painted white with red dots to resemble the polkadot jersey of best climber and he travelled between stages with a bodyguard, Gilles Pagliuca.  That year, he wrote Ma Vérité , a book which asserted his innocence  and included comments of how doping must be fought.  He wrote that his team-mates confessed to using EPO because of pressure from the police. He said Moreau's urine showed EPO had not been detected.  Procycling wrote: , \"The 200 or so pages of Ma Vérité camouflage this dodgy logic [that Virenque never took drugs because he was never caught taking drugs] with sometimes justifiable grievances against the breaches of confidence that have fed the press since the scandal broke. But they also skirt the substantive issues with tedious consistency. Readers after la vérité won't find it in Ma Vérité and fans who have invested emotions in Virenque's sporting career deserve better. If he's innocent, how does Virenque counter the accusations against him coming from all quarters? The answer is: he doesn't even attempt to. Virenque pathetically observes the peloton's custom of keeping mum: he never mentions coming into contact with doping practices, directly or indirectly. He doesn't describe techniques or list substances. He doesn't name names... he carries on as if the problem didn't exist. After all that has happened in the past year, there can be only one reason to buy a book by Richard Virenque: to read a detailed denial of involvement in doping, or a full, contrite confession. Ma Vérité has neither: and integrity is virtually undetectable too.\"  , The Festina affair led to a trial in Lille , northern France, in October 2000. Virenque was a witness with others from the former Festina team. He at first denied he had doped himself but then confessed.  \"Oui, je me suis dopé\" , he told the court's president, Daniel Delegove, on 24 October.  But he denied doping himself intentionally. Voet said he was aware of what he was doing and participated in trafficking between cyclists.  Virenque said this happened without his approval. That led the satirical television programme, Les Guignols de l'info - which displayed Virenque as a moronic rubber puppet with hypodermics in his head  - to change his words to \"à l'insu de mon plein gré\" (\"willingly but without knowing\"),  and the phrase passed into French popular culture as a sign of hypocritical denial . [ n 10 ] Voet wrote a book, Massacre à la Chaîne , published in a legally-censored English edition as Breaking the Chain , in which he came close to identifying Virenque as an unrepentant doper. , \"For sheer effrontery, Virenque's denial for over two years that he had knowingly taken drugs, in the face of overwhelming evidence to the contrary, took some beating.\" , Virenque was criticised by the media and satirists for his denial in the face of increasing evidence and his pretence of having been doped without his knowledge. Voet wrote in Le Journal du Dimanche that he preferred Virenque as a young pro \"because he didn't dope himself much\". Many former colleagues shunned him,  remembering his arrogance and criticism,  but his agent,  Eric Boyer , later manager of the Cofidis team, said: , \"He shouldn't have had to pay for the lack of awareness [ inconscience ] of previous generations, mine and those which preceded it. It was too easy. He became the symbol of doping in cycling but he did only what the others did. He suffered for all that had gone before [ Il a reçu ce fléau en héritage ]. He deserved to be sanctioned severely, and he was. There shouldn't be more than that. In my opinion the Festina affair was just the outcome of what had been going on for many years. Richard walked into it willingly. Nobody made him. He was looking to improve his performances. But he shouldn't have to pay for three or four generations of cycling that did nothing about it.\"  , Virenque's mother, Bérangère, said: , \"[Richard] weeps, he speaks. It's his strength and his weakness. I was afraid that he would do the worst thing [commit suicide], because he is hypersensitive. I saw him defeated. The way others look at him is important to him. When I heard people in the crowd shout 'doper', I hated it... I thought of all the sacrifices that he made when he was very young, like when he was a kid and he was dropped in a race and that he went off like a mad dog, on impulse. When in the middle of it all he came back to Carqueiranne [where he still lives], he was in his garage and I took him in my arms. He cried from morning to night. Why did it take him so long to confess it to us, to talk to us? I don't know. I told him: 'Be brave, son. Whatever you do, think of your children. It's they who will live on after you.'\"  , Virenque lived near Geneva in Switzerland and the Swiss cycling association suspended him for nine months.  The president of the committee which imposed the ban, Bernard Welten, said he deserved a severe penalty because he was one of the biggest drug-takers in the team.  The president of the French federation, Daniel Baal, said nine months was halfway between the minimum penalty of six months and the maximum of a year for a first-time offence.  The sentence was reduced by an independent tribunal to six and a half.  He was fined the equivalent of 2,600 euros and told to pay 1,300 euros in costs. He became depressed. \"I had to realise that I wasn't anything any more,\" he said.  His wife Stéphanie said he put on two sizes in clothes and 10 kg more than his racing weight.  [ n 11 ] He wept repeatedly.  She said she would stay with him and support him only if they moved back in the south of France after four years in Switzerland.  , In the meantime they had the help of a prominent neighbour, Laurent Jalabert . The two had not been friends and did not see each other much in Switzerland.  Then, Jalabert opened links by getting his wife, Sylvie, to ask Stéphanie Virenque for the loan of a vacuum cleaner that she didn't actually need.  Jalabert said that later, \"Richard called me one day when my wife and I were getting ready to move house. He was desperate to help us even though we didn't really need any help. It was then that I realised his distress. He spent the whole day taking the furniture apart and putting it back together again. It's odd, but that day did him an awful lot of good.\"  Jalabert and his wife Sylvie said that, as a souvenir, they had kept the doors of one of their closets upside down because that was the way Virenque had fitted them.  , The two men began training together. [ n 12 ] When Virenque retired Jalabert wrote in an open letter: , Virenque and his family moved back to France as his wife asked. Jalabert followed shortly after his own career ended. , Few teams were willing to consider him when he completed his suspension and only a few friends kept in touch.  Samuel Abt of the International Herald Tribune , wrote: , \"Mocked now and entirely abandoned, Richard Virenque responds with the spirit of the adolescent he remains. In a temper tantrum, he said this week that he is through with professional bicycle racing. If the sport doesn't need him, he raged, he doesn't need it. (Offstage sounds of feet being stamped and doors being slammed.) Nobody loves him. 'He would love to continue and make dreams come true,' his older brother explained, 'but he is not being given that chance.' In other, less shimmering words, because of his involvement in the doping scandal, none of the 20 or so top teams is willing to hire the star climber and team leader at his salary of about $1.6 million a year. Alas for him, many of those teams are not willing to hire him at any salary. His years of cockiness, his frequent and public criticism of rivals, his many small snubs are not forgotten. Virenque has become — made himself — extremely damaged goods.\"  , Cofidis was said to be interested but not in his first year back. Jean Delatour, with whom Virenque trained in the winter, [ n 13 ] said it could be interested if it found more sponsorship.  On 5 July 2001 he joined Domo-Farm Frites,   with the help of the former Tour de France winner, Eddy Merckx who, as supplier of the team's bikes, put up the extra money that the main sponsors would not. He was paid the equivalent of £800 a month, the minimum wage, for the last three months of the year and the same salary for which he had first turned professional in 1992.  Domo kept him the following season, after Farm Frites withdrew as co-sponsor, because it wanted to expand its carpet business in France.  On 25 October 2002, on the eve of the Tour de France presentation at the Palais des Congres in Paris, he signed for another two years.  , Virenque returned to prominence by winning Paris–Tours on 7 October 2001  in a day-long breakaway in which he dropped Jacky Durand and crossed the line seconds ahead of the peloton . Paris–Tours is a flat race that favours sprinters and not climbers. \"It was a typical Virenque moment,\" Fotheringham wrote, \"with a yell of anger as he crossed the line 'for all those who tried to destroy me'\".  The French magazine, Vélo , called the victory \"extraordinary.\"  L'Équipe 's one-word headline on the front page was \"Unbelievable!\"  Virenque said: \"Jacky asked me if we should sit up [give up the breakaway attempt]. There were still 50km to go. I was longing for someone else to come up to us. A long break wasn't the idea. But when I saw the gap was rising, I shouted' Faut y croire ' [We can do it] But he said he'd run dry.\"  , While Virenque was bettered by Laurent Jalabert in the 2001 and 2002 Tour de France for the King of the Mountains competition, he won his sixth polka dot jersey in 2003 to tie with Federico Bahamontes and Lucien Van Impe . His day-long breakaway also saw him wear the yellow jersey . In 2004 he won the King of the Mountains for a record seventh time. Van Impe criticised Virenque for being opportunistic rather than the best climber; he said he had himself refrained from breaking Bahamontes' record himself out of reverence. Virenque said they were jealous: \"They couldn't stand being equal best and they couldn't stand being beaten.\"  , Bahamontes in turn described Virenque as \"a great rider, but not a complete rider\", and compares him unfavorably as a climber with Charly Gaul and Van Impe .  , Virenque ran into trouble again in 2002 when he appeared on a television programme, Tout le Monde en Parle , in June. The presenter, Thierry Ardisson , asked him: \"If you were sure of winning the Tour by being doped but knew you would not get caught, would you do it?\" Virenque replied: \"Win the Tour doped, but without getting caught? Yes.\"  The programme was recorded to be broadcast as-live. Ardisson said that Virenque asked after the recording finished that his answer be cut out. Ardisson said: \"It was very naive, very Virenque. But it's a shame that, once again, he didn't want to tell the truth.\"  , Virenque rode the Olympic Games road race in Athens and decided to retire, a decision he announced at the Olympia theatre in Paris on 24 September 2004.  His wife had suggested continuing one more season, he said. He stayed in the public eye, winning Je suis une célébrité, sortez-moi de là! (the French version of I'm a Celebrity... Get Me Out of Here! ) in Brazil in April 2006.  In autumn 2005 he opened Virenque Design, a company to design and sell jewellery  often featuring the number 7, representing his wins in the King of the Mountains. Since 2005 he has been a consultant commentator for Eurosport , alongside Jacky Durand and Jean-François Bernard and the journalist, Patrick Chassé, where he is described as a \"modest competitor\" to Laurent Jalabert, the specialist on the rival state network.  He has also promoted an energy drink and a pharmacy company.  , On 11 August 2006,   Virenque was taken to hospital at Moûtiers and transferred to Grenoble after falling during a mountain-bike race at Méribel.  He broke his nose and needed 32 stitches to his face.  Hitting his head led to feelings of worry and of depression, he said, and he lost his sense of smell.  , In December 2007, Virenque and his wife, Stéphanie, divorced  after 17 years together.   They have two children, Clara and Dario.  In 2008 he was associated with a 20-year-old model, Jessica Sow,     with whom he made a drinks commercial.  , Eric Boyer said of Virenque's retirement: \"Richard has character, a strong personality. He doesn't let himself go. He looks forwards, never behind. Today, he is a personality [ un people ]. His return to everyday life has been a success but money isn't an end in itself.\"  , Virenque lives at Carqueiranne in the Var region.  He is fond of marmots , dancing, wine, gardening and flowers; he is quoted as saying, \"Put me in a good garden nursery and I'm in heaven,\"  , DQ = disqualified "
}
