{
  "category": "golf",
  "article": "David Robert Duval (born November 9, 1971) is an American professional golfer and former World No. 1 Golfer who competed on the PGA Tour . Duval, originally from Jacksonville Florida, received his PGA Tour card in 1995, earning it after becoming two-time ACC Player of the Year, 1993 National Player of the Year, and playing two years on the Nike Tour (where he won twice). Duval won 13 PGA Tour tournaments between 1997 and 2001. He won his sole major title at The Open Championship in 2001 . After that point, due to injuries and medical conditions, his win record dropped dramatically culminating in the loss of his tour card in 2011. After his professional golf career slowed, he became an analyst and commentator. , , , Duval was born in Jacksonville, Florida , the son of golf instructor and club professional Bob Duval and Diane Poole Duval, a member of the FSU Flying High Circus during college.  His brother Brent was two years older, and sister Diedre was five years younger.  During his early years, his father was club professional at Timuquana Country Club , where he learned to play golf under his father's guidance. , When David was nine, his brother Brent developed aplastic anemia . The family sought treatment at Rainbow Babies & Children's Hospital in Cleveland , Ohio, where David underwent surgery to donate bone marrow. Unfortunately, the transplant was not successful, and Brent died as a result of septicemia on May 17, 1981 at age 12. Bob Duval was unable to cope, and moved out of the family home for a year. Counseling enabled him to reunite with his wife and children in 1982, and David continued to receive golf instruction from his father.  In 1993, just as Duval was starting his professional golf career, his father again moved out of the family home, this time permanently.  , He graduated from the Episcopal High School of Jacksonville in 1989, the same year he was the U.S. Junior Amateur champion. He continued his amateur career for the Georgia Tech Yellow Jackets men's golf team, where he was a four-time first-team All-American, two-time ACC Player of the Year, and 1993 National Player of the Year. While in college, he led an official PGA Tour event, the BellSouth Classic (which he would win as a professional), after three rounds.   , After two years on the Nike Tour where he won twice, he earned his PGA Tour card in 1995. Success came quickly, as Duval posted seven second place finishes on the PGA Tour from 1995 to 1997, qualifying for the 1996 Presidents Cup and posting a 4–0–0 record for the victorious American team. But a PGA Tour victory eluded him until he won the Michelob Championship at Kingsmill in October 1997, and winning his next two tournaments in the same month, including the 1997 Tour Championship . , Duval led the PGA Tour money list in 1998, and also won the Vardon Trophy and Byron Nelson Award for lowest scoring average. He ended second on the 1997 and 1999 money lists, seventh in 2000 and eight in 2001. From 1997 to 2001, he won 13 PGA Tour tournaments, including the 1997 Tour Championship, the 1999 Players Championship , and the 2001 Open Championship , as well as the 2001 Dunlop Phoenix on the Japan Golf Tour and the 2000 World Cup (with Tiger Woods ) internationally. He also tied for second in both the 1998 and 2001 Masters . Duval's winning speech at the 2001 Open was welcomed by British commentators as \"delightfully modest and heartfelt\".  , Other career highlights include achieving the number one spot in the Official World Golf Ranking in April 1999 and shooting a 59 in the final round of the 1999 Bob Hope Chrysler Classic on the Palmer Course at PGA West in La Quinta, California . Duval made an eagle on the final hole to win the tournament by one shot. Before 1999, only two other golfers in PGA Tour history, Al Geiberger and Chip Beck , had posted a 59 in competition and no one had ever done so in a final round.  When he won the Players Championship he became the first player in history to win on the same day as his father, Bob Duval , who won a Champions Tour event that same day.  He also played on the victorious 1999 Ryder Cup team, as well as the 2002 team. , After his Open Championship win, Duval entered a downward spiral in form that saw him drop to 80th on the money list in 2002 , and 211th in 2003 , prompting an extended break from the game. Numerous reasons have been postulated for the decline, including back, wrist, and shoulder problems; private difficulties; and a form of vertigo . Duval has not won a tournament on the PGA Tour since his Open Championship victory in 2001. His last worldwide win was the Dunlop Phoenix Tournament in November 2001, on his 30th birthday. His 30s proved to be much less lucrative on the golf course.  , Many commentators believed Duval's career to be over, but he returned to golf at the U.S. Open in 2004 , where he shot 25 over par and missed the cut. Duval struggled with his best results until 2009 being a T-13 at the Deutsche Bank Championship in 2004 and a T-16 at the U.S. Open in 2006 . He made the cut in only one PGA Tour event in 2005 , but did finish in the top ten at the Dunlop Phoenix tournament in Japan. While Duval at his peak was viewed as aloof and distant and was not a fan favorite, now galleries sympathize with his plight and root for him to overcome his issues and to enjoy playing golf.  , Duval had a successful start to the 2006 season, making the cut in his first two tournaments, as well as a very respectable finish of T-16 at the U.S. Open at Winged Foot Golf Club, where his second round 68 was good enough for a tie as the best round of the tournament. Despite not reaching the same heights in the remaining two majors of the year, his performances continued a general upward trend, with none of the rounds of 80+ that had become so familiar in the previous years. , After a steady start to 2007 during the West Coast Swing, Duval once again disappeared from the tour. His mother died on July 17,  and he later revealed that his wife was going through a difficult pregnancy. This prompted the PGA Tour to amend its medical exemption policies – and Duval was granted twenty starts for the next season. , After a lackluster first half of the following year, Duval inexplicably reappeared on the leaderboard of the British Open , rekindling memories of his major victory. He shot 73-69-83-71 for the week and finished T-39.  , In 2009 , Duval used his final career money exemption on the PGA Tour. He made his first cut at the AT&T Pebble Beach National Pro-Am in February. However, he stormed back onto the golf scene with a T-2 finish at the U.S. Open at Bethpage Black. After going through sectional qualifying, Duval made the most of his first appearance in the U.S. Open since 2006. Going into the final round, Duval was four shots behind eventual winner Lucas Glover . Duval made a triple bogey at the par three 3rd hole, but rebounded with three straight birdies from 14 to 16. He stood on the tee of the 71st hole in a tie for the lead, but his par putt lipped out on the hole, and he finished tied for second, two shots behind Glover. It was his best finish on tour since the 2002 Memorial Tournament . After the Open, Duval jumped 740 spots in the Official World Golf Ranking from 882 to 142.   , Duval failed to earn his PGA Tour card for the 2010 season, so he had to play on sponsor's exemptions. He showed more signs of a come-back by shooting a final round 69 to finish 2nd to defending champion Dustin Johnson at the 2010 AT&T Pebble Beach National Pro-Am . Duval had a good 2010 season and retained his tour card at the end of the year. , The 2011 season was a struggle for Duval, when he made only nine cuts in 24 events and lost his Tour card after finishing outside 150th on the tour money list. He went to Q School in an attempt to regain his tour card, but finished T72 in the final round. For 2012 , Duval had past champion status. After seven unsuccessful starts, Duval made his first cut of the season at the Valero Texas Open, and finished T60. It was announced on June 13 that he would be an analyst for ESPN for the first two rounds of the U.S. Open , having failed to qualify for the 2nd major of the season.   , In December 2013, Duval announced via his Twitter that the 2014 PGA Tour season would be the last season he would ask for sponsor exemptions to get into tournament fields. Many people took this as a possible retirement announcement, but Duval clarified to say that he wants to earn his way back on the Tour rather than depending on others.   In April 2014, Duval finished tied for 25th (−8) at the Zurich Classic of New Orleans . , In addition to playing in tournaments, Duval has helped commentate The Open Championship  and U.S. Open .  In 2015, Duval joined the Golf Channel as a studio analyst. , Duval split with his girlfriend Julie McArthur in early 2002 after being together for eight years.   , He met Susan Persichitte in August 2003 at a Denver restaurant while in town for The International tournament. They were engaged in November  and married in 2004. They have two children together: Brady, born in 2005; and Sienna, born in 2008. She has custody of her three older children from a prior marriage: Deano, Nick, and Shalene Karavites. Their home is in Cherry Hills Village, Colorado , a suburb south of Denver.  , this list may be incomplete , PGA Tour playoff record (2–2) , 1 Defeated Teshima with birdie on first extra hole , * As of March 8, 2015 , Amateur , Professional , Player in bold denotes current number one "
}
