{
  "category": "golf",
  "article": "Theodore Ernest \"Ernie\" Els ( / ˈ ɛ l s / ; born 17 October 1969) is a South African professional golfer. A former World No. 1 , he is known as \"The Big Easy\" due to his imposing physical stature (he stands 6 ft 3 in (1.91 m)) along with his fluid golf swing. Among his 67 career victories are four major championships : the U.S. Open in 1994 at Oakmont and in 1997 at Congressional , and The Open Championship in 2002 at Muirfield and in 2012 at Royal Lytham & St Annes .  He is one of six golfers to twice win both the U.S. Open and The Open Championship. , Other highlights in Els' career include topping the 2003 and 2004 European Tour Order of Merit (money list), and winning the World Match Play Championship a record seven times. He was the leading career money winner on the European Tour until overtaken by Lee Westwood in 2011, and was the first member of the tour to earn over 25 million Euros from European Tour events. He has held the number one spot in the Official World Golf Ranking and until 2013 held the record for weeks ranked in the top ten with 788.   Els rose to 15th in the world rankings after winning the 2012 Open Championship . He was elected to the World Golf Hall of Fame in 2010, on his first time on the ballot, and was inducted in May 2011.  , When not playing, Els has a golf course design business, a charitable foundation which supports golf among underprivileged youngsters in South Africa, and a highly regarded wine-making business. He has written a popular golf instructional column in Golf Digest magazine for several years. , , , Growing up just east of Johannesburg in Kempton Park , South Africa, he played rugby union , cricket , tennis, and, starting at age 8, golf. He was a skilled junior tennis player and won the Eastern Transvaal Junior Championships at age 13. Els first learned the game of golf from his father Neels, a trucking executive, at the Kempton Park Country Club. He was soon playing better than his father (and his older brother, Dirk), and by the age of 14 he was a scratch handicap. It was around this time that he decided to focus exclusively on golf. , Els first achieved prominence in 1984, when he won the Junior World Golf Championship in the Boys 13–14 category. Phil Mickelson was second to Els that year. Els won the South African Amateur Championship a few months after his 17th birthday, becoming the youngest-ever winner of that event, breaking the record which had been held by Gary Player . , Els married his wife Liezl in 1998 in Cape Town and they have two children, Samantha and Ben. In 2008 after Els started to display an \" Autism Speaks \" logo on his golf bag it was announced that their then five-year-old son was autistic .  Their main residence is at the Wentworth Estate near Wentworth Golf Club in the south of England. However, they also split time between South Africa and their family home in Jupiter, Florida , in order to get better treatment for Ben's autism.  , In 1989, Els won the South African Amateur Stroke Play Championship and turned professional the same year. Els won his first professional tournament in 1991 on the Southern Africa Tour (today the Sunshine Tour ). He won the Sunshine Tour Order of Merit in the 1991/92 and 1994/95 seasons. In 1993, Els won his first tournament outside of South Africa at the Dunlop Phoenix in Japan. In 1994 Els won his first major championship at the U.S. Open . Els was tied with Colin Montgomerie and Loren Roberts after 72 holes and they went to an 18-hole playoff the next day. In spite of starting the playoff bogey-triple bogey,  Els was able to match Roberts' score of 74. Els birdied the second hole of sudden death to win his first U.S. Open title. , Els brought his game all around the world in his young career winning the Dubai Desert Classic on the European Tour, and the Toyota World Match Play Championship defeating once again Colin Montgomerie 4 & 2. The following year, Els defended his World Match Play Championship, defeating Steve Elkington 3 & 1. Els won the GTE Byron Nelson Classic in the United States then headed back home to South Africa and won twice more. In 1996, Els won his third straight World Match Play Championship at Wentworth, defeating Vijay Singh in the final 3 & 2. No player in history had ever managed to win three successive titles in the one-on-one tournament.  Els finished the year with a win at his home tournament at the South African Open. , 1997 was a career year for Els first winning his second U.S. Open (once again over Colin Montgomerie) this time at Congressional Country Club , making him the first foreign player since Alex Smith (1906, 1910) to win the U.S. Open twice. He defended his Buick Classic title and added the Johnnie Walker Classic to his list of victories. Els nearly won the World Match Play Championship for a fourth consecutive year, but lost to Vijay Singh in the final. 1998 and 1999 continued to be successful years for Els with 4 wins on both the PGA and European tours. , 2000 started in historic fashion for Els being given a special honour by the Board of Directors of the European Tour awarding him with honorary life membership of the European Tour because of his two U.S. Opens and three World Match Play titles. 2000 was the year of runner ups for Els; with three runner up finishes in the Majors (Masters, U.S. Open and The Open Championship) and seven second-place finishes in tournaments worldwide. Els had a disappointing 2001 season, failing to win a US PGA tour event for the first time since 1994 although he ended the year with nine second-place finishes. , 2002 was arguably Els's best year which started with a win at the Heineken Classic at the Royal Melbourne Golf Club . Then went to America and outplayed World Number one Tiger Woods to lift the Genuity Championship title. The premier moment of the season was surely his Open Championship triumph in very tough conditions at Muirfield . Els overcame a four-man playoff to take home the famous Claret Jug trophy for the first time, also quieting his critics about his mental toughness. The South African also won his fourth World Match Play title, along with his third Nedbank Challenge in the last four years dominating a world class field winning by 8 shots. , 2003 gave Els his first European Tour Order of Merit . Although playing fewer events than his competitors Els won four times and had three runner ups. He also performed well in the United States with back to back victories at the Mercedes Championship - where he set the all time PGA Tour 72 hole record for most strokes under par at 31 under - and Sony Open and achieved top 20 spots in all four majors including a fifth-place finish at the U.S Open and sixth-place finishes at both the Masters and PGA Championship. To top off the season Els won the World Match Play title for a record-tying fifth time. In 2003 he was voted 37th on the SABC3's Great South Africans . , 2004 was another successful year as Els won 6 times on both tours including big wins at Memorial, WGC-American Express Championship and his sixth World Match Play Championship, a new record. His success did not stop there. Els showed remarkable consistency in the Majors but lost to Phil Mickelson in the Masters when Mickelson birdied the 18th for the title, finished ninth in the U.S. Open after playing in the final group with friend and fellow countryman Retief Goosen and surprisingly lost in a playoff in the Open to the then unknown Todd Hamilton . Els had a 14-foot (4.3 m) putt for birdie on the final hole of regulation for the Open at Royal Troon, but he missed the putt and lost in the playoff. Els ended the major season with a fourth-place finish in the PGA Championship, where a three putt on the 72nd hole would cost him a place in the playoff. In total, Els had 16 top-10 finishes, a second European Order of Merit title in succession and a second-place finish on the United States money list. , 2004 was the start of the \"Big Five Era\", which is used in describing the era in golf where Tiger Woods , Vijay Singh , Ernie Els, Retief Goosen and Phil Mickelson dominated the game of golf. The five switched up and down the top five positions in the World Golf Ranking ; most notably Vijay Singh's derailment of Tiger Woods as the best golfer in the world. The five stayed, for the most part, in the top five spots from 2004 until the start of 2007. Nine majors were won between them, many fighting against each other head to head. , In July 2005, Els injured his left knee while sailing with his family in the Mediterranean. Despite missing several months of the 2005 season due to the injury, Els won the second event on his return, the Dunhill Championship . , At the start of the 2007 season Ernie Els laid out a three-year battle plan to challenge Tiger Woods as world number one. \"I see 2007 as the start of a three-year plan where I totally re-dedicate myself to the game,\"  Els told his official website. , When he missed the cut by two strokes at the 2007 Masters Tournament , Els ended tour-leading consecutive cut streaks on both the PGA Tour and the European Tour. On the PGA Tour, his streak began at the 2004 The Players Championship (46 events) and on the European Tour it began at the 2000 Johnnie Walker Classic (82 events) , Els has often been compared to Greg Norman in the sense that both men’s careers could be looked back on and think what could have been. Although the two of them are multiple major championship winners they have both shared disappointment in majors. Their disappointments have ranged from nerves, bad luck and simply being outplayed. 1996 was the year where Norman collapsed in the Masters and Els in the PGA Championship . Els has finished runner-up in six majors. He has finished runner-up to Tiger Woods more than any other golfer and has often been described as having the right game to finally be the golfer to beat Woods in a major. , On 2 March 2008, Els won the Honda Classic contested at PGA National's Championship Course in Palm Beach Gardens, Florida . Els shot a final round 67 in tough windy conditions, which was enough to give him the win by one stroke over Luke Donald . The win marked the end of a three and a half-year-long stretch without a win on the PGA Tour for Els. The win was his 16th PGA Tour victory of his career. , On 8 April 2008, Els officially announced that he was switching swing coaches from David Leadbetter (whom Els had worked with since 1990) to Butch Harmon who has revamped the golf swings of many established pros (which started with Greg Norman). During Els 2008 Masters press conference Els said the change is in an effort to tighten his swing, shorten his swing, and get a fresh perspective. , On 8 November 2009, Els almost ended his year-long slump by shooting a course-tying record 9-under 63 in the final round of the WGC-HSBC Champions to finish at 16-under par 272, a stroke back of Phil Mickelson who finished with a 17-under 271 total including a final round of 3-under 69. , Els finally did break his winless streak by capturing the WGC-CA Championship at Doral in 2010, winning by four strokes over fellow countryman Charl Schwartzel .  It was Els's second WGC tournament title. The victory also saw Els overtake Colin Montgomerie to become the career money leader on the European Tour. Els then won the Arnold Palmer Invitational at Bay Hill two weeks later. It was his 18th PGA Tour victory, and his second in as many starts.  , Ernie continued his 2010 success with a T3 at the 2010 U.S. Open at Pebble Beach Golf Links . He got a 2nd place in 2000 which was also at Pebble Beach.  , Els most recently tasted success at the PGA Grand Slam of Golf in October 2010. After opening the 36 hole event with a round of 68 he fended off the challenge of David Toms with a final day 69 to win the four-man tournament by one stroke, capturing $600,000 in the process. In December 2010, Els won the South African Open beating Retief Goosen by one shot.  , Els had an inauspicious season in 2011 , dropping out of the top 50 in the Official World Golf Ranking for the first time since 1993.  , Els started the 2012 season in his home country at the Volvo Golf Champions where he finished in a tie for second place after he and Retief Goosen lost out in a playoff to Branden Grace . Els and Goosen could only manage pars on the first playoff hole, while Grace two-putted the par-five green for birdie and victory. Els was next in contention at the Transitions Championship , where he needed a win to qualify for the 2012 Masters, led the tournament for most of the final round and had the lead outright until the 16th hole. However he finished the tournament bogey-bogey missing a short three footer on the last hole to make the playoff. The tournament was eventually won by Luke Donald in a four-man playoff. , In 2012, Els failed to qualify for the Masters, the first time since 1993 that he would not play at Augusta. He was ranked 58th in the world prior to the tournament (the top 50 are given automatic invitations). , Els won the 2012 Open Championship , making a birdie on the last hole. Adam Scott led by four shots after a birdie at the 14th hole, but bogeyed the final four holes to miss a playoff with Els by one stroke.  Els earned $1,405,890 for the major win, and among other benefits, exemptions for five years to the other three majors.  Els became the eighth player to win major tournaments in three different decades, joining his countryman Gary Player , Jack Nicklaus , Lee Trevino , Billy Casper , Raymond Floyd , John Henry Taylor and Harry Vardon .  , In June 2013, Els won for the first time, since his 2012 Open Championship victory, at the BMW International Open in Munich , Germany . He claimed a wire-to-wire victory with a one stroke win over Thomas Bjørn . Els started the tournament with an opening round of 63 to take control and followed this with two 69s in rounds two and three. However he entered the final round tied with Alexander Levy and Alexander Norén . He was overtaken during the final round by both Levy and Bjørn, but Els responded with three birdies in four holes mid-round to move back to the top. As Levy and Bjørn made mistakes coming home, Els played the back nine in level par to complete victory and claim his 28th European Tour title. Els moved up to 14th from 20th in the world rankings and moved to 4th in the Race to Dubai standings.  , Els has struggled to find his form through the 2014 season. He finished 4th at the WGC-Accenture Match Play Championship in February, 5th at The Barclays and 7th at the PGA Championship , but has struggled with missed cuts including a missed cut at the Masters Tournament in April. Els has begun to use the short putter again in competition in preparation for the rule change in 2016.  , Els is also responsible for the refinement and modernisation of the West Course, Wentworth-Virginia Water, England, which took place in 2006. , Courses under construction include: , Unlike most of his contemporaries, Els is known for his willingness to participate in tournaments all around the world, having played regularly in European Tour-sanctioned events in Asia, Australasia, and his native country of South Africa. He says that his globe-trotting schedule is in recognition of the global nature of golf. This has caused some friction with the PGA Tour , an organisation that would prefer Els to play more tournaments in the United States. In late 2004, Tim Finchem , the director of the PGA Tour, wrote quite a firm letter to Els asking him to do so, but Els publicised and rejected this request. The PGA Tour's attitude caused considerable offence in the golfing world outside of North America. , The Ernie Els and Fancourt Foundation was established in 1999. It has the objective of identifying youths who show talent and potential in the game of golf from under-privileged backgrounds. It provides educational assistance amongst other moral and financial help in order for these youths to reach their full potential. , The first Friendship Cup was played in 2006 which is a match play competition, played in a Ryder Cup type format. In the cup, Els's foundation plays against the foundation of Tiger Woods . Els's foundation won 12.5 points to 3.5 points. , Els has also participated several times in the Gary Player Invitational series of charity golf events, to assist Player raise significant funds for underprivileged children around the world. , Since his son's autism diagnosis, Els and his wife have been active in charities devoted to that condition. This involvement has increased as Ben has reached school age. In 2009, Els launched an annual charity golf event, the Els for Autism Pro-Am, held at the PGA National Resort & Spa in Palm Beach Gardens near his South Florida residence during the PGA Tour's March swing into the area. The first event, which featured many PGA Tour and Champions Tour golfers, raised $725,000 for The Renaissance Learning Center, a nonprofit charter school in the area for autistic children. The couple has also established the Els Center of Excellence, which began as a drive to build a new campus for the aforementioned school but has since mushroomed into a $30 million plan to combine the school with a research facility.  , On his technique: ,  , —Els on his son's autism: ,  , PGA Tour playoff record (4–4) , European Tour playoff record (2–5) , 1 Co-sanctioned by the European Tour , * As of 23 November 2014. , These figures are from the respective tour's official sites. Note that there is double counting of money earned (and wins) in the majors and World Golf Championships since they became official events on both tours. , Professional , Player in bold denotes current number one "
}
