{
  "category": "golf",
  "article": "John Patrick Daly (born April 28, 1966) is an American professional golfer on the PGA Tour .  , Daly is known primarily for his driving distance off the tee (earning him the nickname \"Long John\"), his non- country club appearance and attitude, and his rough-and-tumble personal life. His two greatest on course accomplishments are his \"zero to hero\" victory in the 1991 PGA Championship , and his playoff victory over Costantino Rocca in the 1995 Open Championship . , According to official performance statistics kept since 1980, Daly in 1997 became the first PGA Tour player to average more than 300 yards per drive over a full season. He did so again in every year from 1999 to 2008, and he was the only player to do so until 2003.  , Daly's last PGA Tour victory came in San Diego in 2004, earning him a two-year playing exemption. After 2006, Daly's career began to falter and he had trouble making cuts and staying on the PGA Tour. He was primarily earning entry through past champion status and numerous sponsor invitations. , Daly is the only man from either Europe or the United States to win two major golf championships but not participate in the Ryder Cup . , Daly has been successful in multiple businesses. He has a \"Loud Mouth\" line of clothing and a golf course design company. In addition, Daly has written and recorded music and released two music albums. , , , Daly was born in Carmichael, California . With his father, mother, older sister and older brother, he moved from California to Dardanelle, Arkansas when he was four, and he began playing golf the following year. He attended Helias High School in Jefferson City, Missouri, and was a letterman in football and golf. In golf, he was a Missouri state champion; he held and continues to hold several kicking records in football. He attended the University of Arkansas , where he was a member of the golf team. He left college before completing his degree.   , Daly turned professional in 1987, and his first pro victory came in the 1987 Missouri Open. He won the Ben Hogan Utah Classic in 1990; he also won two South African Sunshine Tour pro events that year.  , He joined the PGA Tour in 1991 and won the PGA Championship that year. This victory gained Daly a significant amount of media attention, due to the fact that Daly was the ninth and final alternate for the Championship. Just days before the tournament Nick Price dropped out since his wife Sue was about to give birth. The eight other alternates could not make it to Crooked Stick Golf Club in time for the tournament. Daly, playing just his third major, was able to have Price's caddy Jeff (Squeaky) Medlin caddy for him. A virtual unknown at the time, he parlayed this opportunity into a first-round score of 69, even though he hadn't had time to play a practice round on the difficult Crooked Stick course. He finished the tournament with scores of 69-67-69-71, giving him a three-stroke victory over Bruce Lietzke . Daly was subsequently named PGA Tour Rookie of the Year . He was also the first rookie to win a major title since Jerry Pate won the U.S. Open in 1976.   , His surprise victory and powerful swing provided the impetus for a cult-like fanbase, composed of many people who had not been previously attracted to golf, and from that point onwards, Daly became one of the most popular players on Tour; he proved able to swell the attendance at events he played. He won the B.C. Open in 1992 and the BellSouth Classic in 1994.  He added to his reputation as a power hitter in 1993 by becoming the first (and still the only) player to reach the green of the famous 630-yard hole 17 at Baltusrol Golf Club in two strokes.  , In 1995, Daly unexpectedly won The Open Championship in a playoff with Italian Costantino Rocca at St Andrews . As Rocca approached the final hole, he was one shot behind Daly who had already finished his round. Rocca's long drive was only yards from the green, but his second shot resulted in a fluffed chip where he forgot to follow through. Rocca sank a 60 foot (18 metre) putt on the 18th at St Andrews to make the birdie he needed to force a playoff with Daly. Daly easily defeated Rocca in the playoff finishing the four holes of the playoff at one under par, while Rocca finished three over par after hitting into the \"Road Hole Bunker\" and taking three shots to get out. Daly is the only eligible two-time major winner never selected to play in the Ryder Cup . This distinction is often used in quiz shows; in 2006, Scottish golfer Sam Torrance took over nine minutes to (correctly) answer this question on Britain's longest-running game show A Question of Sport .  , Daly won the Buick Invitational in 2004, and he was also selected as PGA Tour Comeback Player of the Year for 2004. Daly won the golf tournament in a playoff against Luke Donald and Chris Riley . Daly started using Dunlop golf equipment before this tournament, and the Buick Invitational was his first victory in 189 events. Daly also increased his world golf ranking from 299th to a spot in the Top 50 during this time frame. Statistically he ranked 4th overall on the PGA tour for 2004.  However, Daly did not win another PGA tournament until December 2014, when he won the Beko Classic by one shot. The tournament, played at Gloria Golf Club in Belek, Antalya, Turkey, is sanctioned by the PGAs of Europe.  , Daly entered the 2007 PGA Tour season without full exempt status for the first time since his 1991 PGA Championship victory, which carried a 10-year PGA Tour exemption. Another such exemption was earned with his 1995 Open Championship win. When Daly won the 2004 Buick Invitational , he earned a 2-year exemption, which expired at the end of 2006. Daly finished 193rd on the 2006 PGA Tour Official Money List,  thereby losing his full exempt status for 2007. , Although Daly has had $10,116,306 in career earnings as of June 2, 2014, he is not among the top 50 on the PGA Tour's All-Time Career Money List,  and so he must now depend heavily on sponsor invitations (PGA Tour Exemption Category 11  ). Some 2007 PGA Tour events extended such invitations. Outside of sponsor invitations, Daly can also play in many 2007 regular events via Exemption Category 32,  \"Past Champions, Team Tournament Winners and Veteran Members Beyond 150 on Money List\". , As far as individual tournaments are concerned, Daly is exempt for life in the PGA Championship and AT&T Pebble Beach National Pro-Am , and up to age 60 in the British Open. In order to play in the Masters , U.S. Open , a World Golf Championship or a FedEx Cup Playoff Event , Daly would have to satisfy the particular invitational requirements of such events. Daly has not played at the Masters since 2006, and he has not made the cut there since 2002, even though Augusta National golf course was made for players with his talents.  , Fans and golf columnists point to the 2005 WGC-American Express Championship as the event where John Daly's post-2006 exempt status would be determined. Tied with Tiger Woods at the end of regulation play, Daly missed a short par putt on the 2nd extra playoff hole, giving Woods the victory. Had Daly instead made the par, and then had gone on to win, he would have earned a 3-year PGA Tour exemption through 2008.  Daly also made it to another playoff in the 2005 Shell Houston Open , but lost on the first extra hole to Vijay Singh .  , Daly was invited to play in the Honda Classic on March 1, 2007 on a sponsor's exemption, but had to withdraw after two holes. He pulled a muscle near his shoulder blade when he tried to stop his backswing after a fan snapped a picture.  In December 2008, he was suspended for six months by the PGA Tour.  , After his 2008 suspension, Daly was forced to compete on the European Tour . After undergoing lap-band surgery to lose 40 pounds,  he began playing much better golf, even managing to finish 2nd  at the Italian Open . On May 26, 2009, Daly announced that he would return to the PGA Tour,  via sponsor's exemption, for the St. Jude Classic . On July 17, Daly told The Dan Patrick Show that he had lost 80 pounds thanks to the surgery, dropping him to 205 lbs. , However, after shooting a then personal-high 88 at the Buick Open in late July 2009, he claimed to be losing confidence in his game, and his swing coach blamed the surgery for making him lose muscle along with weight, taking power away from his swing. However, Daly blamed the effects of his poor eyesight on his putting for his high golf score.  , On March 14, 2014, during the second round of the Valspar Championship , Daly shot a career worst 90 which included an 8-over-par 12 on the 16th hole.  His frequent failure to make cuts and high rounds have revived debates on players who frequently receive sponsor exemptions.  , Daly shot a score of 68 for the first round of the 2012 PGA Championship which was played at Kiawah Island, South Carolina.  Daly finished 18th place in that tournament, which was the first time Daly had finished in the top 20 in a major championship since the British Open in 2005. At 47 years of age, Daly can still hit drives as long as anybody on the PGA Tour. However, Daly continues to play more abroad vs. United States due to his limited status on the PGA Tour. In the late fall of 2014 Daly started to show some promise finishing T-29 at the Sanderson Farms Championship , his only start in 2014 of the 2014–15 season. Soon after, Daly, finished T-25 at the Turkish Airlines Open , a European Tour event with a strong field. Then on December 6, 2014, Daly won the Beko Classic, an event sanctioned by the PGAs of Europe, finishing at −15, Daly's first win in over 10 years  , Daly has a flowing self-taught golf swing which was built for raw power and distance. Daly takes his golf club back much farther past parallel on his back swing by extreme coiling of his arms and shoulders which creates very fast club head speed on his down swing. However, Daly's golf swing has contributed to his inconsistent performance during golf tournaments since almost perfect timing is required for proper execution of such a powerful golf swing.  , Daly has had several incidents during golf tournaments which have contributed to his \"Wild Thing\" image including the following:   , After winning the PGA Championship at Crooked Stick Golf Club in 1991, Daly gave $30,000 to the family of a man who died during the tournament due to lightning strike. The money was used by the family to pay college expenses for the man's two daughters. Daly was just starting his golf career and was not wealthy at the time.  , Daly is known for his involvement in many charities including several in northwest Arkansas. He has donated money to his high school, the Make-A-Wish Foundation , and Boys and Girls Clubs of America . Daly is also an active supporter of the sports programs at the University of Arkansas. He shaved his signature \" mullet \", and donated the proceeds from the event to various charities.  Daly regularly plays in the celebrity Pro-Am Monday after the Masters hosted by his friends, Hootie & the Blowfish .  , Daly is in partnership with Loudmouth Golf line of clothing, which includes licensing deals with the NFL's Dallas Cowboys and Arkansas Razorbacks . Sales continue to increase making it difficult to meet demand.  In 2006, Daly launched a wine label John Daly Wines ,  now defunct. , Daly also has a company which designs golf courses (JD Designs), including Sevillano Links at Rolling Hills Casino in Corning, California. Sevillano Links is one of the few links style golf courses in the Western United States, and named \"Best New Golf Course\" by Golfweek magazine.   Other golf courses that John Daly helped design include: , In 2010, publisher Oxygen Games released John Daly's Prostroke Golf for the Xbox 360 , PS3 , and PC . In the game, John Daly is the instructor, as well as the opponent, for players. The game includes twelve courses modeled after real-world courses, but these are locked at the outset. In order to unlock courses, players must defeat Daly in Challenges, including driving, short game, and putting. Unlocking a course allows the player to play against Daly and other players in tournaments.  , In 2007, Daly provided back-up vocals in the Kid Rock song, \"Half Your Age\".  In April 2010, Daly released his second music album called \"I Only Know One Way\" on Long Ball Records/Hopesong Digital/ GMV Nashville . He wrote/co-wrote eight tracks on the album. One track includes Hootie And The Blowfish 's lead singer Darius Rucker and a cover of Bob Dylan 's Knockin' On Heaven's Door . The following is John's perspective on his music: \"The album itself is really my life. All of the songs have a meaning. Most of the record is happening or has happened in my life. I hope people can relate to some of the troubles I have had along the way. Everyone around the world has problems, and I want to connect with those people.\" John's first album, 'My Life,' included guest vocals by Darius, Willie Nelson and Johnny Lee .  , In March 2008, Daly's swing coach Butch Harmon quit, saying that \"the most important thing in his life is getting drunk.\" John Daly responded by saying \"I think his lies kind of destroyed my life for a little bit.\"  , On October 26, 2008, Daly was taken into protective custody by Winston-Salem police after being found drunk outside a Hooters restaurant. Daly was not arrested or charged with a violation. However, the police released his mug shot to the media which resulted in negative publicity.  Shortly after this incident, Daly committed to stop drinking alcohol and to this date does not drink, which has resulted in a progressive resurgence of his game and a positive change in his personal life; this was confirmed by Daly himself at the Open on July 15, 2010.  , In an interview on the Dan Patrick Show on August 6, 2014, Daly acknowledged that much of his past struggle with alcohol was due to growing up with an alcoholic and abusive father.  , In July 1994, Daly claimed that many PGA golfers were cocaine users, and said that if drug testing was done properly on tour, he would be \"one of the cleanest guys out there\".  This statement brought an uproar among the pro golf community.  , In early 2009 he had \" Lap-Band Surgery \" which limits the amount of food that he can consume.  As of December 8, 2009, Daly had shed well over 100 pounds and was \"a slim, trim 185\".  , In 2006, Daly revealed in the last chapter of his autobiography that he has had great difficulty with a gambling problem.  He claims to have lost between US$50 and $60 million over the past 15 years. This includes losing $1.5 million in October 2005, after winning half that amount at the WGC-American Express tournament, most of it lost on a $5,000 Las Vegas slot machine at Wynn Casino .   , In summer 1992, he married Bettye Fulford. They had a daughter, Shynah Hale. In December 1992, Daly was charged with third-degree assault for throwing his second wife Bettye into a wall at their home near Denver . The actual circumstances of the incident remained unclear so far as public releases were concerned, since Bettye did not wish to pursue the matter.  Daly has said in his autobiography that he did not, nor has he ever, hit or hurt a woman.  , On July 29, 2001, he married Sherrie Miller. Their son John Patrick Daly II was born July 23, 2003. On June 8, 2007, Daly and Sherrie got into a fight at a restaurant in Memphis, Tennessee , site of that week's tour stop, the Stanford St. Jude Championship . Daly claims that later that night his wife attacked him with a steak knife. He showed up for his second round on Friday afternoon with cuts and scrapes across his face. Authorities were contacted by him and came to his house, but his wife had already fled the scene and taken their children with her.  , Sherrie (at some point) plead guilty to federal drug charges and was sentenced to a five-month prison term. On December 17, 2010 in Memphis, Circuit Court Judge Donna Fields awarded custody of the couple's 7-year-old son, \"little John\" to Daly, and jailed Sherrie for interfering with Daly's court-ordered visitation rights and other failures to abide by the court's orders in their ongoing divorce proceeding, saying “She is not following this court's orders. That is criminal contempt.”  , In 2005 Daly sued the Florida Times-Union for libel after a columnist claimed Daly \"failed the scoundrel sniff test.\" A judge threw out the case in 2009, saying that Daly had failed to prove the basis of the libel claim: namely, that the statements were untrue. Daly was also ordered by a judge to pay the newspaper over $300,000 in legal fees.  , PGA Tour playoff record (2–2) , 1 Defeated Rocca in four-hole playoff: Daly (4-3-4-4=15), Rocca (5-4-7-3=19) "
}
