{
  "category": "golf",
  "article": "José María Olazábal Manterola ( Spanish pronunciation:  [xoˈse maˈria olaˈθaβal manteˈrola] , Basque:  [olas̻abal] ; born 5 February 1966) is a Spanish professional golfer who has enjoyed success on both the European Tour and the PGA Tour , and has won two major championships . , In 2012 he captained Europe's Ryder Cup team to a narrow victory over the USA, which seemed improbable at the start of the final day's play when the Europeans trailed 10–6. They came back to win 14½–13½. Oazabal was very emotional with the win, saying in an interview that that was his number one happiest golf moment and happiest moment of his life. The win was inspired by his late friend Seve Ballesteros , to whom he dedicated the win.  , , , Olazábal was born in Hondarribia , a town in the Basque autonomous region of Spain. He burst onto the golf scene in 1984 as a junior, winning the (British) Amateur Championship aged 18. Then, in his rookie professional season of 1986, he finished second on the European Tour Order of Merit aged 20. In his first nine seasons, he finished in the top 10 every year except two, including another second place in 1989, and he was a regular member of the top 10 of the Official World Golf Ranking (over 300 weeks).  Had Olazábal beaten Ian Woosnam at The Masters in 1991 (he finished second) he would have become the World No. 1. He was unable to play in 1996 due to a foot injury but he recovered and recorded further top 10 placings in the Order of Merit in 1997, 1999 and 2000. He has more than 20 career titles on this tour. , Both of Olazábal's majors have come in the United States, namely The Masters in 1994 and 1999. These wins make him the only winner of the Amateur Championship since World War II to have gone on to win a professional major. He has been highly placed in The Masters on a number of other occasions. Olazábal shares the record for the lowest round in the PGA Championship (63), which he accomplished in the third round at Valhalla Golf Club in 2000.  , In 2001 Olazábal began to play on the PGA Tour , while also retaining his membership of the European Tour. He had a solid year on the PGA Tour in 2002, when he won nearly $2 million and came 24th on the money list, but has not duplicated the success he enjoyed in Europe in the 1980s and 1990s. He has six career PGA Tour titles, five of them won before he became a full member of the Tour. In 2006 he made a return to the top 15 of the world rankings. , Olazábal was a member of Europe's Ryder Cup team seven times from 1987 to 2006. He formed a famous partnership with fellow Spaniard Seve Ballesteros that spanned many years,  and formed a similarly successful partnership with Sergio García in 2006. Olazábal captained the European team at the 2012 Ryder Cup for the defence of the trophy at Medinah Country Club in Illinois.  After his team went down 10–6 going into the last day, he helped engineer the greatest ever Ryder Cup comeback with the European team eventually winning by 14½ points to 13½. He confirmed afterwards that he would not consider himself for captaincy in the next Ryder Cup. , Olazábal holds the world record distance for a completed putt. During the 1999 European Ryder Cup team's Concorde flight to the United States, he holed a putt which travelled the full length of the cabin. The ball was in motion for 26.17s, during which time the Concorde, at 1,270 mph, traveled 9.232 miles, beating U.S. golfer Brad Faxon 's previous record of 8.5 miles, set in 1997.  , Olazábal was elected to the World Golf Hall of Fame in 2009 with 56% of the vote on the international ballot.  , On June 19, 2013, Olazábal was presented with Spain's most prestigious sporting honor, the Prince of Asturias Award in recognition of his accomplishments as a player and leader of the 2012 Ryder Cup team. He is only the second golfer to be honored since the awards were launched in 1987; Seve Ballesteros was honored in 1989.  , PGA Tour playoff record (0–2) , Amateur , Professional , Great Britain & Ireland , Europe "
}
