{
  "category": "golf",
  "article": "Retief Goosen (born 3 February 1969) is a South African professional golfer who was in the top ten in the Official World Golf Ranking for over 250 weeks between 2001 and 2007.  His main achievements have been two U.S. Open wins (in 2001 and 2004) and heading the European Tour Order of Merit (money list) in 2001 and 2002. , , , Goosen was born in Pietersburg (now Polokwane), South Africa. He is the son of Theo Goosen, a local real estate agent and amateur golfer who introduced the game of golf to Retief at an early age. Theo took a strict approach to parenting. \"Look, I never made life easy for my kids,\" said Theo \"We never spoiled them. We never pleasurized them.\" Goosen even admits that his father put pressure on him.  When Goosen was fifteen he was golfing with his friend, Henri Potgieter, at Pietersburg Golf Club. They were playing through a small drizzle when lightning struck. Henri was knocked from his feet and when he stood back up saw Retief lying on the ground on his back. Henri retold the story to Golf World \"I wanted to know his reaction. What I did see was his golf clubs and his golf bag. Then I saw him lying on his back. His tongue was down his throat and his eyes were backward, and he was breathing weird. He had no clothes on; they'd been burned from his body. I remember picking up his spectacles. I didn't know what to do. It looked like he was dead. I was screaming for help. Fortunately, there were guys teeing off on the 12th hole. They came running toward us. From then on, I can't remember much. They picked him up and put him in a car.\" Goosen's shoes had disintegrated from his feet, his underwear and watch band had melted to his body. He retains a scar on his wrist from the incident. He was unable to put his shoes on for weeks afterwards. He recovered enough to grab another set of clubs and take up the game a few weeks later. Goosen doesn't remember the events that happened, but his father took his son's survival as a sign from God of good things to come.  , Goosen turned professional in October 1990, following a win in the South African Amateur Championship of the same year in July. He was medalist at the European Tour 's Qualifying School in 1992 and enjoyed success on the Tour between 1992 and 2000, but it was not until 2001 where he made his name in America with a U.S. Open win on a very tough Southern Hills Country Club golf course. He nearly lost his chance at victory after three putting from 12 feet, missing a two foot put on the final green, but managed to recover to make a playoff with the 1996 PGA Championship winner Mark Brooks . Goosen dominated the next day's 18-hole playoff, eventually winning by two strokes. Later that summer, he completed his second wire-to-wire victory of the year at The Scottish Open at Loch Lomond . He finished 2001 with three wins, 11 top-tens and the European Tour Order of Merit and followed it up with another in 2002 he also became the first non-European to win the Order of Merit. After his third win of the 2001 season, he rose to a career-high 11th in the world rankings. In 2002, he won on both the PGA Tour and European Tour for the second straight year, a feat that would last for three more years. He won a second U.S. Open in 2004, where he had 11 one-putts in the final round at a tough test at Shinnecock Hills Golf Club . He then rose to his career high world ranking position of 3rd. He won on the PGA Tour each year from 2001 to 2005 with six wins, and he added a seventh win in March 2009 at the Transitions Championship . , After winning medalist at the European Tour's Q-School in 1992, Goosen played 3 seasons before winning his first event in 1996 at the Slaley Hall Northumberland Challenge . He won the Alfred Dunhill Cup in 1997 and 1998 with Ernie Els and David Frost . , Goosen played in the 2000 Presidents Cup where the U.S. team won, but Goosen scored 2 points in total in his 1st appearance in the event. , Goosen won four times on the European Tour between 1996 and 2000, before his breakthrough year in the United States with his 2001 U.S. Open win. , Two weeks after the U.S. Open win of 2001, Goosen won on the European Tour at The Scottish Open at Loch Lomond . This win secured Goosen the Player of the Month for June 2001 on the European Tour. He would add another win late in the year and win the European Tour Order of Merit and the Player of the Year on the European Tour. , Goosen was in contention in the U.S. Open in 2001 all week, and battled Mark Brooks and Stewart Cink during the final round. After Brooks had posted 4 under par, Goosen at 5 under coming up 18, and Cink having a chance to win until he three-putted the 71st hole leaving the battle for the trophy a two man race between Brooks and Goosen. After Goosen hit his approach to 12 feet on 18, he had 2 putts to win and victory seemed imminent. Goosen put his first putt past the hole and was left with 22 inches for victory. The putt was pulled by Goosen and ran across the right edge of the cup and Goosen had to knock in a putt longer than his previous putt to force a playoff with Brooks. , Goosen won the Monday 18-hole playoff by 2 strokes with an even-par 70 and Brooks shooting a 2-over-par 72. It was Goosen's first victory on U.S. soil. He would finish 47th on the PGA Tour money list with over $1,047,000 in a restricted season shared between the PGA and European Tours. , A good stretch for Goosen. He won the European Tour Order of Merit for a second straight year for a season that included a win at the Johnnie Walker Classic by a commanding margin of 8 strokes. He had eight other top-10s on the season, two runner-up finishes, including a 2nd place to Tiger Woods at The Masters . Goosen won the money title in the end by a slim margin over Northern Ireland's Darren Clarke . Goosen would also grab his second win in the U.S. at the BellSouth Classic in April on the PGA Tour. , In 2003, Goosen won his second Trophee Lancome title in its final playing. It was his lone win on the European Tour in 2003, though he had five other top-10s on the season. 2003 was the first season where he played most of his events in the United States. He picked up his 3rd tour win at the Chrysler Championship in October. His 2003 season included 17 of 19 cuts made, 9 top-10s, a win and over $3,100,000 in earnings. , Goosen played in the Presidents Cup for the International team where he scored 3 points for the week that ended with a tie because Tiger Woods and Ernie Els were involved in a playoff that was not over at sundown, so captains Gary Player and Jack Nicklaus decided that the 2003 matches would be a draw. , Goosen's second major title came at the 2004 U.S. Open at Shinnecock Hills . The USGA had prepared extremely tough conditions which were later argued by players as \"unfair.\"  The final-round scoring average of 78.7 was the second-highest since World War II, with only Goosen and Phil Mickelson finishing under par.  He eventually won by two strokes over Mickelson as both men shot 1-over-par rounds of 71. Goosen had 11 one-putt greens on Sunday and 31 one-putts for the championship. He only needed 24 putts on the day in what is remembered as one of the most clutch putting performances in U.S. Open history. 2004 was the start of the \"Big Five Era\" which is used in describing the era in golf where Tiger Woods , Vijay Singh , Ernie Els , Retief Goosen, and Phil Mickelson dominated the game of golf. The five switched up and down the top five positions in the Official World Golf Ranking ; most notably Singh's derailing of Woods as the number one golfer in the world. The five stayed, for the most part in the top five spots from 2004 till the start of 2007. Nine majors were won between them many fighting against each other head to head. , Goosen would win the Tour Championship in November 2004, coming from four strokes behind on the final round with a 6-under-par 64 to win by four strokes over Tiger Woods . It was his second Tour win on the season and it secured him a career high 6th place finish on the 2004 money list.  , In 2005 Goosen was in pursuit of his third U.S. Open and his second in a row, leading by three strokes after three rounds of golf at the Pinehurst No. 2 course. However, he disappeared in the final round with a score of 81 and he ended up finishing in 11th place. In an interview after his round Goosen said \"I messed up badly. I obviously threw this one away.\"  , Even though Goosen threw away the U.S. Open in 2005 finishing T11, it was his worst finish in a major in 2005, finishing T3 at The Masters , T5 at The Open Championship and a T6 at the PGA Championship . he would win The International  by one point over Brandt Jobe for his 6th career win. His 2005 season included 8 top 10s, and over $3.4 million in earnings. , Goosen played in his 3rd Presidents Cup in 2005, at an event where he defeated Tiger Woods in Sunday's singles matches and finished with 4 points. The final score was 18½–15½ for the United States.  , Goosen has been a consistent player: he has won internationally every year since 1995, and also won a PGA Tour event every year from 2001 to 2005. Additionally, he has spent a long period of time in the top 5 of the Official World Golf Ranking , and in 2006 reached a career-best third place after a runner-up finish at The Players Championship to Stephen Ames and 5 other top 10s on the season. He also won on the European Tour at the South African Airways Open and at the Volkswagen Masters-China on the Asian Tour . He also won his match during the challenge season at the People vs. The Pros  event. But from early 2007 to late 2008 he had had a dip in performance. , 2007 was an average season for Goosen's standards; a victory at the Qatar Masters in January – when he finished birdie-eagle for the win, looked to be a sign of things to come along with being the European Tour player of the month in January. Goosen posed a threat on the final day at The Masters . He held the lead till a bogey on the par-three twelve, Goosen failed to rebound parring each of his six remaining holes. He finished tied for second, two behind Zach Johnson . However after the Masters Goosen's best finish throughout the rest of the year was a tie for 15th at the BMW Asian Open, and he ended 2007 having slumped down to 26th in the world rankings. , Goosen's statistics on the PGA Tour at this time were surprisingly low. He was outside the top 100 in ball striking, greens in regulation, driving accuracy, distance, and putting. But this was due mainly, Goosen said, to the swing changes he had made, his hiring a swing coach for the first time in his career, and how he had lost all confidence in his game.  , He was again a part of the International team at the 2007 Presidents Cup at the Royal Montreal Golf Club , just outside of Montreal, Quebec , Canada. It was his fourth appearance in the event. He finished the week with 2 points including a singles win of 2&1 over Jim Furyk on Sunday.  , At the start of 2008, Goosen withdrew from the Qatar Masters as defending champion due to problems with his vision after undergoing corrective laser surgery ten days before the tournament began. He was forced to return to his home in London, England for further treatment. In March, he showed a form that had left him for almost a year and resulted in a tie for second at the WGC-CA Championship . He putted exceptionally well thanks to his old Yes! putter he won both his U.S. Open titles with and named \"Tracy\" after his wife. , Before the tournament Goosen was ranked 40th in the world, which was the lowest he had been ranked since 10 June 2001 (a week before the U.S. Open). His best finish in 2009 other than the runner-up at the WGC-CA Championship , was at the other stroke play WGC event, the WGC-Bridgestone Invitational , where he finished T4, two strokes behind winner Vijay Singh . It was his second of two top five finishes on the season. Although showing some signs of his old self, Goosen had a very inconsistent year finishing 72nd on the PGA Tour money list. In June 2008, he made controversial comments about fellow golfer Tiger Woods , alleging that Woods was faking the severity of his injuries at the 2008 U.S. Open .  Goosen apologized for the comments saying he was not being serious when he made the claim. , His game was on the rise in late 2008. Late in the 2008 season Goosen replaced Vijay Singh because of injury in the Asian Tour's Iskandar Johor Open . Goosen won the tournament for his only win of 2008. The win also extended his streak of winning a professional golf event every year since 1995.  , Goosen continued his good form from late 2008 into 2009. With two international wins in three months, it was a sign of good form to come throughout the season. , He started his 2009 season with two wins on two major tours. Goosen won his second event in four worldwide starts on the Sunshine Tour , at the Africa Open in January, where he came from behind with a final round 65 on Sunday to win by one stroke over four players and take the trophy. Goosen said he'd been struggling with his putting for the last few seasons, he put a belly putter in his bag for a few weeks to get his stroke back .  He played with it for 3 weeks in January and February, starting at the Buick Invitational . He played well with it at the AT&T Pebble Beach National Pro-Am , where he was the 36 hole leader. He went on to finish 3rd for the rained out 54 hole event. He then won his seventh PGA Tour title at the Transitions Championship in March 2009. He made only five bogeys all week on the tough Copperhead Course at Innisbrook Resort and Golf Club in Palm Harbor , Florida. He shot all four rounds under par, and finished at −8, to win by one stroke over Charles Howell III and Brett Quigley . His putting was exceptional during that week, making 55 of 55 putts from 5 feet and less, including a 4½ foot putt for par on 18 for the win that fell in the left edge of the cup. Goosen credited Gary Player with inspiring him to rededicate himself to a new diet and fitness program.  This win vaulted Goosen to number 22 in the Official World Golf Ranking , his highest position since November 2007. , With his rededication to his game with his work with his swing coach, his newfound fitness regime and his renewed, refreshed sense of confidence, Goosen dramatically improved his statistics in 2009 from those of the 2007–2008 seasons before. He moved from driving distance from outside the top 100 to 82nd, to inside the top 40 in putting, 20th in scoring average and 49th in the all-around statistic. , After a tie for 16th place at the U.S. Open at Bethpage Black , Goosen was in contention the very next week in Munich, Germany at the BMW International Open . He led after the first three rounds at 17 under par, two ahead of Bernhard Langer and three ahead of Nick Dougherty .  On Sunday, Goosen did not putt as well as he did the first three rounds, only managing a 1-under 71. He finished the week in 3rd, four strokes behind eventual winner Dougherty. , After a week off, Goosen was in contention the week before The Open Championship at the Barclays Scottish Open at Loch Lomond Golf Club in Glasgow. After a first round of 3-under par 68, he shot a second round 63, which was started by an un-Goosen like opening tee shot. He pulled out a 3-wood off the first tee, and barely got the ball airborne as Goosen topped it and put it in the right rough, as a couple of grouse scuttled for cover. It would not shake the unflappable Goosen as he would shoot a second round 63 to pull two clear of Adam Scott after two rounds.  He shot a disappointing final round of 73 to finish in a tie for 6th.  , Goosen added a 3rd top-10 finish in as many starts worldwide at the 2009 Open Championship at Turnberry . He contended for most of the week and had a share of the lead momentarily during the 3rd round. He finished the event in a tie for 5th, 2 strokes out the of the playoff between Stewart Cink and Tom Watson . Goosen almost picked up his second PGA Tour win of the season at the RBC Canadian Open the following week. Goosen faced Nathan Green in a playoff after the two players shot −18 after four rounds of play. Goosen had a six-foot birdie putt to win the tournament on the first playoff hole but missed it. Green had a twelve-foot birdie putt to win the tournament on the second hole and missed it but it would not matter. Goosen had to sink a nine-foot par putt to extend the playoff but he missed it, giving Green his first PGA Tour victory. , Goosen had another close call at victory during the 2009 FedEx Cup Playoffs at the Deutsche Bank Championship , where he was the 54-hole co-leader with Sean O'Hair and Steve Stricker , but he shot a final round of Even Par to finish T8.  , Goosen added 4 consecutive top 10 finishes in October and November; 6th at the Portugal Masters , 3rd at the Iskandar Johor Open , where he shot a third round 62, 9th at the Volvo World Match Play Championship and 10th at the WGC-HSBC Champions . , Goosen started his 2010 campaign in January with 3 consecutive top-10 finishes. He finished 6th at the SBS Championship , 4th at the Sony Open in Hawaii and 9th at the Qatar Masters . Goosen added a quarterfinal loss to Camilo Villegas in February at the WGC-Accenture Match Play Championship , his best appearance in the event since 2006. Goosen had a good title defense at the Transitions Championship in March, where he finished 5th. A week later at the Arnold Palmer Invitational , Goosen finished in a tie for 4th, his fifth top-10 in seven 2010 PGA Tour events, and his 11th top-10 finish in his last 14 events worldwide. The 4th place finish moved Goosen to 15th in the Official World Golf Ranking. , On 27 April 2010, Goosen broke his toe while playing with his children.  /The injury caused Goosen to miss the Quail Hollow Championship and The Players Championship . On 18 May, in an incident separate to his toe injury, Goosen injured his hand. This injury caused Goosen to miss the BMW PGA Championship , one of the premier events on the European Tour. Goosen returned to the PGA Tour in June at the St. Jude Classic , the week before the U.S. Open .  He finished T15 at the St. Jude Classic. After the U.S. Open, Goosen flew to Canada to play in the Telus World Skins Game , where he won 5 skins. Two days after that, he played in the Travelers Championship , where he finished T5, his 6th top-10 finish of the season. , At the 2010 Open Championship at St Andrews , Goosen finished 6th, breaking par in all four rounds. It was Goosen's 7th top-10 finish of the season. Goosen had his first top-3 finish of the season in August at the WGC-Bridgestone Invitational , his 8th top-10 of the season. , After a 7th place finish at the BMW Championship , Goosen played in the final group on Sunday at The Tour Championship with eventual winner Jim Furyk . Goosen finished 3rd on his own. Goosen finished 10th in the final standings of the 2010 FedEx Cup Playoffs . He finished his 2010 PGA Tour season with 10 top-10s, and over $3.2 million in earnings. In December, Goosen finished runner-up to Ernie Els at the South African Open in Durban. Goosen finished at 24 under par, one stroke behind Els. , Despite a strong start to the season, with two top-3 finishes by January, Goosen ended the year with his worst season since 1995. Goosen withdrew from both The Open Championship and the PGA Championship after poor first rounds, citing injuries. Goosen had to deal with back injuries for the entire second half of the 2011 season.  At the end of the year, he had dropped out of the top 50 in the world rankings for the first time in over a decade. , Goosen started his 2012 campaign on the European Tour with three consecutive starts in January in South Africa. He finished 3rd in the Africa Open , and 16th in the Joburg Open before finishing tied second with Ernie Els in the Volvo Golf Champions , losing to winner Branden Grace in a playoff.  Through the first three weeks of season, Goosen was second in the Race to Dubai . , For the first time since 1999, Goosen did not play in the Masters, as he was outside the Top 50 in the OWGR. , Goosen started his 2013 campaign internationally, finishing 20th at the Volvo Golf Champions and missing the cut at the Qatar Masters . Goosen made 9 starts on the PGA tour making 6 cuts, including 9th at AT&T National . He would reinjured is back at The Players Championship causing him to withdraw from the tournament. After months of time off, Goosen returned to action on the European Tour in September for two tournaments, finishing 63rd and 66th. , Goosen showed hopeful signs during the 2013–14 season. Focused only on the PGA Tour, Goosen made 19 of the 26 cuts, including 14 straight cuts to finish the season, while earning over $825k. , Goosen started off the 2014–15 PGA Tour season with a 3rd place finish at the Frys.com Open . Goosen finished 2014 making 2 out of 3 cuts, finishing 33rd at the CIMB Classic and 65th at the OHL Classic. He held the lead at the 2015 Northern Trust Open for the first three rounds. A final round 75 dropped him to a tie for 8th finish. , Goosen is known for his extremely calm demeanor, a trait that has earned him the nickname \"The Iceman\" on the PGA Tour. He is also affectionately called \"The Goose.\"  The term unflappable is a term commonly connect with Retief because of his attitude on the course.  Goosen's mother attributes her son's calm demeanor because of the effects left on Goosen after he was struck by lightning.  , Goosen is now married with a son and daughter, and has homes in Virginia Water , Surrey , England and in Lake Nona Golf & Country Club in Orlando, Florida , U.S. as well as retaining residence in Polokwane , South Africa. , Goosen is friends with golf icon Gary Player and regularly plays in the Gary Player Invitational series to help raise funds for needy children in both China and South Africa as well as around the world. , Retief has also played in the Nelson Mandela Invitational hosted by Gary Player in South Africa, honoring former South African President Nelson Mandela . He has won the event twice, in betterball in 2000 with Allan Henning ,  and in 2006 with Bobby Lincoln . He also won the fourball event in 2008 with Costantino Rocca , and Alan Pearson. , Goosen is also known for his interest and business in wine. He owns his own vineyard in Garden Route, South Africa. The vineyard is situated 2500 feet above sea level and was deemed a great place to plant in 1993. He started growing plants on the vineyard in 2005, and labeled his wine The Goose . The Goose Expression Cabernet Sauvignon Shiraz wine won the bronze medal in 2008 from the Decanter World Wide Wine.  , In 2009, Goosen won awards for both his Goose wines. This follows on from last year's Bronze Medal for The Expression Cabernet Sauvignon / Shiraz 2005. 2009 brought a Silver Medal each by The Decanter World Wine Award 2009 for The Expression Cabernet Sauvignon / Shiraz 2007 and The Goose Sauvignon Blanc 2008. , Course(s) under construction: , PGA Tour playoff record (1–1) , 1 Co-sanctioned with the Asian Tour , European Tour playoff record (2–3) , 1 co-sanctioned with the European Tour , 1 Defeated Brooks in 18-hole playoff: Goosen 70 (E), Brooks 72 (+2). , * As of 23 November 2014. , These figures are from the respective tour's official sites. Note that there is double counting of money earned (and wins) in the majors and World Golf Championships since they became official events on both tours. , Green background for Tour's leading money winner. Yellow background for top-10 on Tour's money list. , Professional , As of the 2010 Transitions Championship  "
}
