{
  "category": "golf",
  "article": "Stewart Ernest Cink (born May 21, 1973) is an American professional golfer who won the 2009 Open Championship . He spent over 40 weeks in the top 10 of the Official World Golf Ranking from 2004 to 2009.   , , , Cink was born in Huntsville, Alabama , and grew up in nearby Florence , where he attended Bradshaw High School. After completing high school in 1991, he graduated from Georgia Tech in Atlanta in 1995 with a degree in Management, where he played golf for the Yellow Jackets ; he turned professional in 1995. , After winning the Mexican Open and three events on the Nike Tour (now the Web.com Tour ) in 1996, Cink joined the PGA Tour in 1997 and won the Canon Greater Hartford Open in his rookie season. Cink performed consistently on the Tour over the next few years, picking up another win at the 2000 MCI Classic. Until his victory in the Open Championship in 2009, 2004 was his most successful season, with a fifth-place finish on the money list and wins at the MCI Heritage and at the WGC-NEC Invitational , which is one of the World Golf Championships events. , On February 24, 2008, Cink was the runner-up in the WGC-Accenture Match Play Championship played in Marana, Arizona , falling 8 & 7 in the 36-hole final to top-ranked Tiger Woods . In June 2008, he reached his highest ever ranking, sixth, in the Official World Golf Rankings with his victory at the Travelers Championship in suburban Hartford .  , On July 19, 2009, Cink won his first major title at the 138th Open Championship at Turnberry, Scotland , defeating 59 year-old, five-time champion Tom Watson by six strokes in a four-hole playoff . Cink had birdied the 72nd hole while Watson bogeyed, which forced the playoff.  , Cink has struggled on the PGA Tour since winning the 2009 Open Championship, but is exempt through 2014 as a result of his Open win. , Each fall, Cink co-hosts the East Lake Invitational with Billy Andrade at East Lake Golf Club which benefits the East Lake Foundation. , Cink and his wife, Lisa, have two sons, Connor and Reagan. , PGA Tour playoff record (2–2) , 1 Defeated Tom Watson in 4-hole playoff by 6 strokes (Cink: 4-3-4-3=14 / Watson: 5-3-7-5=20) , Professional "
}
