{
  "category": "swimming",
  "article": "Dara Grace Torres (born April 15, 1967) is an American former competition swimmer who is a twelve-time Olympic medalist and former world record-holder in three events. Torres is the first and only swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, was the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics , she competed in the 50-meter freestyle , 4×100-meter medley relay , and 4×100-meter freestyle relay, and won silver medals in all three events. , Torres has won twelve Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. She won five medals at the 2000 Summer Olympics when, at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games. , , , Torres was born in Los Angeles, California , the daughter of Edward Torres and Marylu Kauder.  Her father was a Cuban -born real estate developer and casino owner; her mother Marylu was a former model.   Torres grew up in Beverly Hills, California , the fifth of six children and the older of two girls.  As a 7-year-old, she followed in the footsteps of her older brothers by joining their community Y.M.C.A. for swimming practice; afterward, she signed up for the swimming club in Culver City to train.  At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel , a college junior.  , She attended the Westlake School for Girls (now Harvard-Westlake School ),  and competed for the Westlake swim team under coach Darlene Bible from the seventh grade through her sophomore year in high school.  She was also a member of the Westlake basketball, gymnastics and volleyball teams.  During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California , while training for her first Olympics under coach Mark Schubert .  After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.  , Torres accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) competition under coach Randy Reese from 1986 to 1989.  In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) individual championships, including the 50-yard freestyle (1987, 1988, 1989), 100-yard freestyle (1987, 1988, 1989), 200-yard freestyle (1987), and 100-yard butterfly (1988, 1989); she was also a member of twelve of the Gators' SEC championship relay teams.  Torres won three NCAA individual national championships (50-yard freestyle, 100-yard freestyle, 100-yard butterfly) in 1988; and was a member of six of the Gators' NCAA championship relay teams, including the 400-yard freestyle relay in 1986; the 200-yard and 400-yard medley relays, and the 400-yard freestyle relay in 1988; and the 200-yard and 400-yard medley relays in 1989.  She was named the SEC Athlete of the Year in 1988, SEC Female Swimmer of the Year in 1987 and 1989, and earned twenty-eight All-American swimming honors—the maximum number possible during a college career.   Torres also lettered in volleyball at Florida, playing the sport in her fifth year after having exhausted her NCAA eligibility in swimming.  , Torres graduated from the university with a bachelor's degree in telecommunications in 1990, and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999.   In November 2013, she was named as a recipient of the 2014 NCAA Silver Anniversary Award , presented annually to six distinguished former student-athletes on the 25th anniversary of their final school year of athletic eligibility.  , At the 1984 Summer Olympics in Los Angeles, Torres was a member of the winning U.S. women's 4×100-meter freestyle relay team, swimming in the first-round qualifying heat and earning a gold medal in the event final.  Her winning teammates in that final included Nancy Hogshead , Jenna Johnson and Carrie Steinseifer ; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.  , For the 1988 Summer Olympics in Seoul, South Korea, Torres qualified for the U.S. Olympic women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4×100-meter freestyle relay final, together with teammates Mitzi Kremer , Laura Walker and Mary Wayte .   She also earned a silver medal for swimming the freestyle leg of the 4×100-meter medley relay for the second-place U.S. team in the preliminary heats, but not the final.  Individually, Torres also placed seventh in the final of the 100-meter freestyle event.  , Torres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay for the winning U.S. team that included Nicole Haislett , Angel Martino and Jenny Thompson , and earned a gold medal for her efforts in the event final and first-round qualifying heat.   , After seven years out of competitive swimming, Torres began to train for an Olympic comeback in 1999 under the guidance of coach Richard Quick .  She won five medals at the 2000 Summer Olympics in Sydney, but saved her best for two of the major relay events of the U.S. Olympic women's team.   She swam the second leg for the winning U.S. women's team in final of the 4×100-meter freestyle relay that included Amy Van Dyken , Courtney Shealy and Jenny Thompson .  Torres won a second gold medal for anchoring the winning U.S. team in the 4×100-meter medley relay , together with teammates B.J. Bedford, Megan Quann and Jenny Thompson in the final.  Individually, Torres also earned bronze medals – her first Olympic medals in individual events – in each of the 50-meter freestyle , the 100-meter butterfly and the 100-meter freestyle ,   tying teammate and rival Jenny Thompson for third place in the last event.   At 33 years old, Torres became the oldest woman to win an Olympic medal in swimming.  She was the oldest member of the U.S. Olympic swim team, but won more medals (5) than any other U.S. team member.   , On August 1, 2007, at age 40 and just 16 months after giving birth to her first child, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis.  On August 4, she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics.  She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle ten times, which is the most by any American swimmer in any event.  , At the 2008 U.S. Olympic Trials , Torres returned to the pool and qualified for a spot in her fifth Olympic Games at the age of 41, unprecedented for an American female swimmer.  She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games.  , At the trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal.  In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the event.  Torres also qualified in the 100-meter freestyle,  but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4x100-meter relay events.  On July 30, at the U.S. swim team's final training in Singapore, Torres, Amanda Beard and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.  , In order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for a new enhanced drug-testing program by the U.S. Anti-Doping Agency (USADA).  \"I want to be an open book\", she said. \"I want people to know that I'm 41, and I'm doing this right. I'm clean.\"  In addition to employing her training team of coach Michael Lohberg, a sprint coach, a chiropractor and two masseuses, Torres used resistance stretching trainers, calling it her \"secret weapon\" for continued success.   Her $100,000-per-year training costs were partially subsidized by her corporate sponsors Speedo , Toyota and Bloomberg L.P.  , At the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the second-place U.S. team in the 4×100-meter freestyle relay .  It was the fifth time in five tries she earned an Olympic medal in the 4x100-meter freestyle relay.  With the American relay team's second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson , who was 38 at the time of the 1908 Summer Olympics.  , On August 17, 2008, she won the silver medal in the 50-meter freestyle , finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner, Britta Steffen .  Her second-place time was a new American record, and 0.18 of a second faster than she swam at the U.S. Olympic Trials.  Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg for the second-place U.S. team in the 4×100-meter medley relay .  Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history.  The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres' time more than a full second faster.  , Torres' twelve Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.  , At the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships .  This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly. , Following reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics .  At the 2012 United States Olympic Trials , she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy , and 0.09 of a second behind the second qualifier, Kara Lynn Joyce .   Only the top two finishers in each trials event qualified for the 2012 U.S. Olympic Team, and as a result, Torres concluded her Olympic career.  After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals.  Her Olympic career spanned twenty-four years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).  , Torres has worked in television as a reporter and announcer for American networks NBC , ESPN , TNT , OLN and Fox News Channel , and hosted the golf show The Clubhouse on the Resort Sports Network .  She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue , appearing in the 1994 edition.  She was elected to the International Jewish Sports Hall of Fame in 2005.  , After 1992, she married and subsequently divorced sports producer Jeff Gowen.  After 2000, she married Israeli-born surgeon Itzhak Shasha, after converting to Judaism before the marriage (her father had been Jewish).  Torres and Shasha later divorced.  Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006.  After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again.  , Torres is a veteran celebrity swimmer for Swim Across America , a charitable organization that raises funds for cancer research in which she has participated for several years.  She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick).  , Women's 50-meter freestyle , Women's 4x100-meter freestyle relay , Women's 4x100-meter medley relay , , "
}
