{
  "category": "swimming",
  "article": "Dawn Fraser , AO ,  MBE (born 4 September 1937) is an Australian champion swimmer and former politician. She is one of only three swimmers to have won the same Olympic event three times – in her case the 100-metre freestyle.  , Within Australia, during her swimming career she was often known for her controversial behaviour and larrikin character as much as for her athletic ability. She outgrew that reputation and received many honours after her competitive swimming career ended. , , , Fraser was born in the Sydney suburb of Balmain in 1937 into a working-class family. She was spotted at the early age of 14 by Sydney coach Harry Gallagher swimming at the local sea baths. , Fraser won eight Olympic medals, including four gold medals, and six Commonwealth Games gold medals. She also held 39 records. The 100 metres freestyle record was hers for 15 years from 1 December 1956 to 8 January 1972. , She is the first of only three swimmers in Olympic history ( Krisztina Egerszegi of Hungary and Michael Phelps of the United States being the two others) to have won individual gold medals for the same event at three successive Olympics (100 metres freestyle – 1956, 1960, 1964) . , In October 1962, she became the first woman to swim 100 metres freestyle in less than one minute.  It was not until 1973, eight years after Fraser retired, that her 100m record of 58.9 secs was broken.  , During the 1964 Summer Olympics in Tokyo, Fraser angered swimming team sponsors and the Australian Swimming Union (ASU) by marching in the opening ceremony against their wishes, and wearing an older swimming costume in competition because it was more comfortable than the one supplied by the sponsors. She was accused of stealing an Olympic flag from a flagpole outside Emperor Hirohito 's palace from the Kōkyo . She was arrested but released without charge. In the end she was given the flag as a souvenir.  However, the Australian Swimming Union suspended her for 10 years. They relented a few months before the 1968 Games but by then it was too late for Fraser, at 31, to prepare. , She later denied having swum the moat to steal the flag, telling The Times in 1991: \"There's no way I would have swum that moat. I was terrified of dirty water and that moat was filthy. There's no way I'd have dipped my toe in it.\" , Fraser became a publican at the Riverview Hotel , Balmain, and took up swimming coaching. In 1988, she was elected an independent Member of the New South Wales Legislative Assembly (MLA) for the seat of Balmain . Fraser left politics when the seat was abolished in 1991 and she failed to win the new seat of Port Jackson .   Fraser is a high profile supporter and a board director of the Wests Tigers NRL club.  , She was named the Australian of the Year in 1964,  was inducted into the International Swimming Hall of Fame in 1965,  was made a Member of the Order of the British Empire in 1967,  and appointed an Officer of the Order of Australia (AO) in 1998.  Also in 1998, she was voted Australia's greatest female athlete in history. [ citation needed ] She was named Australian Female Athlete of the Century by the Sport Australia Hall of Fame ,  who had inducted her as their first female member in 1985.  In 1999 the International Olympic Committee named her the World's Greatest Living Female Water Sports Champion. [ citation needed ] on 14 July 2000, Fraser was awarded the Australian Sports Medal for \"outstanding contribution as a swimming competitor\".  , She was one of the bearers of the Olympic Torch at the opening ceremony of the 2000 Summer Olympics in Sydney. She carried the Olympic Torch at the stadium, as one of the bearers for the final segment, before the lighting of the Olympic Flame . , The Australian Sport Awards includes an award named in honour of and presented by Fraser. In 1992, the State Transit Authority named a RiverCat ferry after Fraser. , In 1979, a movie called Dawn! was made about Fraser's life and career. It starred Bronwyn Mackay-Payne as Fraser. , Fraser was played by Melissa Thomas in the 2003 film Swimming Upstream . Fraser herself is credited in the film as Dawn Fraser's coach. , Fraser married Gary Ware on 30 January 1965 at St Stephens Church, Macquarie Street, Sydney.  The marriage was short-lived. She has one daughter from the marriage, Dawn-Lorraine, who has a son, Jackson.   "
}
