{
  "category": "swimming",
  "article": "For his father, also an Olympian, see Gary Hall, Sr. , Gary Wayne Hall, Jr. (born September 26, 1974) is an American former competition swimmer who represented the United States at the 1996 , 2000 , and 2004 Olympics and won ten Olympic medals (five gold, three silver, two bronze). He is a former world record-holder in two relay events. Hall is well known for his \"pro-wrestling like\" antics before a competition; frequently strutting onto the pool deck in boxing shorts and robe, shadow boxing and flexing for the audience. , , , His father, Gary Hall, Sr. , also competed in three Olympics as a swimmer (1968, 1972 and 1976). His maternal uncle, Charles Keating III , swam in the 1976 Olympics, and his maternal grandfather, Charles Keating Jr. , was a national swimming champion in the 1940s. , In his first Olympics at the age of 21 in Atlanta, Hall had only 6 years of swimming experience yet he already had a well-known rivalry with Russia's Alexander Popov . Hall and his teammates dominated the relay events, but Popov beat Hall in the individual events. The rivalry grew more bitter than ever. Hall responded by coming to his next event in leather motorcycle pants and executing his usual shadow boxing and flexing routine. Eventually, Hall lost in the individual 100 m freestyle and 50 m freestyle to Popov. , Hall won two individual silvers and two team relay golds at the games, including helping set the world record in both the 400 m freestyle and medley relays. , In 1998, Hall was suspended by FINA for marijuana use.  , In 1999, he was diagnosed with Type 1 diabetes , commonly referred to as childhood or juvenile diabetes. Upon his diagnosis, Hall struggled with the possibilities and the effects he knew the medical condition would have on his life. He took a short hiatus from swimming, but returned to compete in the 2000 U.S. Olympic Trials. There he won the 50 m freestyle and placed second in the 100 m freestyle . His 50 m time of 21.76 seconds set a new American record, beating the ten-year-old record set by Tom Jager . , Hall's success continued in the 2000 Summer Olympics . He won the gold medal in the individual 50 m freestyle , tying with his fellow American Anthony Ervin , and won the gold and silver in the team relays. He also won the bronze in the individual 100 meter freestyle race. , Prior to the 4x100 m freestyle relay, Hall posted on his blog: \"My biased opinion says that we will smash them (Australia's 4x100m team) like guitars. Historically the U.S. has always risen to the occasion. But the logic in that remote area of my brain says it won't be so easy for the United States to dominate the waters this time.\" Hall swam last in the team against Australian Ian Thorpe . Thorpe had a better start and came up a body length in front of Hall. Hall managed a lead but Thorpe fought back, inflicting America's first ever Olympic defeat in the event. The Australian team responded to Hall's remarks after the race by playing air guitar on the pool deck. Hall recalled the race, saying, “I don’t even know how to play the guitar...I consider it the best relay race I’ve ever been part of. I doff my cap to the great Ian Thorpe. He had a better finish than I had.”  , At the 2004 Summer Olympics , Hall again won the gold medal in 50 m freestyle . At 29, he became the oldest American male Olympic swimmer since 1924 when Duke Kahanamoku competed. Despite having swum the fastest 50 in the year leading up to the 2004 Summer Olympics , he was regarded as a long shot to medal in the 50 m freestyle. He also won a bronze medal for competing in the preliminary heat of the 4×100 meter freestyle relay. , Hall failed to qualify for the 2008 Olympic Team after finishing 4th in the 50 Meter Finals at the US Olympic Swimming Trials (Located in Omaha, Nebraska) on July 5, 2008. , The Race Club is a swimming club founded by Hall and his father, Gary Hall, Sr. The club, originally known as \"The World Team,\" was designed to serve as a training group for elite swimmers across the world in preparation for the 2000 Sydney Olympic Games. To be able to train with the Race Club, one must either have been ranked in the top 20 in the world the past 3 calendar years or top 3 in their nation in the past year. The Race Club included such well known swimmers as Roland Mark Schoeman , Mark Foster , Ryk Neethling , Ricky Busquet and Therese Alshammar .  They were coached by University of Michigan coach Mike Bottom . , The Race Club offers various swimming camps, swim clinics, and swimming technique video recording year round for young swimmers at their Islamorada, Florida -based training center.  , In the summer of 2006, Hall's sister, Bebe Hall, was attacked by a blacktip reef shark near Islamorada , while she and Gary were spearfishing , an attack for which Bebe Hall needed 19 stitches .  Gary Hall repeatedly punched the shark and his sister shot a spear into it, after which the shark swam off. , Hall has long been one of competitive swimming's most colorful personalities. He often shadow-boxes before a race and is known for wearing a boxing robe in lieu of the usual warm-ups. His eccentricity has won him a great deal of fans, but what some perceive to be \"showboating\" has drawn substantial criticism. He is also an outspoken critic of performance enhancing drug use in swimming, and is one of the few prominent swimmers willing to publicly question the legitimacy of suspected individual accomplishments. In 2008, he compared International Swimming Hall of Fame inductee Amy Van Dyken to disgraced track & field athlete Marion Jones , noting they were both involved with the Bay Area Laboratory Co-Operative (BALCO) steroid scandal. [1] "
}
