{
  "category": "swimming",
  "article": "Jason Edward Lezak (born November 12, 1975) is an American competition swimmer who is a four-time Olympic gold medalist. He formerly swam for Irvine Novaquatics . He graduated from Irvine High School in 1994, and then from the University of California, Santa Barbara in 1999. , Lezak is a specialist in the 50-meter and 100-meter freestyle races. He also owns long-course world records in the 400m freestyle and medley relays, and is a former American record holder in the 100-meter freestyle. Lezak is one of the few elite swimmers not to have a personal coach. Despite this, Lezak enjoys team sports and fellow American Gary Hall, Jr. dubbed Lezak as a \"professional relay swimmer\" at the 2004 U.S. Olympic Trials before their match-up in the 100-meter freestyle.   , , , Lezak was born in Irvine, California , the son of Linda (née Mann), an elementary school science teacher, and David Lezak, a former leather goods salesman.  He is Jewish .  The name Lezak is pronounced Leh-Zhack (short e). Lezak attended El Camino Real Elementary School (now Woodbury Elementary School) and Irvine High School , as well as the University of California, Santa Barbara .  He swam for the UC Santa Barbara Gauchos swimming and diving team from 1995 to 1998. Lezak currently lives in Irvine with his wife, Danielle (DeAlva).  , Lezak currently has competed in four Olympic Games, in 2000 , 2004 , 2008 , and 2012 and has earned a total of Eight Olympic medals, two bronze, two silver, and four gold. He earned a spot on the U.S. team in the 2012 Games in London with a sixth-place finish in the 100-meter freestyle at the Olympic trials. , Lezak earned his first long-course international swimming gold medal at the 2000 Summer Olympics in Sydney, where he was part of the 4×100-meter medley relay in the Olympics in Sydney. He also won a silver medal in the 4×100-meter freestyle relay . , He competed in several events at the 2004 Olympic Games in Athens, Greece, and was a member of the 4×100-meter medley relay team that set a new world record at the games. He also won a bronze medal in the 4×100-meter freestyle relay and finished fifth in the 50-meter freestyle . , At the 2008 Summer Olympics in Beijing, Lezak was the oldest male on the U.S. swim team. He anchored the U.S. 4×100-meter freestyle relay team that won the gold medal and set a new world record. In the final 25 meters, Lezak overtook French team anchor Alain Bernard (the world record holder in the 100-meter freestyle going into the relay) to win gold despite Bernard having nearly a full body length's advantage when Lezak started his leg and half a body length with 25 meters from the end. Lezak split a 46.06, the fastest 100-meter freestyle split in history, by nearly six tenths of a second. The final time of the American team was 3:08:24, which was 3.99 seconds faster than the previous world record; the French team finished second at 3:08.32, eight one-hundredths (0.08) of a second behind—the closest finish in the event's history. This was a crucial race for Michael Phelps , because he needed it to complete the goal of winning eight gold medals in a single Olympic Games, breaking Mark Spitz 's record of seven gold medals at the 1972 Summer Olympics .  , Lezak also earned his first individual Olympic medal, having tied for the bronze with Brazillian swimmer César Cielo Filho in the 100-meter freestyle with a time of 47.67. , Lezak qualified for his fourth Olympics at the 2012 United States Olympic Trials in Omaha, Nebraska. His sixth-place finish in the Olympic Trial finals was good enough to reach the London Games as a member of the U.S. 4x100-meter freestyle relay team.  At the Olympics in London, Jimmy Feigen , Matt Grevers , Ricky Berens and Lezak swam for the U.S. team in the preliminaries. Nathan Adrian , Michael Phelps , Cullen Jones and Ryan Lochte swam in the finals, and together all these competitors earned a silver medal for the team's second-place finish in the finals.   , In short-course competitions he won five world championships, four relays plus a gold in the 100-meter freestyle in 2004. Lezak has also won seven U.S. Championships, three times in the 50-meter freestyle and four in the 100-meter freestyle. , Lezak forwent the 2009 World Aquatics Championships to compete in the 18th Maccabiah Games in Israel from July 12 to 29, 2009.  Lezak was given the honor of lighting the Maccabiah torch at the Opening Ceremony.  At the Maccabiah Games, Lezak won gold medals in the 50-meter freestyle, 100-meter freestyle, 4×100-meter freestyle relay, and 4×100-meter medley relay.  , His personal bests (long-course) are: "
}
