{
  "category": "swimming",
  "article": "Kosuke Kitajima ( 北島 康介 , Kitajima Kōsuke ? , born September 22, 1982 in Tokyo) is a Japanese multiple Olympic gold medalist breaststroke swimmer . He won gold medals for the men's 100 m and 200 m breaststroke at both the Athens 2004 , and the Beijing 2008  Summer Olympic games. , , , Kitajima is a decorated swimmer in the world championships and was the world record holder in the 100 m breaststroke that he set at the 2008 Beijing Olympics – this mark has since been bettered by first Brenton Rickard and later Cameron van der Burgh . He was also bronze medal winner in the same Olympics in the 4×100 m medley relay. He edged out his main rival Brendan Hansen who finished fourth while Kitajima won the gold medal and set the new world record. , He received four gold medals, one silver and two bronze medals in total at the 2004, 2008 and 2012 Olympics.  , His most significant rival in the breaststroke was the American swimmer Brendan Hansen . They dueled at events such as the 2005 World Championships , 2004 Summer Olympics and 2003 World Championships . Kitajima set both world records for 100 m and 200 m breaststroke in the latter occasion. Later his best in 200 m was overcome by Dimitri Komornikov and then by Hansen, who also broke Kitajima's record in the 100 m. Kitajima regained the world record (58.91) in the 100 m at the 2008 Summer Olympics . Kitajima regained the 200 m breaststroke world record in June 2008 at the Japan Open. His time of 2:07.51 shaved nearly a second off the previous record of 2:08.50 set by Hansen in 2006.  , During the 2004 Olympic Games in Athens, Kitajima generated buzz for his primal screams of exuberance after edging out Hansen in the 100 m and 200 m breaststroke for the gold. At a pool side interview (3'24\") following his victory in the 100 m, Kosuke Kitajima also popularised the phrase 'cho-kimochi-ii,' meaning \"I feel really good.\" The word went on to win the 2004 U-Can Neologisms and Vogue Words contest.  , In long course swimming pools Kitajima's bests are: "
}
