{
  "category": "swimming",
  "article": "Kristin Otto (born 7 February 1966)  is a German Olympic swimming champion. She is most famous for being the first woman to win six gold medals at a single Olympic Games, doing so at the 1988 Seoul Olympic games.   Otto was also the first woman to swim the short course 100 meter backstroke in under a minute,  doing so at an international short course meet at Indiana University in 1983.  , Otto was born in Leipzig , East Germany, and began swimming at the age of 12, training in an East German sports academy. Aged sixteen, she participated in her first world championships, the 1982 World Aquatics Championships , winning the gold medal in the 100 meter backstroke as well as two additional gold medals in the 4×100 m relays with the East German team. , After 1982, Otto changed coaches and began concentrating on other speed strokes. At the following European Championships in 1983, Otto finished second in the 100 meter freestyle, following her fellow East German , Birgit Meineke . , In 1984, Otto set a world record in the 200 meter freestyle. She was expected to win gold medals at the 1984 Los Angeles Olympic games, but was unable to compete due to the boycott by 14 Eastern Bloc countries, including East Germany. In 1985 she fractured a vertebra, keeping her from competing for most of the year or to go to the European Championships. , Otto returned to competitive swimming at the 1986 World Championships in Madrid, where she won 4 gold medals (100 m freestyle, 200 m individual medley, 4×100 m medley relay and 4×100 m freestyle relay) and 2 silver medals (50 m freestyle, 100 m butterfly). Her success continued the following year at the 1987 European Championships where she won 5 gold medals. , At the 1988 Seoul Olympic games she once again was expected to win Olympic gold. She won six gold medals, as well as setting world records in the 50 m freestyle, 100 m freestyle, 100 m backstroke and 100 m butterfly.  , Otto retired from swimming in 1989.  She currently works as a sports reporter for German television. , She was named the Female World Swimmer of the Year in 1984, 1986 and 1988 by Swimming World magazine . , Otto's career was marred by the revelations of widespread performance enhancement drugs use by East German athletes: former teammate Petra Schneider openly admitted that she had used banned substances. However, Otto stated that she was not aware that she was being doped, saying: \"The medals are the only reminder of how hard I worked. It was not all drugs.\"  , "
}
