{
  "category": "swimming",
  "article": "Krisztina Egerszegi ( Hungarian pronunciation:  [ˈkristinɒ ˈɛɡɛrsɛɡi] ; born 16 August 1974 in Budapest, Hungary ) is a Hungarian former world record holding swimmer and one of the greatest Hungarian Olympic champions of the modern era. She is a three-time Olympian ( 1988 , 1992 and 1996 ) and five time Olympic champion; and one of three individuals ( Dawn Fraser and Michael Phelps being other two) to have ever won the same swimming event at three Summer Olympics. She is the most successful and greatest female swimmer of all-time with 5 individual Olympic gold medals and she is the first and only female swimmer who won 5 individual Olympic gold medals.    , She held the world record in the long course 200 m backstroke for almost 17 years (August 1991 – February 2008), after setting it at the 1991 European Championships (2:06.62). As of June 2009, that time remains the European and Hungarian records . It is the oldest record on the European list, and the second-oldest on the Hungarian list — Egerszegi's former world record in the 100 m backstroke (1:00.31), set 3 days prior to the 200 m backstroke, is the oldest. She is considered by many to be the greatest female backstroker of all-time. , , , She made her international debut at the 1987 European Aquatics Championships at the age of 13, coming fourth in the 200 m backstroke and fifth in the 100 m backstroke. , At the 1988 Summer Olympics she won silver medal in the 100 m backstroke and became Olympic champion in the 200 m backstroke. At the age of 14 years and 41 days she became the youngest-ever female Olympic champion in swimming. This youth record was broken in 1992 by Kyoko Iwasaki of Japan, who won a gold medal in the 200 meter breaststroke at the 1992 Barcelona Olympic Games at the age of 14 years and six days. , At the 1989 European Aquatics Championships she competed in three events adding the 400 m medley to the 100 m and 200 m backstroke, winning silver medal in all three events despite she struggled with a strong cold during the entire Championships. , In 1991 she competed at the World Championships winning the gold medal in both backstroke events. Few months later at the European Championships she won three gold medals and set World records in the 100 m and 200 m backstroke event. , At the 1992 Summer Olympics she won three individual gold medals, becoming the only female athlete at the Games to do so. The next year at the European Championships she competed in the 200 m butterfly for the first time and went on to win four gold medals also winning the 400 m medley and the 100 m and 200 m backstroke. , In 1994, she announced that she would retire after the World Championships in Rome which was overshadowed by the suspicious Chinese swimmers' performances. China won 12 of the 16 women's titles, however these achievements were sullied less than a month later when seven Chinese swimmers tested positive for banned drugs at the Asian Games in Hiroshima.    In Rome, Egerszegi lost on 100 m and 200 m backstroke, the events were won by He Cihong ,who was only 13th (1:03.50!) on 100 m backstroke 2 years earlier in Barcelona, where Egerszegi won with an Olympic record time (1:00.68). In 1996, at the Olympic Games in Atlanta, He Cihong was 25th on the 100 m backstroke. On the 200 m backstroke,He Cihong qualified for nor Barcelona, neither Atlanta; both Olympic golds won by Egerszegi. After getting fifth place in the 100 m backstroke and coming second in the 200 m backstroke, Egerszegi decided to compete for two more years, citing the two defeats as the main reason. , She competed at the 1995 European Aquatics Championships where she won the last two of her nine European titles in the 400 m medley and the 200 m backstroke event. For the first time, she competed in the 4x100 m medley relay where one of her teammates was a young Ágnes Kovács , a future Olympic champion. They came second and Egerszegi has named this silver medal as 'the one that made her the happiest'. She decided not to compete in the 100 m backstroke even though her time of 1:00.93 clocked during the 4x100 m relay final was better than Mette Jacobsen 's winning time of 1:02.46 by almost two seconds. , At the 1996 Summer Olympics she won her first and only Olympic bronze medal in the 400 m medley and went on to win the 200 m backstroke becoming the second of only three swimmers in Olympic history (Dawn Fraser and Michael Phelps being the other two) to win gold for the same event at three successive Olympics (200 m backstroke: 1988, 1992, 1996). Between the winning time of Egerszegi(2:07.83) and time of the runner-up Whitney Hedgepeth (2:11.98), the margin of victory was 4.15 seconds, which is the greatest in any women's 200m event in the swimming history! In 1996, Egerszegi did not enter the 100m backstroke, however her leadoff backstroke time in the medley relay, 1:01.15, was faster than the winning time in the 100m backstroke final.  , Between 1988 and 1996 she won 5 individual Olympic gold medals , which was a record for a swimmer for individual gold medal wins. This record has since been broken by Michael Phelps , who has to date won 11 individual gold medals. Egerszegi still holds the record with 5 individual Olympic gold medals as the most of any female swimmers in the history of the sport. , Egerszegi announced her retirement from swimming soon after the Olympic games, at the age of only 22. In the same year, she became the board member of the Hungarian Swimming Association and in 2007 the member of the Hungarian Olympic Committee. , Her 1988 winning in Seoul became one of the biggest TV-moments in Hungary. The famous phrase \"Come on Little Mouse! Come on little girl!\" (\"Gyerünk Egérke! Gyerünk kicsi lány!\") by Tamás Vitray, who was the speaker on the air, is part of the popular culture. Egerszegi is still regarded as the role model of the \"champion\" in the country. , Her nickname was \"Egérke\" (\"Little Mouse\") or \"Egér\" (\"Mouse\"), a play on her surname, because of her youthfulness and size. After the 1992 Summer Olympics , where she was the most won three individual gold medals and became the only female athlete at the Games to do so, she was called as Krisztina Királynő (\"Queen Kristina\") both in the Hungarian and in some international media. , In 1993, László Ládonyi and György Volly published a biographical book \"Egerszegi\" about her career. , In 2000, a documentary film called Egerszegi was made about her swimming career.  , She was inducted into the International Swimming Hall of Fame in 2001.  She was named Hungarian Sportswoman of the Year on a record-breaking seven occasions (1988, 1989, 1990, 1991, 1992, 1993 and 1996) and Female World Swimmer of the Year three times. , Krisztina Egerszegi, one of the most prominent FINA athletes of all times, was awarded the Olympic Order on June 23, 2001, during the celebration of the Olympic Day by the International Olympic Committee (IOC) in Lausanne (SUI). , On August 20, 2013, Krisztina Egerszegi has been awarded with the highest State Order of Hungary, the Order of Saint Stephen Hungary Medal by the President of the Republic of Hungary János Áder in the Sándor Palace in Budapest.  , , "
}
