{
  "category": "swimming",
  "article": "Lisbeth \"Libby\" Constance Trickett , OAM (born 28 January 1985), née Lisbeth Constance Lenton , is an Australian competition swimmer. She was a gold medallist at the 2004 Summer Olympics , the 2008 Summer Olympics and the 2012 Summer Olympics . She is the world record holder in the short-course (25m) 100 metres freestyle. , , , Trickett was educated at Somerville House . She married swimmer Luke Trickett among scenes of tight security at Taronga Zoo on Sydney Harbour on 7 April 2007. The couple entered via a \"walking tent\", due to the exclusive photo deal the couple had with women's magazine New Idea .  The couple revealed later they split the photo profits between three charities.  In March 2015, the couple announced that they were expecting their first child, due in September, after suffering a miscarriage in August 2014.  , She changed to swimming under her married name at the Australian 2008 Olympic selection trials.  , On 9 September 2009 she announced that she would take an extended break from swimming and consider retirement. On 14 December 2009 she retired from swimming at the age of 24.  In September 2010, she announced that she would be returning to competition.  , Trickett emerged on the world scene in March 2003 at the Australian championships, by July she was a medal contender in multiple events at the 2003 World Championships in Barcelona. , At the 2003 World Championships, Trickett picked up her first individual medal on the international level in the 50 m freestyle capturing the bronze medal, while placing 5th in the 100 m freestyle, 14th in the 50 m and 19th over the 100 m butterfly, her individual inconsistency came to an end when she won another bronze in the 4×100 m freestyle relay. Her fastest 100 m freestyle sprint in which she set in the lead off leg in the relay would have captured herself another bronze in the individual 100 m freestyle. , Trickett is currently employed by Megaport - an Australian dark fiber carrier - as a National Channel and Partner Manager  , Trickett was also a bronze medalist in the women's 50 m freestyle . She had previously been the holder of the 100 m freestyle world record (53.66) set at the Olympic swimming trials held in Sydney, Australia on 31 March 2004, but lost this to teammate Jodie Henry (53.52) during the semi finals of the event at the 2004 Athens Olympics. , In July 2005, at the FINA World Championships in Montreal, Canada, Trickett was one of the form swimmers of the meet. She won the 50 m freestyle in a time of 24.59 to record her maiden championship at international level. She also achieved a silver medal in the 100 m butterfly (57.37). She was a member of three relay teams, the 4×100 metre freestyle relay, 4×100 metre medley relay, and the 4×200 metre freestyle relay teams, winning gold (3:37.22), gold (3:57.47) and silver (7:54.00) in the respective events. Fairly new to the 200 m freestyle event, Trickett got recorded the then fourth fastest time in history clocking 1:57.06 as lead-off swimmer in the final of the 4×200 m freestyle relay. The time being more than 1.5 seconds faster than the individual gold medallist Solenne Figuès (1.58.60) (France). Trickett did not compete in the individual 100 m freestyle because she placed third in the event at the Australian championship, but her 100 m freestyle split times were faster than the individual 100 m freestyle gold medalist and world record holder Jodie Henry, which earned her the honor of swimming in the final of the medley relay. Despite not competing in the individual 100 m and 200 m freestyle), she did finish 2005 ranked number one in the world in both events. , On returning to Australia, Trickett continued her rich vein of form, lowering the 100 m short course freestyle world record on consecutive nights at the Australian Short Course Championships to 51.70 s. , 2005 brought a further world record in the short-course 200 m freestyle at the Sydney , Australia stop of the 2005 FINA World Cup series (Sydney – 19 November) with Trickett recording a time of 1:53.29 to beat the previous record by 0.75 seconds. , However, Trickett regained her 100 m freestyle world record on 31 January 2006 at the Australian Championships in Melbourne. Her time of 53.42 was 0.1 sec faster than the previous record held by Henry. On 2 August 2006, German swimmer Britta Steffen broke Trickett's 100 m freestyle world record at the 2006 European Championships in Budapest, Hungary, with a time of 53.30. Trickett again regained the world record with a time of 52.88 on 27 March 2008 at the 100 m finals of the Australian Olympic Trials. She is the current 100 m freestyle and 50 m freestyle world record holder. , At the 2006 Commonwealth Games she won silver medals in the women's 100 m butterfly and 200 m freestyle events. She defeated Henry to claim the 50 m and 100 m freestyle, and was a part of the winning 4×200 m and 4×100 m freestyle relay teams, as well as breaking the world record in the 4×100 m medley relay, where her split of 52.87 s eclipsed the previous best by Henry. She took 5 of Australia's 12 gold medals in the 2006 Short Course World Championships in Shanghai, being named the leading female swimmer of the meet. , In the latter part of 2006, Trickett won four titles at the Australian Short Course Nationals – both the 50 m and 100 m freestyle and butterfly events. More commonly known for her freestyle expertise, she set a new Australian and Commonwealth record in the 50 m butterfly and a new world record for the 100 m butterfly. , On 26 March, Trickett added another gold by winning the women's 100 m butterfly in a championship record time – 57.15 seconds – touching the wall just 0.09 seconds ahead of her second-placed team-mate Jessicah Schipper and American Natalie Coughlin . Then, on 1 April, she won another gold by an amazing nine one-hundredths of a second. , Shortly following the 2007 World Championships, on 3 April, at the biannual Duel in the Pool meet between Australia and the USA swimming teams (in Sydney, Australia in 2007), she swam a 100 m freestyle in 52.99, well under the existing world record of 53.30 by Germany's Britta Steffen, and making her the first woman under 53 seconds in a long-course (50 m) pool. The time was not accepted by FINA as the world record, because the race the time was swum in is not, itself, a recognized FINA event according to the ruling. , Trickett went on to officially break the record in a time of 52.88 s on 27 March 2008 in the 100 m finals of the Australian Olympic Trials.  Two days later on 29 March 2008 she broke the world record for the 50 m freestyle finals in the Australian Olympic Trials with a time of 23.97, taking 0.12 seconds off the previous record and being the first women to be under the 24 second barrier.  , At the Beijing Olympics, Trickett's first final was the 4×100 m freestyle capturing a bronze medal, despite setting a new Australian record. Her next final was the 100 m butterfly in which she captured Gold setting a new Australian record, making her the second fastest in that event in history. Trickett's next event was the 100 m freestyle, where she was the world record holder. Trickett was ahead of world record pace in the first 50 m but was overtaken in the last few meters by rival Britta Steffen who captured the gold. Trickett later contested the 50 m freestyle (another event she was the world record holder) but did not get on the podium finishing just outside the medals in fourth. In what seemed to be a terrible Olympics for Trickett, things finally turned when her last event was the 4×100 m medley relay. In what was a competitive race at early on, turned in the Aussies favor down the stretch as they captured gold and a new world record. , After the Olympics Trickett split with Widmar, who had coached her from before she made her debut for Australia. Trickett said that she needed a change to rejuvenate her. She joined the Sopac Swim Club under Grant Stoelwinder in Sydney. Stoelwinder is a sprint coach and currently mentors Eamon Sullivan . , Trickett had a great start to the 2009 World Championships, capturing bronze in the 4×100 m freestyle relay, setting an Australian record in the lead off. Her next individual performances were somewhat anti-climactic, in the 100 m freestyle she finished with another bronze and finished 5th in the 50 m Freestyle. and the final night she anchored the medley relay to a silver. , After retiring in December 2009, she announced her return to swimming in September 2010. At the 2012 Olympic Trials she narrowly missed a berth in the 100 m butterfly finishing 3rd. Later on in the meet she finished 5th in the 100 m freestyle, booking a spot on the 4 × 100m freestyle relay. , Trickett raced the heats of the 4 × 100 m freestyle relay team, Australia went on to win gold in the final setting a new Olympic record, she took the 4th Olympic gold of her career. "
}
