{
  "category": "swimming",
  "article": "Mark Andrew Spitz (born February 10, 1950) is an American former competition swimmer , nine-time Olympic champion, and former world record-holder in seven events. He won seven gold medals at the 1972 Summer Olympics in Munich, an achievement surpassed only by Michael Phelps , who won eight golds at the 2008 Summer Olympics in Beijing. Spitz set new world records in all seven events in which he competed in 1972, a record that still stands. Since the year 1900, no other swimmer has gained so great a percentage of all the medals awarded for Olympic events held in a single Games. , Between 1968 and 1972, Spitz won nine Olympic golds plus a silver and a bronze, five Pan American golds, 31 Amateur Athletic Union (AAU) titles, and eight National Collegiate Athletic Association (NCAA) titles. During those years, he set 35 world records, but two were in trials and unofficial.   With his seven-gold medal performance at Munich in 1972, he was the most decorated athlete in the history of the Olympic Games until Michael Phelp's eight-gold medal performance at Beijing 36 years later in 2008. He was named World Swimmer of the Year in 1969, 1971 and 1972 by Swimming World Magazine . He was the third athlete to win nine Olympic gold medals . , , , Spitz was born in Modesto, California , the first of three children  of Arnold and Lenore (Smith) Spitz. His family is Jewish, the grandparents left Hungary after World War II.    When he was two years old, Spitz's family moved to Honolulu, Hawaii, where he swam at Waikiki beach every day. \"You should have seen that little boy dash into the ocean. He'd run like he was trying to commit suicide.\" Lenore Spitz told a reporter for Time (April 12, 1968).  At age six his family returned to Sacramento, California , and he began to compete at his local swim club. At age nine, he was training at Arden Hills Swim Club in Sacramento with swimming coach Sherm Chavoor , who mentored seven Olympic medal winners including Spitz. , Before he was 10, Spitz held 17 national age-group records, and one world record. [ citation needed ] At 14 his family moved to Santa Clara so Spitz could train with coach George F. Haines of the Santa Clara Swim Club . From 1964 to 1968 Mark trained with Haines at SCHS and Santa Clara High School . During his four years there, Mark held national high school records in every stroke and in every distance [ citation needed ] . It was a remarkable and unprecedented achievement. In 1966 at age 16 he won the 100-meter butterfly at the AAU national championships, the first of his 24 AAU titles. The following year Mark set his first world record at a small California meet in the 400-meter freestyle with a time of 4:10.60, and emerged on the world swimming stage.  , The 1965 Maccabiah Games was his first international competition. At age 15 in Tel Aviv, Spitz, won four gold medals and was named the most outstanding athlete.  , He returned to Israel in 1969 following the Mexico Olympics to again compete in the Maccabiah Games. This time he won six gold medals.  He was again named outstanding athlete of the Games.  , In 1985 Spitz lit a torch to open the Maccabiah Games.  , In 2005 he was a member of the U.S. delegation at the 17th Maccabiah Games. He spoke at the JCC Maccabiah Games Opening Ceremonies, which was held in Richmond, Virginia. The Weinstein JCC in Richmond was one of the Host JCC's for the 2005 games with over 1,000 teenagers participating in various sports, including swimming. , In 1967 he won five gold medals at the 1967 Pan American Games , thereby setting a record that lasted until 2007 when Brazilian swimmer, Thiago Pereira , won six golds at the XV Pan American Games in Rio de Janeiro. , Holder of ten world records already, Spitz predicted brashly he would win six golds at the 1968 Summer Olympics in Mexico City. However, he won only two team golds: the 4×100-meter freestyle relay in 3:31.70, and the 4×200-meter freestyle relay in 7:52.33.  In addition, Spitz finished second in the 100-meter butterfly in 56.40 seconds. In this event he was beaten by fellow American Doug Russell by a half second, despite holding the world record and having beaten Russell the previous ten times they had swum against each other that year.  Russell did briefly match Spitz's world record in late August 1967, holding the record equally with Spitz for five days before Spitz regained it solely on October 2, 1967. As a result of being beaten by Russell, Spitz did not get to swim in the 4×100-meter medley relay, which gave Russell his second gold medal and the USA team another world record performance. , Disappointed in his 1968 Olympic performance, Spitz decided in January 1969 to attend Indiana University  to train with legendary Indiana Hoosiers swimming coach Doc Counsilman ,  who was also his Olympic coach in Mexico City. He called choosing Indiana and Counsilman \"the biggest decision of my life (and) the best.\"  While at Indiana, Spitz won eight individual NCAA titles. In 1971 he won the James E. Sullivan Award as the top amateur athlete in the United States. Spitz also set a number of world records during the U.S. Olympic Swim Trials held in Chicago's Portage Park in 1972. , He was nicknamed \"Mark the Shark\" by his teammates. , At the 1972 Summer Olympics in Munich (West Germany), Spitz was back to maintain his bid for the six gold medals. He did even more, winning seven Olympic gold medals. Further, Spitz set a new world record in each of the seven events – 100-meter freestyle (51.22), 200-meter freestyle (1:52.78), 100-meter butterfly (54.27), 200-meter butterfly (2:00.70), 4×100-meter freestyle relay (3:26.42), 4x200-meter freestyle relay (7:35.78), and 4×100-meter medley relay (3:48.16). Originally Spitz was reluctant to swim the 100-meter freestyle fearing a less than gold medal finish. Minutes before the race he confessed on the pool deck to ABC 's Donna de Varona , \"I know I say I don't want to swim before every event but this time I'm serious. If I swim six and win six, I'll be a hero. If I swim seven and win six, I'll be a failure.\" Spitz won by half a stroke in a world-record time of 51.22 seconds.  , Spitz is one of five Olympians to win nine or more career gold medals : Larisa Latynina , Paavo Nurmi and Carl Lewis also have nine;  only swimmer Michael Phelps has won more with 18.  Spitz's record of seven gold medals in a single Olympics was not surpassed until Michael Phelps at the 2008 Summer Olympics . , During the Munich Massacre by Palestinian terrorists in the 1972 Olympics, Israeli racewalker Shaul Ladany awakened and alerted American track coach Bill Bowerman , who called for the U.S. Marines to come and protect American Jewish Olympians swimmer Spitz and javelin thrower Bill Schmidt .      , Following the Munich Olympics, Spitz retired from competition even though he was still only 22 years old. , In 1999 Spitz ranked No. 33 on ESPN SportsCentury 50 Greatest Athletes , the only aquatic athlete to make the list.  , At age 41, Spitz attempted a comeback for the 1992 Summer Olympics after film maker Bud Greenspan offered him a million dollars if he succeeded in qualifying. Filmed by Greenspan's cameras, Spitz did not beat the qualifying limit, despite his times being nearly as good as (and in some cases better than) his medal-winning times 20 years earlier. He was two seconds slower than the requisite qualifying time at the Olympic trials. Dara Torres made her successful Olympic comeback for the 2008 Summer Games, at the same age as Spitz. , After his retirement from competitive swimming at age 22, he was managed by the William Morris Agency , which tried to get him into show business while his name was still familiar due to his athletic success. , A poster featuring Spitz wearing his swimsuit and seven gold medals made him the hottest pin-up since Betty Grable .  , In 1973–74, Spitz appeared on TV's The Tonight Show Starring Johnny Carson and The Sonny and Cher Comedy Hour . On the TV drama Emergency! , he portrayed Pete Barlow, who accidentally shoots his wife (played by Spitz's wife, Suzy). He also appeared briefly on the The Dean Martin Celebrity Roast of then-Governor of California Ronald Reagan in September 1973. , Spitz went to work for ABC Sports in 1976 and worked on many sports presentations, including coverage of the 1976 Summer Olympics in Montreal and the 1984 Summer Olympics in Los Angeles.  In 1985 he appeared as a TV announcer in Challenge of a Lifetime . He continued as a broadcaster for some time, but within a few years, he was hardly seen as a public figure  except perhaps as a commentator for swimming events like the 2004 Summer Olympics . Instead Spitz focused on his real estate company in Beverly Hills and hobbies such as sailing.  , In 2006 he received critical praise [ citation needed ] for his narration of Freedom's Fury , a Hungarian documentary about the Olympic water polo team's famous Blood in the Water match against Russia during the Revolution of 1956 —considered the most famous match in water polo history . The film was executive produced by Quentin Tarantino and Lucy Liu , and made its debut at the Tribeca Film Festival . , He appeared in an ad for the California Milk Advisory Board. One of his print advertisements featured the caption \"I always drink it-is something I like to do. I want to be loved by the mothers.\" , In 1974 he was in a number of Schick razors commercials.  In 1998 he appeared with Evel Knievel in a TV commercial for PlayStation . , In 2004 he appeared in a TV commercial for Sprint PCS.  Then in November 2007, Spitz made a cameo appearance on Amanda Beard 's first television commercial (for GoDaddy) featuring her own seven Olympic medals (won between 1996–2004). The ad was entitled \"Shock\".  Also, in 2007 he appeared in the infomercial for the \"Orbitrek Elite\" fitness workout.  , He appeared in a commercial for Lear Capital, a gold investment company. (at 8:13 and 15:42 on a video at http://www.stanpredicts.com/media.php dated February 12, 2011, but the commercial was edited out of the version labeled \"Episode 1: Will Massive Amount [ sic ] Of Oil Be Discovered In Israel?\") , In 2012 Spitz appeared in a commercial for Ageless Male, a testosterone supplement. , When Spitz returned from the Olympics, he began dating Suzy Weiner, a UCLA theater student and part-time model, who also was the daughter of one of his father's business acquaintances.   Less than a year after the Munich Olympics, they were married on May 6, 1973,  in a traditional Jewish service at the Beverly Hills Hotel.  They have two sons, Matthew (born October 1981) and Justin (born September 1991). Justin currently will be a senior at Stanford University , and was a member of the swim team.    , From 1964 to 1968 Spitz attended Santa Clara High School. [ citation needed ] After graduating he went on to Indiana University .  At Indiana University from 1968 to 1972, he was a pre-dental student and member of Phi Kappa Psi Fraternity. Time magazine asked him if he wanted to return to dental school after the Olympics. \"I always wanted to be a dentist from the time I was in high school, and I was accepted to dental school in the spring of 1972. I was planning to go, but after the Olympics there were other opportunities. I did some television and speaking engagements, and things just went from there.\"  , In 1972, soon after his return to the United States, Spitz landed several lucrative corporate endorsement contracts. He earned about $7 million in a two-year period.  However, as the memory of his feats receded, so did his endorsement and promotional deals. As his endorsements faded he started a successful real-estate company in Beverly Hills. He bought a Ferrari and says he made more than $1 million. [ citation needed ] \"A million dollars in 1972 would be equivalent to more than $10 million today,\" Spitz said. \"I did very well, thank you very much.\"  \"I would say I was a pioneer. There wasn't anyone who'd gone to the Olympics before me who capitalized the same way on opportunity. It depends on timing, it depends on hype, it depends on the economy, and most importantly, it depends on looks. I mean, I've never seen a magazine of uglies. That's our society. I'm not saying it's right. That's just the facts.\"  , Per his official website, Spitz is self-employed as a corporate spokesperson and motivational speaker. However, Sports Yahoo! lists his occupation as a stock broker and motivational speaker.  According to a recent interview \"Spitz became a stockbroker in 2002 and has since moved into private equity. He is now also dabbling in the \"water business,\" as he calls it, and is in negotiations to build a water-bottling facility on aquifer-rich land that he and a business partner own.  , He has pursued various entrepreneurial projects with former NBA player Rick Barry . He travels the world delivering about 25 lectures a year. His biography, The Extraordinary Life of An Olympic Champion by Richard J. Foster, was released in July 2008.  , In July 2012 he endorsed Istanbul 's bid to host the 2020 Summer Olympics .  , His hobbies include sailing, skiing and collecting art.  (Print) , In an era when other swimmers, male and female, were shaving body hair, he swam with a moustache. When asked why he initially grew one he stated \"I grew the moustache because a coach in college said I couldn't grow one.\"  Spitz said he originally grew the moustache as a form of rebellion against the clean-cut look imposed on him in college. \"It took a long time to grow,\" he said.  It took four months to grow, but Spitz was proud of it, he decided the moustache was a \"good-luck piece.\"  , Mark Spitz is quoted as saying, \"When I went to the Olympics, I had every intention of shaving the moustache off, but I realized I was getting so many comments about it—and everybody was talking about it—that I decided to keep it. I had some fun with a Russian coach who asked me if my moustache slowed me down. I said, 'No, as a matter of fact, it deflects water away from my mouth, allows my rear end to rise and make me bullet-shaped in the water, and that's what had allowed me to swim so great.' He's translating as fast as he can for the other coaches, and the following year every Russian male swimmer had a moustache.\"  , According to a Sports Illustrated article, on February 14, 1988, after talking about shaving off his moustache for a year, he finally did. \"He looked great with it, don't get me wrong,\" explained his wife Suzy, \"but he looks so handsome without it.\"  , When he was asked why he shaved it off he responded \"well, one, I'm not swimming anymore; two, it started to turn gray; and three, my wife had never seen me, nor my family, without the moustache . . . I'm happy [without it].\"  He also commented on his moustache in a live, in-studio interview with KCRA host Mike TeSelle on June 14, 2008, Spitz commented that he no longer maintains his iconic moustache because it had become \"too gray.\" , After retirement, Spitz was diagnosed with acid reflux disease , a condition from which his physician thinks he suffered throughout his career.  \"During my Olympic training, I attributed the symptoms [of acid reflux] to an overexposure to chlorine and eating too soon before and after swimming,\" says Spitz. \"It wasn't until the symptoms began to get in the way of my 1976 Olympic broadcasting career in Montreal, which was four years after retirement that I suspected something more serious must be happening.\" , He has also reported having high cholesterol and other chronic health issues.  \"People don't believe that I have high cholesterol, but it's a fact,\" said Spitz. \"I take medication every day because my doctor told me that diet and exercise are not enough to keep my cholesterol down.\" He is a paid spokesperson for Medco , a pharmacy benefit management company.  , In 1972, Spitz was accused of product placement during the medal ceremony. Following the 200-meter freestyle race Spitz arrived to obtain his gold medal barefoot and carrying his shoes. He put them down when the American national anthem, \"The Star Spangled Banner\" was played. After the anthem played, he picked up his shoes and waved to the crowd. The Soviets saw this as product placement. When questioned by the IOC, Spitz explained that the gesture was innocent, the shoes were old and he was not paid. The IOC cleared him of any wrongdoing.  , Spitz felt snubbed by not being asked to attend the 2008 Summer Olympics to watch Michael Phelps attempt to break his seven gold medal record. In an article, he is quoted as saying, \"I never got invited. You don't go to the Olympics just to say, I am going to go. Especially because of who I am. . . . I am going to sit there and watch Michael Phelps break my record anonymously? That's almost demeaning to me. It is not almost—it is.\"  , Spitz has stated that he has no hard feelings towards Phelps. He is, however, unhappy that he was not invited to the 2008 Summer Olympics. As a result, Spitz refused to attend the games.  \"They voted me one of the top five Olympians of all time. Some of them are dead. But they invited the other ones to go to the Olympics, but not me,\" he said. \"Yes, I am a bit upset about it.\"  , However, on August 14, 2008 Spitz appeared on NBC's Today Show where he clarified his statement and his pride in Michael Phelps: , It's about time that somebody else takes the throne. And I'm very happy for him. I really, truly am...I was working with a corporate sponsor who elected not to bring their US contingent over to China, and they piled on more work for me here in the United States, which was great. So I wasn't able to get to the Olympics and watch Michael in the first couple of days. And they thought, some of these reporters, that I was supposed to be invited by some entity, and I told them that that wasn't really the case, that doesn't happen that way. And so, I'm sort of disappointed that I wasn't there, but, you know, that interview somehow took a different turn, and I've done hundreds and hundreds of them and I've been true to form about the way I feel about Michael, and he's doing a great job for the United States and inspiring a lot of great performances by the other team members.  , Also on August 14, 2008, in an interview aired on Los Angeles KNBC-4's morning news show, Today in L.A. , Spitz was quoted saying he does believe that, \"Michael Phelps is the greatest Olympic athlete ever.\"  , On August 15, 2008, as part of an interview on NBC, Spitz said that he felt Phelps' performance in the 100 fly in Beijing was \"epic\". Spitz paid this compliment to Phelps just two hours after his record-tying seventh gold medal during a live joint interview with Bob Costas : , You know, Bob and Michael, I wondered what I was going to say at this monumental time, when it would happen and who I would say it to, and of course I thought I was going to say it to you for some time now. But, it's the word that comes to mind, \"epic\". What you did tonight was epic, and it was epic for the whole world to see how great you really are. I never thought for one moment that you were out of that race and contention, because I watched you at Athens win the race by similar margins, and 18 months ago at the World's by similar margins. And, you know, that is a tribute to your greatness. And now the whole world knows. We are so proud of you Michael here in America, and we are so proud of you and the way that you handle yourself, and you represent such an inspiration to all the youngsters around the world. You know, you weren't born when I did what I did, and I'm sure that I was a part of your inspiration, and I take that as a full compliment. And they say that you judge one's character by the company you keep, and I'm happy to keep company with you. And you have a tremendous responsibility for all those people that you are going to inspire over the next number of years, and I know that you will wear the crown well. Congratulations, Mike.  , On April 18, 2015 at the Laureus World Sports Awards Ceremony in Shanghai Spitz said he had been sent an email posted by Omega that had said Phelps had lost the 100m butterfly final. He also said that Phelps is still the greatest swimmer in the world, with or without that medal.  , Mark Spitz has been consistent in criticism of both swimming's world bodies, FINA and the IOC, in their incomplete attempts to keep drugs out of the sport. He has felt that not enough has been done to monitor and encourage drug-free participation. In 1998 he criticized FINA for its \"embarrassing\" attempts to stamp out drug abuse, urging them to test for all known drugs. In September 1999 Spitz said the IOC had the technology to test for a plethora of drugs but was refusing to do so because of some IOC member protests.  , During a radio interview in Australia, Spitz was quoted as saying \"They don't want to test for everything because there's tremendous pressure from the television networks because they want the television to have athletic competitions with the world record holders there for the finals. They want the medals not to be tainted in their value of accomplishment by winning them, and it's all about ratings and commercial selling of time and about money. And an International Olympic Committee has got their hand in the pockets of the network television people, so there's a tremendous conflict of interest in what they should do and what they're doing.\"  , In August 2008, the Los Angeles Times reported, that Spitz continued to discuss drug testing and was saying \"the IOC has sponsors who demand a good show. Television pays the IOC for the rights to that good show, and its sponsors want that too. Drug news and drug distractions are not a good show. People are not going to tune in to see athletes have their medals taken away from them.\"  , , "
}
