{
  "category": "swimming",
  "article": "Matthew Nicholas Biondi (born October 8, 1965) is an American former competition swimmer , eleven-time Olympic medalist, and former world record-holder in five events. Biondi competed in the Summer Olympic Games in 1984 , 1988 and 1992 , winning a total of eleven medals (eight gold, two silver and one bronze). During his career, he set thee individual world records in the 50-meter freestyle and four in the 100-meter freestyle. , At the 1988 Olympic Games in Seoul, Biondi won five gold medals, setting world records in the 50-meter freestyle and three relay events. , Biondi is a member of the International Swimming Hall of Fame and the United States Olympic Hall of Fame . , , , Biondi started his aquatics career as a swimmer and water polo player in his hometown of Moraga, California . As he moved into his teens, his incredible abilities as a sprint swimmer began to emerge. Though he did not start swimming year-round until he started at Campolindo High School , by his senior year Biondi was the top schoolboy sprinter in America with a national high school record of 20.40 seconds in the 50-yard freestyle. He accepted a scholarship to attend the University of California, Berkeley , to swim and play water polo, and enrolled in 1983. In his freshman year, he played on Berkeley's NCAA championship water polo team, and made the consolation finals at the 1984 NCAA swimming championships. , In the summer of 1984, Biondi surprised the swimming community by qualifying for a spot on the U.S. 4×100 meter freestyle relay at the 1984 Los Angeles Olympics . The team won the gold medal in a world record time. Upon returning to Berkeley, Biondi once again played on an NCAA champion water polo team in the fall, and during in the winter of 1985, he won the first of his eight individual swimming titles at the NCAA championships. , Biondi was selected as the NCAA Swimmer of the Year in 1985, 1986, and 1987, and he set several American and NCAA records. , Biondi set the first of his twelve individual swimming world records in 1985. He was the first man to swim the 100-meter freestyle faster than 49 seconds, and by 1988 he owned the ten fastest times swum in that event. He won a total 24 U.S. Championships in the 50, 100, and 200 meter freestyle events, as well as the 100 butterfly. In two World Championships (1986 and 1991), Biondi won 11 medals including six gold. During his career, he was a finalist for the James E. Sullivan Award , the UPI Sportsman of the Year, the U.S. Olympic Committee Sportsman of the Year, and selected twice as the Swimming World magazine Male Swimmer of the World, in 1986 and 1988. , Biondi was involved in perhaps one of the oddest defeats of any competitor at the 1988 Seoul Olympics . In the 100-meter butterfly final race, he was caught between strokes as he approached the finishing wall. He chose to glide rather than take another stroke, and Biondi was edged out by Anthony Nesty of Surinam by just one one-hundredth (0.01) of second. , Biondi still won five gold medals, one silver medal, and one bronze medal in the 1988 Olympics, breaking the world records in four of those victories: three in relay races, and one in the 50 meter freestyle , taking just 22.14 seconds for this swim. This was the third time that he had broken or equalled the existing 50 meter freestyle world record.   , Biondi's time in the 100 meter freestyle final was the only swim below 49.00 seconds of the competition, and he set a new Olympic record of 48.63 seconds, the second fastest swim at this distance in history.  , At the 1992 Olympics in Barcelona, Biondi won two more gold medals in relays and a silver in the 50 meter freestyle. , Biondi competed at the World Championships in 1986 and 1991, winning six gold medals. , In 1986, he won three gold medals, one silver and three bronzes to set a record of seven medals at one World Championship meet. (This record has since been matched by Michael Phelps .) , Biondi graduated from the University of California, Berkeley , in 1988 with a Bachelor of Arts degree in Political Economy of Industrialized Societies (PEIS). , Biondi married Kirsten Metzger in her home state of Hawaii in 1995. They have three children: their sons Nathaniel (Nate), born in 1998, and Lucas, born in 2002; and their daughter Makena, born in 2007. , Kirsten Biondi persuaded her husband to continue his education, and he earned his master's degree in education in 2000 at Lewis and Clark College in Portland, Oregon.  , In recent years, Biondi has worked as a school teacher and swimming coach in Hawaii. As of 2012, he has been hired to teach math and coach at Sierra Canyon School in the Los Angeles neighborhood of Chatsworth .  , Biondi has become active within the masters swimming community, launching an annual masters competition that bears his name. The Matt Biondi Masters Classic was held for the first time on March 24, 2014, in Simi Valley, California. The competition is a one-day, short course yards meet held in conjunction with Biondi's masters club, the Conejo Valley Multisport Masters.  , , "
}
