{
  "category": "swimming",
  "article": "Petria Ann Thomas , OAM (born 25 August 1975) is an Australian swimmer and Olympic gold medallist and a winner of 15 national titles. She was born in Lismore, New South Wales , and grew up in the nearby town of Mullumbimby . , , , In 1993, at the age of 17, Thomas won a bronze medal in the 200-metre butterfly at the World Short Course Championships. She followed this with two gold medals, in the 100-metre butterfly and 4x100-metre freestyle in the 1994 Commonwealth Games in Victoria, Canada. However, she then struggled for two years, until making a comeback at the 1996 Summer Olympics in Atlanta in 1996. She won a silver medal, finishing second to fellow Australian Susie O'Neill . , Despite being plagued by a shoulder injury, Thomas repeated her 1994 Commonwealth Games effort at the 1998 Games in Kuala Lumpur . She also won a bronze in the 100-metre butterfly and a silver in the 200-metre at the World Championships in Perth, the same year. She had similar success at the 2000 Summer Olympics in Sydney in 2000, winning three medals - bronze in the 200-metre butterfly, silver in the 4x100-metre medley, and silver in the 4x200-metre freestyle. , Thomas had always struggled to surpass O'Neill, despite being talented in her own right. However, after the 2000 games, O'Neill retired, and Thomas, despite battling recurring injuries, decided to continue. The decision paid off when she won three gold medals at the 2001 World Championships in Fukuoka, Japan. She won both the 100-metre and 200-metre butterfly, and then was part of the winning 4x100-metre medley relay team. She was also part of the 4x200-metre freestyle relay team, which completed the race first, but they were disqualified when Thomas jumped in the pool to celebrate before the other competitors had completed the race. , At the 2002 Commonwealth Games , Thomas won five gold, one silver and one bronze medals. While being one of the pinnacles of her career, her victory also made her the first female swimmer ever to win the same event at three consecutive Commonwealth Games - the 100-metre butterfly. She followed this with three gold and two silver medals at the 2002 Pan Pacific Championships in Yokohama, Japan. At the short-course championships in Moscow, Russia, Thomas managed to win another gold medal in her pet event, the 200-metre butterfly. However, injuries forced her out of competition soon afterwards, and she had to spend much of 2003 recovering from yet another shoulder reconstruction. , In 2004, Thomas made another comeback at the Olympic selection trials in Sydney while training with the Ginninderra Swimming Club . She broke the Commonwealth records in the 50-metre and 100-metre butterfly, set new personal best times in the 100-metre freestyle, 200-metre freestyle and narrowly missed the world record in the 200-metre butterfly. , After having missed out on first place in 1996 and 2000, Thomas finally managed to achieve gold at the 2004 Summer Olympics in Athens. She won the individual 100-metre butterfly, and was a part of two world record setting teams in the 4x100-metre freestyle and 4x100-metre medley relays. She was subsequently chosen to carry the Australian flag at the closing ceremony. Thomas announced her retirement from competitive swimming at the conclusion of the games. , In mid-2005, Thomas released an autobiography, Swimming Against The Tide , in which she describes her career, including her experiences with depression and injuries. , Thomas was inducted into the Australian Institute of Sport Swimming Hall of Fame in 1996, and was crowned the AIS Athlete of the Year in 2001 (with gymnast Philippe Rizzo ) and 2002 and in 2006 inducted in the AIS 'Best of the Best'. She was inducted into the Sport Australia Hall of Fame in 2007.  , She currently resides in Amaroo , Canberra , with her husband, Julian Jones , the head strength and conditioning coach at the AIS. They have two children. "
}
