{
  "category": "swimming",
  "article": "Roland Matthes (born 17 November 1950) is a retired German swimmer and the most successful backstroke swimmer of all times. Between April 1967 and August 1974 he won all backstroke competitions he entered. He won four European championships and three world championships in a row, and swam 19 world and 21 European records in various backstroke, butterfly, freestyle and medley events.   He was trained by Marlies Grohe.  , As an Olympian in 1968, 1972 and 1976 he won a total of eight medals (four gold, two silver and two bronze): In 1968 and 1972 he won gold in both the 100 m and 200 m backstroke, while in 1976 he was third in the 100 m backstroke. In addition to these individual events, he won the 4×100 m team medley silver in 1968 and 1972, and a bronze medal for the 4×100 m freestyle relay.  , In 1973 in Belgrade he became the first world champion holding the titles in both the 100 m and 200 m backstroke . Additionally he won silver in the 4×100 m medley and bronze in the 4×100 m freestyle relay . Two years later in 1975 he defended his world title in the 100 m backstroke. , At the European championships in 1970 in Barcelona and 1974 in Vienna he won all four titles for the 100 and 200 m backstroke. Additionally, in Barcelona he won the individual silver for the 100 m freestyle, gold with the 4×100 m medley team, and bronze with both the 4×100 and 4×200 m freestyle teams. In Vienna, he also won the individual silver for 100 m butterfly, and bronze with the 4×100 m freestyle team. , He was selected East German Sportspersonality of the Year seven times, in 1967–1971, 1973 and 1975. In 1981 he was inducted into the International Swimming Hall of Fame .  , From 1970 to 1977 he studied sport sciences at DHfK in Lepizig and from 1978 to 1984 he studied medicine at the University of Jena .  After graduating he worked as orthopedic surgeon. He retired from swimming in 1976, and in May 1978 married Kornelia Ender , a fellow East German Olympic swimmer. They divorced in 1982.    , The issue of doping in East Germany brought into questioning most achievements of East German athletes. However, Matthes denied any involvement in doping, clarifying that his swimming club was too small to be part of the government system.  "
}
