{
  "category": "swimming",
  "article": "Thomas Michael Jager (born October 6, 1964) is an American former competition swimmer . He is five-time Olympic gold medalist in relay events, a two-time World Championship individual gold medalist for the 50-meter freestyle, and a former world record-holder in two events. Jager set the 50-meter freestyle world record on six occasions during his career. He held this record for over ten years from August 1989 to June 2000. , , , Jager attended the University of California, Los Angeles (UCLA), and swam for coach Ron Ballatore 's UCLA Bruins swimming and diving team in National Collegiate Athletic Association (NCAA) competition from 1983 to 1985. He won NCAA individual national championships in the 100-yard freestyle (1983, 1984), the 50-yard freestyle (1984, 1985), and the 100-yard backstroke (1985). In 1984, he was honored as the Pacific-10 Conference Swimmer of the Year. , He was also an eleven-time United States national open champion. , Jager won seven Olympic medals for the United States. He won five gold medals in relay events. He also won an individual silver medal in the 50-meter freestyle in 1988 , and an individual bronze medal in the 50-meter freestyle in 1992 .  , At the World Championships , Jager won gold medals in the 50-meter freestyle in 1986 and 1991. He also won gold medals in the 50-meter freestyle at the Pan Pacific Swimming Championships in 1989 and 1991. , Jager was inducted into the International Swimming Hall of Fame in 2001.  , In 2004, Jager became the head coach of the University of Idaho 's Idaho Vandals women's swim team.  Jager then accepted the head coaching position for the Washington State Cougars swim team at Washington State University in 2011. , Tom is the youngest of a family of swimming siblings. While under a swimming scholarship at the University of Iowa , his eldest sister Diane was an All-American swimmer. His brother Bill qualified for Nationals while in high school and then went on to earn a full swimming scholarship at the University of Illinois . All three siblings went on to work as swimming coaches. , Tom has two sons, Wyatt (born 1996) and Cy (born 1999), both of whom swim for his swimming club, the Gold Medal Swim Club. , , "
}
