{
  "category": "f1",
  "article": "  In progress , The 2015 Formula One season is the 66th season of the Formula One World Championship , a motor racing championship for Formula One cars which is recognised by the sport's governing body, the Fédération Internationale de l'Automobile (FIA), as the highest class of competition for open-wheel racing cars. Twenty-one drivers representing ten teams are contesting each of nineteen scheduled Grands Prix ,  starting in Australia on 15 March and ending in Abu Dhabi on 29 November as they compete for the World Drivers' and World Constructors' championships. , Lewis Hamilton is the defending Drivers' Champion after securing his second title at the 2014 Abu Dhabi Grand Prix .  His team, Mercedes , began the season as the defending Constructors' Champion, having secured its first championship title at the 2014 Russian Grand Prix .  , After eight races, Hamilton leads the Drivers' Championship standings by 10 points from team-mate Nico Rosberg , with Ferrari 's Sebastian Vettel in third. Mercedes leads the Constructors' standings ahead of Ferrari and Williams . , , , The following teams and drivers are signed to take part in the 2015 Formula One World Championship.   , The following nineteen Grands Prix are scheduled to take place in 2015.  , Before the start of the season, Hamilton announced he would not be exercising his option of switching his car number to 1 for 2015, as was his prerogative as reigning World Champion, and would instead race with his career number 44. It was the first season since 1994 , when Alain Prost retired from the sport following his fourth and final World Drivers' Championship title in 1993 , that the field did not contain a number 1 car.  , Following the financial struggles faced by Marussia and Caterham in 2014, the FIA approved the use of 2014-specification chassis in 2015 provided that teams showed cause and received an individual dispensation to compete with their old chassis.  However, a request by Manor Marussia to use their 2014 car was later rejected by the other teams.   Subsequent regulation changes allowed the team to use a modified 2014 chassis which met updated safety and dimensional limits. The car is powered by a 2014 specification Ferrari power unit, with a new chassis to be introduced later in the season.  , Sauber's early season preparations were disrupted by a series of legal challenges from former Caterham driver Giedo van der Garde , who claimed that the team had reneged on a contract to race that was signed in June 2014.  Van der Garde filed a motion with the Supreme Court of Victoria in Australia in an effort to force the team to replace one of their drivers with him at the opening round in Melbourne,  with the court finding in his favour.  Van der Garde later agreed to not participate in the event, with the driver and team settling the dispute for an undisclosed sum to terminate the contract following the first round.  , McLaren's Fernando Alonso was involved in a pre-season testing accident that saw the two-time World Drivers' Champion hospitalised. McLaren claimed the crash was caused by a sudden gust of wind disrupting the car's downforce, while Alonso insisted the crash was caused by his steering wheel locking up.  On doctor's advice, Alonso elected to sit out the opening round in Australia, prompting the team to replace him with Kevin Magnussen for the race.   Alonso was ultimately cleared to race by the second round in Malaysia .  , Mercedes hit the ground running with a 1–2 finish in Australia, resulting in a twenty-eight point lead after just one round, finishing over 30 seconds clear of third place driver Sebastian Vettel, who secured a podium in his first race with Ferrari. Red Bull's Daniel Ricciardo finished a lap down in sixth,  prompting the team to continue to press their frustrations with Renault, as they were forced to use its second of four allotted power units for Ricciardo on the very first day of the season.  The team also voiced its displeasure over the progress Renault has made in terms of power, with team principal Christian Horner stating that the Energy F1-2015 is still 100 horsepower (75 kW) down on Mercedes's PU106B Hybrid.  After the race, Red Bull team advisor Helmut Marko suggested that Red Bull may exit Formula One entirely if changes to the regulations are not made to level the field or cut development costs.  Renault countered with their own threat to pull out of Formula One as an engine supplier if its reputation continues to be damaged or is otherwise not profitable to the company.  Mercedes followed up by finishing second and third in Malaysia, while Red Bull continued to struggle, rounding out the top ten a lap down. By the end of the flyaway rounds, Mercedes led the field, having earned 159 points (with Lewis Hamilton acquiring 93 out of 100 possible points), while Red Bull's struggles endured. The team acquired 26 points, enough for a distant fourth, and Ricciardo entered the European stages of the season on his fourth and final permissible power unit with fifteen events remaining on the calendar. , With McLaren's longest continuous testing session lasting twelve laps in Barcelona —a total of 56 kilometres (35 mi), a sixth of a total Grand Prix distance—before running into engine trouble, Honda elected to detune the power units for the opening Grands Prix in an effort to improve reliability and longevity while the manufacturer worked to improve these areas before homologation .  Both cars qualified on the back row, and in the race Kevin Magnussen failed to reach the grid after suffering an abrupt engine failure, while Jenson Button managed to finish the race, albeit two laps behind the leaders in the last classified position.  Magnussen reliquished his seat back to Alonso in Malaysia, however both cars qualified ahead of only the Manor Marussias and eventually retired. The team showed signs of improvement in terms of performance, able to compete with the midfield cars in China and Bahrain , although reliability continued to prove troublesome as Button's car was unable to compete in the latter Grand Prix. , Following a tumultuous pre-season in which they went through a period of administration and were saved by late investment, Manor Marussia arrived in Melbourne with a car that had passed its mandatory crash tests, but had completed no testing.  However, it was discovered that after arrival in Australia and while assembling the cars, their computers had been wiped completely clean of all data in preparation for auction.  Despite the team's efforts, they were unable to solve the oversight and could not participate in the Grand Prix.  The team managed to get the car running and on the racetrack by the second round in Malaysia and were able to set times within 107% of the leading times in practice, giving stewards reasonable grounds to allow the team to race when they failed to do so in qualifying. Merhi was able to finish the race three laps down in 15th, while Stevens did not start. Manor Marussia continued to show signs of consistency, with both cars qualifying within 107%, starting, and finishing both Grands Prix in China and Bahrain. They are one of two teams, the other being McLaren, to return to Europe without a championship point. , Ferrari came into the season seemingly much more competitive, finishing on the podium in the opening race. Returning driver Kimi Räikkönen stated that the SF15-T is \"much better\" to drive than last year's F14 T .  With Vettel winning comfortably and Räikkönen finishing in fourth despite suffering a tyre failure in Malaysia, Ferrari began to show that they would stand out as \"best of the rest\" among the other nine teams. They followed this up with a 3–4 finish in China and Räikkönen securing his first podium appearance in Bahrain since rejoining Ferrari the previous season. With 107 points, the team returns to Europe fifty-two points behind Mercedes, and forty-six points ahead of third place Williams. , Mercedes arrived at Spain already with a comfortable lead, having amassed a fifty-two point cushion over Ferrari after the first four races. Lewis Hamilton entered having left only 7 points out of a possible 100 on the table, giving him a twenty-seven point lead over teammate Nico Rosberg entering the eight-race European portion of the season. , Rosberg quickly cut into Hamilton's Championship lead by securing victories in Spain (reducing his deficit to twenty points) and Monaco . The latter win was aided by the result of a costly miscalculation by the Mercedes team to pit Hamilton with a 19-second lead during a safety car period (that briefly saw the use of the \"Virtual Safety Car\" for the first time in F1's history) with 14 laps remaining. Rosberg and Sebastian Vettel did not pit, allowing both to narrowly pass Hamilton by the pit exit lane. Racing resumed on lap 71 and Rosberg quickly pulled away, remaining in the lead till the chequered flag. Vettel held off Hamilton for second and third, respectively. As a result, Hamilton's lead over Rosberg in the Drivers' Championship was cut in half, to just ten points. Meanwhile, Button secured McLaren's first points of the season by finishing 8th. This leaves the Manor drivers of Stevens and Merhi, along with fellow McLaren driver Fernando Alonso, as the only full-time drivers not to score a point after seven rounds. , At the following Grand Prix in Canada , Mercedes quickly put to rest the criticism following the result in Monaco  with another 1—2 finish led by Hamilton, extending his lead over Rosberg to seventeen points. Williams collected their first podium of the season in the form of a third place result by Valteri Bottas , while the Ferraris of Räikkönen and Vettel rounded out the top five despite a spin by Räikkönen and Vettel starting from 18th on the grid and overcoming a slow pit stop. Other power unit manufacturers continued to show their struggles, with Daniil Kvyat's Red Bull the sole Renault in the top ten indicating their continued lack of power, while both McLarens again retired due to exhaust issues with their Honda units, highlighting their lack of reliability. , In Austria , Rosberg captured his third victory in four races ahead of Hamilton, again cutting Hamilton's championship lead to ten points. Williams took advantage of Ferrari mistakes by claiming their second podium in a row, with third place going to Felipe Massa and a fifth place finish by Bottas. While both Ferraris showed pace that kept up with Mercedes in practice sessions, the team could not translate it to qualifying. A communication error  saw Räikkönen qualify in 18th ahead of only the Manor Marussias and violently crash with Alonso's McLaren on the opening lap. Mercedes's lead in the Constructor's championship over Ferrari grew from 105 points to 136, while Ferrari's lead over Williams dropped from 76 to 63 points. Force India climbed into the top five in the Constructor's standings for the first time of the season, courtesy of a double points finish from Sergio Pérez and Nico Hülkenberg , who finished a season-best 6th after winning the 24 Hours of Le Mans one week prior. , Points are awarded to the top ten classified finishers using the following structure: , In the event of a tie, a count-back system is used as a tie-breaker, with a driver's best result used to decide the standings. [ N 1 ] , Notes: , , Notes: , "
}
