{
  "category": "f1",
  "article": "The Austrian Grand Prix (German: Großer Preis von Österreich) is a Fédération Internationale de l'Automobile sanctioned auto race which was held in 1964, 1970–1987 and 1997–2003. The Grand Prix returned to the Formula One calendar in 2014 . , , , The Austrian Grand Prix has been held at two different locations in the Zeltweg area located in Spielberg in southeastern Austria. It was first held at an airfield there for two years, then a permanent race track called the Österreichring was built in 1969 and Formula One first raced there in 1970 and each subsequant race has been held there in three distinct periods as the circuit has been redeveloped and sold. , A non-championship event was held in 1963 at a race track on the Zeltweg Airfield and it was won by Australian Jack Brabham . The first championship event took place in the following year, and Italian Lorenzo Bandini won his only Formula One championship race in a Ferrari. The race was a success, but the track was deemed too dangerous; it was narrow and very bumpy, and spectators complained of poor viewing areas. The FIA removed the race from the F1 calendar until a suitable track was built. , From 1970 until 1987, the event was held at the Österreichring (translated literally as \"Austrian circuit\") (also located near Zeltweg ). It was built in the scenic Styrian mountains and it was a fast, flowing track where every corner was high speed and long. The Austrian Grand Prix was designated the European Grand Prix once, 1975, when this title was an honorary designation given each year to one grand prix race in Europe. The very fast track was popular with drivers, and the events were moderately successful. The first race on this track was dominated by Ferrari, with their more powerful Flat-12 engines enabled them to be 10 mph faster- which is a lot in racing terms. The 1971 race saw Swiss driver Jo Siffert dominate in his BRM and Briton Jackie Stewart took his second driver's championship. The 1975 event was marred by the fatal accident of American Mark Donohue , and the race itself was rain-soaked and was won by Vittorio Brambilla , winning the only F1 race of his career, and, true to form, he crashed when he crossed the finish line when the race was stopped early because the rain got worse. In 1976, home favorite Niki Lauda 's appalling crash at the Nürburgring caused him to miss the race, which was won by Briton John Watson in the short-lived Penske F1 team, winning his first Formula One race. , 1976 had seen the Voest-Hugel corner changed slightly into one corner instead of two corners; but 1977 saw a slow three corner chicane installed at Voest-Hugel, which was where Donohue had crashed 2 years before. What was the fastest corner on the track was now the slowest corner there and would become known as the Hella-Licht Chicane. This race was won by Australian Alan Jones in a Shadow; and like Brambilla and Watson, it was his first Grand Prix victory. 1978 saw the dominant Lotus 79s on the front row, and American Mario Andretti crashed at the Glatz Kurve on the first lap, and his teammate, Swede Ronnie Peterson took victory. 1979 started to show the superiority of turbo-charged engines on this fast and high-altitude circuit. Although Jones won again in a Williams, Jean-Pierre Jabouille and Rene Arnoux in their Renaults were able to dominate this event and the following year's race, which Jabouille won. 1981 saw three turbo-charged cars dominate the front row; and into the race, the immense power and dreadful handling of Didier Pironi's Ferrari helped him to hold up four better handling cars and get into a five-way battle for third place, which went on for a while but the four cars passed eventually passed him, one of which was Jacques Laffite who went on to win the race. 1982 saw a spectacular show in which five turbocharged cars dominated the grid; all but one of these cars retired with mechanical troubles, including Italian Riccardo Patrese who had a spectacular accident at the Texaco Bends and Frenchman Alain Prost , whose engine expired with a few laps to go while in the lead. After Prost's retirement, the race turned into a dead-heat sprint between Italian Elio de Angelis in a Lotus and Finn Keke Rosberg in a Williams. Rosberg had been steadily chipping away at De Angelis; but after Prost retired, Rosberg began to make up 1.5 seconds a lap on De Angelis; and on the last lap the two so-far winless drivers battled for victory, and De Angelis was able to hold off Rosberg and win by less than half a car's length; .05 seconds. 1984 saw Lauda finally take victory at home in his McLaren, and Prost won the next two races. The 1985 race saw a fearsome crash at the Panorama Curve when Andrea de Cesaris spectacularly rolled his Ligier, which led to him being fired from the team. 1986 saw Austrian driver Gerhard Berger lead the early laps in his 1,400 bhp (1,044 kW; 1,419 PS) Benetton-BMW, but electrical problems saw his race ruined allowing Alain Prost to take the win by over a lap from the Ferraris of Michele Alboreto and Stefan Johansson . , The 1987 race was restarted twice due to accidents on the narrow pit-straight grid; and this track was also deemed too dangerous by FIA standards, because of the amount of high-speed corners, lack of protection from trees and embankments and accidents at the start of many races on the narrow and confined pit straight. Increasing speeds were also a growing problem at the Österreichring, polesitter Nelson Piquet averaged 159.457 mph (255.756 km/h) in his 1,100 hp Honda-powered Williams. Piquet finished second to his teammate, Briton Nigel Mansell . Attempts to bring the race back were unsuccessful, and the event disappeared for a decade. , In 1995 and 1996, the Österreichring was refurbished and brought up to date, which allowed the race to run again in 1997. Since the larger portion of the modernized track, which was renamed A1-Ring after a sponsor, is located on the municipal territory of Spielberg , Spielberg was now given as the site of the Grand Prix. The whole layout was redesigned by Hermann Tilke , and the track lost all of its long, sweeping corners, aside from the Texaco Bends (which were made shorter and slower) and the Hella-Licht chicane, Flatschach, Dr. Tiroch curve and the first half of the backstretch run up to where the Bosch-Kurve was were all taken out and replaced with a bypass that went directly to the second half of the fast, uphill backstretch. The 2002 event received negative publicity after Ferrari instructed Rubens Barrichello to cede his victory to Michael Schumacher . It was a mainstay on the calendar until hosting its final race in 2003. , In July 2013, it was reported that the circuit's new owners Red Bull had reached an agreement with Bernie Ecclestone to revive the Austrian Grand Prix after a ten-year absence from the calendar. The race was given a provisional date of July 2014.  And on December 6, the officially released calendar included the Austrian Grand Prix on it.  , A pink background indicates an event which was not part of the Formula One World Championship. "
}
