{
  "category": "f1",
  "article": "The Belgian Grand Prix ( Dutch : Grote Prijs van België ; French : Grand Prix de Belgique ; German : Großer Preis von Belgien ) is an automobile race , part of the Formula One World Championship. The first national race of Belgium was held in 1925 at the Spa region's race course, an area of the country that had been associated with motor sport since the very early years of racing. To accommodate Grand Prix motor racing , the Circuit de Spa-Francorchamps race course was built in 1921 but it was only used for motorcycle racing until 1924. After the 1923 success of the new 24 hours of Le Mans in France, the Spa 24 Hours , a similar 24-hour endurance race, was run at the Spa track. , Since inception, Spa-Francorchamps has been known for its unpredictable weather. At one stage in its history it had rained at the Belgian Grand Prix for twenty years in a row. Frequently drivers confront a part of the course that is clear and bright while another stretch is rainy and slippery. , The Belgian Grand Prix was designated the European Grand Prix six times between 1925 and 1973, when this title was an honorary designation given each year to one grand prix race in Europe. It is one of the most popular races on the Formula One calendar, due to the scenic and historical Spa-Francorchamps circuit being a favorite of drivers and fans. , , , In 1925, the first Belgian Grand Prix was held at the very fast, 9-mile Spa-Francorchamps circuit located in the Ardennes region of eastern Belgium, about half an hour from Liege. This race was won by the Italian works Alfa driver Antonio Ascari , whose son Alberto would win the race in 1952 and 1953. Sadly, after winning the Belgian race, Antonio Ascari was killed in his next race at the 1925 French Grand Prix . The Grand Prix did not come back until 1930, and the circuit had been modified, bypassing the Malmedy chicane. The race was won by Louis Chiron, and in 1931, the Grand Prix had become something of an endurance race, with Briton William Grover-Williams and Caberto Conelli winning. 1933 was won by Tazio Nuvolari, and 1935 was won by Rudolf Caracciola in a Mercedes, by which time the circuit had re-installed the Malmedy Chicane. The 1939 race saw the birth of the Raidillon corner; it was a bypass to the Ancienne Douane section. In contrast to popular belief, the corner to the left at the bottom of the drop is named Eau Rouge, wich directly leads into Radillion, a very long right uphand corner. The tricky left blind corner at the top has no name. The conditions were dreadful, and the race was marred by the death of British driver Richard \"Dick\" Seaman while leading the race. Going into Clubhouse corner, Seaman was pushing hard, he skidded off the rain-soaked road, hit a tree and his Mercedes caught fire. Seaman received life-threatening burns, and he succumbed to his injures later in hospital. The race was won by Seaman's teammate Hermann Lang . World War II broke out, and the Belgian Grand Prix did not return until June 1946, when the 2 to 4.5 litres race at Bois de la Cambre was won by Frenchman Eugène Chaboud in a Delage. , Spa was modified to make it even faster, shortening it to 8.7 miles (14.1 km). All of the slow corners were taken out – the Stavelot hairpin was bypassed and made into a fast banked corner and the Malmedy chicane was also bypassed. At this time, every corner except La Source was ultra-high speed. Spa over this time became known as one of the most extreme, challenging and fearsome circuits in motorsports history. 1950 saw the introduction of the Formula One World Championship; the race was dominated by the Alfa Romeos of Argentine Juan Manuel Fangio and Italian Nino Farina . Their closest challenger, Alberto Ascari , ran into fuel problems and fell back. The race was won by Fangio, and Farina won the next year's race in his works Alfa after Fangio dropped back with hub problems. 1953 saw Ascari dominate in his Ferrari while the Maseratis fell apart. Fangio crashed and José Froilán González had a steering failure and stopped out near the banked Stavelot corner. 1955 saw Mercedes dominate, Fangio and his British teammate Stirling Moss led the race distance. Moss followed Fangio closely for most of the race, the Argentine took victory as he had the year before in a Maserati. 1956 saw a wet race, with Moss in a Maserati lead, and Fangio, now driving for Ferrari, made a bad start and dropped to fifth at the start, although he got up to second behind Moss. The track was drying, and Moss lost a wheel at Raidillon corner. Fortunately he didn't hit anything and went back to take over his teammate Cesare Perdisa's car and was able to finish 3rd. The gearbox in Fangio's car broke, and his teammate Peter Collins won the race. , The 1957 race was cancelled because there was no money for the race to be held, thanks to the extreme prices of fuel in Belgium and the Netherlands caused by the Suez crisis . 1958 saw Spa upgraded with new facilities, a resurfaced track and also the pit straight was made wider. But Spa had gained a reputation as a totally unforgiving, frightening and a very mentally challenging circuit, even in those safety-absent days. The layout was still the same as before, and the extremely small, almost non-existent margin for error as described before had been realized very quickly. The circuit was extremely challenging, mainly because each corner on the circuit was so fast and the circuit's long length plus the fact that it was only really made up of fast corners and straights. The circuit was so fast that really wasn't all that much slower than most American ovals, such as Indianapolis . This made Spa a considerable mental challenge- each corner was as important as the other; each corner had to be taken right, because this affected one's speed through the next corner, and the next one, and so on. If a driver got his line wrong or was even slightly slow through any corner on the track- he would lose not tenths of seconds- but whole seconds, usually 5–8 seconds, and if a driver lifted even just a little bit anywhere on the track (particularly through corners like Burnenville or Stavelot), they would usually lose 2–3 seconds instantly from their lap time. This also applied to physical treatment- crashes in those days usually meant serious injury or death. If a driver made even the smallest mistake or the slightest error in judgement, the punishment was always extremely harsh, mentally and physically. Spa was also a circuit that was located in a region where the weather was rather unpredictable; there were many races there where one part of the track was dry and had sunshine while at the same time, another part would soaking wet and it would be raining. There were no radios in the days of the old Spa circuit, so drivers had no idea of circuit conditions and would often would drive flat out into a wall of rain that wasn't there on the previous lap; this often meant an accident and when that happened- because of the rural area of the circuit, drivers did not know what they were going to hit when crashing at Spa; either they dropped into a lower area or hit telegraph poles, houses, stone walls, embankments or trees. Many drivers were killed or seriously injured at Spa during the 1950s in all disciplines of motorsports that competed there. , 1958 was won by Briton Tony Brooks, driving a Vanwall; beating out teammate Stirling Moss. The prestigious Belgian event was not run in 1959, but 1960 was to be one of the darkest weekends in the history of Formula One. Grand Prix racing had moved forward to a new kind of car design – new British independent teams such as Cooper and Lotus had pioneered the rear mid engined car, much like the Auto Union Grand Prix cars of the 1930s. These cars were considerably lighter, faster and easier to drive than their front engined predecessors, and it became obvious that rear mid-engined cars were the way to go in purpose-built automobile racing. But these new type of cars had not been driven at Spa before, so no one knew how they would perform there. The high-speed bends at Spa were now much faster with these new cars – and in those days, the cars or circuits for that matter had absolutely no safety features of any kind. The cylinder-shaped bodywork was made of very thin highly flammable magnesium and/or fibreglass, and the tube-frame chassis of that day offered little to no crash resistance (as opposed to a modern-day monocoque, pioneered by Lotus only a few years later). Cars were not crash-tested and didn't have any installed equipment such as rollbars (made mandatory in 1961) or fire extinguishers. Although drivers did wear helmets, they were shaped like paper plates, made of weak and lightweight material and not scientifically designed or tested. Drivers in those days did not even wear seatbelts – they found it preferable to be thrown from a car that might be on fire to reduce the chance of injury or death. , During practice, Stirling Moss, now driving a privately entered Lotus, suffered a rear upright failure and crashed heavily at the Burnenville right hander. Moss, who was one of the best racing drivers in the world at the time, was thrown out of his car and his unconscious but living body landed in the middle of the track. The Englishman broke both legs, three vertebrae, several ribs and had many cuts and abrasions; he survived but didn't race for most of that year. Briton Mike Taylor, also driving a Lotus, suffered a steering failure and crashed into trees next to the track near Stavelot. Taylor then was trapped in the car for some time with serious head and neck injuries. This accident ended his racing career; he later successfully sued Lotus founder Colin Chapman in British court for sale of faulty machinery. The race itself, however, was to be even more disastrous. On lap 17, Briton Chris Bristow , driving a Cooper, was fighting for sixth with Belgian Willy Mairesse . The very young Bristow, having never driven at Spa before, was known as a brash and daring driver who had a reputation for being rather wild; the relatively inexperienced 22-year-old Englishman had been in lots of accidents in his short career. This was due to his unruly and very aggressive driving style, and he was possibly in way over his head at Spa-Francorchamps. Mairesse was also known as an equally aggressive driver who had a win-at-all-costs mentality and was known to be difficult to pass, particularly on his home track- the fact that these 2 drivers were racing against other on this track meant that disaster was perhaps inevitable. Bristow and Mairesse touched wheels, and the Englishman lost control at Malmedy, overturned and crashed into an embankment on the right side of the track. The car rolled and flipped a number of times, Bristow was thrown from his car and was beheaded by some barbed-wire fencing next to the circuit; his lifeless body landed on the track where it stayed for some time. Mairesse continued, but retired from the race later on with gearbox trouble. 5 laps later, 26-year-old Briton Alan Stacey , running in sixth place and driving a works Lotus, suffered a freak occurrence when he got hit in the face by a bird on the Masta straight not far from where Bristow had been killed. Stacey then lost control of his car at 140 mph (228 km/h) and it climbed up and flew off an embankment next to the track. After penetrating 10 feet of thick bushes, the car landed on a spot in a field some 25 feet lower than the track. On impact with the field, it then exploded and burst into flames; the hapless Englishman was killed by this horrific crash. It was not known whether the impact broke his neck or if the fire burned him alive while unconscious. Australian Jack Brabham won the race, and British future great Jim Clark scored his first Formula One points by finishing 5th – but the great Scottish driver, like a number of other drivers, developed an intense dislike of the circuit after he had to swerve at extreme speeds to avoid running over Bristow's headless body. This disastrous event would remain the darkest weekend for Formula One until the 1994 San Marino Grand Prix . The race itself was won by Australian Jack Brabham , and it proved to be a gruelling and brutal race for him – he was chased by American works Ferrari driver Phil Hill all the way to the end, the Los Angeles native had to pit because of a broken fuel line.  , 1961 saw Ferrari make use of their superior horsepower, and they romped home 1–2–3–4, with Phil Hill winning. 1962 saw Clark win his first race, going on to win the next 3 Belgian Grands Prix. 1963 was a rain-soaked race with Clark finishing 4 and a half minutes in front of second placed Bruce McLaren . 1966 was an interesting race; it featured cars built under new regulations with the engine capacity up to a maximum of 3 liters from 1.5- engines had now twice as much horsepower as before. This year saw another rain soaked race: on the first lap, as the field reached the far side of the circuit, a heavy rain-storm caused 7 drivers to hydroplane off at Burnenville. Briton Jackie Stewart had a high speed accident at the Masta Kink, where he went through a woodcutter's hut, hit a telegraph pole, and dropped into a much lower part of the circuit where the car landed upside down. The BRM Stewart was driving had bent itself over his legs, he could not get out by himself and the Scot ended up being stuck in his car for nearly 30 minutes. Stewart's misery was made worse by the fact that the fuel tanks, which were bags located inside the car that flanked the driver, had ruptured and were soaking him with inflammable fuel, and he also had broken ribs and collarbone. Stewart's BRM teammate Graham Hill and Bob Bondurant, both of whom had gone off near Stewart, came to help the hapless Scotsman. Because of the absence of safety precautions in those days, they had to borrow spanners from a nearby spectator, and the two drivers got Stewart out. There were other bad accidents on the circuit; some of the cars were hanging off 30 feet high ledges. Stewart's crash at this race was one that effectively began his crusade for safety at racetracks. The race was nearly unmanageable, there was so much water on the track that the Climax engine in Clark's Lotus was flooded and failed. Briton John Surtees won the race in a Ferrari, followed by Austrian Jochen Rindt in a Cooper. , 1967 saw American Dan Gurney in his Eagle win after Clark had mechanical problems – it was to be Eagle's only F1 victory and Briton Mike Parkes crashed appallingly at 150 mph at Blanchimont after slipping on some oil that had dropped off of Jackie Stewart's BRM. After his car hit and climbed up an embankment, the works Ferrari driver was thrown out of his car, receiving serious leg and head injuries. The doctors considered amputation of his legs (but this was not done), and he then lapsed into a coma for a week. Miraculously, the English Parkes survived, but he never raced in Formula One again. 1968 was historically a very important race, as it saw a number of firsts: wings as an aerodynamic device were introduced for the first time in Formula One. The European constructors, particularly Colin Chapman and Mauro Forghieri , were influenced by American Jim Hall 's Chaparral 2E and 2F sports cars' very large high strutted wings. New Zealander Chris Amon qualified his rear-wing equipped Ferrari on pole position by 4 seconds over Stewart in a Matra. Come race day, McLaren won their first ever victory as a constructor, with its New Zealander founder Bruce McLaren winning – but the race saw yet another serious accident. Briton Brian Redman crashed his works Cooper heavily at very high speed into a parked Ford Cortina road car at Burnenville, and the Cooper caught fire. He was seriously burned and he had also badly broken his right arm; he did not race for most of that year. , And come the next season, the Grand Prix racing fraternity had finally snapped: Spa was getting out of order with Formula One. The rural country circuit was very much feared by the drivers, and a number of them disliked the track. It was the fastest road circuit in Europe at that time and average lap speeds were past 150 mph (240 km/h), and as the years went on Formula One cars were becoming faster and faster, so the circuit became more and more dangerous. The ultra-fast Belgian circuit was made up of everyday public roads that went past towns, farmland, trees, people's homes, fields, and telegraph wire poles, and the conditions of the circuit were, apart from a few useless straw bales, virtually identical to everyday civilian use. Safety in motor racing (not just in Formula One) was nearly non-existent and hardly any thought, or none at all, was ever given to safety. Most drivers in those days preferred the danger element of the sport back then, as it gave them satisfaction to do something dangerous and survive doing it. But times were changing, and this was demonstrated when things came to a head when the Belgian Grand Prix was scheduled for 8 June 1969 as part of the that year's season at Spa. When Jackie Stewart visited the circuit on behalf of the Grand Prix Drivers' Association he demanded many improvements to safety barriers and road surfaces, in order to make the track safe for racing.  When the track owners did not want to pay for the safety improvements, the British, French and Italian teams withdrew from the event, and it was cancelled in early April. The exclusion of the Belgian Grand Prix that year was not popular with the press (particularly well-known British journalist Denis Jenkinson ), who were having a difficult time accepting the growing professionalism and business aspects of the sport.  One last race was held there in 1970 with barriers and a temporary chicane at the fast Malmedy corner installed at the circuit, but even this did not stop the cars still averaging over 150 miles per hour (240 km/h) around the 8.7 miles (14.0 km) track. The race was won by Mexican Pedro Rodriguez in a BRM with New Zealander Chris Amon finishing 1.1 seconds behind in a March. But Spa was still too fast and too dangerous, as proven in 1971, the track was not up to mandatory FIA-mandated safety specs and the Belgian Grand Prix was cancelled that year. The event was then eventually relocated. , Following that decision, the Belgians decided to alternate their Grand Prix between Zolder in northern Belgium and a circuit at Nivelles-Baulers near Brussels . The first race at Nivelles in 1972 was won by Emerson Fittipaldi . Zolder hosted the race the following year and it was won by Jackie Stewart . Formula One returned to Nivelles in 1974. Once again the race was won by Fittipaldi, but the circuit was unpopular among the Formula One circus and after that event the organizers were unable to sustain a Grand Prix at Nivelles, and the track faded from the racing scene. , The Belgian Grand Prix would be held at Zolder a further nine times. Niki Lauda scored back-to-back victories at the track in 1975 and 1976, and in 1977 Gunnar Nilsson scored his only F1 victory at Zolder. The following year Mario Andretti dominated the race for Lotus , driving the 79 in its debut race. In 1979, Jody Scheckter won the race in his Ferrari , and in 1980 Didier Pironi became a first time winner in his Ligier . , The 1981 meeting was a chaotic event wrapped in the midst of the FISA-FOCA war and the poor conditions of the Zolder circuit, including its very narrow pitlane. During Friday practice, an Osella mechanic was accidentally run over in the pitlane by Argentine Carlos Reutemann (the mechanic, Giovanni Amadeo, died of his injuries the day after the race), and on race day, as a result of the poor conditions of Zolder and the accident on Friday, there was drivers' strike which caused the race to be started later than scheduled. Then, when the race started after yet another delay, there was a startline accident involving an Arrows mechanic. Riccardo Patrese stalled his Arrows on the grid, so his mechanic Dave Luckett jumped onto the circuit to try and start Patrese's car. However, the organizers started the race and the whole field went into motion while Luckett was still on the road. Next, the other Arrows driver, Italian Siegfried Stohr , hit the back of Patrese's car, where Luckett was standing. Luckett was knocked unconscious and laid sprawled on the circuit. Then, when the field reached the pit straight again (by which time Luckett had been removed from the road, although the track still had Stohr's broken Arrows car on the circuit and the surface was littered with debris) a number of track marshals jumped onto the tarmac and frantically waved their arms to try to make the field stop while waving yellow flags instead of red flags. Unfortunately the cars went by at full racing speeds and the drivers, made confused by the messy situation, waved back at the marshals: when they came back again for the third lap they voluntarily stopped themselves. The race was restarted and was won by Reutemann. Luckett survived the incident and neither Patrese and Stohr started the second race. , Zolder will be primarily remembered, however, as the place where Gilles Villeneuve died during practice in 1982 after a collision with West German Jochen Mass going into the fast Butte corner. Villeneuve's Ferrari flipped a number of times and the hapless Canadian was thrown out of his car during the accident; he succumbed to his severe injuries into the night at a hospital near the circuit. John Watson won the race for McLaren . , Spa-Francorchamps had been shortened to 4.3 mi (7 km) in 1979; the parts that went into and through the urban countryside that swept past towns and other obstructions had been cut out and replaced with a new series of corners right before the Les Combes left-hand corner, and the new track rejoined the old on the straight leading up to Blanchimont. The first race at the shortened Spa circuit was won by Frenchman Alain Prost , and the circuit was an immediate hit with drivers, teams and fans. , The Belgian Grand Prix returned to Zolder in 1984 and this was the last F1 race held at the Flemish circuit with Italian Michele Alboreto taking victory in a Ferrari. , 1985 saw the event postponed because of a new asphalt that had been laid down specifically to help the cars on the often rain-soaked Spa circuit. But to the embarrassment of the organizers, the weather was hot, and the track surface broke up so badly the drivers could not drive on it. The prestigious Belgian event was moved from its original date in early June to mid-September. When mid-September came around, Brazilian Ayrton Senna took his first of 5 Belgian Grands Prix in a wet/dry race, driving a Lotus. Nigel Mansell dominated the 1986 event, and he and Senna took each other out the following year when Mansell attempted to pass the Brazilian on the outside of a wide corner. Senna won the next 4 Belgian Grands Prix, the first 2 being rain-soaked events. The 1988 event was the first Belgian Grand Prix to be held in late August/early September instead of May or June (excluding the rescheduled 1985 event) and it has remained in this time frame ever since. The 1990 event had to be restarted twice after a multi-car accident at the La Source hairpin on the first start and then Paolo Barilla crashing at Eau Rouge on the second start. In 1992 German up-and-comer Michael Schumacher won his first of 91 Grand Prix victories in a Benetton. Damon Hill won the 1993 event after battling with Senna and Schumacher. , 1994 saw a chicane installed at the bottom of Eau Rouge in response to the Imola tragedies that year. 1995 saw the chicane gone, and Schumacher won this and the next two Belgian Grand Prix. The 1998 event was particularly notable, in torrential conditions. The race was originally stopped after an accident involving thirteen of the twenty-two runners at the first corner. The heavy rain caused low visibility, and Michael Schumacher ran into the back of David Coulthard , an event that angered Schumacher so much he stormed into the McLaren garage to confront Coulthard, claiming he had tried to kill him. Coulthard later admitted he had been at fault, due to his own inexperience.  Only eight drivers were classified finishers (two of whom were five laps behind, one of whom was Coulthard) and Damon Hill secured a victory ahead of team mate Ralf Schumacher to record the previously underperforming Jordan team's first Formula One win in its history, and a 1–2 to top it off. , Schumacher won his 52nd Grand Prix at Spa in 2001, surpassing Alain Prost 's all-time record of 51 wins. Schumacher also won his seventh World Drivers' Championship title at Spa in 2004. There was no Belgian Grand Prix in 2003 because of the country's tobacco advertising laws. In 2006, the FIA announced the Belgian Grand Prix would not be part of the 2006 Formula One season , since the local authorities had started major repair work in Spa-Francorchamps. The Belgian Grand Prix returned in 2007, when Kimi Räikkönen took pole position and his 3rd Belgian Grand Prix win in a row. , In 2008, McLaren's Lewis Hamilton survived a frantic last two laps in a late shower of rain to win the Belgian Grand Prix. Hamilton lost the lead to Ferrari's Kimi Räikkönen with an early spin but fought back in the closing laps to re-take the lead with two laps to go. On a soaking track, Hamilton passed Räikkönen, lost the lead again with a spin, re-took it and then saw Räikkönen crash. Ferrari's Felipe Massa took second leaving him eight points behind Hamilton. However, the stewards decided after the race to apply a drive-through penalty for Hamilton's pass on Räikkönen (i.e. a 25-second penalty) after they had deemed that Hamilton had cut a corner in the Bus Stop chicane. This left Hamilton in third place behind Ferrari's Felipe Massa and BMW Sauber's Nick Heidfeld. The penalty cut Hamilton's lead over Massa to just two points with five races remaining. McLaren appealed the decision but were turned down as it is not permissible to appeal drive-through penalties. The stewards' decision was criticised by former world champion Niki Lauda calling it \"completely wrong\".  , In 2009, Bernie Ecclestone said in an interview that he would like the Belgian Grand Prix to rotate with a Grand Prix at the Nürburgring , rather than the Nürburgring rotating with the Hockenheimring .  In January 2015, the economy minister of the Walloon Government Jean-Claude Marcourt, confirmed a contract extension to host the Belgian Grand Prix race at Spa through 2018.  , Michael Schumacher has won the Belgian Grand Prix 6 times and Ayrton Senna won 5 times; including 4 times in a row from 1988–1991, and Kimi Räikkönen and Jim Clark both won 4 times (Clark also won 4 times in row, from 1962–1965). , Embolded drivers are competing in the Formula One championship in the current season. , A pink background indicates an event which was not part of the Formula One World Championship. , A cream background indicates an event which was part of the pre- war European Championship. , Coordinates : 50°26′13″N 5°58′08″E ﻿ / ﻿ 50.437°N 5.969°E ﻿ / 50.437; 5.969 "
}
