{
  "category": "f1",
  "article": "The Brazilian Grand Prix ( Portuguese : Grande Prêmio do Brasil ) is a Formula One championship race which is currently held at the Autódromo José Carlos Pace in Interlagos neighborhood , Socorro district , São Paulo . , , , Motor racing had started in Brazil before World War II, and races on the 7.9-mile Gavea circuit in Rio de Janeiro had started in 1934. In 1936 construction began on Brazil's first permanent autodrome in the São Paulo neighborhood of Interlagos and was finished in 1940. Brazil held Grands Prix during the early parts of WWII at Interlagos and Gavea; and stock car type-touring car racing continued in Brazil where it became very popular. Interlagos quickly gained a reputation as being a very tough and demanding circuit with many challenging corners, elevation changes, a rough surface and little room for error. , Grand Prix racing was rare in Brazil only until the emergence of São Paulo native Emerson Fittipaldi in Formula One. In 1970, he won his first championship Grand Prix at Watkins Glen in the United States ; and São Paulo city officials saw in Fittipaldi a sporting hero equivalent to soccer star Pelé . They then set about refurbishing Interlagos to modern standards. , A Brazilian Grand Prix was first held in 1972 at Interlagos, although it was not part of the Formula One World Championship. Typical of European motorsports at the time, this race was done as a test to convince the FIA if the Interlagos circuit and its organizers could capably hold a Grand Prix. The following year, however, the race was first included in the official calendar, and it was won by defending world champion and São Paulo native Emerson Fittipaldi . In 1974, Fittipaldi won again in rain soaked conditions, and the year after, another São Paulo native, Carlos Pace , won the race in his Brabham, followed by Fittipaldi. 1977 was won by Reutemann, but the drivers began complaining about Interlagos's very rough surface, and the event was then relocated for a year to the new Jacarepaguá circuit in Rio de Janeiro. , After a year in Rio, the race returned to Interlagos, now with new and upgraded facilities for the next two seasons. But by 1980, the population of São Paulo had risen from 5 to 8 million over the space of 10 years; the area surrounding the track was becoming increasingly run-down and the growing slums surrounding the circuit did not look good for the glamorous image of Formula One; and the drivers were dissatisfied with the safety conditions of the very bumpy 5-mile Interlagos circuit which had not been changed after the previous year's improvements. The ground-effect wing cars of that year had a tendency to bounce up and down thanks to the suction created by the cars' wing-shaped underbodies, and they were more stiffly suspended than before; so these fragile cars were barely tolerant of such a rough track and were very unpleasant to drive. The bad surface was so rough that the bumps caused mechanical problems for some cars. Also, the barriers and catch-fence arrangements were not adequate enough for Formula One. Jody Scheckter attempted to stop the race from going ahead but this did not work and the race ended up being won by Frenchman Rene Arnoux . With Formula One's more glamorous image being better suited to the more wealthy and better-looking city of Rio de Janeiro, the F1 circus went back to Rio again and the circuit went on to host the 1980s turbo era. , In 1978 the Brazilian Grand Prix moved to Jacarepaguá in Rio de Janeiro . Argentine Carlos Reutemann dominated in his Ferrari, which was equipped with superior Michelin tires. This proved to be the French company's first victory in Formula One. Reutemann was followed by home favorite Fittipaldi and defending champion Niki Lauda .  , After the emergence in 1980 of Rio de Janeiro racer Nelson Piquet and the retirement of Fittipaldi, Brazilian fans lobbied to host the Brazilian GP in Piquet's home town. The flat Jacarepaguá circuit, like Interlagos before it, proved to be extremely demanding: most corners were long and fast, some were slightly banked and the track had a very abrasive surface. Due to the FIA calendar, which invariably had the Brazilian GP at the beginning of the season thus in the Southern hemisphere summer, most races were held under very high temperatures. Due to all of those circumstances, Grands Prix at Rio were highly demanding and most drivers who won it were exhausted in the end. , In 1981, Carlos Reutemann disobeyed team orders to let his teammate Alan Jones by and took the victory; the following year Piquet finished 1st and Keke Rosberg finished 2nd but because of the FISA-FOCA war , Piquet and Rosberg were both disqualified for being underweight in post-race scrutineering, and the race victory was given to 3rd placed Alain Prost , who would go on to win at Jacarepagua 4 more times (thus earning the nickname \"the King of Rio\"). The race also saw Italian Riccardo Patrese retire due to physical exhaustion (a very rare occurrence in F1, but quite common at Rio). Piquet won in 1983 and 1986, and the 1988 race was particularly notable, as up-and-coming star Ayrton Senna started from the pit-lane in his first race for McLaren; he began a furious charge that brought him up to second behind his teammate Prost; but he was disqualified for switching to his spare car after the parade lap had begun. The 1989 event was the last race at Jacarepaguá. It was won by British driver Nigel Mansell in his Ferrari, in the first Grand Prix won by a car with a semi-automatic gearbox, and it also saw German Bernd Schneider and American Eddie Cheever collide, and Cheever collapsed twice after he exited his car due to exhaustion. , Ayrton Senna's success thus far in Formula One had city officials working hard to revamp the Interlagos circuit in a $15 million investment to shorten and smooth over the circuit. In 1990 the Grand Prix returned to a shortened Interlagos, where it has stayed since. The Interlagos circuit has created some of the most exciting and memorable races in recent Formula One history, and is regarded as one of the most challenging and exciting circuits on the F1 calendar. , The first race at the new Interlagos in 1990 was won by Alain Prost , who won his 40th career race (the most ever at that point in time) and his 6th Brazilian Grand Prix. It wasn't a popular win, as the repercussions of the previous year's Japanese Grand Prix still laid in the minds of many Brazilians; Prost was seen as been given the driver's title by FIA president Jean-Marie Balestre at Senna's expense of being disqualified from that race in Japan. The Brazilian home favorite finished 3rd in Brazil after leading much of the race but then hitting his backmarker ex-teammate Satoru Nakajima in a Tyrrell. 1991 saw the patriotic Senna win emotionally his first Brazilian Grand Prix. His McLaren's manual gearbox was losing gears quickly and close to the end, he only had 6th gear left. This made the car much more difficult and physically demanding to drive, he drove around the track, eventually holding off Williams driver Riccardo Patrese. His exhaustion was so high that had to be extricated from his car. 1992 saw Mansell dominate the weekend and the rest of the season. 1993 was a race of variables; it began to rain heavily early into the race and Prost, now driving a Williams, had a rare accident on the main straight and retired. Senna went on to win in a McLaren from Prost's teammate Damon Hill. 1994 saw Senna, now driving for Williams spin his recalcitrant car going through Juncao late into the race. He was running in 2nd, trying to catch German Michael Schumacher , who went on to win. Senna would lose his life at the San Marino Grand Prix later in the year in an accident. 1995 was a very controversial race that initially had race winner Schumacher and Briton David Coulthard's cars excluded, but then reinstated for apparently using illegal fuel during the race. 1996 saw Damon Hill win his first of 8 races that season, and 1997 saw an accident at the start that involved 4 cars; Canadian Jacques Villeneuve went off the course at the first corner. The race was stopped and restarted; and Villeneuve jumped into the spare car and won the race. 1998 saw a controversy surrounding McLaren — Ferrari had protested about their braking system, and it was then banned from the Brazilian Grand Prix, although it had been approved 4 times by FIA technical delegate Charlie Whiting. It didn't matter much; Finnish McLaren driver Mika Hakkinen won the race. 1999 saw local Rubens Barrichello lead for some time until the engine in his car failed, and Hakkinen won again. , The 2001 Grand Prix was notable for marking the explosive arrival of Juan Pablo Montoya onto the Formula One scene. The Colombian driver stunningly muscled his way past Michael Schumacher early on and led easily until an incident in which Arrows' Jos Verstappen ran into the back of his Williams-BMW and ended his race. Montoya did eventually lay to rest the ghost of this event by winning the 2004 race in his final Grand Prix for Williams before moving to McLaren, holding off his future team-mate Kimi Räikkönen to take a hard-fought victory. The 2001 race is also notable for two brothers, Michael and Ralf Schumacher , sharing a row on the starting grid for the first time. , Particularly memorable recent Brazilian Grands Prix include the 2003 race, which saw a maiden Grand Prix victory, highly unexpectedly, and amidst chaotic and unusual circumstances, for Jordan 's Giancarlo Fisichella . Heavy rain before and during the race produced problems with tyre selection which caught out many teams, which allowed the weak Minardi team to have a real chance for victory the only time ever, because they were the only team who prepared to the rainfall, but their drivers were also soon out. And treacherous track conditions caused multiple drivers to spin out of the race, including then-reigning World Champion Michael Schumacher, ending a remarkable run of race finishes dating back to the German Grand Prix 2001. Amidst this, a number of drivers, including McLaren's Kimi Räikkönen and David Coulthard , led the race, and, when a heavy accident involving Renault's Fernando Alonso blocked the circuit and brought out the red flag, confusion reigned. Fisichella led the race at the time, having just overtaken Räikkönen; however, it was the Finn who was declared the race winner under the count back rule, which stipulates that the race result in such circumstances is taken from the running order two laps prior to the race being stopped. This decision was overturned days later in the FIA Court of Appeal in Paris after new evidence came to light which proved that Fisichella had crossed the finish line in the lead for a second time before Alonso's accident, and therefore was the rightful winner. The 2004 event marked the first time since the race's admission to the Formula One Championship calendar that it was not one of the first three rounds of the championship season. , Fernando Alonso became the youngest ever Formula One World Champion at the 2005 Brazilian Grand Prix, his third place behind winner Juan Pablo Montoya and championship rival Kimi Räikkönen was enough to clinch the title with two races remaining. , For 2006 the Brazilian Grand Prix, as in 2004, was moved to the prestigious position of hosting the final round of the season, in what was Michael Schumacher's first farewell to Formula One, before his return for the 2010 Formula One season . Starting from 10th position on the grid, Schumacher did an astonishing job on his last race. He fell to 19th position on the ninth lap due to a flat tyre caused by a minor collision with Giancarlo Fisichella when the former was trying to overtake the latter. After pitting for a new tyre he returned to the race, just in front of leader Massa, so almost being lapped, then passing several drivers to take the chequered flag in fourth place, after a dazzling passing manoeuvre on Kimi Räikkönen. His performance was not enough to give 'Schumi' his eighth trophy, as Fernando Alonso, who needed only one point to become World Champion again, finished in second place. Brazilian Felipe Massa took pole position and led the race from start to finish for the second victory of his career and celebrations from his Brazilian supporters. , In March 2008, the mayor of São Paulo announced that he had signed a new deal with Bernie Ecclestone to continue the holding of the Brazilian Grand Prix. This deal allows the Brazilian race to be on the calendar until 2015. With this, Interlagos is set for major improvements in its pit and paddock facilities.  , In the final race of the 2008 season in Brazil, Lewis Hamilton became the youngest Formula One world champion, to that point in Formula One history. After adopting a conservative strategy without risks for most of the race to secure at least 5th place, and the title, a late-race rain shower caused unexpected trouble. First, Hamilton was pushed down to 5th place by German Toyota driver Timo Glock who didn't enter the pits for intermediates like most other front runners. With just 3 laps to go, Sebastian Vettel then also overtook the Briton on the track which meant he would end up with equal points to Massa, but with one fewer victory. While everybody was focussing on the battle between these two (Vettel managed to stay in front in the end), against all expectations both were able to overtake Glock, who had lost all grip with his dry weather tyres, in the very last corner before the finishing straight. This meant that, while the McLaren driver's title rival Felipe Massa won the race in his Ferrari, Hamilton ultimately grabbed the fifth place he needed to become champion. Renault's Fernando Alonso, the previous youngest champion, was second ahead of Massa's team-mate Kimi Räikkönen and Toro Rosso's Sebastian Vettel. , Five Brazilian drivers have won the Brazilian Grand Prix, with Emerson Fittipaldi , Nelson Piquet , Ayrton Senna and Felipe Massa each winning twice, and Jose Carlos Pace winning once. The most ever is by the Frenchman Alain Prost , who has won it 6 times (including 5 times at Jacarepaguá). Argentine driver Carlos Reutemann and Michael Schumacher have both won 4 times. , On 10 October 2013 it was announced that the contract for the Brazilian Grand Prix had been extended until 2022.  , A pink background indicates an event which was not part of the Formula One World Championship. , Coordinates : 23°42′04″S 46°41′49″W ﻿ / ﻿ 23.701°S 46.697°W ﻿ / -23.701; -46.697 "
}
