{
  "category": "f1",
  "article": "The British Grand Prix is a race in the calendar of the FIA Formula One World Championship. It is currently held at the Silverstone Circuit near the village of Silverstone in Northamptonshire in England. The British and Italian Grands Prix are the oldest continuously staged Formula One World Championship Grands Prix. It was designated the European Grand Prix five times between 1950 and 1977, when this title was an honorary designation given each year to one Grand Prix race in Europe. All British Grands Prix dating back to 1926 have been held in England; where the British motor racing industry is primarily located. , , , The concrete Brooklands oval was built in 1907 near Weybridge in Surrey, located just outside of the English capital of London. It was the first purpose-built motor racing venue, as well as one of the first airfields in the United Kingdom. Grand Prix motor racing was first established in Britain by Henry Segrave in 1926 after his winning of the 1923 French Grand Prix and the San Sebastián Grand Prix the following year, which raised interest in the sport. The first ever British Grand Prix was won by the French team of Louis Wagner and Robert Sénéchal driving a Delage 155B . The second British Grand Prix was held at Brooklands in 1927. , Several non-championship races known as the Donington Grand Prix were held at Donington Park in the 1930s, where the German Mercedes and Auto Unions dominated the precedings; the 1937 race was the most notable; Auto Union driver Bernd Rosemeyer won. , Brooklands had been severely damaged by the onset of World War II and the circuit was abandoned. Most new British circuits were being built on disused Royal Air Force airfields, and Silverstone, located in Northamptonshire in central England, was one of those circuits. It staged its first race, the Royal Automobile Club International Grand Prix on October 2, 1948, which was won by Italian Luigi Villoresi in a Maserati. In 1949, the circuit was heavily modified and made very fast; and it remained in this configuration for decades on. , In 1950, the Formula One Championship was introduced, and the 1950 British Grand Prix was the first Formula One race ever held, with new regulations and 6 other races in Europe. This race was won by Alfa Romeo driver Giuseppe \"Nino\" Farina. King George VI was among the attendees of the race. The 1951 race was particularly exciting, as it was the first F1 race not won by an Alfa Romeo; the gas-guzzling Italian cars were beaten by another Italian car- the more fuel-efficient Ferrari of Argentine José Froilán González in what was the famed Scuderia's first ever Formula One victory. For the 1952 event, the original pits between Abbey and Woodcote was abandoned and demolished. A new pit complex was constructed between Woodcote and Copse corners; Alberto Ascari dominated this and the next year's race; González won again in 1954 in a Ferrari. , In 1955, the Formula One circus began to alternate between Silverstone and the Aintree circuit , located on the Grand National horse racing course near Liverpool. Mercedes drivers Juan Manuel Fangio and home favorite Stirling Moss arrived at Aintree expecting to win. They took the lead at the start and the two drivers battled throughout, and Moss passed Fangio on the 26th lap; and he kept the lead for a while; but Fangio fought back and was about to pass Moss on the last corner on the last lap, and all were certain Fangio would pip Moss at the checkered flag. But he didn't, and Moss won his first Formula One race on home soil. Moss later asked Fangio \"did you let me through?\" and the Argentine replied \"No. You were better than me that day.\" Mercedes romped to the finish 1-2-3-4, with German Karl Kling and Italian Piero Taruffi finishing 3rd and 4th. , The even-numbered years were at Silverstone and the odd numbered and 1962 were at Aintree. 1956 saw Fangio win in a Ferrari, and 1957 returned to see Moss win again in a Vanwall; he took over his ill teammate Tony Brooks's car and stormed through the field to take victory. This was the first Grand Prix victory for a British-built car- Formula One would soon be mostly made up of British teams. 1958 was when Peter Collins won in a Ferrari and Bernie Ecclestone was entered in a Connaught but his car was driven by Jack Fairman ; and 1959 and 1960 saw Australian Jack Brabham win in a mid-engined Cooper. The last race at Aintree was in 1962, when Briton Jim Clark won his first of 5 British Grand Prix's; Aintree was later decommissioned in 1964. , 1964 saw the first Formula One race at the southern English circuit known as Brands Hatch , located in Kent, just outside of London . The track was built in the early 1950s and had been extended in 1960. Silverstone hosted the British Grand Prix in odd-numbered years and Brands Hatch in even-numbered years. Like Silverstone, the circuit was popular with drivers, and unlike the flat Northamptonshire circuit and Aintree, Brands Hatch had many banked corners and lots of elevation change. Like the year before at Silverstone, Clark won the 1964 race, and the next year's race. 1967 saw Clark take yet another dominant win, and 1968 saw a monumental battle between Swiss Jo Siffert in a Lotus and New Zealander Chris Amon in a Ferrari; Siffert won the race, his first of two victories in F1 on the circuit where he would lose his life in a non-championship race 3 years later. , 1969 saw another big battle between home favorite Jackie Stewart and Austrian Jochen Rindt , that went on for a while; although Rindt had a loose rear wing and had to come into the pits to get it repaired; Stewart took the checkered flag driving a Ford/Cosworth-powered Matra for Ken Tyrrell . Rindt won the 1970 event at the expense of Brabham running out of fuel at the end of the race, and 1971 saw Stewart win again in a Tyrrell (Ken Tyrrell had started building his own cars). 1973, however, saw a huge first lap accident at Woodcote that took out 11 cars, including all 3 works Surtees cars. Amazingly, there were no deaths or any fires and the worst news was that Andrea de Adamich received career-ending ankle injuries. 1974 saw Austrian up-and-comer Niki Lauda dominate the race in his Ferrari, however a rear-tire puncture slowed his car and rivals Jody Scheckter and Emerson Fittipaldi passed Lauda to take 1st and 2nd. , 1975 saw a chicane added to Woodcote to slow cars going through the very high speed corner; and this was another race of variables as a rain storm hit the track and a number of drivers including Scheckter and Briton James Hunt hydroplaned off the track at the same corner; Fittipaldi won the race after it was called short. 1976 also saw changes to Brands Hatch including making the fearsome Paddock Hill bend a bit more tame and South Bank corner more of a left hand apex rather than a long hairpin. This race proved to be very controversial; as home favorite Hunt won the race but was later disqualified following a protest from Ferrari and other teams about Hunt not completing the first lap of the race; and the victory went to 2nd-placed Lauda. 1977 saw Hunt take victory without any controversy and when F1 returned to Silverstone 2 years later, Australian Alan Jones lapped the circuit more than 6 seconds inside the lap record in his ground-effect Williams. His teammate Clay Regazzoni won the race, Williams's first F1 victory. 1980 saw Jones win after the Ligiers of Jacques Laffite and Didier Pironi retired; and 1981 saw French rising star Alain Prost thoroughly dominate the first part race in his Renault; and there was an accident involving Canadian Gilles Villeneuve at the Woodcote Chicane which held up Briton John Watson ; but Watson passed several cars and won the race; the first for a car with an all-carbon fibre chassis. 1982 saw polesitter Keke Rosberg having to start from the back due to problems with his Williams and he begun a charge that brought him far up the field; but he retired, and there was another spectacular showing from Briton Derek Warwick in his underfunded Toleman; he managed to pass Pironi for 2nd, but he also retired with a broken driveshaft; the victory went to Austrian Lauda. , 1983 saw Prost win his 1st of 5 British Grands Prix and a spectacular performance from Briton Nigel Mansell in his first outing in a turbocharged Lotus, he started 16th and finished 4th. Lauda won again at Brands Hatch in 1984, during which FISA president Jean-Marie Balestre announced that the Tyrrell team was to be excluded from that year's championship for fuel irregularities, and the restarted race after a huge accident at Bottom Bend caused more controversy; Prost and Lauda had passed Brazilian Nelson Piquet on the last lap of the first race, but Piquet started in front of the two McLaren drivers; regulations dictated that the positions were on the grid were to be determined 2 laps before the restart was called; and an irate Prost made scathing comments about his countryman Balestre. , 1985 was to see Keke Rosberg set the all-time Formula 1 qualifying lap record for 17 years after posting fastest qualifying time for the race with an average speed of 258.983 km/h (160.92 mph). Silverstone, which was already a very fast circuit, was becoming faster and faster and the cars were lapping the circuit in the low 1-minute range. The race was an exciting one with Brazilian rising star Ayrton Senna making a great start from 4th and taking the lead by the first corner. He led until late in the race, when his car was running out of fuel while Prost was pushing him hard; Senna eventually ran out of fuel and Prost went on to take victory. 1986 saw 42-year old Jacques Laffite get involved in a first corner accident and slam head-on into the barriers, breaking both his legs and ending his Formula One career. Nigel Mansell, whose car broke at the start of the first race, got into his teammate Piquet's spare car and won the race; although this was the last F1 race at Brands Hatch. A number of people had concerns about the speeds of the cars on the small track; particularly the European Grand Prix held at Brands Hatch the previous year.  The southern English circuit was getting to be very fast- now with these 1,000+ hp, 1,180 pound cars, pole sitter Piquet's average qualifying speed was 140.483 mph (227.583 km/h) and his lap time was in the 1 minute 6 second range, compared to the 1 minute 20 second range in 1976. But Brands Hatch's demise was for political reasons- the international motorsports governing body at the time, FISA, had instituted a policy of long-term contracts for one circuit per Grand Prix. Brands Hatch was perceived as a poorer facility, and it did have very little run-off and room to expand, something Silverstone had in acres. Silverstone and the BRDC had signed a seven-year contract with Formula 1 and FISA at some point in 1986, to run from 1987 to 1993.  , 1987 saw Silverstone modified; the Woodcote chicane was no longer used and a new left-right chicane was built on the Farm Straight just before Woodcote. Silverstone's layout, like Brands Hatch, had changed little since 1949. The circuit was still fast; and it saw Mansell charge after Piquet (who had decided to run the whole race on one set of tires) and the British driver broke the lap record 11 times, caught and passed Piquet and took victory; the Silverstone crowd broke ranks and ran onto the circuit after the race was over; this was to start a number of dramatic events surrounding Mansell for the next 5 years. 1988 saw Senna win a rain-soaked event, and Mansell finished 2nd after driving very hard and passing many cars to attempt to catch Senna; this was one of Mansell's two race finishes that season. 1989 saw Prost win in a McLaren after his teammate Senna went off at Becketts; Mansell finished 2nd again driving for Ferrari; and sometime after the event, it was decided that Silverstone, the fastest circuit on the Formula One calendar, was to be heavily modified, and the project would be completed for 1991. The 1990 Grand Prix was the last motor race on the high-speed circuit; and Mansell drove hard and led a lot of the race; but gearbox problems eventually forced him to retire, where he threw his gloves into the crowd and announced that he was going to retire, a decision that he would later take back; and he effectively dominated the next two events, driving for Williams. The circuit was now slower and every corner on the circuit except Copse was different, and it also included an infield section right before the pits. After 1992, Mansell had retired from F1, and 1993 saw new Williams driver Damon Hill lead much of the race until his engine blew up, and Hill's French teammate Alain Prost took his 50th career Grand Prix win. , After the tragedies of Imola in 1994, a chicane was installed at the flat-out Abbey corner 6 weeks before the event was due to take place and Stowe corner was slowed considerably. Hill won the event, something his double world champion father Graham never did. 1995 saw another British driver, Johnny Herbert, take victory in his Benetton. 1996 saw further changes to the circuit, where Stowe was more or less restored to its 1991 design, and the 1999 event saw double world champion Michael Schumacher crash heavily at Stowe; he broke his leg, missed many races and this put him out of championship contention. There were attempts to bring the British GP back to Brands Hatch for 2002, but this never materialized. , The 2003 event was disrupted by a defrocked priest, Cornelius Horan , who ran onto the Hangar Straight during the race while cars were coming at him at 160+ mph. Marshals were able to get him off the track before he hurt himself or anyone else and he was later arrested; Brazilian Rubens Barrichello won the race for Ferrari. A dispute between Silverstone's owners, the British Racing Drivers' Club (BRDC), and the Formula One authorities in 2003 over the funding of necessary improvements to the track's facilities led to doubts over the future of the race. In October 2004 the British Grand Prix was left off the preliminary race schedule for 2005 because the BRDC refused to pay the race fee demanded by Bernie Ecclestone . However, after months of negotiation between the BRDC, Ecclestone and the Formula One constructors, a deal was made for the Grand Prix to be held at Silverstone until 2009. 2008 saw Briton Lewis Hamilton win for McLaren; and on the 4 of July, it was announced that Donington Park had been awarded the contract to host the British Grand Prix for 10 years from 2010.  However, Donington failed to secure the necessary funding to host the race, and its contract was terminated in November 2009. On 7 December 2009, Silverstone signed a 17-year contract to host the British Grand Prix from 2010 onwards. The 2010 race saw a new circuit configuration being used, using the brand new \"Arena\" layout.  For 2011 a new pit complex was built between Club and Abbey Corners, to where the start/finish line was moved. Silverstone is still a very fast circuit- with average speeds up in the 145 mph range for Formula 1 cars; one of the highest average speeds on the F1 calendar. , Despite the controversy and political bickering that has surrounded the future of the race in recent years, the British Grand Prix at Silverstone remains one of the world's premier motor racing events. , Embolded drivers are competing in the Formula One championship in the current season. , A pink background indicates an event which was not part of the Formula One World Championship. , Coordinates : 52°04′16″N 1°00′58″W ﻿ / ﻿ 52.071°N 1.016°W ﻿ / 52.071; -1.016 "
}
