{
  "category": "f1",
  "article": "The Canadian Grand Prix (known in French as the Grand Prix du Canada ), is an annual auto race held in Canada since 1961.  It has been part of the Formula One World Championship since 1967. It was first staged at Mosport Park in Bowmanville, Ontario as a sports car event, before alternating between Mosport and Circuit Mont-Tremblant , Quebec after Formula One took over the event. After 1971, safety concerns led to the Grand Prix moving permanently to Mosport. In 1978, after similar safety concerns with Mosport, the Canadian Grand Prix moved to its current home on Île Notre-Dame in Montreal . , In 2005, the Canadian Grand Prix was the most watched Formula One GP in the world. The race was also the third most watched sporting event worldwide, behind the first place Super Bowl XXXIX and the UEFA Champions League Final .  , Preceding the qualifying session in 2014, the Grand Prix organisers announced they had agreed to a 10-year extension to keep the Canadian Grand Prix at Circuit Gilles Villeneuve through 2024.  , , , The early Canadian Grand Prix was one of the premier events of the new Canadian Sports Car Championship , a series which had been created alongside the Canadian Grand Prix at Mosport Park near Toronto in 1961. Mosport Park (which is still in its original layout configuration) was a spectacular and challenging circuit that had lots of ups and downs; the circuit was popular with drivers. Several international sports car as well as Formula One drivers participated in the event. For the first five years, the event would be won by drivers with either prior Formula One experience, or would enter the championship after winning the Canadian Grand Prix. In 1966 the Canadian-American Challenge Cup ran the event, with American Mark Donohue winning.  Formula One took over the following year, although the CSCC and Can-Am series continued to compete at Mosport in their own events. , The event was run as part of the Formula One world championship first in 1967; Mosport was selected as the venue for the event. The Ontario circuit alternated with the Circuit Mont-Tremblant in Quebec, where the Canadian Grand Prix was held in 1968 and 1970. Mont-Tremblant, like Mosport, was a spectacular circuit that had lots of elevation change and was very challenging. The first championship race was held between the German and Italian rounds; it was won by Jack Brabham with his New Zealander teammate Denny Hulme completing a Brabham 1–2. , The 1968 event saw the unlucky New Zealander Chris Amon lead from the start until 17 laps from the end of the 90 lap distance when his gearbox broke; the McLaren team finished 1–2 with Amon's countrymen Hulme and Bruce McLaren taking top honors. The 1969 event at Mosport Park saw Briton Jackie Stewart climb up from 4th to take the lead, but Jacky Ickx was coming up fast, and Stewart and Ickx battled until lap 33, when they came to lap privateer Al Pease for the fourth time, Ickx attempted to pass Stewart, and the two cars collided. Stewart was unable to get his Matra going, but Ickx did get his Brabham going, and held onto the lead until the checkered flag. An angry Stewart complained to his boss Ken Tyrrell about Pease, who complained to the organizers. The 48-year old Pease was then given the black disqualification flag after completing less than half the amount of laps the leaders had completed in an almost embarrassingly outdated Eagle-Climax, and became the only driver in F1 history ever to be disqualified for being too slow. The 1970 event saw Ickx win again with his Swiss teammate Clay Regazzoni making the result a Ferrari 1–2. But the Mont-Tremblant circuit was later closed down because of safety regarding the bitter winters seriously affecting the track surface and a dispute with the local racing authorities there in 1972. The alternating of the race stopped and Mosport solely continued to hold the Canadian Grand Prix from 1971. , The 1971 event saw Mosport Park flooded with rain; the main event was delayed after a fatal accident at a Formula Ford support race and by the time it started, it was raining heavily. Jackie Stewart took victory easily in a Tyrrell from Swede Ronnie Peterson in a March. 1972 saw Mosport upgraded with new safety features, and Stewart won again. 1973 was an interesting event; like the race 2 years previous it was a rain-soaked event. Austrian new-boy Niki Lauda in a BRM took the lead from Peterson in a Lotus on Lap 3, Lauda led until the 20th lap when he came to change tires; there was considerable confusion after François Cevert and Jody Scheckter collided on Lap 33 after which there was bungled pace car interlude after which things became very confused as this failed to pick up the leader and allowed those ahead to gain almost a lap. All this meant that Briton Jackie Oliver ended up in the lead with American Peter Revson 2nd and Frenchman Jean-Pierre Beltoise 3rd. Of these three Revson had the most competitive car and so eventually moved into the lead and led all the way to the flag while Peterson's Brazilian teammate Emerson Fittipaldi charged to try to make up for lost ground and overtook Oliver and Beltoise in the closing laps to grab second. For hours after the race confusion reigned but eventually it was confirmed that Revson was the winner- thanks to a lucky break when the pace car came out. The 1974 event saw Fittipaldi win while his championship rivals Clay Regazzoni finished 2nd and Jody Scheckter crashed heavily after a brake failure on his Tyrrell. There was no 1975 event, and 1976 event was one where Briton James Hunt found out that his 9 points from Brands Hatch were taken away and he was disqualified; Hunt won the Canadian Grand Prix event that year, driving furiously throughout the race. , 1977 was the race where French-Canadian Gilles Villeneuve made his debut for Ferrari. But concerns about the bumpy Mosport Park's safety arose when Briton Ian Ashley had a horrendous accident while cresting a bumpy rise. Ashley's Hesketh flipped over the Armco guardrails and went into a television tower. The German-born Englishman was seriously injured and safety operations to rescue him were inefficient and time-consuming; and the lack of safety at Mosport was underlined when Jochen Mass lost control of his McLaren and hit a guardrail that virtually flattened upon impact. Jody Scheckter won this race in his Wolf , but with safety not being good enough for Formula One at the rough and very fast Mosport Park circuit, a new circuit was constructed in Montreal, called the Circuit Île Notre-Dame ; where the race was first held in 1978 and where it has been held ever since. , The first winner in Montreal was Quebec native Villeneuve, driving a Ferrari. 1979 saw Australian Alan Jones win, and he then won the 1980 race and the driver's championship that year. 1980 also saw a big startline pile-up with involved Jones's Brazilian championship rival Nelson Piquet after he and Jones collided going into the very fast Droit du Casino corner. Piquet jumped into his spare car with a more powerful qualifying engine; but the engine blew up and Piquet retired from the race. Frenchman Jean-Pierre Jabouille 's season and F1 racing career came to an end when he crashed his Renault head-on into a tire wall. He had badly broken legs; it took the tall Frenchman months to recover. 1981 saw a rain-soaked event in which near end of the race, Villeneuve demonstrated his car control skill when the front wing of his Ferrari was askew from a crash and he drove on to 3rd place with the car in this condition. Frenchman Jacques Laffite took what was to be his last F1 victory, followed by Briton John Watson and Villeneuve. , Villeneuve was killed in 1982 on his final qualifying lap for the Belgian Grand Prix . A few weeks after his death, the race course in Montreal was renamed Circuit Gilles Villeneuve after him. Gilles Villeneuve was one of the first people inducted into the Canadian Motorsport Hall of Fame , and is so far the only Canadian winner of the Formula One Canadian Grand Prix. The 1982 Canadian Grand Prix was a tragic event, in the shadow of the death of Villeneuve a month earlier. It saw another accident when Villeneuve's teammate Didier Pironi stalled at the front of the grid. First, Raul Boesel struck a glancing blow to the stationary vehicle, and then Riccardo Paletti crashed directly into the rear of Pironi's Ferrari at over 180 km/h (110 mph). Pironi and F1 doctor Sid Watkins came to Paletti's aid to try to extract him from his car, which briefly caught fire. After a half hour, the 23-year old Paletti was extracted and flown to a nearby hospital, where he succumbed to his injuries. Nelson Piquet won the race in his Brabham. 1982 was also significant in that the race was moved from October to June, and it has remained around this time ever since. 1983 saw Frenchman René Arnoux win his first race as a Ferrari driver, and the following year Piquet won again in a BMW-powered Brabham. 1985 saw Ferrari finish 1–2 with Italian Michele Alboreto and Swede Stefan Johansson taking top honors from Frenchman Alain Prost , while Lotus gained their final ever lockout of the front row when Elio de Angelis and Ayrton Senna started 1–2. 1986 was a competitive race, Finn Keke Rosberg in a McLaren charged through the field, caught and then passed British leader Nigel Mansell . But Rosberg, like the other front runners, had problems and so Mansell took advantage of these problems and won the race. In 1987 , the race was not held due to sponsorship dispute between two local breweries, Labatt and Molson .  During the break the track was modified, and starting line moved to its current position. , 1988 saw Brazilian Ayrton Senna take victory in the all-conquering McLaren MP4/4 with its Honda turbo engine, and the following year he so very nearly won again, but the Honda engine in his McLaren failed and Belgian Thierry Boutsen took victory, which was the first in his F1 career. 1990, like the year before, was a rain-soaked event, and it saw a number of accidents; Senna came out to win again. 1991 saw a dramatic finale in which Nigel Mansell's Williams failed on the very last lap only a few corners from the finish line; Nelson Piquet took his 23rd and final F1 victory in a Benetton. Austrian Gerhard Berger won the 1992 event after the dominant Mansell spun off after a collision with Berger's teammate Senna. Alain Prost won the 1993 event while fending off a spirited drive from Senna, and in response to the Imola tragedies, the 1994 event saw the very fast Droit du Casino curve being turned into a chicane. German Michael Schumacher won this event. Ferrari's Jean Alesi won the 1995 edition , which occurred on his 31st birthday and which would be the only win of his career. Alesi had inherited the lead when Michael Schumacher pitted with electrical problems and Damon Hill 's hydraulics failed. The victory was a popular one for Alesi, particularly after several unrewarded drives the year before, namely in Italy . Alesi's win at Montreal was voted the most popular race victory of the season by many, as it was the number 27 Ferrari—once belonging to the famous Gilles Villeneuve at his much loved home Grand Prix. Schumacher gave Alesi a lift back to the pits after Alesi's car ran out of fuel just before the Pits Hairpin. , The 1996 race saw the Casino corner removed and the layout changed; the run from the hairpin at the bottom of the circuit was turned into a straight. Briton Damon Hill won this event, and the 1997 race was stopped early due to a crash involving Olivier Panis . He was sidelined for nine races and some see it as a turning point in the career of the 1996 Monaco Grand Prix winner. The races from 1997 to 2004 (except 1999 and 2001) saw a romp of Michael Schumacher victories, all in a Ferrari. 1999 saw Finn Mika Häkkinen win, and in 2001 , there was the first sibling 1–2 finish in the history of Formula 1, as Ralf and Michael Schumacher topped the podium. The Schumacher brothers would finish 1–2 in the 2003 edition as well, 2001 was also noted for Jean Alesi achieving Prost's best finish of the season; he celebrated his fifth place by doing several donuts in his vehicle, and throwing his helmet into the crowd. The 2007 race was the site of rookie Lewis Hamilton 's first win. On lap 67, Takuma Sato overtook McLaren - Mercedes 's Fernando Alonso , to cheers around the circuit, just after overtaking Ralf Schumacher and having overtaken Ferrari's Kimi Räikkönen earlier in the race.  The race saw Sato move from the middle of the grid to the back of the pack and to a high of fifth before a pit-stop error caused him to move back to eleventh. Sato fought up 5 places in the field in the last 15 laps to finish sixth. Sato was voted \"Driver of the Day\" on the ITV website over Lewis Hamilton's first win. The race also saw an atrocious crash involving Robert Kubica (who went on to win the race the following season , resulting to be his only one in F1). The 2011 Canadian Grand Prix became the longest ever Formula One race to date; rainstorms delayed the race for hours; but when it got going again Briton Jenson Button stormed through the field from last place after the restart on lap 41  and caught German leader Sebastian Vettel ; whom he forced into making a mistake, passed the Red Bull driver and the Briton took victory, in what he described as \"my best ever race\". 2013 saw Vettel dominate in his Red Bull, but it was also to see the first Formula One-related fatality in 12 years. 38-year old track marshal Mark Robinson was run over by a recovery vehicle, and the accident happened while marshals were removing the Sauber of Esteban Gutiérrez after the Mexican had spun off during the closing stages of the race. Robinson died later in hospital and became the first track-side death in Formula One since that of marshal Graham Beveridge at the 2001 Australian Grand Prix . , In the weeks leading up the Grand Prix, city officials trap as many groundhogs as they can in and around the race course, and transport the animals to nearby Île Ste-Helene.  Nonetheless, in 1990, Alessandro Nannini struck a gopher on the track which damaged his tyre. In 2007, a groundhog disrupted the practice session of Ralf Schumacher . On race day itself, Anthony Davidson had been running in third until he struck a groundhog, initially thought to be a beaver, which forced him to pit and repair the damage to his front wing. In 2008, a groundhog crossed the track at the hairpin in the 2nd practice session but luckily did not disrupt the session. , The final corner of Circuit Gilles Villeneuve became well known for crashes involving former World Champions . In 1999, Damon Hill , Michael Schumacher and Jacques Villeneuve all crashed into the same wall which had the slogan Bienvenue au Québec ( Welcome to Quebec ) on it. The wall became ironically known as the \"Wall of Champions\". The wall also was involved in a crash with Ricardo Zonta , who was, at the time, the reigning FIA GT sports car champion. In recent years, GP2 Champion Nico Rosberg and CART Champion Juan Pablo Montoya have also fallen victim to the wall. In 2011 Friday practice the wall claimed reigning F1 Champion Sebastian Vettel .  , Before the wall was named it also claimed victims such as 1992 World Sportscar Champion and long-time F1 driver Derek Warwick who spectacularly crashed his Arrows - Megatron during qualifying for the 1988 Canadian Grand Prix .  , Full list of victims: , On October 7, 2008, the Canadian Grand Prix was dropped from the 2009 Formula One calendar , which left the Montreal race off the list for the first time since 1987 .  In the provisional 2009 schedule released in June 2008, the Canadian Grand Prix was to have been held on June 7, a date taken by the 2009 Turkish Grand Prix in the revised schedule.  , Since the US Grand Prix was dropped after 2007, this means that in 2009 no Formula One race was held in North America for the first time since 1958.  (The American Indianapolis 500 formed part of the FIA World Drivers' Championship from 1950 to 1960, but was not run to Formula One regulations and only very rarely entered by regular championship competitors.) , During the Australian Grand Prix, reports surfaced that the Canadian Grand Prix could return during the 2009 season in the event that the race circuit in Abu Dhabi was not ready in time.  On April 26, 2009, Speed reported Bernie Ecclestone as saying the FIA was negotiating a return of the Canadian Grand Prix for the 2010 season, provided upgrades to the circuit were completed. , On August 29, 2009, the BBC reported the provisional schedule for the 2010 season , which had both the Canadian and British Grand Prix marked down as \"provisional\". The Canadian GP was scheduled for June 6.  The 2010 Canadian Grand Prix was eventually run in Montreal on June 13, 2010.  , On November 27, 2009, Quebec's officials and Canadian Grand Prix organizers announced they had reached a settlement with Formula One Administration and signed a new five-year contract spanning the 2010–2014 seasons.  Under the five-year agreement, the government pays 15 million Canadian dollars a year to host the race, much less than the 35 million a year Ecclestone initially asked for.  , Because of tobacco legislation which prohibited further such sponsorship, new venues, and a maximum of 17 races on the schedule, the Canadian Grand Prix was initially removed from the 2004 F1 schedule. However, Canadian officials were able to raise enough money to keep a Grand Prix race, with the FIA allowing expansion to an 18-race schedule.   , A pink background indicates an event which was not part of the Formula One World Championship. , Coordinates : 45°30′14″N 73°31′37″W ﻿ / ﻿ 45.504°N 73.527°W ﻿ / 45.504; -73.527 "
}
