{
  "category": "f1",
  "article": "Carlos Sainz Vázquez de Castro   audio   ( help · info ) , known as Carlos Sainz, Jr.   audio   ( help · info ) or simply Carlos Sainz , (born 1 September 1994) is a Spanish Formula One racing driver and the son of former double World Rally Champion Carlos Sainz . In 2012 Sainz Jr. raced in the British and European Formula 3 championships for Carlin .  He raced for DAMS in Formula Renault 3.5 in 2014 winning the championship. , On 28 November 2014, it was announced that he will drive for Scuderia Toro Rosso in the 2015 Formula One season .  He scored points on his début at the 2015 Australian Grand Prix , finishing in ninth position. , , , Born in Madrid , Sainz began his career in karting . In 2008 he won the Asia-Pacific KF3 title, as well as finishing runner-up in the Spanish Championship.  In 2009 he won the prestigious Junior Monaco Kart Cup , and was runner-up in the European KF3 Championship.  , Sainz raced in Formula BMW Europe in 2010 with the EuroInternational team. He is also part of the Red Bull Junior Team programme. He made his Formula BMW début during a guest drive in the Formula BMW Pacific series at Sepang . Because he was a guest driver, he was ineligible to score points, however his first races in Malaysia went very well, as he managed to get second place at the opening race. That impressive debut followed with 4th place. On the following race day, he retired in the first race but won the second race. It was this impressive start which got him a place at the Red Bull Junior Team. Doctor Helmut Marko applauded Sainz and his strong start to a great career in motor racing. He came 7th in the following race but yet again amazed everybody by winning again. He missed the next races in China but came back in Singapore. He finished in 6th in the first race and 2nd in the second race. This denied anyone who thought he was only good at the Malaysian track. He missed the Japanese races but shortly returned to the season finale in Macau to win. Overall, in 9 races he achieved 3 pole positions, 2 wins and 2 fastest laps. , In Formula BMW Europe, he started his career in that series with a podium position of 3rd and 6th place at the circuit de Catalunya. At Zandvoort, he took 5th and 2nd place. At Valencia he scored a lowly 7th and 10th place to take 18 points out of the possible 60 which Jack Harvey took to lead the championship. A weekend at Silverstone saw him take 3rd place and a victory in the following race, his first that season. Hockenheim saw him take 11th and 6th place. A 4th and a podium position of 3rd enlightened his championship hopes but Robin Frijns was on a charge, scoring a podium position in every race bar 3, two he finished in 4th. A double retirement at Spa put an end to his championship dreams. An 8th and 6th at the season finale at Monza followed. He finished the season 4th with 227 points. , Sainz also competed in the UK Formula Renault Winter Cup, finishing 6th in the first race and retiring from the second race at Snetterton. , During the 2012 season, Sainz raced in both British and Euroseries Formula 3 championships. He won five races and finished nine times on the podium, scoring a pole position, in the British championship, finishing in sixth position. He just scored two podiums and two pole positions in the Euroseries championship, in the first venue, finishing in ninth position overall. , In 2013, Sainz signed with Arden to compete in the GP3 series. After a bad weekend in Barcelona, where he was penalised during the qualifying session, he finished in third position in the sprint race in Valencia, after a fifth position in the first race. Another bad weekend followed in Britain, although he finished in the points in both races in Germany. , Sainz raced in Formula Renault 3.5 for the first time in 2013. However, because he was more focused on GP3 at the time he missed several races in his first season. In Monaco he was 6th was after a difficult start to his GP3 season. He had a double retirement in Spa. He missed the Moscow and Austria races but returned at Hungary to take 7th place in Race 1 but 22nd in race 2 after a few problems. In France, at the Circuit de Paul Ricard he had another double retirement. In the last race weekend of the year in Catulunya, he retired in race 1 but managed to score 6th place. He finished the season in 19th place with 22 points. , In 2014, he switched teams to DAMS. In the season opener at Monza he finished 18th in the first race but won the second. He left Monza with 25 points, beating his previous seasons score by 3 points. Another win at Aragon meant he doubled his score and in race 2, he finished in 4th. Another 4th place followed at the one race in Monaco. The weekend at Spa followed with another 2 wins. Moscow followed and he did not perform well. 14th and 6th meant that he only took 8 points from a possible 50. At the Nurburgring Gp Circuit, he won race 1 but in race 2, he retired. In Hungary, he was no match for Roberto Merhi who lead by half a minute from the rest of the field in the wet. Another 6th place followed in race 2. In France, he won and scored a total of 50 points to extend his championship lead over Merhi. , Sainz was announced to test with both Red Bull and Toro Rosso teams during the Young Drivers' test in Silverstone.  He will partner Max Verstappen at Toro Rosso , in 2015 , following Daniil Kvyat 's promotion to Red Bull .  Sainz selected 55 as his race number. He qualified inside the top ten for his début, at the Australian Grand Prix , and finished the race in ninth position.  , ( key ) (Races in bold indicate pole position; races in italics indicate fastest lap) , * Sainz was a guest driver, ineligible for points. † Driver did not finish the race, but was classified as he completed over 90% of the race distance. , ( key ) (Races in bold indicate pole position; races in italics indicate fastest lap) , ( key ) (Races in bold indicate pole position; races in italics indicate fastest lap) , † Did not finish, but was classified as he had completed more than 90% of the race distance. , ( key ) (Races in bold indicate pole position; races in italics indicates fastest lap) , * Season in progress. "
}
