{
  "category": "f1",
  "article": "Felipe Massa ( Portuguese pronunciation:  [fiˈlipi ˈmasɐ] , born 25 April 1981) is a Brazilian Formula One racing driver who currently drives for Williams . Massa started his career in go-karting from the age of eight continuing in national and regional championships for seven years. He moved into Formula Chevrolet and claimed the championship. He moved in Italian Formula Renault in 2000 and won the title along with the European championship. Massa went into Euro Formula 3000 taking the championship. , Massa started his Formula One career with Sauber before joining Scuderia Ferrari as a test driver for 2003. He returned to Sauber for 2004 and 2005 before rejoining Ferrari where he won two races in 2006 including his home Grand Prix becoming the first Brazilian since Ayrton Senna to win the Brazilian Grand Prix. Massa won three races in 2007, finishing 4th in the Drivers' Championship. He finished second in the 2008 Drivers' World Championship after a long title battle with Lewis Hamilton . At the 2009 Hungarian Grand Prix , Massa was injured by a suspension spring off the Brawn GP car of Rubens Barrichello . Massa was forced to miss the rest of the season but returned in 2010. Massa suffered a dip in form in 2011 scoring no podiums but consistently scoring points. Massa contributed to Ferrari's Constructors Championships in 2007 and 2008 and was under contract to race for the team until the end of the 2013 season.  On 10 September 2013, he confirmed he would be leaving Ferrari at the end of the 2013 season. On 11 November, it was announced that Massa would replace Pastor Maldonado alongside Valtteri Bottas at Williams from 2014.  , , , Born in São Paulo , Massa is a Brazilian whose grandfather emigrated from Cerignola , Italy. , Massa began karting when he was 8 years old, finishing fourth in his first season. He continued in national and international championships for 7 years, and in 1998 moved into Formula Chevrolet, finishing the Brazilian championship in fifth place. During the following season, he won 3 of the 10 races and claimed the championship. In 2000, he moved to Europe to compete in the Italian Formula Renault series, winning both the Italian and the European Formula Renault championships that year. He could have moved to Formula Three , but instead chose the Euro Formula 3000 , where he won 6 of the 8 races and the championship. He was then offered a Formula 1 test with the Sauber team, who signed him for 2002. He also drove for Alfa Romeo in the European Touring Car Championship as a guest driver. , In his rookie year in Formula 1, Massa was paired with 1999 International Formula 3000 champion Nick Heidfeld . He proved he was a competitive driver, but made several mistakes, including spinning off the track several times. Nevertheless, Massa scored 4 championship points in his first season, his best result a 5th place at the Spanish Grand Prix at the Circuit de Catalunya . He suffered a one race suspension late in the season, forcing him to miss the United States Grand Prix . Heinz-Harald Frentzen , Sauber's former driver, drove for Massa in his place. Massa returned to the driver's seat for the Japanese Grand Prix , but Sauber confirmed that Frentzen would partner Heidfeld in 2003 , leaving Massa without a race seat. Instead, he spent a year with Sauber's engine suppliers, Ferrari , gaining experience by testing for the championship-winning team. , Sauber then re-signed Massa for the 2004 season . In 2004, he scored 12 of Sauber's 34 points, his best result was a fourth place at the Belgian Grand Prix . Giancarlo Fisichella scored the team's other 22 points. Massa remained at Sauber in 2005 . Though he scored only 11 points, he outpaced his teammate Jacques Villeneuve through most of the season, and beat him in the drivers' championship. After Sauber was taken over by BMW , Massa was released and replaced by his former team-mate Heidfeld. In 2006 , Massa re-joined Ferrari, paired with Michael Schumacher . , Massa started well at Ferrari, qualifying second at the opening race in Bahrain , and coming from 21st position to 5th in Malaysia, beating teammate Michael Schumacher, who had started from 14th. In Bahrain, however, in both Saturday practice and the race, Massa resumed his tendency to spin, narrowly missing Fernando Alonso , the eventual winner of the race. At the Australian GP he crashed his Ferrari in qualifying, then collided with Christian Klien and Nico Rosberg at the first corner of the race. Nevertheless, Massa scored his first career podium at the Nürburgring , finishing third behind Michael Schumacher and Fernando Alonso. He also set the fastest lap at Barcelona in 2006. Massa had four more podium finishes in 2006, and took his first F1 pole position and his first F1 win at the Turkish Grand Prix at the Istanbul Park circuit.  His future position at Ferrari was secured when Michael Schumacher announced on 10 September 2006, he would retire from F1 at the end of the 2006 season. On 22 October, Massa won his home race at the Brazilian Grand Prix , making it the first time a Brazilian driver had won at Interlagos since Ayrton Senna in 1993. Massa finished the season third with 80 points, behind world champion Fernando Alonso and Ferrari teammate Michael Schumacher .  , Massa topped the time sheets on five occasions and set the fastest lap for four circuits during the 2007 pre-season testing. However, his 2007 season began with problems. At the season opening Australian Grand Prix , he suffered a gearbox problem during qualifying and required an engine change. Massa started the race from 22nd position due to these problems and a 10-grid-slot penalty for the engine change. He employed a one pitstop strategy for the race and finished in sixth place. Massa's problems continued in Malaysia, where despite qualifying on pole position, the McLarens of Fernando Alonso and Lewis Hamilton overtook him at turn one. Massa ran off the track while attempting to overtake Hamilton, and lost two more places, dropping down to fifth place, where he finished the race. However, his season subsequently improved, as he won the Grands Prix of Bahrain and Spain , both from pole position, and finished third in Monaco . The race stewards at the Canadian Grand Prix disqualified Massa for leaving the pit lane while the red light was showing.  After this disqualification, he won one more race at the Turkish Grand Prix ,  and finished on the podium at six more races, including a second-place finish at his home grand prix at the Brazilian Grand Prix. Massa led much of the Brazilian Grand Prix , until yielding the lead to teammate Kimi Räikkönen , thus securing Räikkönen's world championship title. Massa finished the 2007 season ranked fourth in the drivers' standing with 94 points. , In October 2007, Massa extended his contract with Ferrari to the end of 2010.  , Massa endured a terrible first race weekend of his third year at Ferrari . The team, surprisingly, looked off the pace as Massa qualified fourth and his race was even less successful, spinning off at the first corner of the first lap, on lap 26 he collided with David Coulthard and eventually retired due to engine failure. , Things brightened up in Malaysia as he qualified on pole, half a second clear of Räikkönen in P2,  but the race itself did not go as well. Massa led from pole in the first 16 laps but was jumped by Räikkönen in the pitstops. He was still in contention for the victory battle and was chasing Räikkönen until he spun off on lap 31 while in second and retired. , After these two races people began to speculate that Massa had returned to his mistake-prone ways of when he first entered F1, and that he could not handle F1 cars without the help of traction control (which had been outlawed from the start of the 2008 season), but the next race put those thoughts on hold. , Massa went into the Bahrain Grand Prix (where he won in 2007 ) with no points. He dominated the weekend, but Robert Kubica beat him to pole in qualifying. In the start, Massa beat Kubica even before the first corner. Räikkönen soon got up to second but he could not do a repeat of Malaysia. Massa was quicker and easily won by 3 seconds to open up his account.  , In Spain , Massa qualified third behind Räikkönen and Fernando Alonso . He passed Alonso at the start and got up to second behind Räikkönen. He stayed on his teammate's shadow for the whole race, but there was no way he could pass or get ahead in the stops. He had to settle for second. , Massa took pole position at the next round at Turkey . He led from the start, and maintained the lead during the round of pitsops, but was passed by Lewis Hamilton 's three-stopping McLaren at the start of the second stint. Hamilton pulled away, but he did not have the pace to take the lead that was needed to make his third stop and still come out ahead of Massa. Massa was a full 7 seconds up the road by then and took his second win of the season, and his third consecutive at the circuit.  , At Monaco Massa qualified on pole, to his surprise (he had mentioned prior to the weekend that he did not like the circuit) and built up a 15-second lead over Räikkönen in the rain, before that advantage was wiped out by the safety car. Soon Räikkönen was out of contention with a drive-through penalty. After the safety car went, Massa again started pulling away from Robert Kubica, but he ran up an escape road and lost the lead. Massa did jump Kubica in the pitstops but Lewis Hamilton 's one-stopping McLaren was by now way ahead of both of them. During the pitstops, Massa was fueled to the end of the race and was struggling, holding Kubica up. The track dried out and Massa had to pit for dries while Kubica took his second fuel stop at the same time and jumped him. Massa thus finished third behind Hamilton and Kubica. , In the Canadian Grand Prix , Massa qualified down in 6th place. In the race there was a safety car due to an incident involving Adrian Sutil . All drivers pitted, but Massa had to pit twice due to a delay with his fuel rig, which put him down to 17th. Massa then staged a fightback, charging back up to fifth place by the end of the race. Two of Massa's title contenders failed to finish after Hamilton collided with a stationary Räikkönen in the pitlane, allowing Massa to equal Hamilton and jump ahead of Räikkönen in the driver standings. , In the French Grand Prix , Massa qualified 2nd on the grid behind his teammate Räikkönen. Massa stayed some 3 to 4 seconds behind his teammate for the first half of the race. However, Räikkönen had a developing problem in his exhaust system, which allowed Massa to overtake him and win the race. This win gave Massa lead in the championship, 2 points ahead of Robert Kubica, 5 points ahead of Räikkönen and 10 points ahead of Hamilton. Massa was the first Brazilian to lead the championship since Ayrton Senna in the 1993 Formula One season .  , In the British Grand Prix , Massa set the quickest time in 1st practice but immediately crashed. Things did not go any better during the rest of the weekend, as he had his season's worst qualifying down in 9th. In the wet race, while Hamilton dominated and Räikkönen finished fourth, things made a turn for the worse as he spun an embarrassing five times and finished last in 13th, over a lap down behind both his rivals. And so, at the end of the halfway stage of the season, Hamilton, Massa and Räikkönen were deadlocked on 48 points, with Robert Kubica only 2 points behind them. , The tenth round of the season was in Germany . Massa qualified 2nd behind Hamilton. He stayed second and was set to finish there until a crash involving Timo Glock brought out the safety car. Due to a miscommunication, Hamilton stayed out while the others, led by Massa pitted. However, when all the stops were over, Massa was behind Nelson Piquet, Jr. who had already pitted as he was on a one-stopper. Then, when a charging Hamilton came at him in the last 10 laps, Massa could not hold him off and subsequently finished third. After the race, Massa was 4 points behind Hamilton but 3 ahead of Räikkönen. , At the Hungarian Grand Prix , the McLarens who were looking dominant locked out the front row, and the best Massa could get was third. However, at the start itself, Massa passed both Heikki Kovalainen and pole sitter Hamilton on the run down to the first corner. He had the race in control from that point, and built up a five-second lead over Hamilton. When Hamilton suffered a puncture, Massa was left 20 seconds in front and seemed to have victory in the bag, but with 3 laps remaining he suffered an engine failure and retired. , The twelfth round of the season, the European Grand Prix was in Valencia, Spain. Massa took pole position comfortably at this new circuit, and led right from the start. However, during one of his pitstops he was released early and almost touched wheels with Adrian Sutil who was already coming down the pitlane. Massa let Sutil go ahead so it only cost him a second, he won with ease, including setting the fastest lap. After the race, the stewards decided to fine Massa €10,000 for the incident with Sutil, but the victory stood and he was only 6 points behind Hamilton as well as being 7 ahead of Räikkönen. The race was Massa's 100th Grand Prix entry, making him to date the only driver in history to win his 100th GP. , The next race was Belgium , Massa qualified second behind Hamilton. He lost a place at the start to Räikkönen and stayed in third until lap 42 of 44 when Hamilton passed Räikkönen for the lead, just after cutting a chicane. The two had more battles throughout that lap, which resulted in the Finn crashing out, promoting Massa to second, despite the Brazilian dropping 9 seconds on the last lap. Hamilton crossed the line first, but was penalised 25 seconds by the stewards after the race for cutting the chicane, and so the win went to Massa putting him only 2 points behind Hamilton. , At Italy Ferrari's home race, the weekend was wet throughout, and Massa was off form, qualifying only sixth, but he had a great chance to take the championship lead as Hamilton was down in 15th. During the race, Massa got up to third, but dropped back down to sixth after he pitted once more than most others. He finished there, but as Hamilton only finished seventh, there was only a 1-point gap now between them. , Massa took pole position for what was the first ever F1 night race and inaugural Singapore Grand Prix , beating Hamilton's best time by six tenths of a second. He maintained the lead at the start and after 14 laps, was over 5 seconds ahead of Hamilton. However, a crash for Nelson Piquet, Jr. brought out the safety car, bunching up all the cars. It was then time for the first round of stops and during his stop Massa was given the green light to go, but the refueller was still refuelling the car. Massa left with the fuel rig attached and so had to stop at the end of the pitlane. The mechanics ran the whole length of the pitlane and finally removed the rig, but Massa was now last. He was then given a drive-through penalty for an unsafe release, and was 15 seconds behind the rest of the field. His race ruined, he finished 13th and Hamilton who finished 3rd was now 7 points ahead of him. , At the Japanese Grand Prix Massa struggled in qualifying, having to settle for 5th on the grid. Meanwhile, Hamilton, his main rival took pole position.  At the start there was an incident between Hamilton and Räikkönen, dropping the former to sixth. Massa stayed fifth, a place in front of his rival. On the second lap, as Massa was stuck behind the slower car of Jarno Trulli , Hamilton tried to pass him. The result was a collision, with Hamilton spinning down to the back, and Massa dropping down to seventh. He was given a drive-through penalty for the incident, and found himself down in 14th. He made a charge up the order, setting the fastest lap on his way to getting 8th and one point. This became seventh after a controversial 25-second time penalty was issued to Sébastien Bourdais , who was judged by the stewards to have caused a collision with Massa whilst exiting the pitlane.  , At the Chinese Grand Prix the following week Massa and teammate Räikkönen, despite strong performances at Fuji, struggled for pace the entire weekend, a situation which Stefano Domenicali (Ferrari team principal) could not explain.  Massa qualified 3rd behind Räikkönen's Ferrari and title rival Hamilton. Following the pattern of the weekend Massa struggled to keep up with Hamilton, who raced away and maintained a comfortable margin. Whilst he eventually found some speed after the graining period on the medium compound tyres, he was unable to catch Hamilton. As Räikkönen yielded second place to keep Massa's title hopes alive, Hamilton pulled his lead out to 7 points in the Drivers championship. , Massa remained optimistic stating \"For sure we are in a difficult position but we know many things can happen in one race\"  and \"Always when you play at home you usually play better\",  as the last two years he finished strongly at Interlagos (a 1st in 2006 and a 2nd in 2007). At the last race of the season, the Brazilian Grand Prix the situation for Ferrari was: Felipe Massa was seven points behind Lewis Hamilton, meaning that Massa had to either finish first or second to win, and Hamilton had to be outside the top 5 – the same position Räikkönen had been in a year earlier, when he won the championship. , Qualifying went well, Massa qualifying on pole, while Räikkönen qualified 3rd, just ahead of Hamilton.  There was a rainshower just before the start of the race, and thus all drivers started on intermediates. Massa maintained the lead, and after 10 laps everyone had to change to drys on a drying track. Although the order was shuffled, Massa still led. He dominated the rest of the race, set the fastest lap and won by 13 seconds even though everyone had to change to intermediates after a late rainshower. Hamilton, meanwhile, struggled for pace. He was lying fourth for most of the race until the late shower, behind Massa, Alonso and Räikkönen. During the late shower, Timo Glock gambled on staying out on drys. He was fourth with Hamilton fifth. With three laps to go, Massa still led with Hamilton 5th. If the race stayed as it was Hamilton would win the Championship. Then Hamilton, having made a mistake, was passed by Sebastian Vettel , demoting him to 6th. Going into the last lap, if the order stayed as it was, then Massa would have been champion. Massa crossed the chequered flag and thought that he had won the championship. Hamilton was still sixth as he came up to the second-to-last corner, but then passed Glock who had just been overtaken by Vettel and who was struggling for grip on his dry tyres, and so this moved him into 5th place. Crossing the line Hamilton won the Drivers title by a just a single point.  If he had tied points with Massa, by virtue of 6 victories to 5 in the season, Massa would have won the title. , Following the 2008 seasons F1.com called Massa \"no more the nearly man\"  and emphatically stating he is \"No more the Ferrari number two, Massa is now a contender\".  His maturity was also praised by Ferrari President Luca di Montezemolo , commenting \"I can only imagine how painful that moment must have been for him. However, I would like to give him my very special compliments, not only for dominating the running out there on the track in front of his fans, proving he is worthy indeed of the world title, but also for his maturity and sportsmanship off the track. He's a great champion and a great man.\"  , During the course of the season, Massa had 6 pole positions – at the Malaysian , Turkish , Monaco , European , Singapore and Brazilian Grands Prix. He had 3 fastest laps – at the European , Japanese and Brazilian Grands Prix. He had 6 wins – at the Bahrain , Turkish , French , European , Belgian and the Brazilian Grands Prix. , Felipe Massa gave Ferrari's 2009 challenger – the F60  – its shakedown test at Mugello on 12 January 2009. , Ferrari confirmed that it would equip the F60 with KERS several days before the season opening Australian Grand Prix . Friday practice session did not begin so well for Massa as he recorded the 7th and 10th fastest times. Saturday qualifying fared little better as he lined up 7th (although was promoted to 6th as Glock's Toyota was disqualified). In the race the Ferrari's poor ability to handle its tyres lead to their aggressive race strategy of super soft/medium/medium compounds paying little dividends after the first 6 laps (where the Ferraris moved to the front of the pack). Although Massa managed to stay in the top 3 for the first half of the race, the exceptionally quick graining of the super soft tyres forced him into a 3 stop strategy. Before he was able to complete the race a mechanical problem forced him to retire. , In Malaysia , an error of judgement by Ferrari meant that Massa failed to make it through the first session of qualifying. In an interview to Rede Globo , Massa revealed that he and the team believed that his initial time was quick enough to proceed into Q2, and refrained from recording further times in order to conserve the car's engine. However, this was not the case, and Massa subsequently ended up in 16th for the race.   In the race, Massa was classified as having finished in 9th, just outside of the points-paying positions, after the race was abandoned on the 33rd lap due to torrential rain, poor light, and timing delays. Massa also failed to score in the next two races, retiring from the Chinese Grand Prix with electrical problems, and finishing well outside of the point scoring positions in 14th in Bahrain , due to a KERS problem and damaging his car's front-wing on the first lap. , In Spain , Ferrari arrived with an upgraded car which attempted to fix many of the flaws present in the prior races. With the new aerodynamic parts, Massa managed to qualify in fourth place. He managed to maintain third position for a majority of the race before a computer issue showed the car as having less fuel than it should have, forcing him to conserve fuel in the final 10 laps, allowing Vettel and Alonso to cruise past, only for him to realise that the car had enough fuel for him not to need to conserve, after the race. The much upgraded car showed its pace by setting the third fastest time of the race after the two Brawns and in front of both Red Bull cars. , Monaco was another step in terms of improvement for the car as Massa finished fourth in the race, with fastest race lap. After qualifying a disappointing 8th, Massa produced a mistake free drive to net his first podium position of the season with a 3rd place at the German Grand Prix at the Nürburgring . After making a great start to 4th place, he used his fuel strategy while defending from other drivers and looking after his tyres to take the final podium place. , On 25 July 2009, in the second round of qualifying for the Hungarian Grand Prix , Massa's head, though protected by his driver's helmet, was struck by a suspension spring that had fallen from Rubens Barrichello 's Brawn , on a high-speed part of the track. He subsequently crashed head-on into a tyre barrier. Massa was airlifted to the ÁEK hospital in Budapest , where he underwent surgery in the area surrounding his left eye.  His condition was initially described as \"life-threatening but stable\",  but improved rapidly. Massa was discharged from hospital the following week and returned to Brazil.  After further tests it was decided Massa needed a titanium plate inserted into his skull to strengthen it for racing. Ferrari consultant and seven-time world champion Michael Schumacher was asked to take over Massa's race seat during his recovery,  but his comeback was prevented by neck injuries sustained during a motorcycle accident earlier in the year.  Ferrari test driver Luca Badoer was confirmed as Massa's substitute for the European and Belgian Grands Prix.  After two races in which Badoer failed to score a single point, on 3 September 2009 Ferrari announced that Massa's place for the rest of the season would instead be taken by Giancarlo Fisichella who had signed a deal to be a Ferrari test driver for 2010 and had driven for Force India throughout the 2009 season.  , As part of his return to Formula One Massa undertook a series of neurological examinations, co-ordinated by the FIA's medical delegate, in Paris on 10 October 2009. The successful completion of these tests led to the announcement by Ferrari that Massa would, from 12 October 2009 be driving a 2007 Formula One car in order to continue re-acclimatising to racing.  He waved the chequered flag at the 2009 Brazilian Grand Prix . , Massa started the 2010 season with a second-place qualifying place, and a second-place finish in Bahrain behind team-mate Fernando Alonso , despite having to save fuel in the last 22 laps. , At the Australian Grand Prix , Massa was appointed a director of the Grand Prix Drivers' Association .  Massa qualified fifth for the race, which was marked by changeable weather conditions and ten non-finishers. He finished third, largely managing to steer clear of the chaos. After the race, Massa commented cheerfully that it had been an unusually good start to the season for him. Third was his best ever finish at Melbourne. After a storming drive to 7th from 21st on the grid in Malaysia , he took the lead in the world championship. However, a disappointing ninth in China meant that he dropped back to sixth in the standings. , Massa qualified 9th in Spain , and finished the race 6th despite contact with Karun Chandhok which damaged his front wing. In Monaco , Massa was very quick during practice and qualified fourth. He got off to a great start and got alongside Robert Kubica , but had to yield the racing line at the first corner and finished the race in fourth, which promoted him to fifth in the championship with 61 points. The next race, the Turkish Grand Prix  – at which Massa has historically excelled – ended for him in a disappointing seventh, although he at least managed to out-qualify team-mate Alonso and beat him in the race. Massa described the race as \"boring\" ; he spent it battling with the Renaults of Kubica and Vitaly Petrov for the minor points positions. In Canada he qualified 7th and after an excellent start he spun Liuzzi 3 times and from there on had a poor race finishing 15th and a lap down. In Valencia , he qualified 5th, but after Mark Webber and Heikki Kovalainen collided and the safety car came out, he finished 11th and out of the points. In Silverstone , Massa qualified seventh, but on the first lap he developed a puncture after contact in the new section of the circuit. He ended up in a disappointing fifteenth, as the last car on the lead lap. , At the 2010 German Grand Prix Ferrari were investigated for team orders as Massa took the race lead early, ahead of Fernando Alonso in second and Sebastian Vettel close behind in third. During the race these positions were maintained until Massa received instructions from Ferrari engineer Rob Smedley , saying \"Fernando is faster than you. Can you confirm you understood that message?\". Shortly afterwards, on lap 49, Massa allowed Alonso to take the lead, and consequently to win the race.  Smedley then added after the pass 'Ok mate good lad, stick with him now, sorry.'  The incident strongly suggested that a team order had been made to Massa to let Alonso overtake, and race stewards agreed. Despite team boss Stefano Domenicali's denial,  Ferrari were fined $100,000 for breaking Sporting Regulations and the matter was referred to the FIA World Motor Sport Council .  Massa finished 4th in Hungary and Belgium and third in Italy . In Singapore , he qualified last due to a gearbox issue, but finished the race eighth. Massa collided with Vitantonio Liuzzi on the first lap of the Japanese Grand Prix but finished third in Korea . He finished a disappointing 15th in Brazil , and tenth in Abu Dhabi . Massa ended the season ranked sixth in the Drivers' Championship. , In June, Massa agreed to a contract extension until the end of the 2012 season.  , Massa remained with Scuderia Ferrari in 2011 , and again was partnered with Fernando Alonso . He drove his new car – the Ferrari 150° Italia  – for the first time on 29 January 2011, undertaking a shakedown of the car at the Fiorano Circuit . , At the Australian Grand Prix , Massa endured a poor start to the season at what has traditionally been his bogey race. Qualifying eighth, over 0.6 seconds behind team-mate Alonso, Massa managed to get ahead of Alonso and several other drivers at the start and ran in fifth place for a while, much to the frustration of Jenson Button , who had a much quicker car but was unable to pass him. A lack of pace dropped Massa down the order to an eventual ninth-place finish, which became seventh after the Saubers of Kamui Kobayashi and Sergio Pérez were disqualified. , The Malaysian Grand Prix saw a better performance from Massa, who qualified seventh and showed greatly improved race pace, particularly on the soft Pirelli tyres. Massa again made a fine start to the race and ran ahead of Alonso until his first pit-stop. A problem with a tyre-change cost him time but he finished ahead of Alonso in fifth, after Alonso damaged his front wing against Lewis Hamilton 's right-rear tyre. In China , Massa improved again; at one point looking like challenging for the race win, before settling for sixth as Ferrari's two-stop strategy did not suit the conditions. Despite this, he finished over fifteen seconds ahead of Alonso, and was pleased with his improved race performance.  He finished 11th in Turkey after a slow pit stop, and retired in Spain due to a gearbox fault. In Monaco , Massa made contact with Lewis Hamilton at the hairpin on lap 32, and crashed in the tunnel a few corners later.  While at the Canadian Grand Prix , on the last lap, he overtook Kamui Kobayashi just before the chequered flag to finish in sixth place. Three fifth places followed in Valencia , Silverstone  – after a late-race battle with Hamilton – and at the German Grand Prix where Red Bull's Sebastian Vettel had a faster pit stop when they both pitted together on the penultimate lap, losing Massa fourth place. Massa added a sixth-place finish in Hungary . , Massa out-qualified Alonso for only the second time in 2011 , in Belgium ; but he fell from fourth to eighth in the race. Massa took another sixth-place finish at the Italian Grand Prix , after he was spun round by Webber on lap five. Hamilton made contact with Massa for the third time in 2011, when attempting to overtake him for eighth in the Singapore Grand Prix . Hamilton punctured Massa's right-rear tyre with his front wing, an incident for which Hamilton received a drive-through penalty. This followed an incident in qualifying where Hamilton lunged down Massa's inside, attempting to pass on an out-lap, which led Massa to publicly criticise Hamilton.  Massa also went up to Hamilton in the post-race TV interview area as he was about to start an interview with RTL Television , patted his shoulder, and sarcastically said: \"Good job, bro.\"  It was later reported that during the race Massa's engineer Rob Smedley sent a radio message to Massa stating \"Hold Hamilton as much as we can. Destroy his race as much as we can. Come on, boy...\"  Hamilton and Massa collided at the next race in Japan , damaging Massa's front wing endplate, but he eventually finished in seventh place. After the race, Massa called for the FIA to take action on Hamilton.  After finishing sixth at the Korean Grand Prix , he crashed in qualifying for the Indian Grand Prix after he broke his suspension on a kerb and then hit the barriers. In the race, he once again collided with Hamilton on the 24th lap of the Indian Grand Prix , for the fifth time this season, this time however with Massa being awarded a drive-through penalty . He retired later after hitting a kerb too hard, the same fate which ended his qualifying session. He rounded off the year with two fifth-place finishes in Abu Dhabi and Brazil . , Despite his disappointing 2011, Massa remained with Ferrari for 2012. At the Australian Grand Prix , Massa qualified 16th – a second behind team-mate Alonso, who qualified twelfth – for his worst qualifying result since the 2010 Singapore Grand Prix ,  and the first time he qualified outside the top ten since the 2010 Japanese Grand Prix . Massa gained six places on the first lap, running as high as eighth in the early stages of the race, but suffered badly from tyre degradation and fell down the order before retiring from the race after a collision with Williams driver Bruno Senna ; both drivers later agreed that it was a racing incident.  In the Malaysian Grand Prix , Massa qualified 12th and finished 15th, 1-minute 37 seconds behind his teammate Fernando Alonso, who won the race. This result put Massa 19th in the Championship, whilst teammate Alonso was leading on 35 points.  Sauber's Sergio Pérez finished 2nd and there has been speculation linking Pérez to Massa's seat.  Massa was thirteenth at the Chinese Grand Prix before he scored his first points of the season with ninth at the Bahrain Grand Prix . In Spain , Massa started sixteenth and finished fifteenth whilst team-mate Alonso started and finished second, he also had a drive-through for ignoring yellow flags. He finished 6th in Monaco , and tenth in Canada , after spinning in the early stages of the race. , He finished 16th in Valencia , after Kobayashi made contact with him at the restart. A great weekend followed in Silverstone , as he qualified 5th and finished 4th, despite Alonso's pole and second place. Massa finished 12th in Hockenheim , where he hit Daniel Ricciardo on the first lap and as a result, removed his own front wing. Massa added a ninth-place finish in Hungary . After qualifying 14th at Spa , Massa finished 5th in the race, earning 10 points and climbing to eleventh position in the driver standings, with the same points as Michael Schumacher. Massa took his best qualifying result of the season so far and got third place grid position at Monza . After a great start he made his way up to second position but finished the race in fourth after being passed by Alonso and Pérez in the closing laps. In Suzuka , Massa qualified 11th, but started 10th due to a gearbox penalty for Nico Hülkenberg. He made a great start after his team mate Alonso retired at the first corner of the first lap, and went on to finish in 2nd position, his first podium since the 2010 Korean Grand Prix . Massa qualified 6th for the 2012 Korean Grand Prix . He maintened 6th position after the first corner, and overtook Räikkönen on the first lap. After a few laps he also made a move on Lewis Hamilton, giving him 4th position. He had great pace throughout, with the possibility to overtake Alonso and even Webber, but because Alonso is fighting for the drivers championship, Massa was told to hold station. On 16 October 2012, Massa signed a 1-year contract with Ferrari. This came as a result of an impressive string of results for the Scuderia, and means that Massa is under contract to race with Ferrari until the end of 2013. In India , Massa qualified 6th and finished 6th, despite having to save fuel and being hounded by Räikkönen the whole race. In Abu Dhabi , Massa qualified 9th but started on the grid in 8th as a result of Vettel's penalty. He ran as high as 7th until he spun when fighting with Mark Webber, but drove well and worked his way up to 7th again. At the US Grand Prix , Massa outqualified team-mate Alonso for only the second time this year. But then Ferrari tactically broke his gearbox seal to move Alonso onto the clean side of the grid. This demoted Massa to 11th but he drove a storming race to finish 4th. At the final race of the season in Brazil , Massa again outqualified team-mate Alonso for the second straight race to start 5th. At the start of the race Massa made his way up into 2nd place, only to fall down to 11th after some bad strategical decisions with the ever changing weather conditions at Interlagos. Then thanks to a safety car, the field bunched up and Massa made his way through the field into 2nd but had to yield to title-chasing team-mate Alonso. Eventually Massa finished 3rd on the podium in front of his home crowd to end a good second half of the season for him. , Massa started his season strongly with the new F138 at the Australian Grand Prix . He qualified fourth, one place ahead of teammate Alonso. He was able to stay very competitive, especially during the early laps of the race but finished the race in fourth place, two places behind Alonso. At the following race in Malaysia , Massa started on the front row of the grid, out-qualifying Alonso for the fourth time in a row. Massa had a poor start and bad first stint on the intermediate tyres resulting him falling down the order, but as the track dried out, he recovered places on the slick tyres and finished fifth. Three weeks later at the Chinese Grand Prix Massa qualified fifth, beaten by his teammate, who qualified third, for the first time in 5 races. In the race Massa got up to second place before the first round of pitstops, but he pitted a lap later than the other leaders, so he fell back down the order, so despite the early pace that he showed, only managed to finish sixth. At the next race in Bahrain , Massa qualified 6th but moved up to 4th alongside his teammate due to penalties for Webber and Hamilton. Massa was the only car in Q3 to qualify on the hard tyres indicating he was on a different strategy. In the race, the strategy gamble did not pay off as he did not run as far as he wanted and needed before the first stop. Along with two punctures in the race, this resulted in Massa finishing 15th. In Spain , Massa received a three-place grid penalty for blocking Mark Webber in qualifying, and started 9th. He made an excellent start, coming up to 6th, and then leapfrogged more cars during the pitstops, eventually finishing 3rd. His first podium of the year situated him 5th in the Drivers' Championship. , In Monaco Massa suffered a heavy crash during 3rd Practice on Saturday into St Devote corner. He was driving down the main straight at almost 180 mph when his brakes locked and he slid into the barrier on the left hand side of the track. He lost control of the car and bounced off the wall ending up with a face on crash into the tyre wall ahead. He was unhurt by the accident but the car was badly damaged and Massa was unable to take part in Qualifying later in the day. Ferrari engineers initially believed the crash to be attributable to driver error.  Starting the race from 21st on the grid, Massa slowly made up ground before crashing again into St Devote in an almost identical accident. After the crash Massa was taken to hospital in Monte Carlo but escaped with only minor injuries. This second incident caused Ferrari to investigate further, concluding that suspension failure, not driver error, was ultimately to blame.  Massa scored an 8th place in Canada , and a 6th place in Britain . In Germany , he had a good start, jumping to 6th place, before spinning out on lap 3 with gearbox failure. In the Hungarian race, he struggled with an uncompetitive Ferrari, qualifying 7th and finishing 8th. , In Belgium Massa looked to be heading for his 1st pole position since the 2008 Brazilian Grand Prix when he set the fastest time in wet conditions at the beginning of Q3 but the track dried and Ferrari had decided to leave Massa in the garage as they thought his time was good enough for pole so he dropped back to 10th, one place behind team-mate Alonso. In the race Massa finished 7th behind Alonso who finished 2nd. In Ferrari's home race in Italy Massa qualified 4th, one place ahead of his team-mate. He then jumped Red Bull's Mark Webber and Sauber's Nico Hülkenberg who qualified in a brilliant 3rd when the best he had managed all season was 10th in a slow car. Hülkenberg was one of the drivers who was in a chance of taking Massa's seat in 2014. Despite Massa's great start he moved over for Alonso who was race leader Sebastian Vettel 's closest championship rival. Massa dropped to fourth in the pit stop phase after staying out longer than Alonso and Webber, but he fought back to challenge them for a podium, ultimately finishing in fourth place. , On 10 September 2013, Massa confirmed that he be leaving Ferrari at the end of the season on Instagram and Twitter .  The following day, it was announced that Massa's former team-mate, Kimi Räikkönen , would be his replacement at Ferrari.  , On 11 November 2013, Williams F1 announced that Massa would partner Valtteri Bottas for the 2014 Formula One season replacing Pastor Maldonado .  , He suffered an unlucky start to his campaign in Australia , when he retired after being hit hard by Kamui Kobayashi 's Caterham. The string of bad luck continued in Malaysia after a team orders debacle, being caught out by the safety car in Bahrain , a botched pitstop in China and a collision with Sergio Pérez in Canada . However, at the Austrian Grand Prix , he took his first pole position since the 2008 Brazilian Grand Prix and finished fourth. But the next two races, in Britain and Germany , resulted in first lap race-ending collisions with former Ferrari teammate Räikkönen and Kevin Magnussen respectively. , On 7 September 2014 it was confirmed that Massa, along with Bottas, would stay at Williams for 2015 .  On the same day, he scored his first podium for Williams, finishing third in the Italian Grand Prix . , On 9 November 2014 Massa took his second podium for Williams at the Brazilian Grand Prix as he finished third behind second placed Lewis Hamilton and winner Nico Rosberg . Massa ended Williams' competitive season on a high with what he described as his \"best race of the year\" at the Yas Marina Circuit in Abu Dhabi . Although qualifying in fourth – one place behind teammate Bottas – he showed good pace in the whole weekend and finished a strong second after Rosberg's subsequent power-unit problems, even making a late but convincing challenge on race leader Hamilton in the final third of the race. , * Season in progress. , ( key ) (Races in bold indicate pole position; races in italics indicate fastest lap) , ( key ) , ( key ) (Races in bold indicate pole position; races in italics indicate fastest lap) , Felipe Massa married Anna Raffaela Bassi on 30 November 2007, in São Paulo , Brazil.  The couple's first son, Felipinho (Bassi Massa), was born on 30 November 2009.  , Massa is a friend of Swiss watchmaker Richard Mille , who has dedicated several models of his watches to him (RM-005FM, RM-011).  , Nicolas Todt , son of Ferrari's past team principal and current FIA president Jean Todt , is Massa's manager. , Though Massa supports Brazilian football team São Paulo FC ,  he also supports the Turkish football team Fenerbahçe that was formerly coached by Zico . On 24 August 2007, Massa said: \"Zico was my childhood idol, Roberto Carlos is my best friend. I am a Fenerbahçe fan, because it is just like a Brazilian team. I love Turkey , as I won my first championship race in Turkey, it has special value for me.\"  , Massa holds a charity kart race , Desafio Internacional das Estrelas (International Challenge of the Stars) every year since 2005.  Notably, many active top level Brazilian drivers have competed in the event, such as Formula One drivers Rubens Barrichello and Nelson Piquet, Jr. , drivers who competed in American open wheel events such as Tony Kanaan , Mario Moraes , Felipe Giaffone , Vitor Meira , Roberto Moreno , and Gil de Ferran , and Stock Car Brasil champion Cacá Bueno .  In addition, Brazilian motorcycle racer Alex Barros has competed. Michael Schumacher and Luca Badoer joined the Brazilian contingent in 2007.  Vitantonio Liuzzi , Jeff Gordon and Jaime Alguersuari have also participated. , On 18 September 2012, Massa participated on a world record event at Silverstone where 964 Ferrari cars, 36 shy of their target of 1000, assembled together on the track. This spectacle was witnessed by 25,000 fans which features Massa's 2008 car driven by Ferrari test driver Marc Gené .   , Massa has a strong Roman Catholic faith.  , Massa's helmet was blue with a fluorescent yellow X on the sides and a yellow triangle that covers the upper helmet with the top section coloured with a green gradient (prior to F1, this section was blue), in Ferrari early years until 2010,Massa's helmet featured also a white ring surrounding the top. In 2008 the tips of the fluo yellow X were more ramified. in 2011 on the yellow triangle covered the entire upper front with 2 blue lines in the sides. For his 100th race with Ferrari at the 2011 Brazilian Grand Prix, Massa sported a chrome and gold prancing horse on the top with a further 100 horses representing the races Massa contested with Ferrari. The design also featured gold, blue and green spreading out over the helmet.  "
}
