{
  "category": "f1",
  "article": "The Italian Grand Prix ( Gran Premio d'Italia ) is one of the longest running events on the Formula One calendar. The Italian Grand Prix was also one of the inaugural Formula One championship races in 1950, and has been held every year since then. The only other championship race for which this is true is the British Grand Prix , and the only other inaugural F1 races that are still on the calendar are the Monaco Grand Prix and the Belgian Grand Prix . Every Formula One Italian Grand Prix since 1950 has been held at Monza except in 1980 , when it was held at Imola . The Italian Grand Prix counted toward the European Championship from 1935 to 1938. It was designated the European Grand Prix seven times between 1923 and 1967, when this title was an honorary designation given each year to one grand prix race in Europe. , , , Motor racing has always been extremely popular in Italy, the first Italian Grand Prix motor racing championship took place on 4 September 1921 at a 10.7 mile (17.3 km) circuit near Brescia .  However, the race is more closely associated with the course at Monza , a racing facility just outside of the northern city of Milan , which was built in 1922 in time for that year's race, and has been the location for most of the races over the years. , The Autodromo Nazionale Monza was completed in 1922 and was just the third permanent autodrome in the world at that time; Brooklands in England and Indianapolis in the United States were the two others. Motor racing pioneers Vincenzo Lancia and Felice Nazzaro laid the last two bricks at Monza. The circuit was 10 km (6.25 miles) long, with a flat banked section and a road circuit combined into one. It was fast, and always provided excitement. The 1923 race included one of Harry A. Miller 's rare European appearances with his single seat \"American Miller 122\" driven by Count Louis Zborowski of Chitty Chitty Bang Bang fame. In the 1928 race Italians Emilio Materassi and Giulio Foresti in a Bugatti, tangled on the pit straight. One of the front wheels of Materassi's overtaking Talbot touched one of the rear wheels of the Bugatti. Materassi swerved left, cleared a 10-foot wide ditch and ploughed into the unprotected grandstand opposite the pits, killing himself and 27 spectators and injuring another 26 It was the worst accident in motor racing history and would remain so until the 1955 24 Hours of Le Mans . The Italian Grand Prix went on a three year hiatus until the 1931 race was won by Giuseppe Campari and Tazio Nuvolari , sharing an Alfa Romeo. The race was something of an endurance race in those days; it took ten hours to complete the race. The great Nuvolari won again in a shortened 1932 race . , In 1933 disaster struck again. Three top drivers were killed during three heat races. There was a reported patch of oil on the south banking that had come from a Duesenberg, driven by Count Carlo Felice Trossi , and Giuseppe Campari in a Ferrari-entered Alfa Romeo and his protege Baconin Borzacchini in a Maserati were already battling ferociously; and Borzacchini and Campari went through the south banking on the first lap, wheel to wheel. Borzacchini went through the oily patch, lost control, spun wildly and the Maserati then flipped multiple times, and Borzacchini was pinned underneath his car, not having been thrown out. While this happened, Campari swerved to avoid him, and went up and off the banking and crashed into trees situated right next to the track. Campari was killed instantly, and Borzacchini died later that day in a Monza hospital. , Prior to the third heat, there was a drivers meeting to discuss the oil patch and it was cleaned up. on the eighth lap, Polish aristocrat Count Stanislas Czaykowski was on the south banking when his Bugatti's engine blew up, a fuel line broke, the fuel caught fire after touching the very hot front section of the Bugatti and the burning fuel sprayed onto Czaykowski. Blinded by the smoke and flames on him, he went up and flew off the banking- at the same spot where Campari and Borzacchini had crashed. The Polish driver burned to death. Italian Luigi Fagioli was declared the winner of the event. , Enzo Ferrari , who had been close to Campari and Borzacchini; the former deciding to defect from Ferrari's team to Maserati, became hardened by this tragedy. Today, racing historians conclude that the events of this race marked a watershed, notably for Enzo Ferrari. It was the end to the joyful era of racing and the beginning of a harsher new age. Safety in those days was completely non-existent. The circuit's condition was virtually identical of that to an ordinary town and country road, except instead of the surface being made of dirt, it was made of concrete and bricks. Spectators often stood very close to or even next to the track and they had no protection of any kind other than common sense.  , After the disastrous 1933 race, something had to be done to Monza. There were chicanes added at certain points on the circuit and only most of the road circuit and part of the high speed oval was used. These races were at a time when Mercedes and Auto Union became involved in motor racing; the German Silver Arrows won all of these races; with superstar Rudolf Caracciola winning in 1934 and in 1937 when the Italian Grand Prix was held at a street circuit in Livorno. 1938 saw a return to Monza, which was won by Nuvolari driving a mid-engined Auto Union, and the banking had been dismantled after the race was held. In 1939 World War II broke out and the Italian Grand Prix did not return until 1947. , 1947 saw the Italian Grand Prix being held at a fairgrounds park in the city of Milan (not far from Monza), and this race was won by Italian Carlo Felice Trossi driving an Alfa Romeo. Italian Giovanni Bracco went off the road in his Delage and crashed into a group of spectators, killing five. This venue was never used again for racing, and 1948 saw it being held in Valentino Park , a public park in Turin . The 1949 race returned to Monza where it stayed for the next 30 years. , Monza's banking had been abandoned and only the road circuit was used, which had been modified slightly. The long, fluid final corner was now two 90-degree corners. 1949 saw Italian new-boy Alberto Ascari , son of the late 1924 Italian Grand Prix winner Antonio Ascari , win in his Ferrari; Enzo Ferrari was now building his own cars instead of running Alfa Romeos. 1950 saw the new Formula One Championship being established. The race and the first championship was won by Giuseppe \"Nino\" Farina , driving a supercharged Alfa Romeo 158 . 1951 saw Ascari win again, after the competitive Alfas of Farina and Argentine Juan Manuel Fangio ran into engine problems. 1952 saw Ascari complete his domination of that season. 1953 Fangio won in a Maserati; although Ascari had already won the championship at the Swiss Grand Prix. 1954 turned out to be an interesting race; as up-and-comer Stirling Moss in a Maserati passed both Fangio's Mercedes and Ascari's Ferrari. The furious pace saw the retirement of Moss and Ascari and Fangio went onto win while Moss pushed his Maserati 250F over the line. , After the 1954 running, work began on entirely revamping the circuit. New facilities were built and a new corner, the Parabolica, was built in place of the double right-handed sequence right before the pits Extra track used for a short course was eliminated. The biggest change was the reconstruction of the new Monza banking. Built on top of where the almost flat, narrow original banking was, these huge concrete bankings, called the sopraelevata curves, were built in the same shape as the original banking had been. This course was combined with the road course for the 1955 event , which was won by Fangio and was the last race contested by a full-fledged Mercedes factory effort in Formula One until 2010. 1956 saw an exciting race, with championship contenders Fangio, Briton Peter Collins (both in Ferraris) and Frenchman Jean Behra in a Maserati fight over the win. Stirling Moss was already out of championship contention; and Fangio retired with a broken steering arm. The Ferrari team called for Italian Luigi Musso to hand his car over to Fangio. Musso ignored the order so Collins came in and handed his car and his championship chances to Fangio. Behra had retired early with a magneto problem in his own car and took over his teammate Umberto Maglioli 's car; but he retired that car, too. Musso ended up leading after Moss ran out of fuel coming through Vialone. Moss was able to refuel his car and storm off after Musso and eventually the Italian retired with steering problems, and Moss, with Fangio catching him up fast, stormed round the track to take victory. Fangio took secnd and his fourth drivers' championship. , 1957 saw the organizers choose to use the road circuit only, as the rough, poorly constructed banking had caused problems for the Ferrari cars the year before. Moss won again in a Vanwall, and Briton Tony Brooks won next year's race, and Moss won the 1959 event in a Cooper-Climax. 1960 , however was not so straightforward. Ferrari with their front-engined cars, had lost out to the advanced mid-engined British cars. Seeing an opportunity, the Italian organizers decided to re-include the banking with the road circuit, making Monza even faster and more in favor to the powerful Ferraris. The British teams were unhappy as they cited the fragility of the banking, which was extremely rough and was supported by stilts rather than earth surface; and that it was too dangerous for Formula One cars. The British teams boycotted the race, so Ferrari had no competition. American Phil Hill took victory, in what was the last victory for a front-engined Formula One car. 1961 saw a return to the combined circuit, but it was to see yet another tragedy. Two Ferrari drivers, Hill and German count Wolfgang von Trips , came into the race with a chance at winning the championship. Fighting for fourth place while Hill was leading and while von Trips approached the Parabolica, the German moved over into the path of Briton Jim Clark and the two collided. Von Trips crashed into an embankement next to the road and then went flying into a crowd of people standing on the embankment. Von Trips was thrown out of his car and was killed, as were 14 spectators. Clark survived but was hounded by Italian police for months after the incident. Hill won the race and the championship by one point. The race was not stopped, allegedly to assist rescue work for the injured. , 1962 saw a return to the road circuit only and the banking was never used again for Formula One. It still stands, but in decrepit condition. Briton Graham Hill won the race, and would go on to win the driver's championship in South Africa soon after. 1963 saw an attempted use of the extremely fast full circuit again, and the drivers ran the course during Friday practice but the concrete banking was so rough and bumpy that cars were being mechanically torn apart. It was feared that there would be no finishers for the actual race itself. Briton Bob Anderson's Lola crashed after losing a wheel on the banking (he was uninjured); the drivers then threatened to leave unless they raced on the road circuit only, which is what happened. Jim Clark won the race in a Lotus. Ferrari driver John Surtees won in 1964 , and Briton Jackie Stewart won his first of 27 Grand Prix victories in 1965 , driving for BRM. Against team orders, he fought hard with his teammate Graham Hill, and Hill made a mistake at the Parabolica and Stewart was in command; this was all to the chagrin of team boss Tony Rudd . 1966 saw Italian Ludovico Scarfiotti win, and no other Italian has won the race since. 1967 was to be a race of interest and was to produce the first of three close finishes on the fast Monza circuit over the next four years. Surtees, now driving for Honda, battled with Australian Jack Brabham, and Surtees won the race by two-tenths of a second; and Clark, who had problems at the beginning of the race and lost a whole lap, stormed around the circuit, equalled his pole position time and unlapped himself to take the lead- but his fuel pump broke and he coasted over the line to finish third. 1969 saw four drivers; Stewart, Austrian Jochen Rindt , Frenchman Jean-Pierre Beltoise and New Zealander Bruce McLaren battle right down to the line. Stewart came out on top and beat Rindt by eight-hundredths of a second. The four drivers were all within two tenths of a second of each other. With this win, Stewart won his first of three championships. 1970 saw Rindt's fatal crash during qualifying at the wheel of his rear wing-less Lotus. He would become the only posthuomous world champion, after Ferrari driver Jacky Ickx failed to overhaul Rindt. Ickx's teammate Clay Regazzoni won the race, which saw 28 lead changes. 1971 was to see the third close finish in four years. Briton Peter Gethin , Swede Ronnie Peterson , Frenchman François Cevert , Briton Mike Hailwood and New Zealander Howden Ganley battled for the lead all race. On the last lap, Peterson got the inside line for the Parabolica, but Gethin got in front going alongside Peterson through the long right-hand corner, and beat Peterson to the checkered flag by the slimmest of margins; one-one hundredth of a second. Cevert and Hailwood finished within two-tenths and Ganley was half a second behind. , 1972 saw changes to Monza. The 1971 race was the fastest Formula One race ever at that point in time. It was really just a bunch of straights and fast corners and F1 cars had become increasingly advanced and much faster, and the drivers were constantly slipstreaming each other around the circuit. Chicanes were put at the end of the pit straight and at the Vialone curve; Brazilian Emerson Fittipaldi won that race and his first drivers' championship at only 25 years of age. His chief rival Jackie Stewart went out at the start with a broken gearbox. In 1973 , Stewart punctured a tire early in the race and went into the pits to have it changed; he came out in 20th place and finished fourth in the race while Fittipaldi finished second; this was enough for Stewart to win his third and final drivers' championship. 1974 saw further changes with the Vialone chicane changed and renamed Variante Ascari, which was the place where Alberto Ascari was killed in 1955 testing a Ferrari sportscar. Like the year before, Peterson won and Fittipaldi finished second, now driving for McLaren. 1975 , however, was an event to remember. Ferrari, which had regrouped completely under the leadership of Luca di Montezemolo , reached the high point of its resurgence. The Ferrari camp was feeling relaxed while rising star and championship leader Niki Lauda was leading the drivers' championship, and the team was leading the constructor's championship. Fittipaldi and Argentine Carlos Reutemann had to win in order to have a chance at staying in the championship chase. When the race started, Lauda's teammate Clay Regazzoni took the lead, with Lauda following; and Fittipaldi stormed round the circuit in an effort to catch the two Ferraris. Fittipaldi passed Lauda for second but this did not matter as Lauda only needed fifth to secure the drivers' title. Regazzoni took victory, followed by Fittipaldi and Lauda, who won his first drivers' title and Ferrari also won the constructor's championship at the same event. , 1976 saw further changes to Monza's layout. Two chicanes, called Variante Rettifilo were installed just before the Curva Grande, and another chicane was installed just before the Lesmo bends. Lauda, who had come back to racing only six weeks after his horrendous crash at the Nürburgring; finished fourth while Peterson won. 1977 saw Italian-American Mario Andretti win in a Lotus; but the next year's race was to add another page of tragedy to Monza's history. Peterson had re-joined Lotus at the beginning of the 1978 season and had challenged his teammate Andretti all the way. Peterson had crashed his car in practice, and had to use Andretti's spare car, not a comfortable fit for the tall Swede, in contrast to the diminutive American. As the race started, there was a huge, fiery multi-car pile-up on the approach to the first corner. One of the victims was Peterson; his car slammed head-on into the Armco barriers and had caught fire. Instead of the ill-equipped marshals, Briton James Hunt , with the help of Frenchman Patrick Depailler and Regazzoni ran towards Peterson's aid and pulled him out of the burning Lotus. Peterson suffered severe leg injuries, and he died from embolism complications a day later. With Peterson's retirement from the race, Andretti won the drivers' championship. The race itself was an interesting one; during the parade lap South African Jody Scheckter lost a wheel from his Wolf at the second Lesmo curve and hit an Armco barrier right next to the track. Andretti, Hunt, Lauda, Fittipaldi and Reutemann went to inspect the damage, and they refused to start until it had been repaired; and it was repaired in time; although the race started well after it was supposed to. The cars were shown the green light while the back half of the field was still in motion (this often happened at Monza and it had happened during the first start); and due to the visible excitement of the start official Andretti and Canadian Gilles Villeneuve jumped the start and were penalized a minute; Lauda went on to take victory in his Alfa-powered Brabham in a shortened race distance; it was getting dark by the time the checkered flag was shown to the Austrian driver. 1979 saw changes to Monza, run off areas were added to the Curva Grande and Lesmo corners and the track was upgraded. Scheckter, now driving for Ferrari, won the race and the drivers' championship. , In 1979, it was announced that the Autodromo Dino Ferrari, also known as Imola, would host the Italian Grand Prix for 1980 while Monza underwent a major upgrade, including building a new pit complex. The Imola circuit had been used for a non-championship event in 1979, and this running of the Italian GP was won by Nelson Piquet. , The Italian Grand Prix returned to Monza for 1981, and it has stayed there ever since. The Imola circuit was not to leave Formula One, it hosted the San Marino Grand Prix from 1981 to 2006. The 1981 Italian Grand Prix was won by rising star Alain Prost , and that race saw Briton John Watson have a huge accident at the second Lesmo Curve which also took out Italian Michele Alboreto. Watson was uninjured in his carbon-fibre McLaren. 1982 was won by Prost's teammate Rene Arnoux; and Prost also won the exciting 1985 event, this time driving a McLaren. Prost's championship rivals Alboreto (now driving a Ferrari) and Finn Keke Rosberg in a Williams both retired. 1988 saw a memorable win; as McLaren had won every race up to the Italian Grand Prix; Prost had gone out with engine problems and his teammate Ayrton Senna had crashed into a backmarker with 2 laps to go- and Austrian Gerhard Berger in a Ferrari took victory, followed by Alboreto to make it a Ferrari 1-2. This was particularly memorable because Enzo Ferrari had died a month before this event. 1989 saw Prost win after the Honda engine in Senna's McLaren expired; but Senna took victory the following year. 1991 saw a battle between Senna and the two Williams drivers of Nigel Mansell and Riccardo Patrese . Mansell won, Senna finished 2nd and Patrese went out with gearbox problems. Senna won again in 1992, and 1993 saw Williams drivers Alain Prost and Damon Hill battle hard, and while leading, Prost's engine failed and Hill went on to take victory. , In response to the Imola tragedies in 1994, the second Lesmo curve was slowed down. 1996 saw Michael Schumacher win for Ferrari, and 1999 saw championship leader Mika Hakkinen crash and the Finn, false to temperament, went behind a few bushes in the circuit and broke down crying. 2000 saw further changes to the circuit, which have stayed since. The Variante Rettifilo was made into a two corner sequence instead of a 3 corner sequence. The race that year started off tragically, as an accident during the start at the Variante della Roggia resulted in a marshal being struck in the head and chest by a loose wheel from German Heinz-Harald Frentzen 's Jordan. 33-year old Paolo Ghislimberti was given a heart massage at the scene, but later died from his injuries. On a more positive note, the decade also started off with a romp of Ferrari victories, winning in 2000 and 2002-2004. The 2002 race saw the fastest ever qualifying lap, set by Juan Pablo Montoya in a Williams at 259.827 km/h. , After winning the 2006 Italian Grand Prix , Michael Schumacher announced his retirement from Formula 1 racing at the end of the 2006 season. Kimi Räikkönen replaced him at Ferrari from the start of the 2007 season. At the 2008 Italian Grand Prix , Sebastian Vettel became the youngest driver in history to win a Formula One Grand Prix. Aged 21 years and 74 days, Vettel broke the record set by Fernando Alonso at the 2003 Hungarian Grand Prix by 317 days as he won in wet conditions at Monza. Vettel led for the majority of the Grand Prix and crossed the finish line 12.5 seconds ahead of McLaren's Heikki Kovalainen . Earlier in the weekend, he had already become the youngest polesitter, after setting the fastest times in both Q2 and Q3 qualifying stages. His win also gave him the record of youngest podium-finisher. Vettel also won in 2011, after a spectacular pass at the Curva Grande, passing Fernando Alonso on the outside of the big, long curve. , Uncertainty grew over the fact that Monza would continue to host the race as Rome had signed a deal to host Formula One from 2012. On 18 March 2010 however, Bernie Ecclestone and the Monza track managers signed a deal which meant that the race will be held there until at least 2016.  , The Italian Grand Prix in recent years has been labelled as a jinx to the winning driver. For 7 straight races from 2004-2010, no driver was able to win the Italian Grand Prix and the championship in the same year. Over the past two decades, only three drivers have won the Italian Grand Prix and gone on to win the world championship in the same year: Ayrton Senna in 1990 , Michael Schumacher in 2000 and 2003 and Sebastian Vettel in 2011 . A total of 12 Italian drivers have won the Italian Grand Prix; 10 before World War II and 3 when it was part of the Formula One world championship. Alberto Ascari won the race 3 times (once before Formula One and twice during the Formula One championship). Elio de Angelis and Riccardo Patrese both won the San Marino Grand Prix in 1985 and 1990, which was held not in the small principlaity, but at Imola near Bologna in Italy. Michael Schumacher has won it 5 times and Nelson Piquet won 4 times. Ferrari have won their home Grand Prix 19 times. , A pink background indicates an event which was not part of the Formula One World Championship. , A cream background indicates an event which was part of the pre- war European Championship. , Coordinates : 45°37′01″N 9°16′57″E ﻿ / ﻿ 45.61694°N 9.28250°E ﻿ / 45.61694; 9.28250 "
}
