{
  "category": "f1",
  "article": "The Japanese Grand Prix ( 日本グランプリ , Nihon-guranpuri ? ) is a race in the calendar of the FIA Formula One World Championship . Historically, Japan has been one of the last races of the season, and as such the Japanese Grand Prix has been the venue for many title-deciding races, with 13 World Champions being crowned over the 30 World Championship Japanese Grands Prix that have been hosted. , The first two Japanese Grands Prix in 1976 and 1977 were held at the Fuji Speedway, before Japan was taken off the calendar. It returned in 1987 at Suzuka, which hosted the Grand Prix exclusively for 20 years and gained a reputation as one of the most challenging F1 circuits. In 1994 and 1995, Japan also hosted the Pacific Grand Prix at the TI Circuit , making Japan one of only seven countries to host more than one Grand Prix in the same season (the others being Great Britain , France , Spain , Germany , Italy and the USA ). In 2007 the Grand Prix moved back to the newly redesigned Fuji Speedway .  After a second race at Fuji in 2008, the race returned to Suzuka in 2009, as part of an altenating agreement between the owners of Fuji Speedway and Suzuka Circuit, perennial rivals Toyota and Honda . However, in July 2009, Toyota announced it would not host the race at Fuji Speedway in 2010 and beyond due to a downturn in the global economy,  and so the Japanese Grand Prix was held at Suzuka instead. Suzuka has hosted the Japanese Grand Prix every year since 2009. , , , The first Japanese Grand Prix was run as a non-championship Formula 1 race at the Suzuka Circuit 80 kilometres (50 mi) south west of Nagoya in May 1963. This marked the beginning of motor racing in earnest in Japan. For the next 11 years, however; the non-championship Grand Prix was run at the Fuji Speedway , 40 miles (64 km) west of Yokohama and 66 miles (106 km) west of the Japanese capital of Tokyo . The circuit had a banked corner called Daiichi and was the scene of many fatal accidents. It was then run as a number of disciplines of motorsports, particularly Formula 2, sports cars and Can-Am -type sprint racing. , The first Formula 1 Japanese Grand Prix, in 1976, was held at the very fast 2.7 mile Fuji Speedway, minus the banking. The race was to become famous for the title decider between James Hunt and Niki Lauda as it was held during monsoon conditions. Lauda, who had survived a near-fatal crash at the German Grand Prix earlier in the season, withdrew from the race stating that his life was more important than the championship, as did Brazilians Emerson Fittipaldi and Carlos Pace . The torrential rain had stopped, and after a botched pit stop that put him down to 5th, Hunt drove very hard and climbed up to and finished 3rd, so this meant that Hunt scored the 4 points he needed to win the title by the slender margin of one point over Lauda. American Mario Andretti won the race in his 2nd career win and first for Lotus in front of Frenchman Patrick Depailler in a 6-wheeled Tyrrell. Hunt returned the next year to win the second Japanese Grand Prix, but a collision between Gilles Villeneuve and Ronnie Peterson during the race saw Villeneuve's Ferrari somersault into a restricted area, killing two spectators.  Although originally scheduled for an April slot in the 1978 season (which was cancelled), the race did not reappear on the Formula One calendar for another decade, and the race did not return to Fuji for an even greater time. , On Formula 1's return to Japan in 1987, the Grand Prix found a new venue at the redesigned and revamped Suzuka Circuit . The circuit, set inside a funfair , was designed by Dutchman John Hugenholtz and owned by Honda , who used it as a test track. Most notable initially for its layout—Suzuka is the only figure-eight race track to appear on the F1 calendar. The demanding and fast Japanese circuit became very popular among drivers and fans; and it was to see some of the most dramatic and memorable moments in Formula One history. , The first event in 1987 was already a classic. It immediately it saw another World Title decided, as Nigel Mansell injured himself when he crashed his Williams-Honda heavily in practice at the Snake Esses and consequently could not start the race due to an aggravating an old back injury he received in his Formula Ford days, effectively handing the title to his team-mate Nelson Piquet ; the 3rd and final title of his career. Austrian Gerhard Berger won the race for Ferrari, their first victory since 1985. , Suzuka will always be chiefly remembered, however, for the legendary feud between Frenchman Alain Prost and Brazilian Ayrton Senna . This acrimonious and long battle reached unprecedented heights of controversy and media coverage; this struggle was between two men who were both considered to be by far the best drivers in Formula One at that time. , The 1988 race was a championship decider between Senna and Prost- who were McLaren teammates that year. Senna came in with a greater chance of winning the championship, as the points system in those days counted the best 11 results; Senna had retired from one more Grand Prix than Prost had and had been slightly less consistent than the Frenchman; this was actually to the Brazilian's advantage; the way the points system worked in those days meant that there was more room for him to score points. McLaren also had obtained superior and fuel-efficient Honda engines from Williams, and had a car that was far better than any of the others, and they had won every race in the season so far except the Italian Grand Prix. At the start, Senna made a very bad start and dropped to 14th, while Prost took the lead, followed by Gerhard Berger in a Ferrari (who had won the Italian Grand Prix). It then began to rain, and wet-weather specialist Senna stormed around the track, setting a number of fastest laps and passing car after car until he caught Berger in 2nd and started to catch Prost rapidly. The Frenchman's gearbox was malfunctioning, and the Brazilian caught and passed Prost while the Frenchman was delayed by consistent backmarker Andrea De Cesaris. Senna won the race and his 1st driver's championship and Prost finished 2nd. Prost had scored more points in total than Senna, but the Frenchman could only score 3 more points because he had finished 1st and 2nd in every race so far except two (13 finishes in total, only the best 11 results counted), and if he had won (9 points), one of his 2nd-place finishes (6 points) would not have counted towards his countable points tally. Prost ended up scoring 105 points in total to Senna's 94- but only 87 of Prost's points counted, and 90 of Senna's points counted, so Senna won the driver's championship. , The 1989 race was a highly anticipated race, and even with new regulations banning turbo-charged engines, the McLaren-Honda combination was still dominant- they had won 10 of 14 races so far in the season. This race turned out to be one of the most memorable in the sport's history. Prost and Senna, once again McLaren teammates for 1989, were both embroiled in an acrimonious personal feud that had started at the second race of the season and their relationship was, come the race weekend- at such a low point it was virtually non-existent. Very unusual for teammates of a racing team, there was almost zero communication going on between Prost and Senna- it was to the degree where the McLaren team were almost running as 2 different teams- with 4 to 5 times more people around Senna than Prost. This was because Senna had a closer relationship with the Honda engineers than Prost; Senna's popularity with the Japanese public thanks to his flat-out driving style benefited Honda in many different ways; and McLaren wanted a long-term partnership with Honda, as their engines were better than all the others. Both Senna and Prost went into the race weekend each knowing what the stakes were. Prost was 16 points ahead of Senna, and the Brazilian was facing nearly insurmountable odds- he had to win at Suzuka to stand any chance of staying in contention of winning the championship going into the next race- the Australian Grand Prix , and he had to win that race, too. 9 points were received for 1st place, which was enough to beat Prost by 2 points- granted that the consistent Frenchman didn't finish either race; something that seemed very unlikely. Senna qualified on pole position 1.5 seconds ahead of Prost who was already working on his race setup in qualifying. Senna's set up meant he was faster around corners, while Prost opted for a set up that made him faster on the straights. , Come race day, the two McLarens were on the front row of the grid, and both McLaren drivers' emotions were running very high. As the starting lights flashed to green, Prost made an excellent start and jumped into the fast first corner ahead of Senna, and this was to start a race-long battle for top honors. The two McLaren drivers immediately started to pull away from the rest of the field, with Prost and Senna setting the pace at the highest possible level they could muster. If Senna won with Prost 2nd, the Frenchman would take the title. But Prost, in the awful emotional state he was in, was in no mood to lose a race to Senna again. Prost was known as a mild-mannered character who had a smooth, clean driving style; but during this race he was furiously throwing his car around the circuit and taking chances he often would not take. As they had been doing in a number of races where they ran closely together (particularly that year's German Grand Prix ), Prost and Senna were driving as fast as they knew how, like men possessed. Then, Prost began to pull away from Senna. Once they had stopped for tyres, Prost's pit stop was one second faster than Senna's, and the Frenchman again had the advantage. But because he had stopped earlier than Senna, his Goodyear tyre rubber would wear more, so he decided to conserve his tyres and run at a slightly slower pace, and then Senna set fastest lap after fastest lap in a furious effort to catch the Frenchman. Senna had finally caught up to Prost, and Prost responded by keeping the Brazilian's pace- they drove on their own personal limits and Senna tried on a number of occasions to pass Prost. But on lap 47, going through the ultra-fast 130R corner, the Brazilian attempted an ambitious pass going into the Casio chicane. Senna was in an awkward position to pass and tried to shove his way past Prost- but the Frenchman decided to be true to words he had said to Senna and McLaren boss Ron Dennis - he would not leave the door open as he had before and give up the position simply for McLaren to be embarrassed by a double retirement. And Prost did exactly that- as he turned into the right handed turn that made up the first part of the chicane, he turned into Senna, and the Frenchman's car hit the Brazilian's car and the two cars were interlocked and both slid off the track and up the chicane's escape road, the Honda V10 engines in both cars stalling. , Prost and Senna were both beached and Prost got out of his car promptly, knowing he had won the championship whilst Senna waved towards a group of Suzuka's track marshals, who ran up to the two interlocked cars. So they could separate the two cars, the marshals pushed Senna's car backwards onto the track, which put it in a dangerous position. The marshals then pushed his car forwards while Senna bump-started the engine, and he drove off. Even after being stalled for more than 30 seconds, the furious pace he and Prost had been running at put them both so far ahead of the rest of the field that Senna was still leading the race comfortably in front of Benetton driver Alessandro Nannini. Senna's front nose cone was damaged and going through the Degner bend, it came off; and he pitted to have it changed. Nannini had passed Senna while the Brazilian was in the pits- and after he stormed out of the pits, Senna drove as furiously as he had before, and within 2 laps while making up 2.5 seconds a lap on Nannini he caught and passed the Italian cleanly at the Casio chicane. Senna crossed the finish line first, but the podium ceremony had been delayed. There was a meeting between Senna, Prost, the McLaren management and FIA officials including the very unpopular FIA and FISA president Jean-Marie Balestre . It was thought that Senna was going to be disqualified for receiving external non-team assistance, which was against the rules- but that rule had a trump card. That \"card\" (rule) read that if a driver was deemed to be in a dangerous position, they could be push started. But much to almost the entire Formula One paddock's astonishment, it was deemed that Senna was to be disqualified for cutting the chicane and bypassing the marked track after making his way up to the lead and being first on the track. Cutting the chicane was in effect bypassing the track to gain an advantage- and this was illegal. But this rule was not enforced and generally ignored in those days if a driver was negatively affected in terms of where they stood in the race- which Senna was not. Nevertheless, the Brazilian Senna was infuriated by the decision- and he later said that he struggled to cope for a long time with what happened. Nannini was handed the race victory as a result of Senna's disqualification, and McLaren appealed Senna's disqualification- which was not only denied by Balestre and the FIA but he was handed a $100,000 fine and a six-month suspension, both of which were eventually rescinded. Prost had won the driver's championship for the 3rd time- but this was not official until Senna's retirement from the Australian Grand Prix 2 weeks later, before which McLaren's appeal had been denied. , The 1990 event proved to be just as controversial as the 1989 event. Senna and Prost were once again 1st and 2nd in the championship- the two men had won 37 of the past 46 Formula One championship races. But the roles had been reversed. Senna was 9 points ahead of Prost in the championship, and the championship situation for Prost was similar to Senna's had been in the previous year. As shown in a video of the pre-race drivers' briefing,  the drivers were discussing what was to be done if a car was in a dangerous position at the Casio Chicane. Senna was appalled at what he saw as a ridiculous interpretation of badly thought-out rules- and he walked out of the meeting as it was taking place. Senna qualified on pole position, three-tenths ahead of Prost, now driving for Ferrari, who had the next most competitive package that year behind McLaren. Senna requested to change the grid positions in order move pole position to the cleaner left side of the road, where the racing line was. This was granted, but Balestre stopped this and reverted the grid positions back to where they originally were, which meant pole position would be on the dirtier right side of the track, where all the bits of tire rubber that had been thrown from the tires by the Formula One cars, which meant he was off the racing line and worse, it would be more difficult for Senna to make a better start. Frustrated and angry, Senna mimicked Prost's statement of the previous year saying he would not move over if Prost attempted to overtake in the first corner — Senna started at pole, with Prost second (albeit on the racing line). Prost got ahead of Senna- but the more powerful Honda engine in Senna's McLaren meant that he was able to make up a little bit of ground. Prost moved over to take the racing line, but Senna, too far behind Prost to pass him, went for it- and as a result he violently hit the back of Prost's Ferrari. The Frenchman's car had lost his front wing and his car rotated in circles uncontrollably while Senna went straight on and both drivers sped through the gravel traps at 160 mph (260 km/h) and crashed into the tyre wall at the end of the run-off area. Senna and Prost were both unhurt, and neither driver bothered to check to see if the other was okay. This accident meant that Senna won his second world driver's championship; Prost's retirement meant he could not overhaul Senna's point total. The crash looked somewhat dubious, and nothing was done to Senna by the FIA; because they had done nothing to Prost in 1989 for crashing to Senna, they could not do anything to Senna that wouldn't seriously compromise their authoritative powers handing Senna his second world championship; Prost's retirement meant he could not overhaul Senna's point total. Furious and disgusted, Prost later described Senna as \"a man without value\". Both drivers have been accused of crashing into the other deliberately and thus the two situations as well as their comments after both incidents have tainted both driver's reputations in the eyes of most but die hard fans. Benetton driver Nelson Piquet won his first race in 3 years after Gerhard Berger went off and Nigel Mansell 's Ferrari failed in the pits after a pit stop, and Piquet's new teammate Roberto Moreno finished 2nd. , 1991 was yet again the showdown for the driver's championship, and it saw Senna and this time Mansell in a competitive but rather unreliable Williams battle for the driver's championship. Prost did not win a race in his uncompetitive Ferrari that year and it turned out to be his last race for the Scuderia that year; he was fired from the team after the race while describing the 643 as having handling like \"a truck\". This was the last straw for Ferrari; as Prost had been making unsavory comments about the Italian team for some time. The race started, and Mansell went off at the first corner on lap 10, and Senna won his 3rd driver's championship in 4 seasons. Senna let his teammate Gerhard Berger through to win as a \"thank you\" gesture for his support all season. But during the post-race press conference, Senna then admitted that his actions in 1990 were indeed intentional, and he then called Balestre and the rest of the governing body \"stupid people\". He admitted that he did what he did the year before because of his refusal to put up with Balestre's continuously illegal manipulation of the driver's championship. 1992 was the first year, which the Japanese Grand Prix at Suzuka did not determine the championship- Mansell had already won it 4 races before in Hungary with his all-dominant Williams. He retired from the race, as did Senna, and Mansell's teammate Riccardo Patrese took his only victory that year. 1993 was an interesting event; Senna took the lead from Alain Prost (who had won his 4th driver's title at the previous race ) and kept it; although changeable weather conditions played to Senna's advantage- who was known to be exceptional in wet-weather conditions. He was harassed, however, by Briton newcomer Eddie Irvine, who attempted to pass Senna and unlap himself while battling with Prost's British teammate Damon Hill . Senna won his 40th race in his career from Prost, but he wasn't all smiles. He sought out Irvine, had a heated discussion with the Northern Irishman and punched him in the side of the head; and then Senna went on live television for post-race interviews, and used profanity on the live recording in frustration at Irvine, other driver's bad behavior on the track and at the media, who he claimed were irresponsible for sensationalizing some of the driver's dangerous on-track behavior. , By 1994, Prost had retired and Senna was killed at the San Marino Grand Prix , and the Japanese GP that year saw Hill and German Michael Schumacher battle for the driver's championship. Hill crucially won the race ahead of Schumacher; Suzuka was hammered by a torrential downpour which made conditions very difficult for Hill as Schumacher was an acknowledged specialist in wet-weather conditions. 1995 saw an incredible drive from French-Italian Jean Alesi on dry slick tyres on damp conditions. It had rained at the start; but the track was drying. Alesi went into the pits on lap seven, around the time everyone else came in. The French driver began to lap Suzuka in his Ferrari 5 seconds faster than anyone else, and when he came out of the pits, he was 17th- but over the course of 18 laps climbed to 2nd place, passing car after car while a number of the other cars changed to dry slick tyres. But then Alesi had to serve a drive-through penalty for jumping the start. But this did not stop the emotionally highly-strung Alesi- he dropped down to 10th, but he pushed hard; and began passing car after car. He then went into the pits and dropped to 13th from 8th. Alesi had gone off on the last corner on lap 20 but recovered, but dropped further down the order to 15th. Just about all the runners had changed to dry slick tyres, and Alesi started to push hard again- and he was lapping the damp circuit 5 seconds faster than everyone else, and just about everybody had slick tyres on at this point. He went from 15th to 9th in one lap and he got into 2nd again behind Schumacher- whom he had caught up to and battled with for the lead. This remarkable performance was only to last 5 laps, however: Alesi's Ferrari's driveshaft failed as a result of his excursion earlier and he retired from the race. Schumacher won the race; he had already won the driver's championship at the European Grand Prix at the Nürburgring. 1996 was the last race of the year, and it saw Williams teammates Jacques Villeneuve and Damon Hill's title struggle come to a showdown at Suzuka. Villeneuve lost a wheel on lap 37 and went off at the second of the first sequence of corners, handing the driver's title to Damon Hill; however he was never as competitive as he was ever again in Formula One- team owners Frank Williams and Patrick Head decided earlier in the season not to renew Hill's contract. , 1997 saw Michael Schumacher win and his title rival Jacques Villeneuve disqualified for ignoring yellow flags during one of the practice sessions. Finn Mika Hakkinen won the next 2 races and his second consecutive driver's title in 1999. The next 5 events were all won by Ferrari; Schumacher won in 2000–2002 and 2004, and his teammate Rubens Barrichello won in 2003. Schumacher won his 3rd title at the 2000 event, he took advantage of his superior speed in damp conditions during a mid-race rain shower to secure the race win and his first World Title for Ferrari. Ferrari completed their domination of the 2002 season by completing their total points tally of 221 points on the previous 10-point scoring system. At the 2003 event, Michael Schumacher endured one of the most trying races [ original research? ] in his career, needing to come at least eighth, he started at fourteenth on the grid — but managed to secure the point he needed to take his sixth World Championship, beating the record held by Juan Manuel Fangio . The qualifying session for the 2004 event , due to have been held on 9 October, was postponed until race day after a typhoon hit Suzuka. This led to the idea of holding qualifying sessions on a Sunday morning (an idea that was abandoned half-way through the following year ). The 2005 race was one of the most exciting races of the season after many top drivers started near the back of the grid after the qualifying in variable weather. McLaren driver Kimi Räikkönen won the race after starting from 17th place, overtaking Renault driver Giancarlo Fisichella at the beginning of the last lap, after Fisichella was blocked by a backmarker. At the 2006 event Schumacher led until an engine failure virtually ended his chances of an eighth championship, which went to Spaniard Fernando Alonso . , It was announced on March 24, 2006 by the FIA that future races will again be held at the redesigned Fuji Speedway (now owned by Toyota) in Oyama , Sunto District , Shizuoka Prefecture .  The news of the Japanese Grand Prix moving to the circuit redesigned by Hermann Tilke was met with some trepidation, as the Honda-owned Suzuka was a favorite of many of the drivers and Hermann Tilke's tracks have received mixed reviews from the drivers and the fans. , On 8 September 2007, it was announced that Fuji will alternate the Japanese Grand Prix with Suzuka, starting from 2009 onwards.  The 2007 race was held in torrential rain and started behind the safety car. Lewis Hamilton took the victory while his team-mate Fernando Alonso crashed heavily. Heikki Kovalainen finished 2nd, his best result until that date and Kimi Räikkönen 3rd, marking the first time that two Finnish drivers were together on the podium. In 2008, the first corner brought troubles for the McLarens and the Ferraris, and Fernando Alonso was able to take win in a Renault. Felipe Massa was 7th after a penalty for a collision with title rival Lewis Hamilton, while Hamilton finished outside the points, having also served a penalty for an incident in the first corner. , In July 2009, Toyota cited a global economic slump as the reason that the Japanese Grand Prix would not return to Fuji Speedway in 2010 and beyond. The speedway argued, according to the Associated Press , that \"continuing to host F1 races could threaten the survival of the company.\" As a result, the 2010 Grand Prix was held at Suzuka.  Sebastian Vettel secured his second World Championship in the 2011 Grand Prix with a third-place finish, McLaren 's Jenson Button (the only driver who in the field who had a theoretical chance of beating Vettel to the title) won the race wearing a special tribute helmet to the people affected by the 2011 Tōhoku earthquake and tsunami . The helmet featured a design in the style of the Japanese flag, and he auctioned the helmet off afterwards to raise money for those caught in unfortunate circumstances during the times of the tsunami earlier that year. , From its return to the Formula One calendar in 1987 , the Japanese Grand Prix was one of the most popular with spectators. For the 1990 race , three million fans entered a draw for the 120,000 available tickets, due to the popularity of Honda 's world championship successes as an engine supplier to the Williams and McLaren teams, and the fact that the country had produced its first full-time F1 driver in the shape of Satoru Nakajima and Ayrton Senna's immense popularity in Japan. [ original research? ] After Nakajima's retirement in 1991 and Honda's withdrawal from competition the following year, interest went into decline despite the addition of the Pacific Grand Prix to the F1 calendar, an event also held in Japan during the 1994 and 1995 seasons. The 1995 Japanese Grand Prix was the first for which the allocated tickets did not sell out.  Subsequently, the appearance of new Japanese drivers such as Takuma Sato and the entry of Honda and Toyota as full manufacturer teams has restored the event to its former popularity. But Honda pulled out of F1 at the end of 2008, citing economic reasons, and Toyota did the same the following year, also citing economic reasons. , Honda will be returning to Formula One as an engine supplier for McLaren starting in the 2015 season. On 23 August 2013 it was announced that the contract for the Japanese Grand Prix had been extended until 2018.  , Events which were not part of the Formula One World Championship are indicated by a pink background. "
}
