{
  "category": "f1",
  "article": "First included in the Formula One World Championship in 1999, the current Malaysian Grand Prix is held at the Sepang International Circuit at Sepang , Malaysia . FIA -sanctioned racing in Malaysia has existed since the 1960s. Since 2011, the race has been officially known as the Malaysia Grand Prix.  , , , The 1962-1965 seasons of the original Formula Two Grand Prix held on the Thomson Road circuit in Singapore is regarded as an earlier precedence of the Malaysian Grand Prix, when Singapore was originally part of the Malaysian federation from 1963 to 1965. After Singapore seceded from the federation in 1965, the Grand Prix continued until 1973. , Between Singapore's departure from the Malaysian federation and the opening of Sepang Circuit, Malaysia hosted a range of other racing tournaments at Shah Alam 's own circuit between 1968 to 1995, including the Tasman Series (1968–1972),  Formula Pacific (1973–1974, 1978–1982), Formula Atlantic (1975), Formula Two (1977) and Formula Holden (1995). , As part of a series of major infrastructure projects in the 1990s under Mahathir Mohamad 's government, the Sepang International Circuit was constructed between 1997 and 1999 close to Putrajaya , the then-newly founded administrative capital of the country, with the intent of hosting the Malaysian Grand Prix. Similar to other of the country's circuits, the circuit is known for its unpredictable humid tropical weather, varying from clear furnace hot days to tropical rain storms. , The inaugural Grand Prix at Sepang was held in 1999 , and saw Michael Schumacher return to the sport after his absence due to a broken leg sustained at that year's British Grand Prix .  Ferrari dominated the race, with Schumacher handing the victory to title-hopeful team-mate Eddie Irvine , only for both Ferraris to be disqualified due to a technical irregularity, before later being reinstated.  , The 2001 event was hit by a heavy rainstorm in the middle of the race which made conditions very difficult. Conditions were so bad that the two Ferraris of Michael Schumacher and Rubens Barrichello spun off almost simultaneously at the same corner. Remarkably, they both recovered to score a Ferrari \"1-2\", because for a long time they were nearly 5 seconds faster than anyone else on the field. Elsewhere, the race was even led by Jos Verstappen , surprisingly. However, as the track begun to dry, he fell back to 7th, but his efforts to keep positions were memorable.  , Since 2001, the Malaysian Grand Prix has moved from the end of the season to the beginning, which has seen some topsy-turvy results as teams and drivers get to grips with their new equipment, with many races heavily influenced by the winners and losers of the scramble for position into the tight double hairpin bend at the first corner.  , On 8 April 2007, shortly before the 2007 Malaysian Grand Prix , Formula One president Bernie Ecclestone was quoted as stating that the circuit was getting \"shabby\" and \"a bit tired\" from the lack of care, describing it as \"an old house that needs a bit of redecorating\". He noted that the circuit itself is not the issue, but rather the surrounding environ; rubbish is said to be littered all over the place, potentially damaging the circuit's good reputation when it was opened in 1999.  , The day before, Malaysian Prime Minister Abdullah Ahmad Badawi had met Ecclestone to discuss an extension of the Formula One contract beyond 2010.  While the government had been given an additional extension to host the Grand Prix until 2015, the government was still mulling the offer, as of 23 April 2007.  The circuit was given a renewed contract in 2006 to organise the Malaysian Grand Prix for another five years.  , On 13 February 2008, the management of the Sepang International Circuit announced its aim to become Formula One's second night race from 2009 after Singapore , following discussions about buying a floodlighting system. Its plans seem to be moving forward when Mokhzani Mahathir , the chairman of the circuit, revealed that they were in the process of securing a lighting system. He was quoted as saying, \"They might be custom made for the circuit.\"  However, since then, the organizers have confirmed that they will not be making the race a night race, but will be adopting a late-afternoon start time.  The 2009 Malaysian Grand Prix indeed did adopt a late afternoon start time. However this proved disastrous due to heavy rainfall and the race not being able to be restarted due to the low light level making it through the clouds, the race ended on Lap 33, and with the rules requiring 42 laps for full points, so both driver and constructor results were halved in relation to points.  , A pink background indicates an event which was not part of the Formula One World Championship. The 1962 race was titled \"Malayan Grand Prix\" , Formula BMW Asia and Porsche Carrera Cup Asia have supported the Malaysian Grand Prix since 2003. , Coordinates : 2°45′36″N 101°44′13″E ﻿ / ﻿ 2.760°N 101.737°E ﻿ / 2.760; 101.737 "
}
