{
  "category": "f1",
  "article": "The Mexican Grand Prix (Gran Premio de México) is a Fédération Internationale de l'Automobile sanctioned auto race held at the Autódromo Hermanos Rodríguez in Mexico City . It first appeared as a non-championship event in 1962 before being held as a championship event from 1963-1970 and 1986-1992. The Grand Prix is scheduled to return in 2015 at the Mexico City circuit. , , , The Mexican Grand Prix was first held on 4 November 1962 at the Magdalena Mixhuca circuit. The circuit was the first international racetrack in Mexico and was built within a park in the center part of capital city of Mexico City . The race provided rare challenges racing at high-altitude (7,380 feet above sea level) and the challenge of the large, 180 degree, lightly banked and fast Peraltada corner that finishes the lap, in addition to being a bumpy racetrack from actively shifting soils beneath the circuit. The Mexican Grand Prix of this period was always the season finale Grand Prix, held in late October. , The first race , a non-championship affair which attracted a strong international entry, was won by Team Lotus with Jim Clark taking over the car of team mate Trevor Taylor to claim the win; Clark was black-flagged after receiving a push-start at a confused race start. The meeting was marred by the death of young Mexican star Ricardo Rodríguez who as a teenager was already a works Ferrari driver. Despite this, Rodriguez died after injuries received crashing a Rob Walker run Lotus 24 on the Peraltada. The Formula One World Championship arrived the following year with Clark winning again, equalling Juan Manuel Fangio 's record of most victories in a single season. 1964 saw the battle for both the drivers and constructor's championships. British drivers Clark, John Surtees and Graham Hill all arrived with a chance, with Hill leading the table; and Ferrari, BRM and Lotus were in contention for the constructors championship. The race started with Clark leading from pole position, with American Dan Gurney , Italian Lorenzo Bandini , Hill, and Surtees. Bandini and Hill were battling, and Bandini then ran into the back of Hill's car, causing him problems. Then, on the very last lap, Clark's engine seized, and Gurney took the lead, with Bandini second and Surtees third. The Ferrari team signaled Bandini to let his teammate Surtees through, which he did, and Surtees finished second behind Gurney and won the championship by one point over Hill, and Ferrari won the constructor's championship; Clark finished fifth. 1965 saw American Richie Ginther take victory for Honda, the Japanese company's first Formula One victory. 1967 saw Clark win his third Mexican Grand Prix, the most prolific winner of the race to this day. 1968 once again saw three men go into the race with a chance of winning the driver's championship. Hill, his countryman Jackie Stewart and New Zealander and defending world champion Denny Hulme . The race was a straight fight between Hill and Stewart; the Scotsman leading for several laps until Hill passed him. Hulme was running third, but he had a rear suspension failure and crashed on Lap 11. Swiss Jo Siffert decided to get in on the mix and took the lead, but he had to pit with a broken throttle cable. Stewart then fell back with when his engine started to misfire, his car's handling was going off and the car also had a fuel-feed problem. But Hill had no problems; and took victory and his second driver's championship. The race continued until 1970 when it was dropped from the calendar. An enormous crowd of approximately 200,000 arrived to see Pedro Rodríguez , but officials struggled to control the crowd and at one point a dog ran across the track and was hit by Stewart. , American IndyCars arrived for a brief two-year visit in 1980 and 1981, racing as the Grand Prix of Mexico on the Magdalena Mixhuca track now named for Mexico two lost racing heroes, Autódromo Hermanos Rodríguez. The event was dominated by Rick Mears . A number of years later, work began on rebuilding the Hermanos Rodríguez circuit with much improved organisation. The circuit's layout was slightly shorter and the circuit was much safer than it had been. The Grand Prix returned in 1986 where the race played host to Austrian Gerhard Berger 's first race win in his Benetton B186 , in a race where an ill Berger outlasted his opposition as tyre problems struck most of the field. The circuit was still very rough and bumpy, however. 1987 saw the race being run in two parts. It was stopped around mid-distance when Briton Derek Warwick crashed heavily coming out of the Peraltada, Brazilian driver Nelson Piquet actually won on the road, but because his Williams teammate Nigel Mansell was 30 seconds ahead when the first race ended, Mansell kept Piquet in sight and won the race on corrected time. , The 1988 race was moved from mid-October to a late May season slot. This race saw Frenchman Alain Prost dominate in his dominant McLaren, and Prost's Brazilian teammate Ayrton Senna won the next year; this was at a time when the two men's relationship was at a low point. 1990 saw the race moved to late June, and it produced a stirring drive from Prost (now in a Ferrari). The Frenchman qualified 13th on the grid and drove through the field, and took second from his teammate Mansell late in the race. Senna, who was leading, had a slow puncture that turned into shredded rubber and he went into the pits to have it changed, but the suspension was too badly damaged for the Brazilian to continue. This put Prost and Mansell 1-2 but Senna's teammate Gerhard Berger was challenging Mansell for second; and Berger aggressively passed the Englishman going into the Moises Solana esses. But Mansell was not about to give up- as the Englishman pulled a brave overtaking manoeuvre on the same lap. Going into the Peraltada, Mansell was climbing all over the back of Berger and he passed the Austrian around the outside of the corner. Prost won the race; Mansell and Berger finished second and third. 1991 saw Senna crash heavily at the Peraltada during practice; he was declared fit to race by FIA doctor Sid Watkins ; he finished third behind Williams drivers Riccardo Patrese and Mansell. On October 9, 1991 European media sources reported that promoters barely made enough funds to pay off F1 for the 1991 race. FISA demanded improvements to the track for the 1992 event.  For the 1992 season, the race had been moved further forward to March, and on February 20 of that year, Mexico City's air pollution had reached a record level. City officials had imposed emergency measures banning half of government cars and equipment from the streets. This put extra stress on the Mexican Grand Prix committee to ensure the track was ready for 1992.  Some safety measures had been implemented to the track; i.e. easing of the banking at Peraltada, making the corner a little slower. The race that year went ahead, and it saw Williams teammates Mansell and Patrese dominate the race. Senna had another bad accident, this time at the fast Esses. Although the circuit was popular with drivers, they began complaining about the ubiquitous bumps on the circuit, which had decayed even further and the decline of Mexico City itself not only with air pollution problems but also a rapid and unstable city population increase saw Formula One leave again. , 2002 saw the revival of the Grand Prix of Mexico for Champ Cars on a much modified version of the Autódromo Hermanos Rodríguez circuit which included cutting the peraltada in half. This was a six-year stay which saw Sébastien Bourdais win half of the six races that followed. , Rumors first surfaced in 2003  that the Mexican Grand Prix might return to the Formula One calendar at a new $ 70 million circuit, dubbed \"Mantarraya\", to be built near Cancún . In 2005, the governor of the Quintana Roo state boldly stated Mexico would have a Grand Prix on the calendar for 2006 .  The plan was halted, possibly scuttled, later that year as a debate arose about whether the land the circuit was to be built on was properly owned by the right people to do so.  , After the 2006 United States Grand Prix , Bernie Ecclestone announced that the Grand Prix of Mexico would return for the 2009 season, however nothing further came from the announcement. , In August 2011, Carlos Slim Domit revealed plans for a revived race.  In August 2013, it was suggested by \"high level sources\" that the Mexican Grand Prix could be on the provisional 2014 World Championship calendar.  A preliminary draft calendar for the 2014 season, circulated in early September 2013, assigned 9 November 2014 for the Mexican Grand Prix, but did not specify a circuit and noted that the event was \"subject to confirmation\".  But on December 5, 2013, the FIA released the official 2014 Formula One season calendar, and the Mexican Grand Prix was not on the calendar; then the FIA announced that the Mexican Grand Prix was postponed to 2015 due to lack of sufficient preparation time to upgrade the somewhat run-down Hermanos Rodríguez circuit to Formula 1 working standards.  In July 2014, Ecclestone confirmed that he had signed a 5-year deal for the Hermanos Rodriguez track to host the Mexican Grand Prix, starting in 2015.  On 3 December 2014, the FIA published a confirmed calendar for 2015  showing the 2015 Grand Prix of Mexico on 1 November 2015. , *Shared win with Trevor Taylor , Note: Pink background indicates non-Championship year. "
}
