{
  "category": "f1",
  "article": "The United States Grand Prix is a motor race which has been run on and off since 1908, when it was known as the American Grand Prize . The race later became part of the Formula One World Championship. Over 44 editions, the race has been held at ten locations, since 2012 at the Circuit of the Americas in Austin, Texas . , , , Inspired by the Gordon Bennett Cup and Circuit des Ardennes races he had competed in, William Kissam Vanderbilt founded a series of road races in the United States to showcase American road racing to the world. The Vanderbilt Cup soon became an institution on New York's Long Island , attracting American and European competitors alike. However, the race was plagued by crowd control problems, which led to spectator deaths and injuries, and the cancellation of the 1907 event. Upon its return for 1908, the American Automobile Association did not adopt the new Grand Prix regulations agreed upon by the Association Internationale des Automobiles Clubs Reconnus (AIACR).   This led the rival Automobile Club of America, an enthusiasts group with strong ties to Europe, to sponsor the American Grand Prize , using the Grand Prix rules.  The Savannah Automobile Club, who had staged a successful stock car race in the spring, won the rights to stage the event.  , The Savannah Automobile Club laid out a lengthened version of their stock car course, totaling 25.13 mi (40.44 km). Georgia Governor M. Hoke Smith authorized the use of convict labor to construct the circuit of oiled gravel. The Governor also sent state militia troops to augment local police patrols in keeping the crowd in check, hoping to avoid the pitfalls of the Vanderbilt Cup races.  The entry for the inaugural race featured 14 European and six American entries, including factory teams from Benz , Fiat , and Renault .  In the race, held on Thanksgiving Day , Ralph DePalma led early in his Fiat, before falling back with lubrication and tire problems. The race came down to a three-way battle between the Benz of Victor Hémery and the Fiats of Louis Wagner and Felice Nazzaro . Wagner won the race by the close margin of 56 seconds.  , Despite the success of the Savannah event, it was decided that the 1909 race would be held on Long Island, in conjunction with the Vanderbilt Cup. However, only the Vanderbilt race was held and the Grand Prize pushed back to the next year. After the 1910 Vanderbilt Cup saw more issues, including the deaths of two riding mechanics and several serious spectator injuries, the Grand Prize was cancelled once again. A last-minute request by the Savannah club saved the race for the year, but only gave one month to prepare the course. A shorter 17-mile (27 km) course was laid out, but due to the short notice, most European teams were not able to make the trip. The leading trio from 1908 did make it and American David Bruce-Brown joined the Benz squad. Bruce-Brown won another incredibly tight race over teammate Hémery, this time by only 1.42 seconds.  The 1911 event returned to Savannah, and this time the Vanderbilt Cup came with it; the Cup and Grand Prize were to be held together until 1916. Despite the success of the events, public pressure started to amount on the organizers. The use of convict labor and the militia drew criticism, as did the nuisance of closing roads for the event.  Two accidents on the open roads in practice, one resulting in the death of Jay McNay, cast a shadow over the event. The American entries dominated the support events and ran well throughout the Grand Prize, after poor showings in past years and once again Bruce-Brown triumphed, this time driving a Fiat.  , For 1912, Savannah succumbed to public pressure, and Milwaukee , Wisconsin , won the bid for the race. A narrow, 7.88-mile (12.68 km) trapezoidal course was set up on the outskirts of the city, in Wauwatosa . As in 1911, tragedy struck in practice when David Bruce-Brown was killed after a puncture sent him off the road. On the final lap of the race, Ralph DePalma collided with eventual winner Caleb Bragg , seriously injuring DePalma and his mechanic and ending any chance of a second race at Milwaukee.  , The Grand Prize was not held in 1913, after Long Island's bid was rejected and Savannah refused to provide sufficient prize money. Oval racing on board tracks had taken off in the United States, to the detriment of road racing. For 1914, the Grand Prize and Vanderbilt Cup were staged in Santa Monica, California , on an 8.4-mile (13.5 km) course, with the start/finish straight along the Pacific Ocean . The field was primarily American entries (twelve, against five European entries), and the Americans dominated, with Eddie Pullen 's Mercer winning by over 40 seconds.  In 1915, the race shifted to San Francisco , in conjunction with the Panama–Pacific International Exposition . With the outbreak of World War I in Europe, almost all of the drivers and cars were American, except for a few cars imported earlier. The 3.84-mile (6.18 km) course was set up around the Exposition grounds and nearby oval track with a boarded main straightaway. Heavy rain began two hours into the race, covering the circuit in mud from the extensive flower arrangements, and warping the main straight's boards. Dario Resta in a Peugeot cruised to a seven-minute victory, and followed up a week later by winning the Vanderbilt Cup.  For 1916, the Grand Prize returned to Santa Monica. The race would be a part of the AAA National Championship , which carried a 4.91-liter displacement limit. Although the limit for the Grand Prize was 7.37 liters, no large-displacement cars would enter. The race was the penultimate round of the championship, with Dario Resta leading Johnny Aitken after his Vanderbilt Cup win. However, both cars would be out before halfway. Although Aitken took over teammate Howdy Wilcox 's car for the win, the AAA awarded points only to Wilcox, and Resta took the championship.   , The Grand Prize was discontinued after the 1916 event. Between a lack of European participation due to World War I and the growing American interest in oval racing, road racing fell by the wayside. The two Santa Monica events were the only road races on the 1916 championship, and the aborted 1917 National Championship was slated to feature 8 events, all ovals and six of them board tracks.  The Vanderbilt Cup was revived in 1936 and 1937 and run to Grand Prix regulations, but the races were a commercial failure. , The Indianapolis 500 kept a connection to European racing, running to Grand Prix regulations between 1923 and 1930,  and from 1938 until 1953.  In the late 1920s, efforts were made to refer to the 500 as the American Grand Prize.  The Grand Prize trophy was awarded to the winner of the Indianapolis 500 between 1930  and 1936, when it was replaced by the Borg-Warner Trophy . The race was included in the World Championship from 1950 through 1960. , Riverside International Raceway opened in Riverside, California , in 1957 and one of its first events was an SCCA National sports car race. For 1958, the race moved to the new, professional, USAC Road Racing Championship , and was billed as the \"United States Grand Prix\".   The race attracted over 50 cars and drivers from sports car series in the U.S. and Europe, as well as USAC and NASCAR . Chuck Daigh won in a Scarab , beating Dan Gurney 's Ferrari in second place.   , Russian-born Alec Ulmann staged the first 12 Hours of Sebring endurance race, located in central Florida in 1952 and it became a round of the World Sportscar Championship in 1953. Buoyed by the success of the 12 Hours, the Riverside sports car race and Formula Libre events at Watkins Glen and Lime Rock Park , Ulmann decided to stage a Formula One race at Sebring International Raceway in 1959. The race was billed as the \"II United States Grand Prix\",  cementing the Riverside race as a part of the Grand Prix's heritage. The race was originally scheduled for March 22, the day after the 12 Hour-race, but rescheduled for December 12, the final round of the season.  The race took place 3 months after the previous round at Monza . The starting grid included seven American drivers, but New Zealand 's Bruce McLaren , in a Cooper , took his first win in F1 and was, at the time, the youngest driver ever to win a Grand Prix. McLaren took the lead on the last lap of the race when his team-mate, Jack Brabham , ran out of fuel. Brabham had to push his car over the line to finish fourth. By virtue of Ferrari 's Tony Brooks finishing third, Brabham and Cooper took the drivers' and constructor's championships.  Despite providing an exciting climax to the season, the race was not successful from the hosts' standpoint, as the promoters barely broke even. When prize money checks bounced, Charles Moran and Briggs Cunningham paid the money to save face for their country.  , Ulmann moved the race to the Riverside International Raceway in Riverside, California in 1960 . Stirling Moss put on quite a show in his privately entered Lotus by winning from pole position. However, while the driver's purse was enormous (as at Sebring), the event was no better received than the previous year's due to a lack of promotion, and proximity to the successful Times Grand Prix .  Again Moran and Cunningham would pay the prize money.  , Through most of 1961, Ulmann was listed as the promoter of the USGP, and contacted organizers in Miami and Bill France of the Daytona International Speedway but was unable to reach agreements. In August, racing promoter Cameron Argetsinger , owner of the 2.35-mile (3.78 km) Watkins Glen Grand Prix Race Course located in the central Finger Lakes region of upstate New York , offered his circuit to the Automobile Competition Committee for the United States (ACCUS) to host the Grand Prix. He succeeded and Watkins Glen would host the United States Grand Prix for the next 20 years. Over this time, the event became a tradition among the fans as loyal crowds gathered each autumn on the spread out hills of Upstate New York . It was one of the season's most popular events with the teams and drivers as well, receiving the Grand Prix Drivers' Association award for the best organized and best staged Grand Prix of the season in 1965 , 1970 , and 1971 . The isolated, very peaceful and quiet location of the track gave it a vacation-type atmosphere (it was and is at least four hours from a major city in every direction, New York City and Philadelphia were the two cities closest to Watkins Glen) and there was often a festive atmosphere that celebrated the end of each season of Formula One that included the Glen on its calendar. Watkins Glen has the longest hosting record of any American Formula One race in history; the considerably challenging track became known as the \"Mecca\" of American road racing and it eventually wove itself into European Grand Prix racing culture.  , Watkins Glen had hosted a series of Formula Libre events that attracted international entries. ACCUS accepted on August 28, leaving only six weeks to organize the event on October 8. Argetsinger assembled the field, but was unable to convince Scuderia Ferrari to make the trip, leaving Richie Ginther and recently crowned World Champion Phil Hill out of their home Grand Prix.  Innes Ireland took a surprise win, his first and the first for Team Lotus . Dan Gurney 's Porsche was second, and Tony Brooks was third in his final Grand Prix. Stirling Moss , in his final Grand Prix, retired with engine problems. Unlike the previous two races, the race was well attended (over 60,000) and turned a profit. The Watkins Glen circuit had similarities to the British Brands Hatch circuit, in that a number of corners were banked and very fast and that the circuit was located in a very green part of the world.  The race purse was paid in cash, a popular move with the teams after the previous two years payment issues.  Due to its position on the calendar near the end of the season, often either the final or penultimate round, championships were often decided before the event. In part to offset this, race organizers offered large sums of prize money; in 1969 the purse totaled $200,000 (with $50,000 for the winner),  and when in 1972 it was raised to $275,000, the Tyrrell team earned a record $100,000.  , 1962 saw Briton Jim Clark win in a Lotus; the next three races were won by fellow-Briton Graham Hill, each time in a BRM. Hill's 1964 win was crucial to him as he carried a points advantage into the next and final race in Mexico. 1966 and 1967 saw Clark win, the '66 win was the only time he won that year driving a Lotus with an overweight BRM H16 engine. Both the driver's and constructor's championships were clinched by Australian Jack Brabham and his Brabham team. Clark dominated the 1967 event, leading comfortably from his teammate Hill and American Dan Gurney in an Eagle. In 1968 Mario Andretti put his Lotus 49 on pole position in his first ever Formula One race on a track he had never seen before. Andretti retired, and Briton Jackie Stewart won the race in a Ford/Cosworth powered Matra. Austrian Jochen Rindt won in 1969 – his first Formula One race. He took advantage of Stewart's mechanical problems to pull a huge gap out on the rest of the field. Graham Hill had a much worse day, however. He punctured his car's rear right tire and the rubber came off the rim. The rubber exploded, sending Hill's Lotus cartwheeling off the course, and Hill was thrown out of the car at a very awkward angle, breaking both legs. 1970 was a memorable event, Brazilian newcomer Emerson Fittipaldi won the race, which was his fourth start in a Formula One race. Stewart retired his new Tyrrell and Fittipaldi, driving a Lotus, held off a charge from Mexican Pedro Rodriguez in a BRM. It was a very emotional win for Colin Chapman's Lotus team, as team leader Rindt had been killed while practicing for the Italian Grand Prix at Monza. Lotus had not run the Canadian Grand Prix, but because the next closest championship contender Jacky Ickx did not score enough points to keep him in contention, the driver's championship went posthumously went to Rindt at this race. Team Lotus also won the constructor's championship at the 1970 event. , In 1971, the course was changed considerably. The entire lower section of the track was torn up and re-drawn, and there was a whole new \"boot\" section which added more than a mile to the course, lengthening it to 3.377 miles (5.435 km). It also saw a new pitlane and pit straight and three new corners (a new first, second-to last and last corners). The improvements cost nearly $2.5 million ($13 million in 2010 dollars).  The alterations considerably heightened the driving challenge of the track, and it became even more popular than it had been with drivers, teams and fans. Watkins Glen had been transformed from a quick, small circuit into a fast, scenic and very tough up-and-down circuit where just about every corner was banked and long; uncommonly hard driving and maximum effort was required for almost every part of a lap. 1971 was the first running on the completed full circuit (the circuit was not completed in time for previous races, so the completed short circuit was used) and it saw popular Frenchman François Cevert win his only Grand Prix for Tyrrell, and the biggest cash prize in Formula One- $267,000. 1972 saw Jackie Stewart win after Emerson Fittipaldi had already won the championship at the previous race, the Italian Grand Prix at Monza. Cevert made it a Tyrrell 1–2. The race was at this point attracting lots of entries; 30 drivers entered and qualified for the 1972 race. , But from 1973 to 1975, the event reached its probable low. The 1973 Grand Prix was to become a memorable event for all the wrong reasons. Stewart, unknown to almost everyone (even his wife Helen) had planned to retire after this race. He had already won his third driver's championship two races previously at Monza and he would be running his 100th and final Grand Prix. But during qualifying, Stewart's teammate and friend Cevert was killed. Going into the nearly flat out uphill Esses, Cevert went into the first right-hander too fast, clipped the steep curb on the left hand side, lost control, hit Watkins Glen's trademark sky blue Armco on the right side (which on both sides was (and still is) situated right next to the track) and then the Tyrrell started to spin uncontrollably. The car then struck the barrier on the left side nearly head on at 150 mph. The car vaulted and went over the barriers. The barriers cut Cevert in half and he was killed instantly. The Tyrrell was completely destroyed and the right rear tire was sticking over the Armco barriers. South African driver Jody Scheckter tried to get him out- but it was no use; Cevert was so clearly dead. The marshals just left Cevert in the car and threw a cover over the cockpit. A distraught Stewart and his team's manager Ken Tyrrell withdrew the team, handing the constructor's championship to Lotus. The illustrious Scotsman never raced competitively again. The race, however, was an exciting one. Swede Ronnie Peterson in a Lotus beat Briton new boy James Hunt in a Hesketh-entered March to the finish by 0.6 of a second. American Peter Revson finished fifth at his home race at his home track.  The 1974 event was to decide the world championship between Fittipaldi and Swiss Clay Regazzoni. Both drivers had the same number of points and Regazzoni, driving a Ferrari, ran into a host of problems during the race and finished out of the points. Fittipaldi finished fifth which won him his second driver's championship. The event was marred by yet another fatal accident. The young Austrian Helmut Koinigg crashed at the fast, long Outer Loop corner, the bend after the extended back straight on Lap 10. Koinigg's Surtees went straight on and the car went under the barriers and decapitated Koinigg, killing him instantly.  The race was a Brabham 1–2, with Argentine Carlos Reutemann winning with Brazilian Carlos Pace second. 1975 saw a medium speed chicane added to the Esses to slow the cars down, but it did not ruin the flow of the track. The race however, was a politically charged event. Regazzoni held up Fittipaldi's McLaren for six laps and Fittipaldi eventually lapped the Swiss. However, Regazzoni was black flagged by Clerk of the Course Berdie Martin and this irked the ire of Ferrari team manager Luca di Montezemolo . The thin and wiry Montezemolo actually got into a bit of a scuffle with the large Martin; and Montezemolo withdrew Regazzoni in protest. It was not a complete disaster for Ferrari- Austrian and recently crowned driver's champion Niki Lauda went on to win from Fittipaldi. , 1976 saw James Hunt win crucially in a McLaren while his closest championship contender Lauda finished third. At this point, Hunt was only three points behind Lauda for the final race at Fuji, Japan. The race also saw Jacky Ickx crash hugely at the Chute, the Belgian survived but was injured. 1977 saw rain throughout the race. Hunt won again on a very wet track as he held off home favorite Mario Andretti in a Lotus 78 to win by two seconds. 1978 saw the heavy-hearted circus arrive after the death of Ronnie Peterson at Monza two weeks before. Andretti had already accumulated enough points to win the Drivers' Championship before coming to Watkins Glen. Mechanical problems forced Andretti to retire early from the race, which was won by Carlos Reutemann in a Ferrari 312T3 . 1979 saw Ferrari driver Gilles Villeneuve win a very wet race after Australian Alan Jones retired after dominating much of the race. , But by this time, Watkins Glen had deteriorated from its earlier splendor. Drivers began complaining about the bumpy track surface, and the teams and press were concerned over facilities and rowdy fans.  The event started to be attended by drunken, rowdy people who knew little about motor racing and often went to the infamous \"Bog\", located inside the Boot to set fire to objects and do other destructive things; the Bog was a place where cars and even a Greyhound bus in 1974 were burned just for enjoyment. Even though the Bog was made into a parking lot in 1975, things still did not improve sufficently over the years. In 1978, the European motorsports governing body, FISA, demanded that the track owners make safety improvements to the track, which were made; and then the event was due to be cancelled for the 1980 season, but it was given a reprieve by FISA after promising to upgrade facilities over the winter.  After initially being given an April 13 date on the calendar, the race was moved to October 5.   Organizers were finally able to secure funding for circuit improvements in late August, and the track was resurfaced.  But they still needed a $750,000 loan from FOCA to pay prize money and other expenses.  Alan Jones won the exciting 1980 race for Williams after he went off at the first corner on the first lap and charged through the field into second place from 17th, and he ended up taking the checkered flag after pole sitter Bruno Giacomelli retired with electrical problems near the Chute. Reutemann would make it a Williams 1–2, followed by Frenchman Didier Pironi in a Ligier. But this would prove to be the final United States Grand Prix at the Glen. It was initially included on the 1981 calendar, but cancelled after the debts could not be paid and government loans were denied. It was replaced by the Caesars Palace Grand Prix in Las Vegas 2,500 miles away.   , In 1976, the Long Beach Grand Prix in the Los Angeles area became a Formula One event, making the United States the first nation since Italy in 1957 to hold two Grands Prix in the same season. The United States Grand Prix West , as it was called to distinguish from the United States Grand Prix East at Watkins Glen, was held until 1983, after which CART became the headliner series. The Caesars Palace Grand Prix in Las Vegas, Nevada was a non-starter in 1980, debuting in 1981; it would only last two years with Formula One, before CART took over the race for another two seasons. 1982 saw the inaugural Detroit Grand Prix in the center of Detroit, Michigan; making three Formula One races in the United States that year. Detroit would last until 1988, after which it too became a CART event. A one-off Dallas Grand Prix in Fair Park, Texas was held in 1984, which was plagued by problems with the track surface, exacerbated by extremely hot 104 F (40 C) July weather.  , A new Grand Prix in the New York City area was announced for the 1983 season, to be held either at the Meadowlands Sports Complex , Meadow Lake in Flushing Meadows , or Mitchel Field in Hempstead, Long Island (on the same site as the 1936 and 1937 Vanderbilt Cups).   However, the race was first postponed and then cancelled,  as CART started their own race at the Meadowlands , and titled it the \"United States Grand Prix\".  , Plans to continue Formula One races in the Detroit area at the nearby Belle Isle Park did not materialize, and in 1989, Formula One moved to Phoenix, Arizona .  The Phoenix street circuit in the centre of the city was unpopular with drivers and the event was largely ignored by the local populace; the 1990 Grand Prix reportedly attracted only a third as many spectators as an ostrich festival in the Phoenix suburb of Chandler on the same weekend.    , The inaugural event in 1989 was held in June, with temperatures nearing 100 °F (38 °C). The race was moved to March, as the opening round of the season, for the next two years. The McLaren team dominated all three years, with Alain Prost winning in 1989 and Ayrton Senna in 1990 and 1991. The 1989 race saw Prost take advantage of Senna's mechanical woes and 1990 race was notable in that emerging French star Jean Alesi harried Senna for a number of laps; the Tyrrell driver went on to finish second behind Senna. After the uneventful 1991 race was attended by little more than 18,500 spectators,  On October 7, 1991 members of International Auto Sport Federation (FISA) met to discuss the agenda for the 1992 Formula One season, where they voted to cancel the contract with city of Phoenix and award the contract to the South African GP. That same year, Phoenix city manager David Garcia said the city lost $1.3 million dollars and was in negotiations with Ecclestone on contract cancelation. The circuit itself, made up of wide, long straights and right-angle corners offered hardly any challenge to the drivers or any spectacle to the audience; this contributed to this event's failure in Phoenix.  Formula One had effectively tarnished its once-welcomed image in the United States during the Watkins Glen and eventually Long Beach eras. Over a period of 11 seasons, there were no less than four failed Grand Prixs in the United States: in Dallas, Detroit, Phoenix, and Las Vegas. Formula One had likewise become disillusioned with the United States. It would not return there until 2000. , It was not until 2000 that another United States Grand Prix took place, this time at the legendary Indianapolis Motor Speedway in Indiana. Indianapolis was rumored to have been considering a Formula One race since the USGP left Phoenix.  The 2.606-mile (4.194 km) infield road course uses about a mile of the oval, but in a clockwise direction. The crowd at the 2000 race was estimated at over 225,000, perhaps the largest ever in F1.  Michael Schumacher 's win was his second of four straight to end the season as he overtook Mika Häkkinen for his third Championship. In 2001, the race took place less than three weeks after the events on September 11, 2001 in the US , and many teams and drivers featured special tributes to the USA on their cars and helmets. The 2002 edition was known for Schumacher and teammate Rubens Barrichello trading places near the finish line after Schumacher's failed bid to end the race into a dead heat with Barrichello. Held in September its first four years (in order to distance it from the \"500\" and NASCAR 's Brickyard 400 ), the USGP at Indianapolis was moved to an early summer date in 2004 . In 2005, problems with Michelin tires led to seven teams withdrawing from the race after the formation lap. Only the three teams (six cars) with Bridgestone tires started the 2005 United States Grand Prix , and the event was considered a farce.  Many commentators questioned whether a United States Grand Prix would be held in Indianapolis again, but the 2006 United States Grand Prix was held the next year, on July 2, 2006, without controversy. , On July 12, 2007, Formula One and the Indianapolis Motor Speedway announced that the 2007 U.S. Grand Prix would be the last one held at IMS for the foreseeable future, as both sides could not agree on the terms for the event.  It was thought that the race would return to Indianapolis for 2009 on the track configuration that was used for the 2008 race in the MotoGP championship.  Then-Indianapolis Motor Speedway CEO , Tony George , claimed that the USGP would not return to Indianapolis unless it made financial sense. Due to the expensive fees paid to host a grand prix, the race would require a title sponsor to be economically viable.  Ultimately, the United States Grand Prix was not on the Formula One calendar for 2009. , In August 2009, Formula One president Bernie Ecclestone remarked that there was no immediate plan to return Formula One to the US, vowing \"never to return\" to Indianapolis.  Nevertheless, shortly before the first race of the 2010 season , Ecclestone continued to fuel speculation that a return to Indianapolis was not out of the question.  In March 2010, Ecclestone announced plans to bring a Formula One race to New York City for the 2012 season . Ecclestone was quoted as saying the race would take place across the Hudson River in New Jersey , with the Manhattan skyline overlooking the circuit.  In May 2010, plans emerged for a circuit to be built in Jersey City 's Liberty State Park ,   but those plans were abandoned shortly thereafter.  A race in West New York and Weehawken was later announced in October 2011. In May 2010, it was announced that Monticello Motor Club – a circuit complex modeled on a private country club near Monticello – had submitted a bid for the rights to host the race.  , On May 25, 2010, Austin, Texas , was awarded the race on a ten-year contract, as Ecclestone and event promoter Full Throttle Productions agreed to a deal beginning in 2012 . The event is being held on a purpose-built new track, which was named Circuit of the Americas .  German architect and track designer Hermann Tilke designed the new track on 800 acres (320 ha) of land to the east of the city.  In July 2010, promoter Tavo Hellmund promised that the circuit would be one of the \"most challenging and spectacular in the world\" and that it would include a selection of corner sequences inspired by \"the very best circuits\" in the world.  , On November 15, 2011, it was reported that construction of the circuit had been temporarily halted as the owners had not yet been awarded the contract to stage the race in 2012,  following reports that Bernie Ecclestone had cast doubt on the race taking place.    After Tavo Hellmund's contract was found in breach by Ecclestone  and a new contract was entered into between Formula 1 and the original track investors, Red McCombs and Bobby Epstein, the U.S. Grand Prix was confirmed to be held at the Circuit of the Americas in Austin on the original scheduled date in 2012.   Reining champion Sebastian Vettel took pole for the 1st race at the Texas circuit but it was 2007 winner Lewis Hamilton who kept his unbeaten run in the USA as the two finished almost 40 seconds ahead of third. , The Grand Prix in Austin has proven to be a considerable success, thanks to the Texas capital's growing reputation as a center of music and culture, its friendly citizens and unique atmosphere during the race weekend. It has been lauded from all quarters of Formula One.  , Another American race was scheduled for the 2014 season alongside the United States Grand Prix called the Grand Prix of America , which was to be held on a 3.2-mile (5.2 km) street circuit in West New York and Weehawken, New Jersey. The circuit is located right next to the New York State/New Jersey border, New York City 's Manhattan borough skyline and the Hudson River. The organizers signed a 10-year contract with Formula One Management and the race was originally on the 2013 calendar. However due to financial and preparation problems it was taken off the 2013 and 2014 calendar and is now unlikely to take place.  , Events which were not part of the Formula One World Championship are indicated by a pink background. , Notes: , A pink background indicates an event which was not part of the Formula One World Championship. , Sebring (1959) , Riverside (1960) , Watkins Glen (1961–1970) , Watkins Glen (1971–1974) , Watkins Glen (with Esses chicane) (1975–1980) , Phoenix (1989–1990) , Phoenix (1991) , Indianapolis Motor Speedway (2000–2007) ,  "
}
