{
  "category": "nrl",
  "article": "The Canberra Raiders are an Australian professional rugby league football club based in the national capital city of Canberra, Australian Capital Territory . They have competed in Australasia's elite rugby league competition, the National Rugby League (NRL) premiership since 1982. Over this period the club has won 3 premierships, (out of 5 Grand Finals played), received 1 wooden spoon and had a total of 15 of its players (9 New South Wales Blues and 6 Queensland Maroons ) selected to don the green and gold for Australia . The Raiders' current home ground is Canberra Stadium in Bruce . Previously, the team played home matches at Seiffert Oval in Queanbeyan, New South Wales , with the move to Canberra Stadium taking place in 1990. The official symbol for the Canberra Raiders is the Viking . The Viking, also a mascot at Raiders' games, is known as Victor the Viking. , As part of the New South Wales Rugby Football League premiership 's first expansion outside Sydney, the Raiders were admitted to the League, along with the Illawarra Steelers in 1982 . Over the following years they improved steadily, reaching a playoff for 5th in their third season, and becoming the first non-Sydney team to make the finals (1987), feature in a grand final (1987) and win a premiership (1989). This heralded a period of great success for the club, with five grand final appearances and three premierships in eight years. During this period, the Raiders boasted international players such as Mal Meninga , Laurie Daley , Ricky Stuart , Glenn Lazarus , Bradley Clyde , Gary Belcher , Brett Mullins and Steve Walters . After this came the Super League war , with the Raiders switching to the rebel competition before continuing to compete in the re-unified NRL. During the 2000s the Raiders suffered from an exodus of experience. At the beginning of the 2009 season , the Raiders squad contained only four players who have played at the representative level. Joel Monaghan and Terry Campese each represented the Australian side during the 2008 Rugby League World Cup, with Monaghan also playing for the NSW blues during the third game of the 2008 State of Origin Series. , , , At the beginning of the 1980s, the New South Wales Rugby Football League (NSWRFL) was looking to expand its Sydney-based premiership into other areas of the state. The Canberra franchise was accepted in 1981 as the 14th team for the 1982 NSWRFL season . Along with the Illawarra Steelers who were also introduced that season, they became the first NSWRFL club based outside Sydney since the old Newcastle team left in 1909. , The club's initial seasons were a mixed bag, with the team earning the Wooden Spoon in their debut year. The team was notorious for late game collapses, leading to the nicknames \"Canberra Faders\" and \"Pine Lime Splices \", in what was also a reference to the team's colours. In fact, no team has conceded more tries in a season than the 1982 Raiders. The first points recorded by the Canberra Raiders were scored by Peter McGrath (later to become Chairman of the Australian Rugby Union). McGrath finished with 41 points in his first and only season with the Raiders.  The club's first win, a 12–11 heartstopper v Newtown, came in its 8th match, and 3 more wins followed, most notably against then competition leaders Souths. 1983 saw 9 wins, more than doubling 1982's four. However, the team continued to struggle to win away from home. An away win first up in 1984 foreshadowed a much improved season, a positive winning record (13–11) snagging a playoff for fifth versus Souths. But this game was lost (4–23), and the Raiders had still not succeeded in reaching the semi-finals of the competition. , 1985 saw regression, with the team winning only 8 games (though the reserves did reach the Grand Final). Though 1986 was similarly disappointing, the team had a core group of players, such as Queensland trio Mal Meninga, Gary Belcher, Steve Walters, and John Ferguson who would greatly influence the coming decade. , This was the most successful period in the Raiders' short history, with 5 Grand Finals and 3 premierships. In 1987 , the team finished third after the minor rounds, resulting in a maiden semi-finals appearance. Despite going down 25-16 in their first finals match against Eastern Suburbs , the Raiders rallied to defeat South Sydney (46–12) and Easts again (32–24) in the Preliminary Final. The latter earned the team a place in the Grand Final, but they were never really competitive against minor premiers Manly-Warringah , going down 18-8 in what was the last Grand Final to be played at the Sydney Cricket Ground . The GF attracted the Raiders all-time record attendance of 50,201. Laurie Daley , Peter Jackson and Glenn Lazarus all made their debut for Canberra in 1987, though only Queensland State of Origin Centre Jackson played a prominent role that year, more so after his centre partner Meninga broke his arm and missed half of the season. , 1988 featured free-scoring (over 100 tries in 22 games) and a number of large victories, with the team again finishing in third place on the ladder. Unfortunately, a narrow 19-18 loss against eventual premiers Canterbury-Bankstown in the Major Semi-Final was followed by defeat against the Balmain Tigers and an early exit. After the debuts of Daley, Jackson and Lazarus in 1987, 1988 saw the debuts of future internationals Bradley Clyde , and former Wallaby scrum half, Queanbeyan born Ricky Stuart . , With 5 rounds to play in the 1989 season , Canberra were 7th and in danger of missing the semis. But a hard fought 14–10 win over Easts started a 9 match winning streak, culminating in the club's first Premiership. Throughout the finals, Canberra was forced to walk the sudden-death tightrope after sneaking into the finals in fourth place. They easily accounted for Cronulla 31-10 in the Qualifying final, before defeating the emerging Penrith Panthers 27-18 in the Semis. Then the Preliminary final, the Raiders defeated the minor premiers South Sydney 32-16 to qualify for their second Grand Final appearance in three seasons. , In one of the all-time great Grand Finals against Balmain, the Raiders sent the game into extra time after a late John Ferguson try that was converted by Meninga. Reserve forward Steve Jackson then scored the winning try to win the premiership for the Raiders in extra time after crashing through 4 Tigers defenders. Following the Grand Final win, the Raiders then went on to play in England at Old Trafford in the official World Club Challenge against 1988–89 RFL champions , Widnes . Widnes however, with their main strike weapon, Great Britain winger and the fastest player in rugby league at the time Martin Offiah in top form, defeated Canberra 30-18 in front of 30,768 fans , Fullback Gary Belcher became the first Raider to be the NSWRL's leading point scorer in 1988 with 218 points (10 tries and 89 goals). 1989 also saw the Australian and Queensland fullback become the first Raider to lead the league in try scoring when he crossed for 17 tries. Belcher was also the first ever fullback to lead the try scoring list in a season. , 1990 was a stellar year for the club at all levels. All three grades making the Grand Final, with only the reserves losing. The first grade side earned their first Minor Premiership and a second consecutive title, defeating Penrith in the decider. Trouble brewed in 1991 as the club was embroiled in salary cap hardships. Nonetheless, a fourth Grand Final berth was secured – the team's third in a row. However, the team went down to Penrith in a repeat of the 1990 Grand Final. Jason Croker, the team's longest serving player, debuted this year. , The fallout from the salary cap scandal saw several players leave the club, most prominently Glenn Lazarus, Brent Todd, David Barnhill, Nigel Gaffey and Paul Martin. An average performance resulted, with the Raiders missing the finals for the first time since 1986. David Furner , son of former Raiders and Australian coach Don Furner , started out in this year. , Since their final premiership in 1994 which was a convincing win against the Bulldogs with some of the most spectacular tries ever seen in a grand final With the final score being 36-12. The Raiders have been unable to scale their previous heights, largely due to their inability to lure representative players to the capital. The team bowed out in Round 1 of the 1996 finals series, losing to St George. The next year, they were one of several teams that joined the breakaway Super League competition , losing in the preliminary final to the Cronulla Sharks . It was upon rejoining the newly formed National Rugby League the following year that the team began their decline. The Raiders' problems came to a head in the late 1990s, when club legends Ricky Stuart and Bradley Clyde were forced out in order to accommodate players such as Brett Finch . Finch would ironically leave the Raiders soon after to play under Stuart, who has since returned to the club to be its head coach from 2014 onwards. , The Raiders had mixed results in the new millennium, often finishing just inside or just outside the final eight and usually being bundled out of the finals in the early weeks, However, in 2003, the Raiders unexpectedly led the competition for most of the season, almost clinching the minor premiership. The Raiders then lost narrowly to the Melbourne Storm in the opening finals game, but still advanced to Week 2 due to ladder position. In one of the closest games in recent history, the Raiders were eclipsed by one point in the preliminary final by the New Zealand Warriors and eliminated from the 2003 competition. , Many fans believed the achievements of 2003 would be improved in the following years. However, the Raiders finished a disappointing 8th in 2004, being knocked out in week one of the finals by the Sydney Roosters. Club legends Ruben Wiki and Mark McLinden left the Raiders for other clubs in this year. Wiki's loss, in particular, was a bitter pill to swallow for many Raiders fans, as it was found that the New Zealand Warriors had significantly breached the salary cap in signing him (the Warriors eventually paid the price for this, being docked four competition points at the beginning of the 2006 season). The 2005 side was written off by fans and critics alike, as the club's two major signings, Jason Smith and Matt Adamson , were ageing veterans considered well past their prime. However, both, particularly Smith, proved formidable campaigners, and the Raiders were joint competition leaders in Round 10. But as the season progressed, injuries took their toll and the Raiders finished second last on points differential to the Newcastle Knights . The Raiders started season 2006 heavy favourites to run last, but despite this pessimism and heavy losses to the Knights and the Roosters early on, fought back and guaranteed themselves a finals berth with a round to play. , 2006 saw club stalwarts Simon Woolford , Clinton Schifcofske and the club's longest serving player, Jason Croker , leave the club, going to St George Illawarra, the Queensland Reds rugby union team and the European Super League club Catalans Dragons respectively. Outgoing backs Schifcofske and Adam Mogg both earned representative berths with Queensland in State of Origin. Saturday 9 September 2006 saw Jason Croker, Simon Woolford, Clinton Schifcofske, Michael Hodgson, Jason Smith and Adam Mogg all play their final games for the club. The round one finals series clash with the Bulldogs saw the Raiders defeated 30–12 in slippery and muddy conditions at Telstra Stadium , and eliminated from the 2006 premiership race. This was also the final match for coach Matthew Elliott, who is coaching Penrith in 2007. His replacement is former North Queensland Cowboys' assistant coach Neil Henry. , In 2007, the Raiders were an unknown quantity. Having lost star players such as Schifcofske, Smith, Croker and Woolford in key positions, the Raiders found themselves with a new captain in Alan Tongue relying on young, inexperienced players such as Todd Carney , William Zillman and Michael Dobson to step up and take on more prominent roles within the team. The sense of inexperience was reinforced by the selection of Neil Henry as coach, despite his lack of first-grade coaching experience. Though the Raiders were bolstered by late season signings Neville Costigan and Matt Bickerstaff , several critics believed that the Raiders' significant loss of experience would result in their \"winning\" the wooden spoon.  , 2007 was, overall, a disappointing season for the Raiders, who finished in 14th place despite entering the top 8 midway through the season. However, two players – Phil Graham for Country Origin and Neville Costigan for Queensland – achieved representative status. The season was notable for the difference in the team's performance at and away from home, with just 2 of their 9 wins occurring outside Canberra.  Coach Neil Henry incurred a fine of $10 000 for questioning the impartiality of the referee after the round 19 clash.  , The 2008 season started with some promise for the Raiders – a good showing despite a loss in round 1 vs. Newcastle was followed up with two solid wins against Penrith and St.George-Illawarra. The club then suffered a series of losses, whilst snaring only the occasional victory, with a big come from behind victory against Wests being noteworthy. In the representative field, Todd Carney and Joel Monaghan picked for Country Origin , and Monaghan being a shadow player for the New South Wales Side. In September 2008, despite a heavy injury toll, the Raiders guaranteed themselves a place in the NRL 2008 Finals Series winning seven of their last nine regular season games, a feat which was at the start of the season impossible according to Rugby League punditry in Australia. The Raiders semi-final appearance was brief, however. After being defeated by the Cronulla Sharks, the Raiders 6th place finish was considered to be enough to get them a second chance. However, a huge upset with 8th place New Zealand defeating minor premiers Melbourne saw the Raiders eliminated. , The season had not been without controversy however, with star halfback Todd Carney and fullback Bronx Goodwin being stood down by the club after an altercation at a Canberra nightclub following the round 19 win against the Roosters. Carney was eventually dismissed by the club after failing to agree to the punishment plan the club had laid out for him, Goodwin was also sacked from the club. , A slow start to the 2009 season saw the raiders lose to the tigers and the roosters. However with the help from under 20s debutants Josh Dugan, Jarrod Croker and Travis Waddell they won their next two matches. Despite a disappointing season for the raiders losing to many close games the Raiders were able to beat the Melbourne Storm for the first time in 14 games and 7 years 26–16 in round 16 to keep their slim finals hopes alive.  The Raiders also had a memorable win over the number one team at the time St George-Illawarra Dragons , by 24–12.  Despite wins against three of the top four (St George Illawarra Dragons, Gold Coast Titans and the Melbourne Storm) and coming within three points of the other (Canterbury-Bankstown Bulldogs) losses to bottom placed teams Cronulla Sharks and Sydney Roosters at home saw the raiders finish in 13th. , The 2010 season began traditionally poorly for the Raiders with a loss to Penrith in the opening round however against early-season expectations that the Raiders would again struggle the club posted early season wins over Brisbane in round two, Parramatta in round five and the New Zealand Warriors in round eight in New Zealand in what was the club's first win in New Zealand since the early 2000s. However, losses to Todd Carney's new club the Roosters in round six and a narrow loss at home to the South Sydney Rabbitohs in round seven saw the club sitting second from last after round seven (last had the Melbourne Storm not been stripped of competition points due to salary cap breaches) of the 2010 season. Wins over the ladder-leading Dragons and the Gold Coast Titans followed until a four-game losing streak ensued; with the club sitting third from last after a round 17 home loss to the Roosters in what was Todd Carney 's return to the nation's capital. The Raiders then began a run similar to that of Parramatta last year; winning eight of their next nine regular season matches to sneak into the top eight by season's end. The regular season's highest home attendance came when 20,445 fans filled Canberra Stadium to see the Raiders defeat the ladder-leading Dragons 32-16 for the second time in the season. , The Raiders advanced to the finals on the back of eight wins from their past nine and were drawn a tough away final against the second-placed Penrith Panthers whom the Raiders had beaten just five weeks earlier. The Raiders led from the start and despite lapses at times during the match the Raiders managed to sniff out a narrow 24-22 win, thus achieving its first final win in a decade, which ironically was also against the Panthers. This saw the Raiders draw a home final against the Wests Tigers in round two of the finals. Having lost to the Tigers twice during the regular season, it was hoped that a record crowd of 26,746 would inspire the Raiders to continue their fairytale run deep into the finals, however a missed penalty attempt by Jarrod Croker in the final minutes of the match saw Canberra lose by 26-24 and therefore draw a curtain on the Raiders' 2010 season. The Raiders off season didn't start well, with Joel Monaghan being sacked by the club for inappropriate behaviour with a team mates dog. This appeared to be a team building exercise, as photos surfaced showing the rest of the team cheering him on. , The Raiders, looking to build on their strong finish to the 2010 season in 2011, bolstered its already strong roster with the addition of Blake Ferguson , Brett White and former Dally M medalist Matt Orford . The latter signing was an important one for the Raiders as vice-captain and star playmaker Terry Campese is out indefinitely due to a knee injury suffered in the semi-final loss to Wests at the end of the 2010 season.  After starting the season with a 40-16 thumping of the Cronulla-Sutherland Sharks in round one, the Raiders have since lost their last eight matches in succession, and were sitting at the bottom of the ladder by round nine. Their fortunes started to turn when they caused the boilover of the 2011 season, upsetting the Melbourne Storm in Melbourne by 20-12. This was Canberra's first win in the Victorian capital since 2000. This was tempered by being held scoreless for the first time at home in their history by Melbourne in round 19, losing 26-0. One other unlikely win to the Raiders against a 7th place Bulldogs at home 20-12 has kept the momentum building as the Raiders look to turn their season around. , After the first four rounds of the 2012 NRL season, the Raiders have lost 3 and won 2. , The Canberra Raiders 2013 campaign began with two demoralising defeats to Penrith Panthers and Gold Coast Titans , only managing to score 10 points in the two games while conceding 68. Another early blow to the Raiders at the start of the 2013 season was the irresponsible behaviour of up and coming superstar Josh Dugan whom was sacked from the club for disciplinary reasons after he and teammate Blake Ferguson missed a team recovery session in favour of spending the day drinking on the rooftop of Blake Fergusons home. The Raiders then managed to win 5 of the next 7 games including upsets to the undefeated Melbourne Storm away from home and premiership favourites Sydney Roosters , winning all games played at Canberra Stadium for the first 12 rounds of the premiership season. , In 2014, the Raiders hired Ricky Stuart (former player) as a coach. He has had mixed success with the team. Star player, Anthony Milford, agreed to sign with rival team, the Broncos, disappointing Raiders fans. , The Raiders' Toyota Cup team won 28–24 over the Broncos' team in golden point extra time to win the Toyota Cup (Under 20s) Premiership in the lead-up game to the NRL Grand Final on 5 October 2008.  In 2009 the team was unsuccessful in defending its National Youth Competition title, finishing eighth at the end of the regular season. The team were able to upset the minor premiers Manly in week one of the finals but lost to the Wests Tigers in week two ending their title defence. , Since inception, the Raiders' team colours have been lime green and white with blue and gold bands. In recent years, the \"away\" strip for the team has been mostly white, with lime green, blue and gold bands. The lime green was chosen as the main colour as it differentiated the side from other club's colours. The blue and gold were included in the Raiders colours as they are the traditional sporting colours of the Australian Capital Territory . , The original jersey's design was chosen through a competition held by the club in 1981. The winning entrant was Ms Patricia Taylor, whose design was duly adopted. , 2012 , Head coach , , IN , OUT , IN , OUT , This is the 25-man \"Dream Team\" picked in the Canberra Times to celebrate the club's 25th season in 2006 [ citation needed ] , Head coach , , , The Canberra Raiders' first coach was former Queensland and Australian representative player, Don Furner , who was coaching in Queanbeyan at the time of the club's formation in 1982. In 1987 he was joined by Wayne Bennett , who was coaching in Brisbane, and the Raiders reached their first grand final . , The Raiders' largest ever winning margin was 68 points, when they defeated the Parramatta Eels 68-0 during the 1993 NSWRL season . Their worst loss was in the 2013 NRL season when the Melbourne Storm dealt a 4-68 defeat. Canberra have won eleven consecutive games twice, in 1990 and in 1995. , Jason Croker has played the most games for the Raiders with 318 between 1991 and 2006. He also holds the club's all-time try scoring record with 120. David Furner is Canberra's highest ever point scorer with 1,218 (49 tries, 511 goals) between 1992 and 2000. , , Notable supporters of the club include Formula One driver Mark Webber ,  Brad Haddin ,  Brendan Jones ,  Bob Hawke ,  Michael Milton ,  James O'Loghlin and Erin Molan .  , Official Sites , Statistics & Information Sites "
}
