{
  "category": "nrl",
  "article": "The Cronulla-Sutherland Sharks are an Australian professional Rugby league team based in Cronulla , in the Sutherland Shire , Southern Sydney , New South Wales . They compete in the National Rugby League ( NRL ), Australasia 's premier Rugby league competition. , The Sharks, as they are commonly known, were admitted to the New South Wales Rugby League premiership , predecessor of the Australian Rugby League and the current National Rugby League competition, in January 1967. The club competed in every premiership season since then and during the Super League war joined the rebel competition before continuing on in the re-united NRL Premiership. Despite being in the competition for 47 years and appearing in three Grand Finals , the Sharks have yet to win a premiership, however, they have won the minor premiership twice, in 1988 and 1999. , , , In 1967 the New South Wales Rugby Football League (NSWRFL) added two new clubs to the competition, Cronulla-Sutherland and Penrith, the first to join the competition since Parramatta and Manly were admitted 20 years earlier in 1947. , Cronulla debuted in 1967 wearing a sky blue jersey adorned with a white V and red numbers on the back, at the then club home ground of Sutherland Oval, under the captaincy of multiple premiership-winner Monty Porter and the coaching of Ken Kearney . Cronulla earned immediate recognition when they beat Eastern Suburbs at the Sydney Sports Ground in their first match. They had only two more wins, against Norths and Parramatta, and finished last on the competition table. , In mid-1968 the club moved permanently to Endeavour Field at Woolooware , thus becoming the only club in Sydney to own their own ground. Their first match there was against Parramatta and the Cronulla Sharks won 10–7. , Cronulla met the Sea Eagles again in the 1978 grand final, amidst much controversy surrounding referee Greg Hartley . The Sharks led by 7–2 well into the second half. Manly came back and brought the scoreboard to 11–7. It took a late penalty goal from Steve Rogers to level scores at 11-all by full-time. Referee Greg Hartley denied Cronulla a scrum penalty at the end of the game, allegedly because he did not want the grand final decided by a penalty goal. The replay saw the Sharks opportunity pass by as they fielded a much-weakened team due to further injuries, eventually being shut-out by Manly 16–0. Cronulla were without suspended stars Greg Pierce and Dane Sorensen in both games, while hooker John McMartin, fullback Mick Mullane and Barry Andrews were all injured for the replay. , Cronulla suffered major financial trouble in 1983, with the NSWRL appointing an administrator and providing a loan. Western Suburbs and Newtown, both in a similar predicament, were refused a loan, with Newtown being forced out of the competition. However, the season wasn't all bad for Cronulla, with the emergence of teenage star, Andrew Ettingshausen , who was named Rookie of the Year, and would later go on to become the most capped and successful player for Cronulla. Cronulla also made the final of the mid-week KB Cup , but lost again to Manly, 26–6. , In 1985, Cronulla was buoyed by the arrival of 'super coach' Jack Gibson , who had coached Easts and Parramatta to premierships. Gibson left the club in good shape in 1987, with the promise fulfilled in 1988 when Cronulla won the minor premiership, led by veteran second-rower Gavin Miller , who was named Dally M Player of the Year , and Rothmans Medal winning halfback, Barry Russell . However, Russell dislocated his shoulder two weeks before the finals, and missed the semi-final where Cronulla went down to Canterbury. He was rushed back in for the final against Balmain, but he was severely hampered by the injury, and Cronulla were bundled out. A bright spot for the Sharks, though, was the selection in the Australian team of Miller, and young centres, Ettingshausen and Mark McGaw . , In 1989, Cronulla sneaked into the finals after thrashing Illawarra 46–14 in the final round, followed by a memorable 38–14 victory over the Brisbane Broncos in the play-off for fifth position. However, they could not repeat the performance in their semi-final against eventual premiers Canberra, in what was their third game in seven days. Gavin Miller was rewarded for another great year with both the Dally M Player of the Year award and the Rothmans Medal. , Cronulla again dropped into a period of poor form and financial trouble in 1990, but the appointment as coach of rugby league Immortal, Arthur Beetson , in 1992 helped turn the on-field problems around. He helped develop a batch of promising players, including five-eighth Mitch Healey , fullback David Peachey , winger Richie Barnett , prop Adam Ritson , and hooker Aaron Raper , son of another Immortal, Johnny Raper . However, Cronulla were forced into receivership in 1993. , Beetson was replaced as coach in 1994 by John Lang , a former Australian hooker, and coach of the Brisbane Easts team. Lang brought halfback, Paul Green , down from Brisbane with him. A golden age for the club had begun, signalled by the two lower grade teams (President's Cup and Reserve grade) winning their competitions. During John Lang's coaching period, from 1994 to 2001, Cronulla made the semi-finals every year except for 1994 and 1998. The club had a glamorous image and attracted record crowds, with a corresponding financial improvement. , In 1995, Cronulla were one of the first clubs to join the Super League competition, which kicked off after protracted legal battles and much bitterness, in 1997. The club was motivated by a dissatisfaction with the perceived favouritism of the NSWRL administration towards other clubs, and a still-risky financial situation. , They reached the inaugural – and only – grand final of the ten-team Super League competition, only to lose to a vastly superior Brisbane side 26–8 in Brisbane. The game was notable for being the only grand final to be played outside Sydney. The club rejoined the reunited National Rugby League competition in 1998. , Arguably the Sharks' best season ever was in 1999, when they again won the minor premiership and the J. J. Giltinan Shield in convincing fashion. The Sharks easily accounted for the Brisbane Broncos in the quarter-final, and led 8–0 in the grand final qualifier against the St George Illawarra Dragons before eventually losing 8–24. Also in 1999, the Cronulla-Sutherland name was dropped, and the club was simply known as the \"Sharks\", and would be known as this until the end of 2002. , Cronulla lost the grand final qualifier in similar circumstances in 2001, to eventual premiers Newcastle. The year was marked by the sudden rise of halfback Preston Campbell , who was named Dally M Player of the Year, despite being a fringe first grader at the start of the season. , In 2002, John Lang was replaced by Australian coach Chris Anderson , who had led Canterbury Bulldogs and Melbourne Storm to premierships. The following two years were the most acrimonious in the club's history. The first year was almost an on-field success, as Anderson retained the core of John Lang's team, and the Sharks again reached the grand final qualifier. However another heartbreaking loss to New Zealand, the replacement of halfback Preston Campbell – a crowd favourite – with former Melbourne halfback Brett Kimmorley, and a string of released players signaled trouble for 2003. , This was realised with the sudden mid-season departure of long-time stalwarts Nick Graham and Dean Treister. The Sharks finished 11th, suffering a record 74–4 loss to Parramatta in a match marred by the controversial performance of referee Shayne Hayne . Three Cronulla players were sent from the field, including Sharks captain David Peachey, for ignoring the referee's instructions. Constant infighting between the board and the coach led to Anderson's departure at the end of the season. , The same year the club's name reverted to Cronulla-Sutherland, Chris Anderson was replaced by Stuart Raper , another son of Johnny Raper, and the coach of the President's Cup-winning team in 1994. A loyal clubman, he instantly brought a revival in club and supporter spirit. However, Raper's apparent focus on team harmony rather than results led to Cronulla's win percentage worsening, from 49% (24 wins 27 losses) under Anderson, to 43% (31 wins 42 losses). , Steve Rogers, the CEO of the Cronulla Sharks and a former club legend, died on 3 January 2006 at the age of 51 of a \"mixture of prescription drugs and alcohol\". In April, 2006, the NSW state coroner ruled that the death was accidental. , On 21 April 2006, the Australian government announced they would be funding a 9.6 million-dollar upgrade to Toyota Park. , Cronulla finished the 2006 season in disastrous fashion. After winning 8 out of 9 games in the middle of the season and climbing to near the top of the ladder, the team experienced the worst losing streak in the club's history, losing their last 10 consecutive games. In a see-sawing match to finish to a tumultuous season, the Sharks in their final game coming back from 26–0 down only to lose 26–24 to Canberra. A missed penalty goal in the dying seconds of the match would have sent the game into extra-time, allowing the chance for Cronulla to equal the biggest single-game comeback in the history of top-level rugby league in Australia. , On 22 September 2006, the Sharks Board ended weeks of speculation over the future of Coach Stuart Raper by sacking him as first-grade coach and handing him a $300,000 payout, making him the second consecutive coach to receive such a payout. On 26 September, Australian Test Coach Ricky Stuart signed a new three-year deal to coach the Sharks as of 2007, replacing Raper as coach. , Round one of the 2007 season saw the Sharks break their 10-game losing streak against the Penrith Panthers with an 18–0 victory at Toyota Park. Ricky Stuart, despite being somewhat hampered by the decisions of former coach Raper in the team he inherited, led the Sharks to fifth on the ladder at the halfway mark of the season surprising many critics. [ who? ] Towards the end of the season, Cronulla plunged to fifteenth on the league ladder, slumping to seven straight losses. The season ended with the Sharks in 11th place, rounding off a heartbreaking season, with the club losing no less than nine matches by 4 points or less. , The Sharks had a strong season in 2008, finishing the season in equal first spot (third on for and against). They had one of the best defensive records, but one of the worst attacking records in the league. They had an excellent start to the season, beating defending grand finalists Manly and premiers Melbourne in away games in the first two rounds. After a comprehensive 36–10 victory over Canberra in the Qualifying Final at Toyota Stadium , Cronulla were beaten 28–0 by Melbourne (who later were found to be over the salary cap and cheating) in the Preliminary Final at the Sydney Football Stadium . This was a disappointing end to an otherwise successful season. , During the 2009 season Cronulla's dire financial problems became public knowledge. The club is asset-rich, owning its stadium and the surrounding land, but had cash flow problems due to its low average home gate, poor on-field performances in recent seasons which contributed to lower than average merchandising and corporate sponsorship. The club announced plans for a partial relocation to the Central Coast, which was rebuffed by the NRL. It was to split home games for the 2010–14 seasons among: , On May 26th 2009 the club was facing closure when lifelong supporter and respected businessman Damian Irvine put together a fresh board and took over the club and debts. , The on-field performances of the club also suffered in 2009, with the club recording 9 straight losses after a win in Round 1. Despite a midseason revival with four straight wins after Irvine's arrival, the Cronulla side slipped to ten straight defeats to equal the club's worst losing streak. One of these losses caused great controversy as the Sharks, playing against Manly, were forced to field just 12 men for most of the game after Luke Douglas was sent off by referee Phil Haines for a careless high tackle. Coach Stuart was left fuming by this and other decisions made by the referees during the game. The Sharks managed to avoid the wooden spoon in 2009 when the Roosters were soundly beaten by the Cowboys in the final round, resulting in a lower overall standing than the Sharks. This was a rare positive in a horror season for the Cronulla club. , The start of the 2010 season saw the Sharks return reinvented, with a new board constructed by Irvine, new CEO Richard Fisk and refinancing of club debt with the leagues club. However, reverting the poor on-field performance proved more difficult. After the board developed a plan to refinance debt and a long term financial strategy, Richard Fisk resigned in June 2010 due to his close friendship with Ricky Stuart and a failure to refresh the commercial area of the club. The clubs head coach, Ricky Stuart , also tendered his resignation from 2011 onwards due to the poor on field performance. Promising wing/centre Blake Ferguson was criticised for comments about wanting to leave the club in order to achieve success. On Tuesday, 20 July Ricky Stuart left the Sharks for the rest of the season after admitting he could get no more out of the players and had \"lost\" them. Assistant NSW and Cronulla coach Shane Flanagan was appointed as coach. After departing, Stuart and Fisk also cited fractured relationships with Chairman Damian Irvine as a reason for their departure however it is widely agreed that the club has gone from strength to strength in the absence of Stuart and Fisk and under Irvine's guidance. , The 2011 season started so promising for the club. The addition of Wade Graham at five-eighth and New Zealand international Jeremy Smith to a pack already containing two origin players promised an end to the Sharks' status as cellar-dwellers. Despite being humiliated by the Raiders at Canberra Stadium in round one, 40-12, the club won its next two matches. They beat defending premiers St. George Illawarra 16-10 at home in round two, and smashed Penrith 44-12 at Centerbet Stadium. Then the losses really started coming for the club as a number of first starters were injured, losing five in a row to the Warriors (26-18), Sea Eagles (19-13), Knights (24-20), Cowboys (30-12), and Rabbitohs (31-12). Cronulla dropped down the table, from 9th to 15th. They broke their hoodoo in round ten, when they beat the struggling Sydney Roosters 18-4 at Toyota Stadium. They were again disappointing in round eleven, when they were defeated 40-6 by the Eels at Parramatta Stadium. Despite losing 14-8 to the Storm in round 12, they were much improved and forced the Storm into a classic showdown at AAMI Park in Melbourne. They then faced the Broncos at home in round 13, and were, again, disappointing going down 34-16. A bye in round 14 gave them the chance to train hard for a week without a match, and skipper Paul Gallen lead the NSW Blues Origin team to a memorable 18-8 victory over Queensland, with an inspirational performance. He then played outstandingly for the Sharks in their round 15 match against the Bulldogs just three days after the State of Origin match. Cronulla beat Canterbury-Bankstown 26-10. The next four weeks saw a turnaround of the club's performance, with victory over the Gold Coast Titans 36-12, the South Sydney Rabbitohs 24-4, and then they took revenge against the Canberra Raiders 26-12. , A round of player signings occurred in the middle of the 2011 season. Cronulla lost their two props for the 2012 season, Origin representative Kade Snowden to Newcastle and Luke Douglas signing for the Gold Coast Titans. Captain Paul Gallen's transformation into an Origin prop alleviated this problem somewhat, and the Sharks were active in the player market, signing prop Jon Green from St George, former Shark Isaac de Gois and prop Mark Taufua from Newcastle, halfback Jeff Robson from Parramatta and props Bryce Gibbs and Andrew Fifita from Wests Tigers. , 2012 began very well for the club under the leadership of Chairman Damian Irvine,Coach Shane Flanagan, and General Manager Football Darren Mooney. The recruitment by Mooney and Flanagan paid dividends with new recruits Jeff Robson, Andrew Fifita, Todd Carney, Ben Ross, Isaac De Gois and Mark Taufua taking pressure off Superstar Paul Gallen allowing him to hit a purple patch of form. The club won 6 matches in a row for the first time in over a decade and after 8 rounds were sitting third on the table as the highest placed Sydney based franchise. , A difficult state of origin period saw injuries to captain Paul Gallen and star Todd Carney. The Sharks struggled to recover and struggled in the back half of the year,however still capped a remarkable turnaround by qualifying for their first finals series in 4 years,losing to Canberra in week one. , New sponsorship deals with SHARK Energy Drink and Fishermans Friends capped a remarkable turnaround off- field for the club in a short space of time since 2009. , The close of Season 2012 saw Shane Flanagan emerge as one of the games leading up and coming head coaches. Off-Field success and financial management saw Damian Irvine emerge as a leading results-based administrator. , At the beginning of Season 2013 Irvine stood down after discovering through the press that the Coach Shane Flanagan and Football Manager Darren Mooney he appointed had hidden suspect medical practices from Irvine and his board during the 2011 season. The club as of 2015 is still to recover from this event and Irvines departure. , 2014 was a disastrous season for the Cronulla Sharks. With a roster that boasts NSW Origin and Australian players, more was expected from the before season start. With ASADA suspending coach Shane Flannigan, Peter Sharp stepped up. That was until a few days after the clubs greatest victory, coming from 22 nil down to beat the Brisbane Broncos 24-22. Following that win, a photo went viral of Todd Carney \"bubbling\". Just one day after Carney was stood down by the Sharks CEO, Sharp resigned as interim head coach and was replaced by James Shepherd . , The beginning of the 2013 NRL Season saw the Sharks being investigated by ASADA (Australian Sports Anti-Doping Agency) and reports lead back to the fact that former Sports scientist Stephen Dank had given some sharks players peptides. It resulted in the sacking of four of the Cronulla Sharks' staff and the coach for their involvement and subsequent cover up. They were Darren Mooney, Shane Flanagan,Mark Noakes, David Giveny and Konrad Schultz. , Cronulla won their first game of the 2013 season in a 12-10 home victory against the Gold Coast Titans with respected Chairman Damian Irvine Standing down after the match citing an inability to represent the senior management in light of the dishonesty that had come to light. , Coach Shane Flanagan was later re-instated as coach after management changes at CEO level, while the four other staff members still remained sacked. As the 2013 season continued, the ASADA investigation continued to dominate headlines for the Sharks and interviews began with Sharks player, Wade Graham, before being cancelled after there were claims Sharks were uncooperative. On the field, Sharks player Andrew Fifita had a massive surge of form, to become one of the games leading props, eventually earning him a NSW State of Origin jersey for games 1-3. He would also go on to represent Australia in the World Cup. The Sharks finished the season in 5th place on the ladder and won their first finals game in a controversial 20-18 victory over the Cowboys, whereby they were awarded a seventh-tackle try in the first half. Along with this, an extra minute was added onto the end of the game after an error by the timekeeper in the 79th minute, which almost cost Cronulla the game. The Sharks then lost the next week in the Semi-Finals, going down 24-18 to the Manly-Warringah Sea Eagles. Cronulla were commended for their bravery throughout the whole of the season by not letting off-field distractions (namely the ASADA investigation) deter their on-field performances. , For Cronulla's maiden season in first grade a teal jersey with a white V was adopted from the Cronulla Surf Life Saving Club despite Cronulla's chocolate and gold design in the Sydney 2nd Division competition. The team colours of black, white and teal changed to sky blue, with grey being incorporated during super league , and shortly after on the team's away strip. , The club wasn’t known as the Sharks' until after its initial admission into the competition. During Cronulla’s first season the crest featured a drawing of Captain Cook 's ship the Endeavour . It is alleged that during the first season the club President suggested the 'Lions' while the captain Ken Kearney recommended the 'Sharks'. The mascot may have been named after the Cronulla Surf Club's rugby league teams of the 1970s. , From the late 1970s through to the late 1990s, the Sharks used a predominately black circular crest with a blue shark. This was changed after Super League in 1997 to a blue and white star-shaped design. Between 1999–2002, the name was shortened to simply the \"Sharks\" [ citation needed ] . Since 2003, the name has since been changed back to the Cronulla-Sutherland Sharks and changed their logo again in 2004, which is currently in use. , When the Sharks entered the competition in 1967, they played their home games at Sutherland Oval . They only played there for two seasons. , In 1969, they then moved to Endeavour Field , where they have remained ever since. This home ground has had numerous names over the years including Ronson Field, Shark Park, Toyota Park and until the end of 2012, Toyota Stadium. In 2013, it returned to the original name Endeavour Field. On 4 July 2013, the Cronulla Sharks announced their new stadium naming rights partner Remondis, an international waste solutions and management company. The stadium is known as Remondis Stadium. , It has a capacity of 22,500 , The Cronulla Sutherland Leagues Club is known as Sharkies, and is located on Captain Cook Drive at Woolooware . The leagues club sits beside the Cronulla Sutherland home ground, Endeavour Field . , Proposals to develop the land assets of the Leagues Club which owns the stadium and land around Endeavour Field stumbled for many years prior to arrival of renowned businessman Damian Irvine. In partnership with his head of finance Craig Douglas the plans finally became more tangible, as details of a residential and shopping centre were released. In August 2012, the club received final approval for their plans solving a 40-year old problem of financial instability. , In an opportunistic political grab amongst the publicity surrounding Coach Shane Flanagans supplement scandal ,Irvine and Douglas were replaced after their resignations in early 2013 by a local junior rugby league club ticket. The ticket used the shamed coaches popularity to garner public support over the two men who are credited with saving the clubs life in 2009-2013. Ex basketball player Damian Keogh was used as a high profile chairman however he lacked knowledge of history with the club. Since the departure of Irvine and Douglas the Club has floundered from one disaster to another with player sackings, suspect refinancing deals, governance issues, poor media relations and perception, and finishing last in the league for the first time in decades. , Head coach , Assistant coaches , Gains , Out , The club has honoured five individuals as \"Immortals\" of the club:  , , Announced 2006 , Announced 2003 , The current head coach of the club is Shane Flanagan , This rivalry has been dubbed the \"Battle of the Beaches\", due to their geographical locations and areas. Manly played the Sharks in two grand finals during the 1970s, which are renowned for being the most brutal in history. Cronulla and Manly play for the Steve Rogers Trophy when the two clubs meet in the NRL premiership each season. , One of Cronulla's fiercest rivalries is with their Southern Sydney neighbour, St. George Illawarra Dragons , creating a true local derby every time these teams meet. "
}
