{
  "category": "nrl",
  "article": "Melbourne Storm is an Australian professional rugby league team based in Melbourne , Victoria that participates in the National Rugby League . The first fully professional rugby league team based in the state, they entered the competition in 1998. Melbourne Storm was originally a Super League initiative and created in 1997 during the Super League war . The club plays its home games at AAMI Park . The Storm has won two premierships since its inception, in 1999 and 2012, and has contested several more grand finals. A salary cap breach discovered in 2010 saw the club stripped of two titles by the NRL. Melbourne Storm also competes in the NRL's Under-20s competition and has done since its first season in 2008. , , , By 1994, due to the high attendances at recent State of Origin series matches (including a then Australian rugby league record crowd of 87,161 in 1994 at the Melbourne Cricket Ground ) the Australian Rugby League (ARL) had planned to establish a Melbourne-based team in the Premiership by 1998.  However, the disruption caused by the Super League war caused great change to the game in Australia. By May 1997, Super League boss John Ribot pushed for a Melbourne-based club for his competition, which was the rival of the ARL.  Former Brisbane Broncos centre Chris Johns became the CEO of the club and Ribot stepped down from the head of Super League to set up the club. In September 1997, Melbourne announced that Chris Anderson would be their foundation coach, and then Super League announced that the new team would be named the Melbourne Storm.  , In 1997, there were 21 rugby league teams running around Australia (and one in New Zealand), but none in the country's second-largest city. In 1998, with the game reunited, three clubs had been jettisoned and the Melbourne Storm had bobbed up as an unexpected and initially curious addition to the landscape. , The Melbourne club then went forward with signing players, mainly from folding Super League clubs Perth Reds and Hunter Mariners . Some of these players included Robbie Ross , Glenn Lazarus , Brett Kimmorley and Scott Hill . With the Super League and ARL joining into one competition for the 1998 season, the Melbourne team became part of the National Rugby League (NRL). The Melbourne Storm club was unveiled at a function in the Hyatt in February 1998. , In their first game, they defeated the Illawarra Steelers , with Glenn Lazarus as their inaugural captain. Melbourne, in a complete shock to the rest of the competition, won their first four games, before losing to the Auckland Warriors .  They went on to make the finals, but were defeated by the eventual premiers, the Brisbane Broncos.  , In January 1999, CEO John Ribot negotiated a deal that saw Melbourne Storm games televised in China every weekend.  The club won eight of their first eleven games of the 1999 NRL season , and went on to make the finals in third position on the Premiership ladder. The team was beaten convincingly 34–10 in the quarter final by St. George Illawarra . After narrow victories against the Canterbury Bulldogs and the Parramatta Eels however Melbourne once more faced St. George Illawarra, this time winning 20–18 and securing their first Premiership. , Melbourne's Premiership defence began relatively slowly losing their first four games of the 2000 NRL season , the club went on to make the finals (finishing 6th), but were eventually knocked out by Newcastle Knights in the quarter-finals. Between 2001 and 2002, the clubs on field performances waned, resulting in a 10th placed finish in 2002. Cracks were starting to appear between John Ribot and Anderson throughout the period, with Anderson quitting as coach after round 7, 2001. He was replaced by Mark Murray . The Melbourne club failed to make the finals in 2001. Johns left the club as CEO at the end of 2002 and coach Murray was sacked due to Melbourne's poor form, with the club missing the finals for the second year in a row. Wayne Bennett 's assistant coach at the Brisbane Broncos, Craig Bellamy was announced as the new coach of Melbourne for 2003.   In addition to a new captain in Kiwi international skipper Stephen Kearney , Bellamy's strict coaching would see the Melbourne Storm get back on track from the previous lean years. , Now, the Melbourne Storm are here to stay. They are not moving and News Limited is apparently committed to keeping them financially. I am OK with that. I hated Melbourne when they were in place of traditional teams that were expelled, but that's all over now. If they want to persevere in Melbourne, I have no argument. , Between 2003 and 2005, Melbourne consistently made the finals, but lost games in the semi finals that prevented them from reaching the grand final. On 17 July 2004, during round 19 of the 2004 NRL season , Danny Williams king-hit Wests Tigers ' player Mark O'Neill . , Williams defended the incident, using four medical experts to argue on his behalf that he was suffering post-traumatic amnesia when the incident occurred, which he claims was the result of a high tackle by O'Neill just prior to the incident. Despite Williams' claim, he was suspended for 18 weeks by the NRL judiciary. After the decision, Williams stated that he was \"obviously disappointed with the outcome\". It was the longest suspension in Australian rugby league since Steve Linnane was suspended for twenty weeks for eye-gouging in 1987.  , In 2005, Storm coach Craig Bellamy, in his third season as an NRL coach, gained representative honours when he was selected to start coaching the Country Origin team.  , Season 2006 saw the retirement of captain Robbie Kearns , the emergence of talented rookie halfback Cooper Cronk , taking the reins from Matt Orford , and the recruitment of hard-man Michael Crocker . Contrary to expectation, 2006 was a standout year for the Melbourne team, winning their first Minor Premiership . This title has since been stripped by the league because of Melbourne's systematic breaching of the salary cap during the 2006 season. Melbourne only lost four games in the season, making them outright leaders by four wins.  They went on to win their two finals matches, and were favourites in the 2006 NRL Grand Final , but lost 15–8 the to the Brisbane Broncos, in a match where controversial refereeing decisions against Melbourne caused much media coverage.  , In 2007, the Storm finished the season Minor Premiers (again stripped due to systematic breaches of the salary cap), by finishing on top of the table again. They progressed through the finals series with wins over Brisbane, 40–0, and then Parramatta 26–10, in the Preliminary final. This secured a berth in the 2007 NRL Grand Final against the Manly Sea Eagles which they won 34–8, with Greg Inglis winning the Clive Churchill Medal for best on ground. This Premiership has been stripped due to systematic breaches of the salary cap. Melbourne were also involved in budding controversies over their tackling styles throughout their period of success, with many claiming they introduced wrestling techniques into the game that were dangerous and against the spirit of Rugby League tackling. , In 2008, foundation player Matt Geyer became the first player to play 250 games for the club.  Melbourne won what at the time they considered their third Minor Premiership after the 26 rounds of regular competition (as it and others have since been stripped because of the salary cap scandal the Storm are rightfully credited with only one Minor Premiership). Despite becoming the first minor premiers since the McIntyre Final Eight System was introduced to lose their opening finals game (15–18 to the New Zealand Warriors ), they then defeated the Brisbane Broncos 16–14, scoring in the last minute of their semi final. Cameron Smith was suspended for two matches for a grapple tackle on Brisbane's Sam Thaiday in the match, seeing him miss the rest of the finals, and Craig Bellamy was fined $50,000 for making scathing remarks against the judiciary's decision. Melbourne convincingly beat the Cronulla Sharks 28–0 to qualify for the Grand Final, but suffered the heaviest Grand Final defeat in league history, beaten 40–0 by Manly . Greg Inglis , Billy Slater , Cameron Smith and Israel Folau all won awards at the Dally M Awards, and Slater and Smith finished equal second for the Dally M Medal .  Billy Slater was awarded the international player of the year Golden Boot award for 2008, following on from Cameron Smith in 2007. , After what they considered to be three consecutive Minor Premierships (all since rescinded), Melbourne finished 4th on the ladder after the home and away season in 2009; they defeated Manly 40–12 in the first week of the finals and Brisbane 40–10 in the preliminary finals to qualify for a fourth straight grand final (the first since Parramatta from 1981–1984). Against Parramatta, who had finished eighth in the home-and-away season but had won ten of its last eleven matches, the Storm led at one stage by 16 points, before finishing 23–16 winners.  Slater won the Clive Churchill Medal , and they were named as the NRL Team of the Decade for the 2000s.  This Premiership was also stripped from the Storm following the salary cap scandal. , In the late 2000s the Melbourne Storm were still running at a loss of up to $6M per season.  However, they were voted the state of Victoria's most popular sports team by a national Roy Morgan Poll in October 2009.  , On 11 January 2010, it was announced that Brian Waldron resigned his position as CEO to take up the same position at the Melbourne Rebels Super Rugby team.  He was replaced by Matt Hanson who was the Chief Operating Officer, however following the Salary cap revelations Matt Hanson was then stood down and Ron Gauci appointed. , The Storm's first match of the season was the 2010 World Club Challenge against equally dominant English side, the Leeds Rhinos , in very cold and wet conditions the Storm prevailed 18 – 10.  For the 2010 NRL season , they played their first three home games at Etihad Stadium before unveiling their new purpose built permanent home ground, AAMI Park . , On 22 April 2010 the club admitted that it had committed serious and systematic breaches of the salary cap for the last five years by running a well-organized dual contract and bookkeeping system which left the NRL ignorant of $3.17 million in payments made to players outside of the salary cap, including $550,000 in 2007, $965,000 in 2009 and $1.03 million in 2010. As a result, NRL Chief Executive David Gallop stripped the Melbourne Storm of their 2007 and 2009 Premierships and their 2006, 2007 and 2008 minor Premierships (all of which were withheld, rather than awarded to the runners-up), fined them a then Australian sporting record $1,689,000, deducted all eight Premiership points they had already received in the 2010 season, and barred them from receiving Premiership points for the rest of the season. The club had won enough matches to make the finals, but automatically finished in last place due to the penalties. The penalty did not have an effect on the players, who were still eligible for Test and State of Origin selection as well as Dally M contention; ultimately, Melbourne did not figure prominently in the latter awards. , The Storm's 2011 season saw a return to the top of the NRL ladder, winning what after the salary cap penalties was considered the club's first Minor Premiership. The season included a club record twelve consecutive wins. However, Melbourne did not reach the Grand Final, losing the preliminary final against New Zealand . Billy Slater won the Dally M Medal, and Craig Bellamy and Cameron Smith also won awards on Dally M Medal night. , The Storm's 2012 season started very strongly with nine consecutive wins, the club's best start to a season up to that time. A five-game losing streak between Rounds 16 and 21, (the club's second worst losing streak to that time) saw them fall from the top of the ladder. However from Round 22 forward they recovered their winning form and finished the regular season with five straight wins, ending the regular season in second place on the table. Storm began their finals campaign with a 24-6 win over South Sydney Rabbitohs . Storm played its fifth Preliminary Final in six years, this time defeating Manly-Warringah Sea Eagles 40-12 at AAMI Park , following this they then went on to claim their second official Premiership defeating the Canterbury Bulldogs 14 - 4 in the Grand Final . , The Storm began its 2013 season when they defeated Leeds Rhinos 18-14 in the World Club Challenge , to be crowned World Champions for 2013.  In round 5, they won their 5th consecutive game for the season and their 13th consecutive overall. Setting a new club record, the streak ended at 15 games with a loss in Round 8. , On 21 May 2013 the Storm announced that, effective immediately, News Limited had sold the club to Holding M.S. Australia Pty Limited, an organisation made up of internationally experienced and successful businessmen. This change included replacement of the News Ltd Board and Executive, which included the replacement of Chairman Stephen Rue with Bart Campbell and CEO Ron Gauci with Mark Evans. News Limited had owned the Storm since its inception in 1997.  On 9 June 2013 Captain Cameron Smith played his 250th game for the club.  , The Storm managed to finish 3rd in 2013 , however successive losses to the South Sydney Rabbitohs and Newcastle Knights in the finals saw the Storm miss the Preliminary Finals for the first time since 2005 (excluding 2010 ). , On 15 March 2014 Billy Slater reached his 250th game milestone, a feat matched by Cooper Cronk on 30 August 2014. Craig Bellamy passed 300 games as coach on 16 May 2014.  The 2015 season began successfully for the Storm with the club finding itself on top of the ladder following Round 7. In April Storm CEO Mark Evans announced that he will return to England and complete his tenure as CEO in late June, the club is now in the process of searching for his replacement.  An expanded Representative weekend over the 2–3 May saw fifteen Storm players selected to play in the various matches. , Originally, the club favoured the name Melbourne Mavericks with a gunslinger logo holding a fistful of dollars. The club officials were all set to go with this until News Limited's Lachlan Murdoch told them to go with something else because the Mavericks sounded too American.  Trams and Flying Foxes were also some ideas that came up. However co-CEOs Chris Johns and John Ribot decided to go with the themes lightning, power and storm. The club then became known as the Melbourne Storm.  , The Storm was always going to go with the colours of their state, Victoria . These were navy blue with a white 'V'. But club consultant Peter McWhirter, from JAG fashion house, suggested that they should also have purple and gold to make their merchandise more attractive.  These colours appear in the logo, however, on the home jersey they have varied. Between 1998 and 2004 these four colours also appeared but between 2005 and 2009, gold was completely removed and silver introduced. Between 2010 - 2012, gold returned and silver was omitted, purple also became the dominant colour in the jersey. For 2013 a new design was announced featuring a deeper V, with more navy blue in the jersey, gold disappeared along with most of the white. The lightning bolts are now also purple. , Between 1998–2001, Melbourne was the only club to display player names on the back of jerseys. This was because there was no major sponsor for the Storm to display on the chest or back at the time. In 2001, Melbourne gained its first major sponsor in Adecco,  and was displayed on the jersey chest, while maintaining the players names on the back until the end of 2001. In 2002, the Storm removed the player's names and displayed Adecco's logo on the back. Since then the Storm have had varying sponsors adorning the Jersey. , The Melbourne Storm's club song, written by Jon Mol and Phil Wall, is called \"We Are the Storm\".  The song is played over the public address system following each home victory. , Every year since Brisbane's victory over Melbourne in the 2006 Grand Final, Melbourne have ended the Broncos' season by knocking them out of the finals. Melbourne captain Cameron Smith commented on the rivalry prior to their 2009 Preliminary Final at Etihad Stadium. , The Brisbane Broncos defeated the Storm 15–8 in the 2006 NRL Grand Final. The Storm sought revenge through a 40–0 thrashing in the 2007 Qualifying Final at Olympic Park Stadium . The 2008 Semi-Final at Suncorp Stadium ended with Melbourne dramatically winning 16–14 with a try on the final play of the game. In 2009 Brisbane were again beaten by eventual premiers Melbourne, this time 40–10 at Etihad Stadium, catapulting the Storm to their 4th consecutive Grand Final Appearance. , Manly-Warringah Sea Eagles , The Storm defeated Manly 34–8 in the 2007 Grand Final but lost to in the 2008 re-match in a history-making 0–40 loss. To add to the rivalry, Melbourne beat Manly 40–12 in the opening final of the 2009 finals series, ending their bid to be back-to-back premiers. In September 21, 2012, Storm and Manly played each other in the preliminary final for the first time. Storm again thrashed Manly 40-12, again ending their chances of winning back-to-back titles.  , As of the 2015 NRL season, the NRL have replaced the Storm's tradition ANZAC Day game with the New Zealand Warriors with a clash against the Sea Eagles. , New Zealand Warriors , More of a traditional rivalry due to the large amount of Kiwi internationals Melbourne has fielded in their history.  Matches between the two clubs are normally close and low scoring, with the overall head to head slightly in Melbourne's favour (30 clashes, Storm 15-Warriors 13 & 2 draws). These two sides played an annual ANZAC Day clash each year between 2009 - 2014. For 2015 it will be played earlier in April. , Melbourne's home ground since 2010 has been AAMI Park . Their highest season average attendance for home games was 16,302 in 2013.  Their highest regular season attendance of 28,716 was set on 25 April 2014 for the ANZAC Day match against New Zealand Warriors at AAMI Park.  A home finals attendance record of 33,427 was set in 2007 for the Preliminary Final against Parramatta , at the Docklands Stadium . , Melbourne previously played the vast majority of their home matches at the city's Olympic Park Stadium , affectionately coined \"The Graveyard\" by fans due to the incredible 77.2% winning percentage there. It was there that the club played their inaugural home match in the fourth round of the 1998 season on 3 April 1998, having come off the back of three successive away victories.  The team recorded a 26–16 victory over the North Sydney Bears , and the crowd of 20,522 was the largest attendance for the club at Olympic Park .  , The team remained at the ground until the end of the 2000 season. In the 2000 season they attracted an average home attendance of 14,622,  which remained their largest average attendance ever until the 2010 season which drew an average on 14,670. They played at Melbourne Cricket Ground for two games in 2000, and they won both times including the 70–10 thrashing of St George Illawarra Dragons in the Grand Final rematch from the previous year. Following steady attendance increases over the three years, it was decided to move home games to the 56,347 capacity Docklands Stadium for the following year. Docklands is an oval shaped venue primarily built for use by the Australian Football League (AFL). However, with the team ending up missing the finals, crowd numbers declined and it was decided to move the team back to Olympic Park. Due to the high costs involved, as well as Docklands stadium management (which included the AFL) citing damage to the playing surface, the Storm only used the movable seating once in their time at the venue. This came in their Round 21 win over the Brisbane Broncos in 2001 . It also saw the Storms largest home attendance of the 2001 season with 15,470 fans attending the game. , The Storm had their lowest crowd average of 8,886 per home game in 2004, but crowds steadily rose over the following years, breaking the previous record average in 2010, and then up to an peak of 16,302 for the 2013 season, their highest yearly average to date.  , The Storm played their last game at Olympic Park in round 25, 29 August 2009, with a 36–4 thrashing of the Sydney Roosters .  , For the 2010 NRL Premiership season, the Storm's first three home games (rounds four, six and seven) were played at Docklands Stadium, before moving into their new home ground, AAMI Park in round nine (9 May 2010) against the Brisbane Broncos. The club had anticipated playing its first game at the new ground in round four against the St George Illawarra Dragons , however, a delay in construction required the opening to be pushed back several weeks.  , As of Round 15 of the 2015 NRL season , the Storm have won two legitimate NRL Premierships in 1999 and 2012 and one Minor Premiership in 2011. Their current wins percentage of 63.34% is the best in the league. The clubs highest point scorer to date is Cameron Smith with 1735 points and the clubs most prolific try scorer is Billy Slater with 172. Melbourne also has three Dally M medal winners in Cameron Smith (2006), Billy Slater (2011) and most recently Cooper Cronk in 2013 and in addition, the Storm have so far had three Golden Boot award winners (Smith 2007, Slater 2008 and Greg Inglis 2009). , Melbourne Storm's current winning streak record for the most consecutive matches won stands at 15 matches, completed between Round 22 of the 2012 NRL season and Round 7 of the 2013 NRL season. The club's all-time highest score is 70 points scored against St. George Illawarra on 3 March 2000 but the highest winning margin is 64 points achieved in a 64-0 win over West Tigers in 2001 and equaled in a 68-4 win over Canberra Raiders in 2013.  , Head coach , Assistant coaches , As part of their 10-year celebrations in 2007, Melbourne Storm released a team of the decade. The 17 man team was selected by former assistant coach Greg Brentnall , foundation CEO John Ribot , and then board member Frank Stanton (all 3 were members of the 1982 Kangaroo tour \"Invincibles\", Brentnall and Ribot as players with Stanton the coach). The trio were joined by The Daily Telegraph ( Sydney ) journalist Steve Mascord .  , Head coach , , The Melbourne Storm's supporter base grew from almost 500,000 in 2004 to almost 800,000 in 2009, making them the fourth most popular rugby team.  The club's supporter group, the \"Graveyard Crew\", make an Aussie-rules -(AFL) style banner for the team to run through in important matches.  , Former Prime Minister Julia Gillard is a supporter of the club.  , In March 2015 SpotJobs has become a major partner until the end of 2016. They will feature on the front neck of the Storm’s playing jerseys for home and away games, in addition to featuring prominently at the side’s AAMI Park home ground.  , Official sites , News sites , Statistics and information sites "
}
