{
  "category": "nrl",
  "article": "The Penrith Panthers are an Australian professional rugby league football team based in the western Sydney suburb of Penrith . The team is based 55 km west of the centre of Sydney and at the foot of the Blue Mountains . , The Panthers were admitted to the New South Wales Rugby League (NSWRL) competition in 1967. Penrith struggled for almost twenty years before finally reaching their first finals series. The club achieved its first Grand Final appearance in 1990 but were beaten by the Canberra Raiders 18–14. The following year the Panthers met the Raiders again in the 1991 Grand Final , this time winning the game 19–12. , Penrith's most recent premiership achievement was over the Sydney Roosters in the 2003 Grand Final where Penrith were considered underdogs but came out on top with an 18–6 victory. , Ivan Cleary has been the head coach of the team since 2012. For the 2014 NRL season , Peter Wallace and Kevin Kingston are co-captains. Sports media personality Phil Gould is the club's manager of football operations. OAK Milk has been their major sponsor since 2012. , , , Varied Penrith teams had played for many years between 1912 and 1966 in the Western Districts League under the control of the Western Suburbs RLFC . In the Parramatta competition after Parramatta was admitted to the NSWRL in 1947, and also in a second-tier Sydney competition introduced by the NSWRL in 1962. By this time a single top level rugby league team had emerged in the Penrith area and in 1964 they became known as the Penrith Panthers. The Panther had been chosen as the Penrith emblem after a public competition won by a graphic artist from Emu Plains named Deidre Copeland. , In 1966 word was out that the New South Wales Rugby League in 1967 would introduce two new teams to the Sydney premiership. There were three teams vying for the two proposed slots, Penrith, Cronulla-Sutherland , and the Wentworthville Magpies . Cronulla-Sutherland had been assured of one place, leaving Penrith and Wentworthville to fight it out for the other place. The NSWRL eventually settled on Penrith due to their location and a win in the 1966 Second Division title. , After admission to the competition in 1967 , they promptly came second last on the competition ladder. Hopes were raised in 1968 under new Captain-Coach Bob Boland when they won the pre-season competition and finished 8th, but this improvement proved to be short lived. , Penrith had trouble attracting the sort of experienced players they knew they needed, and although they always had good junior talent coming through, they did not get the on-field leadership they needed. Penrith needed to wait until they could develop their own 'stars'. They consequently struggled for almost 20 years before finally reaching their first finals series in 1985 with a team boasting new local star Greg Alexander and captained by Royce Simmons . , Penrith developed a strong team in the late 80's and started to build momentum. They made their first Grand Final appearance in 1990 with a team boasting notable players the likes of Greg Alexander , John Cartwright , Brad Fittler and Mark Geyer only to be beaten by the Canberra Raiders 18–14. The next year the Panthers met the Raiders again in the Grand Final, this time winning 19 to 12, including two tries by Royce Simmons the former team captain in his last game. They went on to play Wigan in England for the 1991 World Club Challenge but were beaten by the British champions 21–4.  , Their reign was short lived as in 1992 tragedy struck the club when the younger brother of Captain Greg Alexander , Ben , died in a car accident. Greg and close family friends Mark Geyer and Brad Fittler left the club soon after (Fittler left after the 1995 season as Penrith had signed with Super League) as well as coach Phil Gould left mid-way through the 1994 season. , The Panthers were coached by former player and club captain Royce Simmons starting with the last six games in 1994 until the end of 2001. , They made the finals during the 1997 Super League season and then again in 2000 in the re-united NRL competition. , In the year 2001, they came last on the competition ladder. 2001 was Royce Simmons' last season as coach for the Panthers, and he was replaced by John Lang from Cronulla in 2002, where they finished 12th. Their last game of 2002 showed hope as they proceeded to thrash the Northern Eagles , knocking them out of the final eight. , This showed the promise that was to come the next year. With the signing of Preston Campbell and Joe Galuvao , their side fired in 2003. Coming off 3 early season losses, they proceeded to lose only 3 other games for the rest of the competition with the local hero, Rhys Wesser scoring a new club record 25 tries. Penrith finished as Minor Premiers after convincingly accounting for the Parramatta Eels in the last round of competition. In the Finals series Penrith beat the Brisbane Broncos and New Zealand Warriors to reach the 2003 NRL Grand Final against the Sydney Roosters . Entering the match as underdogs, Penrith defeated the Roosters 18–6, with winger Luke Rooney scoring two tries. Hooker Luke Priddis received the Clive Churchill Medal . The game is also remembered for a spectacular tackle by Scott Sattler in the 2nd Half, where he ran down and tackled Roosters winger Todd Byrne, who was sprinting down the left wing for an almost certain try. Penrith lost the 2004 World Club Challenge in the following pre-season, with the Bradford Bulls defeating them 22–4 in sub-zero temperatures.  The Panthers did however rally after that loss and once again qualified for the NRL semi-final series by finishing fourth and defeating St George Illawarra in the first week of the semi-finals before being knocked out by the Bulldogs in the Grand Final qualifier two weeks later. , The Panthers then just failed to qualify for the Top 8 in 2005 finishing two points out and in 10th spot on percentages. They endured another below-par season in 2006 this time falling well short of the finals finishing the year in 12th position. The 2007 season turned out to be a poor one for the Panthers, they won only eight games, finished last and \"won\" the wooden-spoon for the second time in six years after losing to the New Zealand Warriors in the last round of the regular season competition. , In 2008 the Panthers improved four spots on their 2007 performance by finishing in 12th spot out of 16 teams in the NRL competition with 10 wins, one draw and 13 losses. In 2009 they finished the season in 11th spot out of 16 teams in the NRL competition with 11 wins, one draw and 12 losses. [ citation needed ] , In 2010 the Panthers had an excellent season, finishing in 2nd place in the ladder out of the 16 teams, with 16 wins and 9 losses. However, in the first round of the Finals series, they lost 22:24 at home to the Canberra Raiders and were knocked out in the second round when they lost 34:12 to the Sydney Roosters . , Michael Gordon played very well in that year, setting two new club records. In round 24, against the South Sydney Rabbitohs, he set a new club record for most points scored in one game: 30. By the end of the final game of the regular season, game 24, round 26, he had also set a new club record for the most points scored in one season at 270. , In 2011, following a terrible start to the season, the Panthers board decided to sever ties with coach Matthew Elliot at season's end. On 20 June 2011 he stepped down as coach and that same day Steve Georgallis was appointed caretaker coach for the remainder of the season. On 29 June Ivan Cleary was announced as coach for the next 3 seasons, with Georgallis staying as assistant coach for the remainder of the season. , After a 2010 season where the club went above and beyond expectations, they were looking to starting the new season on a high. It wasn't to be, however, when they were thumped by Newcastle at the newly named Centrebet Stadium, 42-8. While Round 2 went a lot better for the team, beating rivals the Eels at Parramatta Stadium 20-6, the year was marked by inconsistency as they finished 12th on the ladder. , 2012 was again a disappointing year for the Panthers, finishing second last with an 8-16 record. However, the club discovered some new talent in the form of winger Josh Mansour, a candidate for Rookie of the Year, as well as fullback Lachlan Coote's successful move to five-eighth. , 2013 began poorly for the Panthers; after a first up win against the Raiders, they went on to lose their next five games. However, a more inspired performance against the Parramatta Eels in Round 7, where they won 44-12, was a trigger for a strong run; four wins from five games to see Penrith move into the top eight of the competition. The four wins included a 12-10 victory over the reigning premiers, Melbourne Storm , and a 64-6 thrashing of the New Zealand Warriors . However, after a year with mixed results, Penrith finished in tenth position, one win out of the top eight. At the end of the season, the likes of Luke Walsh , Lachlan Coote , Mose Masoe , Brad Tighe and Clint Newton departed. , A playing roster overhaul saw the arrival of big name players such as Jamie Soward , Peter Wallace , Jamal Idris , Tyrone Peachey and Elijah Taylor at Penrith, while Matt Moylan took the vacant fullback role left by the departed Lachlan Coote . , Over their forty six years, the Panthers have gone through eight major sponsors (These sponsors appear on the chest of the jersey). , Penrith's uniform colours in the 1966 NSWRL Second Division and earlier years were blue and white but due to the Cronulla-Sutherland side registering a predominantly blue jersey design first, and with Newtown , Canterbury , Eastern Suburbs and Parramatta also displaying various shades of blue, Penrith went in search of an alternative. A decision was made to change their colours to Brown with a white V. This decision subsequently earned them the affectionate name of the \"Chocolate Soldiers\" thanks to radio commentator Frank Hyde who wrote in the Penrith Club journal \"these chocolate soldiers from out west – they don't melt!\". , The team had been referred to as the 'Panthers' as early as 1970.  , In 1974 Penrith changed their strip to a jerseys with brown and white vertical bars and again in 1991 they changed the colours to Black with White, Red, Yellow and Green stripes (drawing another confectionery-related nickname, The Liquorice Allsorts ) until 1997 when Super League had all new jerseys made by Nike. The yellow was all but removed from the jersey at this stage. Then in 2000 they changed the colours once more to Black, Rust red, Teal green and White. In 2004 the design of the jersey changed once more to its current design. On Thursday, 23 November 2006 the club launched a new 'alternate/away' jersey predominately white in colour as a stark contrast to its main design. , Just before Christmas 2007 the Panthers launched a new 'home' jersey which is predominately black with light grey claw marks on either side at the front and back. For Season 2010, the Panthers have launched a new predominantly teal away jersey, this teal jersey connect with the away jersey from their 03 and 04 season's. With their official colours still Black, Teal green and rust red the alternate jersey was chosen to represent their secondary colour. The inception of Teal into the colour palet of Panthers links directly back to the unique colour their 2nd division jerseys had before brown and white. , In late October, 2010, the Panthers announced that rust would no longer be a secondary colour for the club. A new jersey was also launched, black with grey claw marks on either side. The club's teal jersey was also scratched in Round 4, 2011, when a new white jersey with grey claw marks and teal and black stripes was announced the club's new alternate jersey. , For the current 2014 season the Panthers have a redesigned black home jersey while the white away jersey prominently displays the new club logo. The Pink Jersey was also retained as a 3rd alternate strip, and used for Women in League and Breast Cancer Awareness rounds, or when both strips would clash with the opposing side. There is also a special Indigenous Jersey, worn in round 23 for the Indigenous Awareness round. , Home 1991–1996 , Home 2000–2003 , Home 2004–2007 , Home 2008–2010 , Alternate 1991–1994 , Alternate 1995–1996 , Alternate 2000–2002 , Alternate 2007–2009 , Heritage 2011 , Heritage 2012 , 40th Anniversary 2006 , Pink Panthers 2009-2011 , Pink Panthers 2013- , The Penrith Panthers Rugby League Football Club is the major financier the Penrith Panthers Leagues Club (of the Panthers Entertainment Group). , The Panthers Entertainment Group has 14 licensed club sites in NSW – from Port Macquarie on the mid-north coast to Lavington, in the south. The clubs cater for a wide range of activities for members, their families and guests. , Head coach , Assistant coach , Gains , Losses , On 4 October 2006 a 40 Year Panthers Legends Team was named. , Notable fans , * Average home crowd "
}
