{
  "category": "nrl",
  "article": "The Wests Tigers are an Australian professional rugby league football club based in Sydney's Inner West . They have competed in the National Rugby League since they were formed at the end of the 1999 NRL season as a joint-venture club between the Balmain Tigers and the Western Suburbs Magpies . , The Wests Tigers started playing in the 2000 NRL season and won their maiden premiership in 2005 . The club also won the World Sevens in 2004 . , The Wests Tigers have three home grounds: Leichhardt Oval (the home ground of Balmain), Campbelltown Stadium (the home ground of Western Suburbs) and ANZ Stadium as of 2014. They are currently coached by Jason Taylor and captained by Robbie Farah . On June 15 2015 Chief executive Grant Mayer has quit the Wests Tigers with immediate effect, the NRL club announced on Monday. Mayer joined the wests tigers mid way through 2013 season taking over from Stephen humphreys. General manager of football operations Phil Moss will step into the chief executive role until a fulltime replacement is found for Mayer. , , , In Australia, the game of rugby league began in 1908 as the New South Wales Rugby League premiership (NSWRL) which had nine teams from the Sydney, Australia area. Two of those teams were clubs based in Balmain and the Western Suburbs who happen to meet each other in the in round 1 of 1908 Balmain went on to win 24 to 0. The Balmain club, who later adopted a Tiger as their emblem, in their tenure in the NSWRL won eleven premierships in twenty grand finals and was one of the forces in the NSWRL competition. However their last premiership success was in 1969 and in the 1990s with many new clubs being established, there was pressure on clubs to perform to survive in the first grade competition in Australia.  The Wests Tigers got their name from their suburb and from their logo. , The Westerns Suburbs club was less successful, only winning four premierships in twelve grand finals over the tenure of the NSWRL competition. The Western Suburbs Magpies, like the Balmain Tigers, had a dismal 1990s winning rate, and again there was pressure on the foundation clubs to perform. The NSWRL competition was replaced by the Australian Rugby League competition (ARL) in 1995 due to the expansion of rugby league within Australia.  , With a media driven rival competition being set up, the pressure for clubs to survive and preserve their short-term future. Both the Magpies and the Tigers signed with the ARL whereas eight clubs of the 1995 ARL competition signed with the rival Super League competition for 1997. In 1998, the ARL and Super League were unified into a National Rugby League (NRL) competition.  As part of the deal with the ARL and Super League, the NRL competition would reduce down to fourteen teams in 2000 from the twenty two that had competition in both competitions in 1997. With the addition of a team in 1998, this meant that nine teams would be forced out before the 2000 season.  , With the NRL offering guaranteed entrance into the 2000 competition and A$ 6 million funding for clubs that merged, many clubs that were struggling to compete were negotiating to merge. Balmain had garnered interest to merge with the Parramatta Eels and Gold Coast Chargers while Western Suburbs had talked with the Canterbury Bulldogs and Penrith Panthers . Both Balmain and Western Suburbs felt that those offers were seen more as takeovers of their clubs rather than mergers. By June 1999, both club’s boards had unanimously voted to form a joint venture partnership with each other to make a competitive entity.  , Each club took a 50% share in the club which would be known as the Wests Tigers . Due to Western Suburbs record breaking dismal season in 1999, they supplied just six of the twenty five players to the new joint venture. However the club’s board would garner two members from each club with a chairman which rotated between foundation clubs each year. Because the playing roster was supplied mostly by Balmain, the chairman and chief executive officer was supplied by Western Suburbs to even the deal.  , Balmain coach Wayne Pearce was the initial coach of the Wests Tigers and new recruit Jarrod McCracken was named captain. Before the first round the Tigers were controversially denied a place in the double header at Stadium Australia. The debut match for the side was therefore held at Campbelltown, against eventual premiers the Brisbane Broncos , where after leading 18–6 the side snatched a 24-all draw after falling behind late in the game. John Skandalis scored the Tigers' first ever try. , The Tigers surprised many by maintaining a high place on the ladder for most of the year (often in second place). Losses to the Penrith Panthers (after leading 31–8) and in the snow against the Canberra Raiders combined with injuries to key players saw the Tigers slide out of the top eight.  The loss of captain Jarrod McCracken from a spear tackle against Melbourne was a crucial blow.  , A highlight of their first season is that Wests' Joel Caine claimed the 2000 NRL season 's top point-scorer spot. , 2001 was a bitter year for the joint venture club, including off-field incidents. After Wayne Pearce announced he would no longer coach the team, Terry Lamb was appointed to the position. This was a controversial selection because of animosity from Balmain supporters due to an incident involving Ellery Hanley in the 1988 Grand Final (see Terry Lamb entry for more information). , Early in the season, key players Craig Field and Kevin McGuinness tested positive to prohibited drugs and received long suspensions.  Field was the team's halfback and playmaker whilst McGuinness was a leading try scorer for the club. , Later in the season another big name player was suspended: John Hopoate earned world wide notoriety when he was charged with inserting his finger into the anus (pushing the players' shorts) of opposition players.  Hopoate quit the club and received a long suspension. Lamb was criticised for seeming to condone the activity. , During the season the club announced Terry Lamb would not have his contract renewed.  The side struggled near the foot of the ladder and only a large victory over Souths moved them clear of the wooden spoon position. , The coaching job for 2003 was offered to (and rejected by) both Craig Bellamy and Ian Millward before Tim Sheens was selected. The selection was by no means seen as a positive move by the media as Sheens' most recent coaching stint had seen him sacked by the North Queensland Cowboys . , The 2003 season was notable for the emergence of new young players through the team as the club moved away from the era of big names and big money signings and focused on developing junior talent. Most notably Benji Marshall , then a schoolboy prodigy with no senior league experience, made his debut against the Newcastle Knights . , The Tigers improved greatly in 2004 aided by signings of players such as Brett Hodgson and Pat Richards who began to blend well with the younger players emerging as talents. The Tigers narrowly missed the playoffs after losing their final three games when a single victory would have guaranteed finals football for the first time. , 2005 was the Wests Tigers best season yet, as they not only made it to the finals for the first time, but also reached the top four in the round robin part of the competition, setting crowd attendance records at three different grounds: Campbelltown Stadium (20,527), Telstra Stadium (29,542) and Leichhardt Oval (22,877). , After a slow start, bookmakers rated the Tigers a 150–1 chance to win the premiership.  However the club emerged from the bottom half of the table to win a club record eight in a row before finishing fourth. The team developed a reputation as a flamboyant attacking side who played at a rapid pace to compensate a lack of forward size. , The Tigers played their first ever final as a joint venture club at Telstra Stadium against North Queensland Cowboys . Backed by a passionate crowd the team won 50–6. They then beat the Brisbane Broncos 34–6 and premiership favourites St George Illawarra Dragons 20–12 to book a spot against the Cowboys. , Based on their winning form (they had won 11 of their last 13) and their big win over the Cowboys in the opening finals game, the Wests Tigers were rated favourites to win the 2005 grand final. After a slow start, Bryce Gibbs and Pat Richards scored tries to give the Tigers a 12–6 lead. The Richards try was ranked the second best try of all time in the NRL's Centenary of Rugby League 100 Hot Tries survey.  The try was started by five-eighth Benji Marshall, who received the ball from Brett Hodgson (after receiving a down field kick) 98 metres from the opposition tryline. He beat Cowboys five-eighth Johnathan Thurston and Matt Sing . Marshall then ran 60 metres, only to be caught by Cowboys fullback Matt Bowen . He made a flick pass to Pat Richards behind his back, who then fended off Rod Jensen to score. , In the second half the Tigers gained control with tries to Anthony Laffranchi and Daniel Fitzhenry . After withstanding a Cowboys fightback, a Todd Payten try on full-time sealed a 30–16 win. Captain Scott Prince was awarded the Clive Churchill Medal for 2005. , The premiership victory meant that the club joined an exclusive group that won premierships in their first finals appearance, which had not been achieved in almost 100 years. The group also includes Souths in 1908 and Newtown in 1910. , At the end of the 2005 season, Wests also signed Malaysian car manufacturer Proton as its major new sponsor on a contract estimated to be worth more than $1 million.  , Following the premiership win several key players left the club. From the grand final team, Mark O'Neill , and Pat Richards signed with English clubs ( Leeds Rhinos and Wigan Warriors respectively). New signings included Jamaal Lolesi (Bulldogs), Keith Galloway (Cronulla Sharks) and Ryan O'Hara (Canberra Raiders). , As defending premiers, the Wests Tigers began the season by travelling to England to play English Super League champions the Bradford Bulls . Missing many of their star players, the Tigers tried hard but were eventually beaten 10–30. After a come from behind win over competition heavyweights St George-Illawarra, the team struggled with injuries to key players. Most notably Benji Marshall and Brett Hodgson missed large portions of the season. The team suffered a number of narrow losses late in games and also two golden point (extra time) matches in controversial circumstances. , The Wests Tigers narrowly missed the finals and the chance to defend their title. One highlight of the season was the debut of several players including Chris Lawrence and the emergence of up and coming players such as Dean Collis . Brett Hodgson played for the New South Wales team in the interstate State of Origin series in all three games. Another highlight was an upset win over eventual premiers the Brisbane Broncos at Suncorp Stadium where a second-string Tigers side missing Hodgson, Marshall, Whatuira and Gibbs beat the more experienced Broncos 20–6. , Joining the club for the 2007 season was John Morris (ex Parramatta Eels ) to replace Scott Prince who signed with the Gold Coast Titans . Other players to leave at the end of the 2006 season were John Skandalis , Anthony Laffranchi and Shane Elford – all members of the 2005 grand final team. , The Wests Tigers had a bad start to the season losing their opening four games by narrow margins. They then had a six-game winning streak to move into the top four. The Tigers' five-eighth Benji Marshall and full-back Brett Hodgson missed the majority of the season with injuries. , The Wests Tigers' ended their attempt at a finals berth and finished the season on a disappointing loss to the Newcastle Knights , 26–24 at the then- Telstra Stadium . , The following two seasons ended in the same fashion with the tigers missing out on the finals narrowly in 2008 and 2009 finishing 10th and 9th. , In February 2008, the Wests Tigers announced the extension of Benji Marshall 's contract by one year, to the end of 2009. They also announced the signing of Gareth Ellis , the Leeds Rhinos second-rower and international representative, to a three-year deal commencing in 2009.  , In February 2010, the Wests Tigers announced the signing of former Rugby Union star Lote Tuqiri for three years,  and the signing of Benji Marshall for a further five.  , 2010 turned out to be a positive year for the club, finishing third in the minor premiership competition, narrowly missing out on a grand final spot after losing to eventual premiers St. George Illawarra Dragons in the preliminary final by one point. , 2011 was another successful season with the tigers finishing 4th and making the semi finals yet again, where they were defeated by a late try to the New Zealand Warriors in a shock loss. , Despite being backed as premiership favourites at the start of the season, the Tigers failed to qualify for the finals in the 2012 season finishing 10th. On 25 September 2012, in a press conference CEO Stephen Humphreys and Chairman Dave Trodden announced that Tim Sheens would not be the head coach in 2013 in a restructuring of the club. This came a week after the loss of long term players Beau Ryan and Chris Heighington to the Cronulla Sharks for the 2013 season, and a disappointing 2012 season on the field. Heighington had 1 year on his contract left while a handshake deal with Ryan had been made back in February. After the disastrous 2012 season, Mick Potter was given the head coaching job on a two-year deal to help rebuild the club. Success was far from achieved with the tigers missing out on the finals in the 2013 and 2014 seasons finishing 15th and 13th. During this period Benji Marshall left the club at the end of 2013 to rugby union (Who later returned to play for the dragons) and mick potter contract was not renewed at the end of 2014. He finished with a record of 17 wins and 31 losses. The sacking meant the bringing in of Jason Taylor on a 3-year deal under the new board which now didn't involve any Balmain Tigers Representatives due to financial problems. , The joint venture draws supporters from the historic bases of Balmain and Western Suburbs. Because they are a joint venture the basic structure of the former teams remains in place including their respective leagues clubs. The Balmain Leagues Club is based in Rozelle . The Western Suburbs Magpies have two leagues clubs, one representing their former inner-city base Ashfield , and the other established when they relocated to the outer west in the 1980s Campbelltown . , The Wests Tigers do not have a single home but play at a number of grounds each year. Home games are split between traditional games played at the former home grounds of Balmain and Western Suburbs and financial games played at grounds which offer playing incentives. , Traditional home games are played at Campbelltown Sports Stadium and Leichhardt Oval , the former home grounds of Wests and Balmain respectively. The grounds are around 50 km apart and attract different supporter bases. Marquee home games were previously played at ANZ Stadium , the former Olympic Stadium used for the 2000 Sydney Olympic Games. It costs the Tigers $70,000 to play a game at Leichhardt Oval, while they are paid more than $100,000 per game to take matches to ANZ Stadium.  , From 2004 until 2006, a \"home game\" was played at AMI Stadium against the Auckland based New Zealand Warriors . This agreement was not renewed for 2007 and in that year a game was played at Bluetongue Stadium in Gosford against Melbourne Storm . In 2008, one home game was played at the Sydney Cricket Ground as part of the Centenary of Rugby League celebrations, and also one game at the Sydney Football Stadium . , In late 2008, CEO Scott Longmuir announced the Wests Tigers would move from ANZ Stadium at Homebush to the Sydney Football Stadium at Moore Park for the 2009 season.  The Wests Tigers also play an annual pre-season friendly game known as the Foundation Cup at the Sydney Football Stadium, against their neighbouring club to the east and main tenant at the venue, the Sydney Roosters . The name of the Cup reflects the fact that Balmain, Western Suburbs and the Roosters, are the only foundation clubs to have participated in some form in every season of Rugby League played in Australia, since 1908. , Stadiums used by the Wests Tigers as home grounds: , Present: , Former: , The club's name and logo are a combination of the two partners. The uniform colours are a combination of the black and white of the Western Suburbs Magpies uniform and the black and gold from the Balmain Tigers uniform. The logo combines a modern \"in your face\" Tiger with a traditional Wests 'V' in the background. There is also a Magpie (taken from the Western Suburbs Logo) on both sleeves of the Jersey. , In 2009, to commemorate the 10th anniversary of the joint venture, a predominantly white strip with a gold 'V' was unveiled.  , Some notable supporters of the club include Dawn Fraser ,  Anthony Field ,  Jimmy Barnes ,  Harry Triguboff ,  Michael Clarke ,  Mark Schwarzer ,  Julie Goodwin ,  Jordan Thompson ,  and former NSW Premier Barry O'Farrell .  , * Average home crowd , Head coach , Assistant coaches , Gains , Out , Having played in every game of the 2008, 2009, 2010 & 2011 seasons, Robbie Farah holds the record for most appearances for The Wests Tigers, having played in 221 games. Chris Heighington previously held the record, having played 201 games,  but he had previously played 64 games with the Magpies  before the merger with Balmain . , The highest point-scorers for the club have been players who have undertaken goalkicking duties for a period. Benji Marshall has scored the most points for the club (1118), followed by Brett Hodgson (786), and Joel Caine (526).  In 2005, Hodgson scored a record 308 points during the season, the most points ever scored by a fulllback in one season. In the semis of 2005, he also scored 30 points in one match against the North Queensland Cowboys .  , Benji Marshall holds the record for most tries scored for the Tigers, with 76. He is ahead of Chris Lawrence (68) and Robbie Farah (57).  Taniela Tuiaki scored a club-record 21 tries during the 2009 season.  , The Wests Tigers Team of the Century was announced in 2004, encompassing the best players from both Balmain and Western Suburbs. Nine Balmain players and eight from Western Suburbs made up the 17 members of the team.  , Head coach , , The Wests Tigers have had six appointed club captains (at one stage two of those as co-captains) and a total of 15 first grade captains in their history. The team has been under the guidance of four coaches since their inception. , An * indicates the individual is still involved with the club. , All statistics are correct up to 3 May 2015. "
}
